#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AdvancedPreviewScene

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "AdvancedPreviewScene_structs.hpp"


namespace SDK
{

// Class AdvancedPreviewScene.DefaultEditorProfiles
// 0x0010 (0x0040 - 0x0030)
class UDefaultEditorProfiles final : public UObject
{
public:
	TArray<struct FPreviewSceneProfile>           Profiles;                                          // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DefaultEditorProfiles">();
	}
	static class UDefaultEditorProfiles* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultEditorProfiles>();
	}
};

// Class AdvancedPreviewScene.LocalProfiles
// 0x0010 (0x0040 - 0x0030)
class ULocalProfiles final : public UObject
{
public:
	TArray<struct FPreviewSceneProfile>           Profiles;                                          // 0x0030(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LocalProfiles">();
	}
	static class ULocalProfiles* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocalProfiles>();
	}
};

// Class AdvancedPreviewScene.SharedProfiles
// 0x0010 (0x0040 - 0x0030)
class USharedProfiles final : public UObject
{
public:
	TArray<struct FPreviewSceneProfile>           Profiles;                                          // 0x0030(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SharedProfiles">();
	}
	static class USharedProfiles* GetDefaultObj()
	{
		return GetDefaultObjImpl<USharedProfiles>();
	}
};

// Class AdvancedPreviewScene.AssetViewerSettings
// 0x0070 (0x00A0 - 0x0030)
class UAssetViewerSettings final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPreviewSceneProfile>           Profiles;                                          // 0x0038(0x0010)(Edit, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x50];                                      // 0x0048(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bFakeConfigValue_HACK;                             // 0x0098(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetViewerSettings">();
	}
	static class UAssetViewerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetViewerSettings>();
	}
};

}

