#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: advanced_storm_beacon_device

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "advanced_storm_beacon_device_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"


namespace SDK::Params
{

// Function advanced_storm_beacon_device.task_advanced_storm_beacon_device$MoveTo_L_Ntransform_M_Nfloat_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_advanced_storm_beacon_device_MoveTo_L_Ntransform_M_Nfloat_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function advanced_storm_beacon_device.advanced_storm_beacon_device._L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Ntransform_R
// 0x0070 (0x0070 - 0x0000)
struct advanced_storm_beacon_device__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Ntransform_R final
{
public:
	struct FSpatialMath_transform                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0060)(Parm, NoDestructor)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0060(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_0;                                // 0x0062(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_1;                                // 0x0064(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function advanced_storm_beacon_device.advanced_storm_beacon_device._L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Nvector3_M_Nrotation_R
// 0x00E0 (0x00E0 - 0x0000)
struct advanced_storm_beacon_device__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Nvector3_M_Nrotation_R final
{
public:
	struct advanced_storm_beacon_device::Ftuple_Lvector3_Mrotation_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0040)(Parm, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0040(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_0;                                // 0x0042(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct advanced_storm_beacon_device::Ftuple_Lvector3_Mrotation_R _ExprResult_1;                                     // 0x0050(0x0040)(NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_2;                                // 0x0090(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0xE];                                       // 0x0092(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct advanced_storm_beacon_device::Ftuple_Lvector3_Mrotation_R _ExprResult_3;                                     // 0x00A0(0x0040)(NoDestructor, HasGetValueTypeHash)
};

// Function advanced_storm_beacon_device.advanced_storm_beacon_device.MoveTo_L_Ntransform_M_Nfloat_R
// 0x00A0 (0x00A0 - 0x0000)
struct advanced_storm_beacon_device_MoveTo_L_Ntransform_M_Nfloat_R final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct advanced_storm_beacon_device::Ftuple_Ltransform_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0020(0x0070)(Parm, NoDestructor, HasGetValueTypeHash)
	class UConcurrency_task*                      RetVal;                                            // 0x0090(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function advanced_storm_beacon_device.advanced_storm_beacon_device.MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R
// 0x0080 (0x0080 - 0x0000)
struct advanced_storm_beacon_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct advanced_storm_beacon_device::Ftuple_Lvector3_Mrotation_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0020(0x0050)(Parm, NoDestructor, HasGetValueTypeHash)
	class UConcurrency_task*                      RetVal;                                            // 0x0070(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function advanced_storm_beacon_device.task_advanced_storm_beacon_device$MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_advanced_storm_beacon_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

