#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: advanced_storm_beacon_device

#include "Basic.hpp"

#include "VerseDevices_structs.hpp"
#include "VerseDevices_classes.hpp"
#include "advanced_storm_beacon_device_structs.hpp"
#include "VerseNative_structs.hpp"
#include "VerseNative_0_classes.hpp"


namespace SDK
{

// VerseClass advanced_storm_beacon_device.task_advanced_storm_beacon_device$MoveTo_L_Ntransform_M_Nfloat_R
// 0x0188 (0x0250 - 0x00C8)
class Utask_advanced_storm_beacon_device_MoveTo_L_Ntransform_M_Nfloat_R final : public UConcurrency_task
{
public:
	class Uadvanced_storm_beacon_device*          _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct advanced_storm_beacon_device::Ftuple_Ltransform_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0070)(Parm, NoDestructor, HasGetValueTypeHash)
	EDevices_move_to_result                       _RetVal;                                           // 0x0140(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_0;                                      // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct advanced_storm_beacon_device::Ftuple_Ltransform_Mfloat_R _ExprResult_1;                                     // 0x0150(0x0070)(NoDestructor, HasGetValueTypeHash)
	int64                                         _AsyncResult_2;                                    // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_3;                                      // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct advanced_storm_beacon_device::Ftuple_Ltransform_Mfloat_R _ExprResult_4;                                     // 0x01D0(0x0070)(NoDestructor, HasGetValueTypeHash)
	int64                                         _AsyncResult_5;                                    // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_advanced_storm_beacon_device$MoveTo_L_Ntransform_M_Nfloat_R">();
	}
	static class Utask_advanced_storm_beacon_device_MoveTo_L_Ntransform_M_Nfloat_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_advanced_storm_beacon_device_MoveTo_L_Ntransform_M_Nfloat_R>();
	}
};

// VerseClass advanced_storm_beacon_device.advanced_storm_beacon_device
// 0x0000 (0x00C0 - 0x00C0)
class Uadvanced_storm_beacon_device final : public UDevices_creative_device_base
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Nvector3_M_Nrotation_R(const struct advanced_storm_beacon_device::Ftuple_Lvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* MoveTo_L_Ntransform_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct advanced_storm_beacon_device::Ftuple_Ltransform_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct advanced_storm_beacon_device::Ftuple_Lvector3_Mrotation_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"advanced_storm_beacon_device">();
	}
	static class Uadvanced_storm_beacon_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uadvanced_storm_beacon_device>();
	}
};

// VerseClass advanced_storm_beacon_device.task_advanced_storm_beacon_device$MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R
// 0x0128 (0x01F0 - 0x00C8)
class Utask_advanced_storm_beacon_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R final : public UConcurrency_task
{
public:
	class Uadvanced_storm_beacon_device*          _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct advanced_storm_beacon_device::Ftuple_Lvector3_Mrotation_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0050)(Parm, NoDestructor, HasGetValueTypeHash)
	EDevices_move_to_result                       _RetVal;                                           // 0x0120(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_0;                                      // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct advanced_storm_beacon_device::Ftuple_Lvector3_Mrotation_Mfloat_R _ExprResult_1;                                     // 0x0130(0x0050)(NoDestructor, HasGetValueTypeHash)
	int64                                         _AsyncResult_2;                                    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_3;                                      // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct advanced_storm_beacon_device::Ftuple_Lvector3_Mrotation_Mfloat_R _ExprResult_4;                                     // 0x0190(0x0050)(NoDestructor, HasGetValueTypeHash)
	int64                                         _AsyncResult_5;                                    // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_advanced_storm_beacon_device$MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R">();
	}
	static class Utask_advanced_storm_beacon_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_advanced_storm_beacon_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R>();
	}
};

}

