#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ai_patrol_path_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass ai_patrol_path_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class ai_patrol_path_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass ai_patrol_path_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class ai_patrol_path_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ai_patrol_path_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass ai_patrol_path_device.ai_patrol_path_device
// 0x0050 (0x0110 - 0x00C0)
class Uai_patrol_path_device final : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0x56480FA5_NodeReachedEvent;               // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xE7E5E1FD_NextNodeUnreachableEvent;       // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x5CA63EB4_PatrolPathStartedEvent;         // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xF2F32E1B_PatrolPathStoppedEvent;         // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x5BDC7A5C_EnableFunction;                 // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC9184E23_DisableFunction;                // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xAD6CFE3C_GoToNextPatrolGroupFunction;    // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x2725EA70_GoToNextPatrolPathFunction;     // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xAAC4074B_AssignFunction;                 // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fai__patrol__path__device_N_RAssign_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fai__patrol__path__device_N_RDisable(const struct ai_patrol_path_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fai__patrol__path__device_N_REnable(const struct ai_patrol_path_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fai__patrol__path__device_N_RGoToNextPatrolGroup_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fai__patrol__path__device_N_RGoToNextPatrolPath_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ai_patrol_path_device">();
	}
	static class Uai_patrol_path_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uai_patrol_path_device>();
	}
};

}

