#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIGraph

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AIGraph.AISchemaAction_AddComment
// 0x0000 (0x00F0 - 0x00F0)
struct FAISchemaAction_AddComment final : public FEdGraphSchemaAction
{
};

// ScriptStruct AIGraph.AISchemaAction_NewNode
// 0x0008 (0x00F8 - 0x00F0)
struct FAISchemaAction_NewNode final : public FEdGraphSchemaAction
{
public:
	class UAIGraphNode*                           NodeTemplate;                                      // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AIGraph.AISchemaAction_NewSubNode
// 0x0010 (0x0100 - 0x00F0)
struct FAISchemaAction_NewSubNode final : public FEdGraphSchemaAction
{
public:
	class UAIGraphNode*                           NodeTemplate;                                      // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIGraphNode*                           ParentNode;                                        // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AIGraph.GraphNodeClassData
// 0x0060 (0x0060 - 0x0000)
struct FGraphNodeClassData final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AssetName;                                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 GeneratedClassPackage;                             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 ClassName;                                         // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                   Category;                                          // 0x0040(0x0010)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

