#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AlembicLibrary

#include "Basic.hpp"

#include "AlembicLibrary_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class AlembicLibrary.AbcAssetImportData
// 0x0098 (0x00F8 - 0x0060)
class UAbcAssetImportData final : public UAssetImportData
{
public:
	TArray<class FString>                         TrackNames;                                        // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FAbcSamplingSettings                   SamplingSettings;                                  // 0x0070(0x0018)(NoDestructor, NativeAccessSpecifierPublic)
	struct FAbcNormalGenerationSettings           NormalGenerationSettings;                          // 0x0088(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FAbcMaterialSettings                   MaterialSettings;                                  // 0x0094(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbcCompressionSettings                CompressionSettings;                               // 0x0098(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
	struct FAbcStaticMeshSettings                 StaticMeshSettings;                                // 0x00A8(0x0003)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbcGeometryCacheSettings              GeometryCacheSettings;                             // 0x00AC(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbcConversionSettings                 ConversionSettings;                                // 0x00C0(0x0038)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbcAssetImportData">();
	}
	static class UAbcAssetImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbcAssetImportData>();
	}
};

// Class AlembicLibrary.AbcImportSettings
// 0x0090 (0x00C0 - 0x0030)
class UAbcImportSettings final : public UObject
{
public:
	EAlembicImportType                            ImportType;                                        // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbcSamplingSettings                   SamplingSettings;                                  // 0x0034(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAbcNormalGenerationSettings           NormalGenerationSettings;                          // 0x004C(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAbcMaterialSettings                   MaterialSettings;                                  // 0x0058(0x0002)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbcCompressionSettings                CompressionSettings;                               // 0x005C(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAbcStaticMeshSettings                 StaticMeshSettings;                                // 0x006C(0x0003)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbcGeometryCacheSettings              GeometryCacheSettings;                             // 0x0070(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAbcConversionSettings                 ConversionSettings;                                // 0x0080(0x0038)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbcImportSettings">();
	}
	static class UAbcImportSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbcImportSettings>();
	}
};

// Class AlembicLibrary.AlembicTestCommandlet
// 0x0020 (0x00A8 - 0x0088)
class UAlembicTestCommandlet final : public UCommandlet
{
public:
	uint8                                         Pad_88[0x20];                                      // 0x0088(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AlembicTestCommandlet">();
	}
	static class UAlembicTestCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlembicTestCommandlet>();
	}
};

}

