#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AmbientAudio

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AudioGameplay_classes.hpp"
#include "AmbientAudio_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class AmbientAudio.AmbientAudioComponent
// 0x0038 (0x0118 - 0x00E0)
class UAmbientAudioComponent final : public UAudioGameplayComponent
{
public:
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAmbientAudioDataAsset*                 AmbientAsset;                                      // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         Priority;                                          // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CrossfadeTime;                                     // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  AmbientGuid;                                       // 0x00F8(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   DisplayName;                                       // 0x0108(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAmbientAsset(class UAmbientAudioDataAsset* InAmbientAsset);
	void SetCrossfadeTime(float InCrossfadeTime);
	void SetPriority(int32 InPriority);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AmbientAudioComponent">();
	}
	static class UAmbientAudioComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmbientAudioComponent>();
	}
};

// Class AmbientAudio.AmbientAudioDataAsset
// 0x0028 (0x0060 - 0x0038)
class UAmbientAudioDataAsset : public UDataAsset
{
public:
	TArray<struct FAmbientAudioLoop>              LoopingSounds;                                     // 0x0038(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FAmbientAudioOneShot>           OneShotSounds;                                     // 0x0048(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         TagCrossfadeTime;                                  // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AmbientAudioDataAsset">();
	}
	static class UAmbientAudioDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmbientAudioDataAsset>();
	}
};

// Class AmbientAudio.AmbientAudioSubsystem
// 0x0228 (0x0260 - 0x0038)
class UAmbientAudioSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(struct FGameplayTag& GameplayTag, EAmbientAudioTagActionType ActionType)> OnTagChanged;                                      // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName AmbientName, EAmbientAudioEntryActionType ActionType)> OnEntryChanged;                                    // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class UAmbientAudioComponent*>         AmbientComponents;                                 // 0x0060(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	class AAmbientAudioParameterActor*            ParameterActor;                                    // 0x0070(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x1E8];                                     // 0x0078(0x01E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddAmbientEntry(class FName AmbientName, class UAmbientAudioDataAsset* Asset, int32 Priority, float CrossfadeTime);
	void AddGameplayTag(const struct FGameplayTag& GameplayTag);
	class UAudioParameterComponent* GetAudioParameterComponent();
	void RemoveAmbientEntry(class FName AmbientName, float CrossfadeOverride);
	void RemoveGameplayTag(const struct FGameplayTag& GameplayTag);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AmbientAudioSubsystem">();
	}
	static class UAmbientAudioSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmbientAudioSubsystem>();
	}
};

// Class AmbientAudio.AmbientAudioParameterActor
// 0x0008 (0x0428 - 0x0420)
class AAmbientAudioParameterActor final : public AActor
{
public:
	class UAudioParameterComponent*               Parameters;                                        // 0x0420(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AmbientAudioParameterActor">();
	}
	static class AAmbientAudioParameterActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAmbientAudioParameterActor>();
	}
};

}

