#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AndroidDeviceProfileSelector

#include "Basic.hpp"


namespace SDK
{

// Enum AndroidDeviceProfileSelector.ESourceType
// NumValues: 0x0011
enum class ESourceType : uint8
{
	SRC_PreviousRegexMatch                   = 0,
	SRC_GpuFamily                            = 1,
	SRC_GlVersion                            = 2,
	SRC_AndroidVersion                       = 3,
	SRC_DeviceMake                           = 4,
	SRC_DeviceModel                          = 5,
	SRC_DeviceBuildNumber                    = 6,
	SRC_VulkanVersion                        = 7,
	SRC_UsingHoudini                         = 8,
	SRC_VulkanAvailable                      = 9,
	SRC_CommandLine                          = 10,
	SRC_Hardware                             = 11,
	SRC_Chipset                              = 12,
	SRC_ConfigRuleVar                        = 13,
	SRC_HMDSystemName                        = 14,
	SRC_SM5Available                         = 15,
	SRC_MAX                                  = 16,
};

// Enum AndroidDeviceProfileSelector.ECompareType
// NumValues: 0x000F
enum class ECompareType : uint8
{
	CMP_Equal                                = 0,
	CMP_Less                                 = 1,
	CMP_LessEqual                            = 2,
	CMP_Greater                              = 3,
	CMP_GreaterEqual                         = 4,
	CMP_NotEqual                             = 5,
	CMP_Regex                                = 6,
	CMP_EqualIgnore                          = 7,
	CMP_LessIgnore                           = 8,
	CMP_LessEqualIgnore                      = 9,
	CMP_GreaterIgnore                        = 10,
	CMP_GreaterEqualIgnore                   = 11,
	CMP_NotEqualIgnore                       = 12,
	CMP_Hash                                 = 13,
	CMP_MAX                                  = 14,
};

// ScriptStruct AndroidDeviceProfileSelector.ProfileMatchItem
// 0x0018 (0x0018 - 0x0000)
struct FProfileMatchItem final
{
public:
	ESourceType                                   SourceType;                                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECompareType                                  CompareType;                                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MatchString;                                       // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AndroidDeviceProfileSelector.ProfileMatch
// 0x0020 (0x0020 - 0x0000)
struct FProfileMatch final
{
public:
	class FString                                 Profile;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FProfileMatchItem>              Match;                                             // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct AndroidDeviceProfileSelector.JavaSurfaceViewDevice
// 0x0020 (0x0020 - 0x0000)
struct FJavaSurfaceViewDevice final
{
public:
	class FString                                 Manufacturer;                                      // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Model;                                             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

