#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimationModifierLibrary

#include "Basic.hpp"

#include "AnimationModifierLibrary_structs.hpp"
#include "AnimationBlueprintLibrary_structs.hpp"
#include "AnimationModifiers_classes.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class AnimationModifierLibrary.CopyBonesModifier
// 0x0018 (0x0090 - 0x0078)
class UCopyBonesModifier final : public UAnimationModifier
{
public:
	TArray<struct FBoneReferencePair>             BonePairs;                                         // 0x0078(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	EAnimPoseSpaces                               BonePoseSpace;                                     // 0x0088(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CopyBonesModifier">();
	}
	static class UCopyBonesModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCopyBonesModifier>();
	}
};

// Class AnimationModifierLibrary.EncodeRootBoneModifier
// 0x0020 (0x0098 - 0x0078)
class UEncodeRootBoneModifier final : public UAnimationModifier
{
public:
	TArray<struct FEncodeRootBoneWeightedBone>    WeightedBoneToComputeRootPosition;                 // 0x0078(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FEncodeRootBoneWeightedBoneAxis> WeightedBoneToComputeRootOrientation;              // 0x0088(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncodeRootBoneModifier">();
	}
	static class UEncodeRootBoneModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEncodeRootBoneModifier>();
	}
};

// Class AnimationModifierLibrary.FootstepAnimEventsModifier
// 0x00C8 (0x0140 - 0x0078)
class UFootstepAnimEventsModifier final : public UAnimationModifier
{
public:
	int32                                         SampleRate;                                        // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundThreshold;                                   // 0x007C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedThreshold;                                    // 0x0080(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFootDefinition>                FootDefinitions;                                   // 0x0088(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bShouldRemovePreExistingNotifiesOrSyncMarkers;     // 0x0098(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FName>                             GeneratedNotifyTracks;                             // 0x00A0(0x0050)(Edit, EditConst, AdvancedDisplay, NativeAccessSpecifierPrivate)
	TSet<class FName>                             ProcessedNotifyTracks;                             // 0x00F0(0x0050)(Edit, EditConst, AdvancedDisplay, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FootstepAnimEventsModifier">();
	}
	static class UFootstepAnimEventsModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFootstepAnimEventsModifier>();
	}
};

// Class AnimationModifierLibrary.MotionExtractorUtilityLibrary
// 0x0000 (0x0030 - 0x0030)
class UMotionExtractorUtilityLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class FName GenerateCurveName(class FName BoneName, EMotionExtractor_MotionType MotionType, EMotionExtractor_Axis Axis);
	static float GetDesiredValue(const struct FTransform& BoneTransform, const struct FTransform& LastBoneTransform, float DeltaTime, EMotionExtractor_MotionType MotionType, EMotionExtractor_Axis Axis);
	static TArray<struct FVector2D> GetMovingRangesFromRootMotion(const class UAnimSequence* AnimSequence, float StopSpeedThreshold, float SampleRate);
	static TArray<struct FVector2D> GetStoppedRangesFromRootMotion(const class UAnimSequence* AnimSequence, float StopSpeedThreshold, float SampleRate);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotionExtractorUtilityLibrary">();
	}
	static class UMotionExtractorUtilityLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionExtractorUtilityLibrary>();
	}
};

// Class AnimationModifierLibrary.ReOrientRootBoneModifier
// 0x0018 (0x0090 - 0x0078)
class UReOrientRootBoneModifier final : public UAnimationModifier
{
public:
	struct FRotator                               Rotator;                                           // 0x0078(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReOrientRootBoneModifier">();
	}
	static class UReOrientRootBoneModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReOrientRootBoneModifier>();
	}
};

// Class AnimationModifierLibrary.ZeroOutRootBoneModifier
// 0x0008 (0x0080 - 0x0078)
class UZeroOutRootBoneModifier final : public UAnimationModifier
{
public:
	bool                                          bClipStartFramesWithNoMotion;                      // 0x0078(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClipEndFramesWithNoMotion;                        // 0x0079(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZeroOutRootBoneModifier">();
	}
	static class UZeroOutRootBoneModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZeroOutRootBoneModifier>();
	}
};

// Class AnimationModifierLibrary.MotionExtractorModifier
// 0x0040 (0x00B8 - 0x0078)
class UMotionExtractorModifier final : public UAnimationModifier
{
public:
	class FName                                   BoneName;                                          // 0x0078(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RelativeToBoneName;                                // 0x0084(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMotionExtractor_MotionType                   MotionType;                                        // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMotionExtractor_Axis                         Axis;                                              // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveCurveOnRevert;                              // 0x0092(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRelativeToFirstFrame;                             // 0x0093(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMotionExtractor_Space                        Space;                                             // 0x0094(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bComponentSpace;                                   // 0x0095(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteValue;                                    // 0x0096(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMotionExtractor_MathOperation                MathOperation;                                     // 0x0097(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Modifier;                                          // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNormalize;                                        // 0x009C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SampleRate;                                        // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCustomCurveName;                               // 0x00A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CustomCurveName;                                   // 0x00A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotionExtractorModifier">();
	}
	static class UMotionExtractorModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionExtractorModifier>();
	}
};

}

