#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimationLocomotionLibraryEditor

#include "Basic.hpp"

#include "AnimationLocomotionLibraryEditor_structs.hpp"
#include "AnimationModifiers_classes.hpp"


namespace SDK
{

// Class AnimationLocomotionLibraryEditor.DistanceCurveModifier
// 0x0018 (0x0090 - 0x0078)
class UDistanceCurveModifier final : public UAnimationModifier
{
public:
	int32                                         SampleRate;                                        // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CurveName;                                         // 0x007C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StopSpeedThreshold;                                // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDistanceCurve_Axis                           Axis;                                              // 0x008C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopAtEnd;                                        // 0x008D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DistanceCurveModifier">();
	}
	static class UDistanceCurveModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDistanceCurveModifier>();
	}
};

}

