#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimPresetsRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "AnimPresetsRuntime_structs.hpp"
#include "AnimPresetsCore_classes.hpp"
#include "GameFeatures_classes.hpp"


namespace SDK
{

// Class AnimPresetsRuntime.AnimPresetComponent
// 0x0030 (0x0108 - 0x00D8)
class UAnimPresetComponent final : public UActorComponent
{
public:
	TSoftClassPtr<class UClass>                   AnimPreset;                                        // 0x00D8(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimPresetComponent">();
	}
	static class UAnimPresetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimPresetComponent>();
	}
};

// Class AnimPresetsRuntime.AnimPreset_BasicLocomotion
// 0x0050 (0x0080 - 0x0030)
class UAnimPreset_BasicLocomotion final : public UAnimPreset
{
public:
	struct FAnimPreset_SingleAnimationData        Idle;                                              // 0x0030(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAnimPreset_SingleAnimationData        MoveForward;                                       // 0x0040(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAnimPreset_SingleAnimationData        MoveBackward;                                      // 0x0050(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAnimPreset_SingleAnimationData        MoveLeft;                                          // 0x0060(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAnimPreset_SingleAnimationData        MoveRight;                                         // 0x0070(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimPreset_BasicLocomotion">();
	}
	static class UAnimPreset_BasicLocomotion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimPreset_BasicLocomotion>();
	}
};

// Class AnimPresetsRuntime.GameFeatureAction_AnimPreset
// 0x0030 (0x0060 - 0x0030)
class UGameFeatureAction_AnimPreset final : public UGameFeatureAction
{
public:
	TSoftClassPtr<class UClass>                   AnimBP_Preset_BasicLocomotion;                     // 0x0030(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_AnimPreset">();
	}
	static class UGameFeatureAction_AnimPreset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AnimPreset>();
	}
};

}

