#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimationLayeringEditor

#include "Basic.hpp"

#include "AnimationLayeringRuntime_structs.hpp"
#include "AnimGraph_classes.hpp"
#include "AnimationModifierLibrary_structs.hpp"
#include "AnimationModifiers_classes.hpp"


namespace SDK
{

// Class AnimationLayeringEditor.AnimGraphNode_BoneMask
// 0x0170 (0x0408 - 0x0298)
class UAnimGraphNode_BoneMask final : public UAnimGraphNode_BlendListBase
{
public:
	struct FAnimNode_BoneMask                     Node;                                              // 0x0298(0x0170)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimGraphNode_BoneMask">();
	}
	static class UAnimGraphNode_BoneMask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimGraphNode_BoneMask>();
	}
};

// Class AnimationLayeringEditor.AnimGraphNode_CopyBoneAdvanced
// 0x0218 (0x04A8 - 0x0290)
class UAnimGraphNode_CopyBoneAdvanced final : public UAnimGraphNode_SkeletalControlBase
{
public:
	struct FAnimNode_CopyBoneAdvanced             Node;                                              // 0x0290(0x0218)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimGraphNode_CopyBoneAdvanced">();
	}
	static class UAnimGraphNode_CopyBoneAdvanced* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimGraphNode_CopyBoneAdvanced>();
	}
};

// Class AnimationLayeringEditor.AnimGraphNode_CopyMotion
// 0x0320 (0x05B0 - 0x0290)
class UAnimGraphNode_CopyMotion final : public UAnimGraphNode_SkeletalControlBase
{
public:
	struct FAnimNode_CopyMotion                   Node;                                              // 0x0290(0x0320)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimGraphNode_CopyMotion">();
	}
	static class UAnimGraphNode_CopyMotion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimGraphNode_CopyMotion>();
	}
};

// Class AnimationLayeringEditor.LayeringMotionExtractorModifier
// 0x0050 (0x00C8 - 0x0078)
class ULayeringMotionExtractorModifier final : public UAnimationModifier
{
public:
	class FName                                   BoneName;                                          // 0x0078(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneSpaceName;                                     // 0x0084(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MotionTypes;                                       // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMotionExtractor_Axis                         Axis;                                              // 0x0094(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveCurveOnRevert;                              // 0x0095(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteValue;                                    // 0x0096(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyFilter;                                      // 0x0097(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHighPass;                                         // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bButterworth;                                      // 0x0099(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CutoffFrequency;                                   // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Order;                                             // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMotionExtractor_MathOperation                MathOperation;                                     // 0x00A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Modifier;                                          // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNormalize;                                        // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SampleRate;                                        // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCustomCurveName;                               // 0x00B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CustomCurveName;                                   // 0x00B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LayeringMotionExtractorModifier">();
	}
	static class ULayeringMotionExtractorModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULayeringMotionExtractorModifier>();
	}
};

}

