#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimGraph

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Enum AnimGraph.EAnimGraphAttributesDisplayMode
// NumValues: 0x0004
enum class EAnimGraphAttributesDisplayMode : uint32
{
	HideOnPins                               = 0,
	ShowOnPins                               = 1,
	Automatic                                = 2,
	EAnimGraphAttributesDisplayMode_MAX      = 3,
};

// Enum AnimGraph.EAnimGraphAttributeBlend
// NumValues: 0x0003
enum class EAnimGraphAttributeBlend : uint32
{
	Blendable                                = 0,
	NonBlendable                             = 1,
	EAnimGraphAttributeBlend_MAX             = 2,
};

// Enum AnimGraph.EBlueprintUsage
// NumValues: 0x0004
enum class EBlueprintUsage : uint8
{
	NoProperties                             = 0,
	DoesNotUseBlueprint                      = 1,
	UsesBlueprint                            = 2,
	EBlueprintUsage_MAX                      = 3,
};

// Enum AnimGraph.EAnimGraphNodePropertyBindingType
// NumValues: 0x0004
enum class EAnimGraphNodePropertyBindingType : uint32
{
	None                                     = 0,
	Property                                 = 1,
	Function                                 = 2,
	EAnimGraphNodePropertyBindingType_MAX    = 3,
};

// Enum AnimGraph.EMontagePreviewType
// NumValues: 0x0003
enum class EMontagePreviewType : uint8
{
	EMPT_Normal                              = 0,
	EMPT_AllSections                         = 1,
	EMPT_MAX                                 = 2,
};

// Enum AnimGraph.EAnimStateType
// NumValues: 0x0003
enum class EAnimStateType : uint8
{
	AST_SingleAnimation                      = 0,
	AST_BlendGraph                           = 1,
	AST_MAX                                  = 2,
};

// Enum AnimGraph.ETransitionGetter
// NumValues: 0x000A
enum class ETransitionGetter : uint8
{
	AnimationAsset_GetCurrentTime            = 0,
	AnimationAsset_GetLength                 = 1,
	AnimationAsset_GetCurrentTimeFraction    = 2,
	AnimationAsset_GetTimeFromEnd            = 3,
	AnimationAsset_GetTimeFromEndFraction    = 4,
	CurrentState_ElapsedTime                 = 5,
	CurrentState_GetBlendWeight              = 6,
	CurrentTransitionDuration                = 7,
	ArbitraryState_GetBlendWeight            = 8,
	ETransitionGetter_MAX                    = 9,
};

// ScriptStruct AnimGraph.EdGraphSchemaAction_NewStateNode
// 0x0008 (0x00F8 - 0x00F0)
struct FEdGraphSchemaAction_NewStateNode final : public FEdGraphSchemaAction
{
public:
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AnimGraph.AnimPreviewInstanceProxy
// 0x0420 (0x0E40 - 0x0A20)
struct FAnimPreviewInstanceProxy : public FAnimSingleNodeInstanceProxy
{
public:
	uint8                                         Pad_A20[0x420];                                    // 0x0A20(0x0420)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AnimGraph.EdGraphSchemaAction_NewStateComment
// 0x0000 (0x00F0 - 0x00F0)
struct FEdGraphSchemaAction_NewStateComment final : public FEdGraphSchemaAction
{
};

// ScriptStruct AnimGraph.NodeSpawnData
// 0x0048 (0x0048 - 0x0000)
struct FNodeSpawnData final
{
public:
	class FText                                   CachedTitle;                                       // 0x0000(0x0010)(NativeAccessSpecifierPublic)
	class UAnimGraphNode_Base*                    SourceNode;                                        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimStateNodeBase*                     SourceStateNode;                                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    AnimInstanceClass;                                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimBlueprint*                         SourceBlueprint;                                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UField*                                 Getter;                                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GetterContextString;                               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AnimGraph.AnimGraphAttributeDesc
// 0x0120 (0x0120 - 0x0000)
struct FAnimGraphAttributeDesc final
{
public:
	class FName                                   Name;                                              // 0x0000(0x000C)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Icon;                                              // 0x0010(0x00D0)(Config, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x00E0(0x0010)(Config, NativeAccessSpecifierPublic)
	class FText                                   ToolTipText;                                       // 0x00F0(0x0010)(Config, NativeAccessSpecifierPublic)
	struct FSlateColor                            Color;                                             // 0x0100(0x0014)(Config, NativeAccessSpecifierPublic)
	EAnimGraphAttributesDisplayMode               DisplayMode;                                       // 0x0114(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimGraphAttributeBlend                      Blend;                                             // 0x0118(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SortOrder;                                         // 0x011C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AnimGraph.AnimGraphNodePropertyBinding
// 0x0148 (0x0148 - 0x0000)
struct FAnimGraphNodePropertyBinding final
{
public:
	struct FEdGraphPinType                        PinType;                                           // 0x0000(0x0070)(NoDestructor, NativeAccessSpecifierPublic)
	struct FEdGraphPinType                        PromotedPinType;                                   // 0x0070(0x0070)(NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ArrayIndex;                                        // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   PathAsText;                                        // 0x00F0(0x0010)(NativeAccessSpecifierPublic)
	TArray<class FString>                         PropertyPath;                                      // 0x0100(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   ContextId;                                         // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CompiledContext;                                   // 0x0120(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   CompiledContextDesc;                               // 0x0130(0x0010)(NativeAccessSpecifierPublic)
	EAnimGraphNodePropertyBindingType             Type;                                              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBound;                                          // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPromotion;                                      // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyUpdateWhenActive;                             // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_147[0x1];                                      // 0x0147(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AnimGraph.AnimBlueprintFunctionPinInfo
// 0x0080 (0x0080 - 0x0000)
struct FAnimBlueprintFunctionPinInfo final
{
public:
	class FName                                   Name;                                              // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEdGraphPinType                        Type;                                              // 0x0010(0x0070)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct AnimGraph.AnimPreviewAttacheInstanceProxy
// 0x01D0 (0x0A70 - 0x08A0)
struct FAnimPreviewAttacheInstanceProxy final : public FAnimInstanceProxy
{
public:
	uint8                                         Pad_898[0x1D8];                                    // 0x0898(0x01D8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

