#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: animated_mesh_device

#include "Basic.hpp"

#include "animated_mesh_device_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function animated_mesh_device.animated_mesh_device.$InitCDO
// 0x0120 (0x0120 - 0x0000)
struct animated_mesh_device__InitCDO final
{
public:
	class UDevices_device_function*               _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_2;                            // 0x0010(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0020(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_4;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_6;                            // 0x0040(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_8;                                     // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_9;                                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_10;                           // 0x0070(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x0080(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_12;                                    // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_13;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_14;                           // 0x00A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x00B0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_16;                                    // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_17;                               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_18;                           // 0x00D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_19;                                    // 0x00E0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_20;                                    // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_21;                               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_22;                           // 0x0100(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_23;                                    // 0x0110(0x0010)(HasGetValueTypeHash)
};

// Function animated_mesh_device.animated_mesh_device._L_2fFortnite_2ecom_2fDevices_2fanimated__mesh__device_N_RPause
// 0x0068 (0x0068 - 0x0000)
struct animated_mesh_device__L_2fFortnite_2ecom_2fDevices_2fanimated__mesh__device_N_RPause final
{
public:
	struct animated_mesh_device::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct animated_mesh_device::Ftuple_L_R       _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct animated_mesh_device::Ftuple_L_R       _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function animated_mesh_device.animated_mesh_device._L_2fFortnite_2ecom_2fDevices_2fanimated__mesh__device_N_RPlay
// 0x0068 (0x0068 - 0x0000)
struct animated_mesh_device__L_2fFortnite_2ecom_2fDevices_2fanimated__mesh__device_N_RPlay final
{
public:
	struct animated_mesh_device::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct animated_mesh_device::Ftuple_L_R       _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct animated_mesh_device::Ftuple_L_R       _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function animated_mesh_device.animated_mesh_device._L_2fFortnite_2ecom_2fDevices_2fanimated__mesh__device_N_RPlayReverse
// 0x0068 (0x0068 - 0x0000)
struct animated_mesh_device__L_2fFortnite_2ecom_2fDevices_2fanimated__mesh__device_N_RPlayReverse final
{
public:
	struct animated_mesh_device::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct animated_mesh_device::Ftuple_L_R       _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct animated_mesh_device::Ftuple_L_R       _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

