#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AssembledMeshSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"
#include "AssembledMeshSystem_structs.hpp"
#include "RigVM_classes.hpp"


namespace SDK
{

// Class AssembledMeshSystem.AssembledMeshUser_AttachToComponentSpecifier
// 0x0000 (0x0030 - 0x0030)
class IAssembledMeshUser_AttachToComponentSpecifier final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssembledMeshUser_AttachToComponentSpecifier">();
	}
	static class IAssembledMeshUser_AttachToComponentSpecifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAssembledMeshUser_AttachToComponentSpecifier>();
	}
};

// Class AssembledMeshSystem.AssembledMeshSchema
// 0x0228 (0x0270 - 0x0048)
class UAssembledMeshSchema : public UPrimaryDataAsset
{
public:
	struct FGameplayTag                           MeshSchemaTag;                                     // 0x0048(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCustomizableObjectInstance> CustomizableObjectInstance;                        // 0x0058(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCustomizableObject>     CustomizableObject;                                // 0x0088(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ComponentIndex;                                    // 0x00B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMesh>           SkeletalMesh;                                      // 0x00C0(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            SelectedIntParams;                                 // 0x00F0(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FString, float>                    SelectedFloatParams;                               // 0x0140(0x0050)(NativeAccessSpecifierPublic)
	struct FAssembledMeshAttachmentRules          AttachmentRules;                                   // 0x0190(0x0058)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   AnimClass;                                         // 0x01E8(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  SoundLibraryTags;                                  // 0x0218(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               AdditionalData;                                    // 0x0238(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UCustomizableObjectInstance*            TempInstance;                                      // 0x0248(0x0008)(ZeroConstructor, Transient, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FIntParamData>                  IntParams;                                         // 0x0250(0x0010)(ZeroConstructor, Transient, EditorOnly, NativeAccessSpecifierPublic)
	TArray<struct FFloatParamData>                FloatParams;                                       // 0x0260(0x0010)(ZeroConstructor, Transient, EditorOnly, NativeAccessSpecifierPublic)

public:
	void SetCustomizableObjectInstance(TSoftObjectPtr<class UCustomizableObjectInstance> InCustomizableObjectInstance);

	TSoftObjectPtr<class UCustomizableObjectInstance> GetCustomizableObjectInstance() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssembledMeshSchema">();
	}
	static class UAssembledMeshSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssembledMeshSchema>();
	}
};

// Class AssembledMeshSystem.HeadAccDataAssetLink
// 0x0000 (0x0140 - 0x0140)
class UHeadAccDataAssetLink final : public UDataAssetLink
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HeadAccDataAssetLink">();
	}
	static class UHeadAccDataAssetLink* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeadAccDataAssetLink>();
	}
};

// Class AssembledMeshSystem.NeckAccDataAssetLink
// 0x0000 (0x0140 - 0x0140)
class UNeckAccDataAssetLink final : public UDataAssetLink
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NeckAccDataAssetLink">();
	}
	static class UNeckAccDataAssetLink* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeckAccDataAssetLink>();
	}
};

// Class AssembledMeshSystem.HipAccDataAssetLink
// 0x0000 (0x0140 - 0x0140)
class UHipAccDataAssetLink final : public UDataAssetLink
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HipAccDataAssetLink">();
	}
	static class UHipAccDataAssetLink* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHipAccDataAssetLink>();
	}
};

// Class AssembledMeshSystem.AssembledMeshUserComponent
// 0x0068 (0x0140 - 0x00D8)
class UAssembledMeshUserComponent : public UActorComponent
{
public:
	TArray<class UObject*>                        LoadedAssets;                                      // 0x00D8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x20];                                      // 0x00E8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAssembledMeshSchema*>           MeshParts;                                         // 0x0108(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, RepNotify, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FAssembledComponentReferences>  MeshPartComponents;                                // 0x0118(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	bool                                          bDuplicateCOIs;                                    // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAssembledMeshSchema*                   MeshPart;                                          // 0x0130(0x0008)(BlueprintVisible, ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAssignMeshPartsOnBeginPlay : 1;                   // 0x0138(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CustomizationCompleted(const int32 PartIndex);
	void GatherAndAssignAssembledMeshParts();
	class USkeletalMeshComponent* GetAttachToComponent();
	void OnRep_MeshParts();
	void SetMeshPart(class UAssembledMeshSchema* InMeshPart);
	void SetMeshParts(const TArray<class UAssembledMeshSchema*>& InMeshParts);

	class UAssembledMeshSchema* GetMeshPart() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssembledMeshUserComponent">();
	}
	static class UAssembledMeshUserComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssembledMeshUserComponent>();
	}
};

}

