#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AssetDependencies

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class AssetDependencies.AssetDependencySettings
// 0x0120 (0x0180 - 0x0060)
class UAssetDependencySettings final : public UDeveloperSettings
{
public:
	TArray<class FName>                           ExcludedPaths;                                     // 0x0060(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_70[0x50];                                      // 0x0070(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ExcludedPackages;                                  // 0x00C0(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x50];                                      // 0x00D0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         ClassIgnoreList;                                   // 0x0120(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSet<class UClass*>                           ClassIgnoreListSet;                                // 0x0130(0x0050)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDependencySettings">();
	}
	static class UAssetDependencySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDependencySettings>();
	}
};

}

