#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AssetDefinition

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum AssetDefinition.EAssetActivationMethod
// NumValues: 0x0004
enum class EAssetActivationMethod : uint8
{
	DoubleClicked                            = 0,
	Opened                                   = 1,
	Previewed                                = 2,
	EAssetActivationMethod_MAX               = 3,
};

// Enum AssetDefinition.EAssetCommandResult
// NumValues: 0x0003
enum class EAssetCommandResult : uint8
{
	Handled                                  = 0,
	Unhandled                                = 1,
	EAssetCommandResult_MAX                  = 2,
};

// Enum AssetDefinition.EAssetOpenMethod
// NumValues: 0x0003
enum class EAssetOpenMethod : uint8
{
	Edit                                     = 0,
	View                                     = 1,
	EAssetOpenMethod_MAX                     = 2,
};

// ScriptStruct AssetDefinition.RevisionInfo
// 0x0020 (0x0020 - 0x0000)
struct FRevisionInfo final
{
public:
	class FString                                 Revision;                                          // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Changelist;                                        // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              Date;                                              // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AssetDefinition.AssetFilterData
// 0x0190 (0x0190 - 0x0000)
struct alignas(0x08) FAssetFilterData final
{
public:
	uint8                                         Pad_0[0x190];                                      // 0x0000(0x0190)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

