#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AssetManagerEditor

#include "Basic.hpp"

#include "AssetManagerEditor_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class AssetManagerEditor.SizeMapSettings
// 0x0010 (0x0040 - 0x0030)
class USizeMapSettings final : public UObject
{
public:
	class FName                                   SizeType;                                          // 0x0030(0x000C)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESizeMapDependencyType                        DependencyType;                                    // 0x003C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SizeMapSettings">();
	}
	static class USizeMapSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USizeMapSettings>();
	}
};

// Class AssetManagerEditor.EdGraphNode_Reference
// 0x0110 (0x01D0 - 0x00C0)
class UEdGraphNode_Reference final : public UEdGraphNode
{
public:
	uint8                                         Pad_C0[0x110];                                     // 0x00C0(0x0110)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EdGraphNode_Reference">();
	}
	static class UEdGraphNode_Reference* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEdGraphNode_Reference>();
	}
};

// Class AssetManagerEditor.EdGraphNode_ReferencedProperties
// 0x0020 (0x00E0 - 0x00C0)
class UEdGraphNode_ReferencedProperties final : public UEdGraphNode
{
public:
	uint8                                         Pad_C0[0x10];                                      // 0x00C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UEdGraphNode_Reference*                 ReferencingNode;                                   // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEdGraphNode_Reference*                 ReferencedNode;                                    // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EdGraphNode_ReferencedProperties">();
	}
	static class UEdGraphNode_ReferencedProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEdGraphNode_ReferencedProperties>();
	}
};

// Class AssetManagerEditor.EdGraph_ReferenceViewer
// 0x0270 (0x0320 - 0x00B0)
class UEdGraph_ReferenceViewer final : public UEdGraph
{
public:
	uint8                                         Pad_B0[0x270];                                     // 0x00B0(0x0270)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EdGraph_ReferenceViewer">();
	}
	static class UEdGraph_ReferenceViewer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEdGraph_ReferenceViewer>();
	}
};

// Class AssetManagerEditor.ReferenceViewerSchema
// 0x0000 (0x0030 - 0x0030)
class UReferenceViewerSchema final : public UEdGraphSchema
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReferenceViewerSchema">();
	}
	static class UReferenceViewerSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReferenceViewerSchema>();
	}
};

// Class AssetManagerEditor.ReferenceViewerSettings
// 0x0040 (0x0070 - 0x0030)
class UReferenceViewerSettings final : public UObject
{
public:
	bool                                          bLimitSearchDepth;                                 // 0x0030(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsShowReferencers;                                // 0x0031(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxSearchReferencerDepth;                          // 0x0034(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsShowDependencies;                               // 0x0038(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxSearchDependencyDepth;                          // 0x003C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLimitSearchBreadth;                               // 0x0040(0x0001)(ZeroConstructor, Config, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxSearchBreadth;                                  // 0x0044(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnableCollectionFilter;                           // 0x0048(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnablePluginFilter;                               // 0x0049(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsShowSoftReferences;                             // 0x004A(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsShowHardReferences;                             // 0x004B(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsShowEditorOnlyReferences;                       // 0x004C(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsShowManagementReferences;                       // 0x004D(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsShowSearchableNames;                            // 0x004E(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsShowCodePackages;                               // 0x004F(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsShowDuplicates;                                 // 0x0050(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsShowFilteredPackagesOnly;                       // 0x0051(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsCompactMode;                                    // 0x0052(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsShowExternalReferencers;                        // 0x0053(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsShowPath;                                       // 0x0054(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bFiltersEnabled;                                   // 0x0055(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAutoUpdateFilters;                                // 0x0056(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FilterState>                    UserFilters;                                       // 0x0058(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	bool                                          bFindPathEnabled;                                  // 0x0068(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReferenceViewerSettings">();
	}
	static class UReferenceViewerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReferenceViewerSettings>();
	}
};

}

