#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AtomModelImporterEditor

#include "Basic.hpp"

#include "AtomRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "GeometryCollectionEngine_structs.hpp"
#include "DataflowCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AtomModelImporter_structs.hpp"


namespace SDK
{

// Enum AtomModelImporterEditor.EAtomMeshMergingCoarseApproximationStrategy
// NumValues: 0x0005
enum class EAtomMeshMergingCoarseApproximationStrategy : uint8
{
	Automatic                                = 0,
	VoxelBasedSolidApproximation             = 1,
	SweptPlanarProjection                    = 2,
	IntersectSweptPlanarProjections          = 3,
	EAtomMeshMergingCoarseApproximationStrategy_MAX = 4,
};

// Enum AtomModelImporterEditor.EAtomMeshMergingRemoveHiddenFacesMode
// NumValues: 0x0005
enum class EAtomMeshMergingRemoveHiddenFacesMode : uint8
{
	None                                     = 0,
	Fastest                                  = 1,
	ExteriorVisibility                       = 5,
	OcclusionBased                           = 6,
	EAtomMeshMergingRemoveHiddenFacesMode_MAX = 7,
};

// Enum AtomModelImporterEditor.EAtomMeshMergingVertexColorMappingMode
// NumValues: 0x0003
enum class EAtomMeshMergingVertexColorMappingMode : uint8
{
	None                                     = 0,
	TriangleCountMetric                      = 1,
	EAtomMeshMergingVertexColorMappingMode_MAX = 2,
};

// Enum AtomModelImporterEditor.EAtomModelTreeEntryType
// NumValues: 0x0004
enum class EAtomModelTreeEntryType : uint8
{
	AtomModelPrimitive                       = 0,
	Group                                    = 1,
	Socket                                   = 2,
	EAtomModelTreeEntryType_MAX              = 3,
};

// Enum AtomModelImporterEditor.EAtomMergedMeshPartDetailLevel
// NumValues: 0x0005
enum class EAtomMergedMeshPartDetailLevel : uint8
{
	Base                                     = 0,
	Standard                                 = 1,
	Small                                    = 2,
	Decorative                               = 3,
	EAtomMergedMeshPartDetailLevel_MAX       = 4,
};

// Enum AtomModelImporterEditor.EAtomGroupFilterMode
// NumValues: 0x0003
enum class EAtomGroupFilterMode : uint8
{
	Disabled                                 = 0,
	UseDefaultGroupFiltering                 = 1,
	EAtomGroupFilterMode_MAX                 = 2,
};

// Enum AtomModelImporterEditor.EAtomMergedMeshPartApproximationType
// NumValues: 0x0007
enum class EAtomMergedMeshPartApproximationType : uint8
{
	NoConstraint                             = 0,
	AxisAlignedBox                           = 1,
	OrientedBox                              = 2,
	SweptHull                                = 4,
	ConvexHull                               = 8,
	SweptProjection                          = 16,
	EAtomMergedMeshPartApproximationType_MAX = 17,
};

// ScriptStruct AtomModelImporterEditor.AtomColorsProperty
// 0x0004 (0x0004 - 0x0000)
struct FAtomColorsProperty final
{
public:
	int32                                         AtomColorValue;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomDestructionMaterialReplacementDataTable
// 0x0038 (0x0040 - 0x0008)
struct FAtomDestructionMaterialReplacementDataTable final : public FTableRowBase
{
public:
	class FString                                 SearchString;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BaseMaterialSearchString;                          // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     MaterialReplacement;                               // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Annotations;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomDestructionFixISMMaterialsDataflowNode
// 0x0020 (0x01C0 - 0x01A0)
struct FAtomDestructionFixISMMaterialsDataflowNode final : public FDataflowNode
{
public:
	class UGeometryCollection*                    GCAsset;                                           // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGeometryCollectionAutoInstanceMesh> InstancedMeshes;                                   // 0x01A8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UDataTable*                             ISMMaterialDataTable;                              // 0x01B8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.ConnectionFieldPlanarPointStateDetails
// 0x0008 (0x0008 - 0x0000)
struct FConnectionFieldPlanarPointStateDetails final
{
public:
	EConnectionPointFlags                         Flags;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConnectionPointType                          Type;                                              // 0x0004(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Size;                                              // 0x0005(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFree;                                            // 0x0006(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSecondaryPinFree;                                // 0x0007(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.ConnectionFieldStateDetails
// 0x000C (0x000C - 0x0000)
struct FConnectionFieldStateDetails final
{
public:
	EFieldConnectResult                           Result;                                            // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectID;                                          // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        FieldIndex;                                        // 0x0008(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AtomModelImporterEditor.ConnectionFieldPlanarStateDetails
// 0x0080 (0x0080 - 0x0000)
struct FConnectionFieldPlanarStateDetails final
{
public:
	EConnectionFieldType                          Type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConnectionFieldGender                        ConnectionFieldType;                               // 0x0001(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        SubType;                                           // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FConnectionFieldPlanarPointStateDetails> Points;                                            // 0x0008(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         Overlaps;                                          // 0x0018(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FIntPoint                              FieldSize;                                         // 0x0028(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FConnectionFieldStateDetails>   Connections;                                       // 0x0030(0x0010)(Edit, EditFixedSize, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FQuat                                  Rotation;                                          // 0x0040(0x0020)(Edit, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0060(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AtomModelImporterEditor.ConnectionFieldLineStateDetails
// 0x0070 (0x0070 - 0x0000)
struct FConnectionFieldLineStateDetails final
{
public:
	EConnectionFieldType                          Type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        SubType;                                           // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Rotation;                                          // 0x0010(0x0020)(Edit, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0030(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Length;                                            // 0x0048(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StartCapped;                                       // 0x0050(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EndCapped;                                         // 0x0051(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConnectionFieldStateDetails>   Connections;                                       // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AtomModelImporterEditor.ConnectionFieldPointStateDetails
// 0x0060 (0x0060 - 0x0000)
struct FConnectionFieldPointStateDetails final
{
public:
	EConnectionFieldType                          Type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        SubType;                                           // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConnectionFieldStateDetails           Connection;                                        // 0x0008(0x000C)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Rotation;                                          // 0x0020(0x0020)(Edit, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0040(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AtomModelImporterEditor.AtomEditPivotTarget
// 0x0010 (0x0010 - 0x0000)
struct FAtomEditPivotTarget final
{
public:
	class UTransformProxy*                        TransformProxy;                                    // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCombinedTransformGizmo*                TransformGizmo;                                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomMeshMergingRequestedLODsSettings
// 0x0010 (0x0010 - 0x0000)
struct FAtomMeshMergingRequestedLODsSettings final
{
public:
	int32                                         NumLODs;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LODGroup;                                          // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomMeshMergingCopiedLODsSettings
// 0x0004 (0x0004 - 0x0000)
struct FAtomMeshMergingCopiedLODsSettings final
{
public:
	int32                                         NumCopiedLODs;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomMeshMergingSimplifiedLODsSettings
// 0x0018 (0x0018 - 0x0000)
struct FAtomMeshMergingSimplifiedLODsSettings final
{
public:
	int32                                         NumSimplifiedLODs;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SimplifyBaseTolerance;                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SimplifyLODLevelToleranceScale;                    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSimplifyPreserveCorners;                          // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SimplifySharpEdgeAngleDeg;                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SimplifyMinSalientDimension;                       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomMeshMergingApproximateLODsSettings
// 0x0010 (0x0010 - 0x0000)
struct FAtomMeshMergingApproximateLODsSettings final
{
public:
	int32                                         ApproximationSourceLOD;                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OptimizeBaseTriCost;                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OptimizeLODLevelTriCostScale;                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAllowableApproximationDeviation;                // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomMeshMergingCoarseLODsSettings
// 0x0014 (0x0014 - 0x0000)
struct FAtomMeshMergingCoarseLODsSettings final
{
public:
	EAtomMeshMergingCoarseApproximationStrategy   CoarseLODStrategy;                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumCoarseLODs;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CoarseLODBaseTolerance;                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CoarseLODMaxTriCountBase;                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CoarseApproximationDetailSize;                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomMeshMergingHiddenFacesRemovalSettings
// 0x0010 (0x0010 - 0x0000)
struct FAtomMeshMergingHiddenFacesRemovalSettings final
{
public:
	EAtomMeshMergingRemoveHiddenFacesMode         RemoveHiddenFacesMethod;                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RemoveHiddenStartLOD;                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RemoveHiddenSamplingDensity;                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoubleSidedHiddenRemoval;                         // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AtomModelImporterEditor.AtomMeshMergingCommonPartsSettings
// 0x0008 (0x0008 - 0x0000)
struct FAtomMeshMergingCommonPartsSettings final
{
public:
	int32                                         FilterCommonPartsLODLevel;                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ApproximateCommonPartLODs;                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomMeshMergingEdgeHardnessSettings
// 0x0004 (0x0004 - 0x0000)
struct FAtomMeshMergingEdgeHardnessSettings final
{
public:
	float                                         HardNormalAngleDeg;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomMeshMergingVertexColorSettings
// 0x0001 (0x0001 - 0x0000)
struct FAtomMeshMergingVertexColorSettings final
{
public:
	bool                                          bBakeVertexColor;                                  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomMeshMergingCoplanarMergeSettings
// 0x0008 (0x0008 - 0x0000)
struct FAtomMeshMergingCoplanarMergeSettings final
{
public:
	bool                                          bMergeCoplanarFaces;                               // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MergeCoplanarFacesStartLOD;                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomMeshMergingRetriangulationSettings
// 0x0010 (0x0010 - 0x0000)
struct FAtomMeshMergingRetriangulationSettings final
{
public:
	int32                                         PlanarPolygonRetriangulationStartLOD;              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRetriangulateSourceLODs;                          // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StartRetriangulateSourceLOD;                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PreserveUVsUpToLOD;                                // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomMeshMergingBudgetSettings
// 0x0020 (0x0020 - 0x0000)
struct FAtomMeshMergingBudgetSettings final
{
public:
	bool                                          bEnforceLODBudgets;                                // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TriangleBudget;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PartLODPromotionBudgetMultiplier;                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bManualBudgetPerLOD;                               // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 TriangleBudgetPerLOD;                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomMeshMergingFinalizationSettings
// 0x0002 (0x0002 - 0x0000)
struct FAtomMeshMergingFinalizationSettings final
{
public:
	bool                                          bAutoGenerateMissingUVs;                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoGenerateTangents;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomMeshMergingDebugUtilitySettings
// 0x0001 (0x0001 - 0x0000)
struct FAtomMeshMergingDebugUtilitySettings final
{
public:
	EAtomMeshMergingVertexColorMappingMode        VertexColorMappingMode;                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomMeshMergingSettings
// 0x00B0 (0x00B0 - 0x0000)
struct FAtomMeshMergingSettings final
{
public:
	struct FAtomMeshMergingRequestedLODsSettings  RequestedLODsSettings;                             // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAtomMeshMergingCopiedLODsSettings     CopiedLODsSettings;                                // 0x0010(0x0004)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAtomMeshMergingSimplifiedLODsSettings SimplifiedLODsSettings;                            // 0x0014(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAtomMeshMergingApproximateLODsSettings ApproximateLODsSettings;                           // 0x002C(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAtomMeshMergingCoarseLODsSettings     CoarseLODsSettings;                                // 0x003C(0x0014)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAtomMeshMergingHiddenFacesRemovalSettings HiddenFacesRemovalSettings;                        // 0x0050(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAtomMeshMergingCommonPartsSettings    CommonPartsSettings;                               // 0x0060(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAtomMeshMergingEdgeHardnessSettings   EdgeHardnessSettings;                              // 0x0068(0x0004)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAtomMeshMergingVertexColorSettings    VertexColorSettings;                               // 0x006C(0x0001)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAtomMeshMergingCoplanarMergeSettings  CoplanarMergeSettings;                             // 0x0070(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAtomMeshMergingRetriangulationSettings RetriangulationSettings;                           // 0x0078(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAtomMeshMergingBudgetSettings         BudgetSettings;                                    // 0x0088(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FAtomMeshMergingFinalizationSettings   FinalizationSettings;                              // 0x00A8(0x0002)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAtomMeshMergingDebugUtilitySettings   DebugUtilitySettings;                              // 0x00AA(0x0001)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AtomModelImporterEditor.AtomModelEditorDecorationAssignment
// 0x0040 (0x0040 - 0x0000)
struct FAtomModelEditorDecorationAssignment final
{
public:
	int32                                         OriginalDecorationAssignmentIndex;                 // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SurfaceName;                                       // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               Texture;                                           // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TextureName;                                       // 0x0020(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Version;                                           // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomModelMergeOptions
// 0x0006 (0x0006 - 0x0000)
struct FAtomModelMergeOptions final
{
public:
	bool                                          bMergeAllElements;                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMergeBySelectionSets;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CommonPartOptimization;                            // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExtractCommonParts;                               // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreCommonPartCollisions;                       // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBakeColorIDsIntoVertexColors;                     // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomPrimitiveViewerConnectionPointProperties
// 0x0008 (0x0008 - 0x0000)
struct FAtomPrimitiveViewerConnectionPointProperties final
{
public:
	bool                                          bHighlight;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EConnectionPointFlags                         Flags;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomPrimitiveViewerConnectionPointTypeProperties
// 0x0020 (0x0020 - 0x0000)
struct FAtomPrimitiveViewerConnectionPointTypeProperties final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EConnectionPointFlags>                 ConnectionPoints;                                  // 0x0010(0x0010)(Edit, EditFixedSize, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomPrimitiveGeometryTransformProperties
// 0x0040 (0x0040 - 0x0000)
struct FAtomPrimitiveGeometryTransformProperties final
{
public:
	class UStaticMesh*                            GeometryPreview;                                   // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform3f                           Transform;                                         // 0x0010(0x0030)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomPrimitiveRenderStyleProperties
// 0x00B0 (0x00B0 - 0x0000)
struct FAtomPrimitiveRenderStyleProperties final
{
public:
	class FString                                 ExportStyleName;                                   // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomPrimitiveGeometryTransformProperties Shell;                                             // 0x0010(0x0040)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomPrimitiveGeometryTransformProperties> Parts;                                             // 0x0050(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomPrimitiveGeometryTransformProperties> Details;                                           // 0x0060(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomPrimitiveGeometryTransformProperties> Caps;                                              // 0x0070(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>             SourceMesh;                                        // 0x0080(0x0030)(Edit, EditConst, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomPrimitiveColorProperty
// 0x0004 (0x0004 - 0x0000)
struct FAtomPrimitiveColorProperty final
{
public:
	int32                                         AtomColorValue;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomModelImporterTemplate
// 0x0060 (0x0060 - 0x0000)
struct FAtomModelImporterTemplate final
{
public:
	class FString                                 Label;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Category;                                          // 0x0020(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 ThumbnailObject;                                   // 0x0030(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomChildProcessorEntry
// 0x0010 (0x0010 - 0x0000)
struct FAtomChildProcessorEntry final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEditorAtomModelChildProcessor*         Processor;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomDatabase
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FAtomDatabase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnabled;                                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x1F];                                       // 0x0009(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AtomModelImporterEditor.AtomRemoteDatabase
// 0x0028 (0x0050 - 0x0028)
struct FAtomRemoteDatabase final : public FAtomDatabase
{
public:
	struct FAtomGameDataAPIConnectionSettings     ConnectionSettings;                                // 0x0028(0x0028)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomFileDatabase
// 0x0010 (0x0038 - 0x0028)
struct FAtomFileDatabase final : public FAtomDatabase
{
public:
	struct FFilePath                              FilePath;                                          // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomDirectoryDatabase
// 0x0010 (0x0038 - 0x0028)
struct FAtomDirectoryDatabase final : public FAtomDatabase
{
public:
	struct FDirectoryPath                         DirectoryPath;                                     // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomDatabaseManagementPageOptions
// 0x0060 (0x0060 - 0x0000)
struct FAtomDatabaseManagementPageOptions final
{
public:
	class FName                                   SortColumn;                                        // 0x0000(0x000C)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SortMode;                                          // 0x000C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, bool>                       ColumnVisibility;                                  // 0x0010(0x0050)(Config, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomModelUpdateTagsOptions
// 0x0028 (0x0028 - 0x0000)
struct FAtomModelUpdateTagsOptions final
{
public:
	struct FAtomModelTags                         AddTags;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FAtomModelTags                         RemoveTags;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bRemoveInvalidTags;                                // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveAllTags;                                    // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyToGeneratedMergedMeshes;                     // 0x0022(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AtomModelImporterEditor.AtomModelMergingSettings
// 0x0200 (0x0200 - 0x0000)
struct FAtomModelMergingSettings final
{
public:
	bool                                          bKeepCustomCollision;                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreCommonPartCollision;                        // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBakeVertexColors;                                 // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SelectionSetFilter;                                // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomModelMergedMeshSelection                 MeshSelection;                                     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CommonPartOptimization;                            // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExtractCommonParts;                               // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMeshMergingSettings                   MergingSettings;                                   // 0x0018(0x0118)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                   LODGroup;                                          // 0x0130(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPerQualityLevelInt                    QualityLevelMinLOD;                                // 0x0140(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FAtomModelGeometryOptimizationSettings OptimizationSettings;                              // 0x01B8(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAtomMergedMeshLODDistanceSettings     LODSettings;                                       // 0x01D0(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomMergedMeshPartInfo
// 0x0200 (0x0200 - 0x0000)
struct FAtomMergedMeshPartInfo final
{
public:
	struct FAtomPrimitiveGeometryLODs             GeometryLODs;                                      // 0x0000(0x00C8)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FAtomPrimitiveCollisionGeometry        Collision;                                         // 0x00C8(0x0080)(NativeAccessSpecifierPublic)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0150(0x0060)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 VertexColor;                                       // 0x01B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             Materials;                                         // 0x01B8(0x0010)(BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FAtomMaterialFeatures>          MaterialFeatures;                                  // 0x01C8(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	EAtomMergedMeshPartDetailLevel                MeshDetailLevel;                                   // 0x01D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreserveUVs;                                      // 0x01D9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowMerging;                                     // 0x01DA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowApproximation;                               // 0x01DB(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FilterLODLevel;                                    // 0x01DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MeshName;                                          // 0x01E0(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InstanceSubsetID;                                  // 0x01F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomMergedMeshPartApproximationType          ApproximationType;                                 // 0x01F4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F5[0xB];                                      // 0x01F5(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AtomModelImporterEditor.AtomModelBlueprintCreationArguments
// 0x0008 (0x0008 - 0x0000)
struct FAtomModelBlueprintCreationArguments final
{
public:
	TSubclassOf<class UObject>                    ParentClass;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomModelBlueprintCreationArgumentsAndString
// 0x0018 (0x0018 - 0x0000)
struct FAtomModelBlueprintCreationArgumentsAndString final
{
public:
	class FString                                 Pattern;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelBlueprintCreationArguments   Args;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporterEditor.AtomMergedGeometry
// 0x00D8 (0x00D8 - 0x0000)
struct FAtomMergedGeometry final
{
public:
	struct FAtomPrimitiveGeometryLODs             GeometryLODs;                                      // 0x0000(0x00C8)(BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             Materials;                                         // 0x00C8(0x0010)(BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

}

