#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AtomModelImporterEditor

#include "Basic.hpp"

#include "AtomRuntime_structs.hpp"
#include "AtomRuntime_classes.hpp"
#include "Engine_classes.hpp"
#include "UnrealEd_classes.hpp"
#include "InteractiveToolsFramework_classes.hpp"
#include "AtomModelImporterEditor_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "AtomModelImporter_structs.hpp"


namespace SDK
{

// Class AtomModelImporterEditor.AssetDefinition_AtomColorLUTAtlas
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_AtomColorLUTAtlas final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_AtomColorLUTAtlas">();
	}
	static class UAssetDefinition_AtomColorLUTAtlas* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_AtomColorLUTAtlas>();
	}
};

// Class AtomModelImporterEditor.AssetDefinition_AtomModel
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_AtomModel final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_AtomModel">();
	}
	static class UAssetDefinition_AtomModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_AtomModel>();
	}
};

// Class AtomModelImporterEditor.AssetDefinition_AtomPrimitive
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_AtomPrimitive final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_AtomPrimitive">();
	}
	static class UAssetDefinition_AtomPrimitive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_AtomPrimitive>();
	}
};

// Class AtomModelImporterEditor.AtomColorLUTAtlasFactory
// 0x0000 (0x0088 - 0x0088)
class UAtomColorLUTAtlasFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomColorLUTAtlasFactory">();
	}
	static class UAtomColorLUTAtlasFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomColorLUTAtlasFactory>();
	}
};

// Class AtomModelImporterEditor.AtomColorLUTAtlasThumbnailRenderer
// 0x0000 (0x0030 - 0x0030)
class UAtomColorLUTAtlasThumbnailRenderer final : public UTextureThumbnailRenderer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomColorLUTAtlasThumbnailRenderer">();
	}
	static class UAtomColorLUTAtlasThumbnailRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomColorLUTAtlasThumbnailRenderer>();
	}
};

// Class AtomModelImporterEditor.AtomEditToolBuilderBase
// 0x0000 (0x0030 - 0x0030)
class UAtomEditToolBuilderBase : public UInteractiveToolWithToolTargetsBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomEditToolBuilderBase">();
	}
	static class UAtomEditToolBuilderBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomEditToolBuilderBase>();
	}
};

// Class AtomModelImporterEditor.AtomEditMultiSelectionToolBuilderBase
// 0x0000 (0x0030 - 0x0030)
class UAtomEditMultiSelectionToolBuilderBase : public UAtomEditToolBuilderBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomEditMultiSelectionToolBuilderBase">();
	}
	static class UAtomEditMultiSelectionToolBuilderBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomEditMultiSelectionToolBuilderBase>();
	}
};

// Class AtomModelImporterEditor.AtomColorPickerToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UAtomColorPickerToolBuilder final : public UAtomEditMultiSelectionToolBuilderBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomColorPickerToolBuilder">();
	}
	static class UAtomColorPickerToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomColorPickerToolBuilder>();
	}
};

// Class AtomModelImporterEditor.AtomColorPickerToolProperties
// 0x0010 (0x00C0 - 0x00B0)
class UAtomColorPickerToolProperties final : public UInteractiveToolPropertySet
{
public:
	class UAtomColorPickerTool*                   Tool;                                              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSwitchToPaintToolAfterSelection;                  // 0x00B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAtomColorsProperty                    ColorsProperty;                                    // 0x00BC(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomColorPickerToolProperties">();
	}
	static class UAtomColorPickerToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomColorPickerToolProperties>();
	}
};

// Class AtomModelImporterEditor.AtomColorPickerTool
// 0x0050 (0x0108 - 0x00B8)
class UAtomColorPickerTool final : public UMultiSelectionTool
{
public:
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomColorPickerToolProperties*         AtomColorProperties;                               // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class USingleClickInputBehavior*              LeftClickBehavior;                                 // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMouseHoverBehavior*                    MouseHoverBehaviour;                               // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomColorPickerTool">();
	}
	static class UAtomColorPickerTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomColorPickerTool>();
	}
};

// Class AtomModelImporterEditor.AtomDecorationProperties
// 0x0018 (0x0048 - 0x0030)
class UAtomDecorationProperties final : public UObject
{
public:
	class FString                                 Revision;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              Size;                                              // 0x0040(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomDecorationProperties">();
	}
	static class UAtomDecorationProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomDecorationProperties>();
	}
};

// Class AtomModelImporterEditor.AtomDestructionBlueprintLibrary
// 0x0000 (0x0030 - 0x0030)
class UAtomDestructionBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void SetGeometryCollectionSourceFromAtomModel(class UGeometryCollection* GeometryCollection, class UAtomModel* AtomModel, class UAtomModelProcessor* CustomPrimitiveProcessor, const struct FAtomOnProcessPrimitiveSettings& PrimitiveSettings, const class UAtomMaterialFactory* MaterialFactory);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomDestructionBlueprintLibrary">();
	}
	static class UAtomDestructionBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomDestructionBlueprintLibrary>();
	}
};

// Class AtomModelImporterEditor.AtomEditorConnectionFieldComponentBase
// 0x0030 (0x06D0 - 0x06A0)
class UAtomEditorConnectionFieldComponentBase : public UStaticMeshComponent
{
public:
	uint8                                         Pad_6A0[0x30];                                     // 0x06A0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomEditorConnectionFieldComponentBase">();
	}
	static class UAtomEditorConnectionFieldComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomEditorConnectionFieldComponentBase>();
	}
};

// Class AtomModelImporterEditor.AtomEditorConnectionFieldPointComponent
// 0x0000 (0x06D0 - 0x06D0)
class UAtomEditorConnectionFieldPointComponent final : public UAtomEditorConnectionFieldComponentBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomEditorConnectionFieldPointComponent">();
	}
	static class UAtomEditorConnectionFieldPointComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomEditorConnectionFieldPointComponent>();
	}
};

// Class AtomModelImporterEditor.AtomEditorPointConnectionFieldComponent
// 0x0000 (0x06D0 - 0x06D0)
class UAtomEditorPointConnectionFieldComponent final : public UAtomEditorConnectionFieldComponentBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomEditorPointConnectionFieldComponent">();
	}
	static class UAtomEditorPointConnectionFieldComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomEditorPointConnectionFieldComponent>();
	}
};

// Class AtomModelImporterEditor.AtomEditorLineConnectionFieldComponent
// 0x0010 (0x06E0 - 0x06D0)
class UAtomEditorLineConnectionFieldComponent final : public UAtomEditorConnectionFieldComponentBase
{
public:
	uint8                                         Pad_6D0[0x10];                                     // 0x06D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomEditorLineConnectionFieldComponent">();
	}
	static class UAtomEditorLineConnectionFieldComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomEditorLineConnectionFieldComponent>();
	}
};

// Class AtomModelImporterEditor.AtomEditorConnectionStateContainer
// 0x0030 (0x0060 - 0x0030)
class UAtomEditorConnectionStateContainer : public UObject
{
public:
	TArray<struct FConnectionFieldPlanarStateDetails> PlanarFields;                                      // 0x0030(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FConnectionFieldLineStateDetails> LineFields;                                        // 0x0040(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FConnectionFieldPointStateDetails> PointFields;                                       // 0x0050(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomEditorConnectionStateContainer">();
	}
	static class UAtomEditorConnectionStateContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomEditorConnectionStateContainer>();
	}
};

// Class AtomModelImporterEditor.AtomEditorMode
// 0x0018 (0x0168 - 0x0150)
class UAtomEditorMode final : public UBaseLegacyWidgetEdMode
{
public:
	class UGeometrySelectionManager*              SelectionManager;                                  // 0x0150(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_158[0x10];                                     // 0x0158(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomEditorMode">();
	}
	static class UAtomEditorMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomEditorMode>();
	}
};

// Class AtomModelImporterEditor.AtomEditPivotToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UAtomEditPivotToolBuilder final : public UAtomEditMultiSelectionToolBuilderBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomEditPivotToolBuilder">();
	}
	static class UAtomEditPivotToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomEditPivotToolBuilder>();
	}
};

// Class AtomModelImporterEditor.AtomEditPivotToolProperties
// 0x0010 (0x00C0 - 0x00B0)
class UAtomEditPivotToolProperties final : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseWorldBox;                                      // 0x00B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Back();
	void Bottom();
	void Center();
	void Front();
	void Left();
	void Right();
	void Top();
	void WorldOrigin();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomEditPivotToolProperties">();
	}
	static class UAtomEditPivotToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomEditPivotToolProperties>();
	}
};

// Class AtomModelImporterEditor.AtomEditPivotTool
// 0x0178 (0x0230 - 0x00B8)
class alignas(0x10) UAtomEditPivotTool final : public UMultiSelectionTool
{
public:
	uint8                                         Pad_B8[0xE8];                                      // 0x00B8(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAtomEditPivotTarget>           ActiveGizmos;                                      // 0x01A0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UDragAlignmentMechanic*                 DragAlignmentMechanic;                             // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B8[0x68];                                     // 0x01B8(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomEditPivotToolProperties*           AtomToolProperties;                                // 0x0220(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomEditPivotTool">();
	}
	static class UAtomEditPivotTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomEditPivotTool>();
	}
};

// Class AtomModelImporterEditor.LxfmlExporter
// 0x0000 (0x0080 - 0x0080)
class ULxfmlExporter final : public UExporter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LxfmlExporter">();
	}
	static class ULxfmlExporter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULxfmlExporter>();
	}
};

// Class AtomModelImporterEditor.AtomModelActorToolTargetFactory
// 0x0000 (0x0030 - 0x0030)
class UAtomModelActorToolTargetFactory final : public UToolTargetFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelActorToolTargetFactory">();
	}
	static class UAtomModelActorToolTargetFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelActorToolTargetFactory>();
	}
};

// Class AtomModelImporterEditor.AtomModelActorToolTarget
// 0x0018 (0x0048 - 0x0030)
class UAtomModelActorToolTarget final : public UToolTarget
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelActorToolTarget">();
	}
	static class UAtomModelActorToolTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelActorToolTarget>();
	}
};

// Class AtomModelImporterEditor.AtomModelAuditCommandlet
// 0x0020 (0x00A8 - 0x0088)
class UAtomModelAuditCommandlet final : public UCommandlet
{
public:
	uint8                                         Pad_88[0x20];                                      // 0x0088(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelAuditCommandlet">();
	}
	static class UAtomModelAuditCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelAuditCommandlet>();
	}
};

// Class AtomModelImporterEditor.AtomModelBackedTarget
// 0x0000 (0x0030 - 0x0030)
class IAtomModelBackedTarget final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelBackedTarget">();
	}
	static class IAtomModelBackedTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAtomModelBackedTarget>();
	}
};

// Class AtomModelImporterEditor.AtomModelPartEntry
// 0x0028 (0x0058 - 0x0030)
class UAtomModelPartEntry final : public UObject
{
public:
	int32                                         PartIndex;                                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ParentGuid;                                        // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x14];                                      // 0x0044(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelPartEntry">();
	}
	static class UAtomModelPartEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelPartEntry>();
	}
};

// Class AtomModelImporterEditor.SelectedModelPrimitiveWrapper
// 0x0080 (0x00B0 - 0x0030)
class USelectedModelPrimitiveWrapper final : public UObject
{
public:
	TArray<class UAtomPrimitive*>                 AtomPrimitives;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FAtomPrimitiveColorProperty>    AtomPrimitiveColors;                               // 0x0040(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomModelEditorDecorationAssignment> Decorations;                                       // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         DesignId;                                          // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  UUID;                                              // 0x0064(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     Transforms;                                        // 0x0078(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class UAtomModel*                             AtomModel;                                         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAtomModelPartEntry*>            Parts;                                             // 0x0090(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SelectedModelPrimitiveWrapper">();
	}
	static class USelectedModelPrimitiveWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<USelectedModelPrimitiveWrapper>();
	}
};

// Class AtomModelImporterEditor.SelectedGroupWrapper
// 0x0020 (0x0050 - 0x0030)
class USelectedGroupWrapper final : public UObject
{
public:
	class FString                                 GroupName;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  GroupId;                                           // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SelectedGroupWrapper">();
	}
	static class USelectedGroupWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<USelectedGroupWrapper>();
	}
};

// Class AtomModelImporterEditor.SelectedSocketWrapper
// 0x0080 (0x00B0 - 0x0030)
class USelectedSocketWrapper final : public UObject
{
public:
	class FString                                 SocketName;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  SocketId;                                          // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             Transform;                                         // 0x0050(0x0060)(Edit, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SelectedSocketWrapper">();
	}
	static class USelectedSocketWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<USelectedSocketWrapper>();
	}
};

// Class AtomModelImporterEditor.AtomModelTreeEntry
// 0x0060 (0x0090 - 0x0030)
class UAtomModelTreeEntry final : public UObject
{
public:
	struct FGuid                                  Id;                                                // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x30];                                      // 0x0040(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAtomModelTreeEntry*>            Children;                                          // 0x0070(0x0010)(ZeroConstructor, NonTransactional, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UAtomModelPartEntry*>            Parts;                                             // 0x0080(0x0010)(ZeroConstructor, NonTransactional, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelTreeEntry">();
	}
	static class UAtomModelTreeEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelTreeEntry>();
	}
};

// Class AtomModelImporterEditor.AtomModelSelectionToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UAtomModelSelectionToolBuilder final : public UInteractiveToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelSelectionToolBuilder">();
	}
	static class UAtomModelSelectionToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelSelectionToolBuilder>();
	}
};

// Class AtomModelImporterEditor.AtomModelSelectionToolProperties
// 0x0010 (0x00C0 - 0x00B0)
class UAtomModelSelectionToolProperties final : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_B0[0x10];                                      // 0x00B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Clear();
	void Copy();
	void Delete();
	void Invert();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelSelectionToolProperties">();
	}
	static class UAtomModelSelectionToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelSelectionToolProperties>();
	}
};

// Class AtomModelImporterEditor.AtomModelSelectionTool
// 0x0090 (0x0148 - 0x00B8)
class UAtomModelSelectionTool final : public UMultiSelectionTool
{
public:
	uint8                                         Pad_B8[0x40];                                      // 0x00B8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class USingleClickInputBehavior*              LeftClickBehavior;                                 // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USingleClickInputBehavior*              RightClickBehavior;                                // 0x0100(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAtomModelSelectionToolProperties*      AtomToolProperties;                                // 0x0108(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_110[0x38];                                     // 0x0110(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelSelectionTool">();
	}
	static class UAtomModelSelectionTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelSelectionTool>();
	}
};

// Class AtomModelImporterEditor.AtomModelSnapToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UAtomModelSnapToolBuilder final : public UAtomEditMultiSelectionToolBuilderBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelSnapToolBuilder">();
	}
	static class UAtomModelSnapToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelSnapToolBuilder>();
	}
};

// Class AtomModelImporterEditor.AtomModelSnapToolProperties
// 0x0018 (0x00C8 - 0x00B0)
class UAtomModelSnapToolProperties final : public UInteractiveToolPropertySet
{
public:
	TSubclassOf<class UPointingDeviceConnectivityPlacementTool> ToolClass;                                         // 0x00B0(0x0008)(Edit, ZeroConstructor, Config, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPointingDeviceConnectivityPlacementTool* CurrentTool;                                       // 0x00B8(0x0008)(Edit, ZeroConstructor, EditConst, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelSnapToolProperties">();
	}
	static class UAtomModelSnapToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelSnapToolProperties>();
	}
};

// Class AtomModelImporterEditor.AtomModelSnapTool
// 0x0030 (0x00E8 - 0x00B8)
class UAtomModelSnapTool final : public UMultiSelectionTool
{
public:
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UPointingDeviceConnectivityPlacementTool* PlacementTool;                                     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomModelSnapToolProperties*           ToolProperties;                                    // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelSnapTool">();
	}
	static class UAtomModelSnapTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelSnapTool>();
	}
};

// Class AtomModelImporterEditor.AtomModelThumbnailRenderer
// 0x0008 (0x0040 - 0x0038)
class UAtomModelThumbnailRenderer final : public UDefaultSizedThumbnailRenderer
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelThumbnailRenderer">();
	}
	static class UAtomModelThumbnailRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelThumbnailRenderer>();
	}
};

// Class AtomModelImporterEditor.AtomPaintToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UAtomPaintToolBuilder final : public UAtomEditMultiSelectionToolBuilderBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPaintToolBuilder">();
	}
	static class UAtomPaintToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPaintToolBuilder>();
	}
};

// Class AtomModelImporterEditor.AtomPaintToolProperties
// 0x0020 (0x00D0 - 0x00B0)
class UAtomPaintToolProperties final : public UInteractiveToolPropertySet
{
public:
	class UAtomPaintTool*                         Tool;                                              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomColorsProperty                    ColorsProperty;                                    // 0x00B8(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   PrimitiveImportStyle;                              // 0x00BC(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseColorPayload;                                   // 0x00C8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyColorToSelection();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPaintToolProperties">();
	}
	static class UAtomPaintToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPaintToolProperties>();
	}
};

// Class AtomModelImporterEditor.AtomPaintTool
// 0x00A8 (0x0160 - 0x00B8)
class UAtomPaintTool final : public UMultiSelectionTool
{
public:
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomPaintToolProperties*               AtomColorProperties;                               // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class USingleClickOrDragInputBehavior*        LeftClickBehavior;                                 // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULocalMouseHoverBehavior*               MouseHoverBehaviour;                               // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_100[0x60];                                     // 0x0100(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPaintTool">();
	}
	static class UAtomPaintTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPaintTool>();
	}
};

// Class AtomModelImporterEditor.AtomPartsCollectionEditorBlueprintLibrary
// 0x0000 (0x0030 - 0x0030)
class UAtomPartsCollectionEditorBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FAtomModelPartInstanceInfo CreatePartInstanceFromPrimitive(class UAtomPrimitive* Primitive, const TArray<struct FTransform>& Transforms);
	static struct FAtomModelPartInstanceInfo CreatePartInstanceFromPrimitiveId(int32 PrimitiveId, const TArray<struct FTransform>& Transforms);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPartsCollectionEditorBlueprintLibrary">();
	}
	static class UAtomPartsCollectionEditorBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPartsCollectionEditorBlueprintLibrary>();
	}
};

// Class AtomModelImporterEditor.AtomPartSelectionToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UAtomPartSelectionToolBuilder final : public UInteractiveToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPartSelectionToolBuilder">();
	}
	static class UAtomPartSelectionToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPartSelectionToolBuilder>();
	}
};

// Class AtomModelImporterEditor.AtomPartSelectionToolProperties
// 0x0000 (0x00B0 - 0x00B0)
class UAtomPartSelectionToolProperties final : public UInteractiveToolPropertySet
{
public:
	void Clear();
	void Invert();
	void SelectSimilarColor();
	void SelectSimilarParts();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPartSelectionToolProperties">();
	}
	static class UAtomPartSelectionToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPartSelectionToolProperties>();
	}
};

// Class AtomModelImporterEditor.AtomPartSelectionTool
// 0x0080 (0x0138 - 0x00B8)
class UAtomPartSelectionTool final : public UMultiSelectionTool
{
public:
	uint8                                         Pad_B8[0x40];                                      // 0x00B8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class USingleClickInputBehavior*              LeftClickBehavior;                                 // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USingleClickInputBehavior*              RightClickBehavior;                                // 0x0100(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAtomPartSelectionToolProperties*       AtomToolProperties;                                // 0x0108(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_110[0x28];                                     // 0x0110(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPartSelectionTool">();
	}
	static class UAtomPartSelectionTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPartSelectionTool>();
	}
};

// Class AtomModelImporterEditor.AtomPrimitiveUserNotesEditorData
// 0x0020 (0x0050 - 0x0030)
class UAtomPrimitiveUserNotesEditorData final : public UObject
{
public:
	TArray<class FString>                         UserNotes;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         UserWarnings;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitiveUserNotesEditorData">();
	}
	static class UAtomPrimitiveUserNotesEditorData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitiveUserNotesEditorData>();
	}
};

// Class AtomModelImporterEditor.AtomPrimitiveGeometryProperties
// 0x0020 (0x0050 - 0x0030)
class UAtomPrimitiveGeometryProperties final : public UObject
{
public:
	TArray<struct FAtomPrimitiveRenderStyleProperties> RenderStyles;                                      // 0x0030(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UStaticMeshComponent*>           GeneratedStaticMeshComponents;                     // 0x0040(0x0010)(Edit, ExportObject, EditFixedSize, ZeroConstructor, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitiveGeometryProperties">();
	}
	static class UAtomPrimitiveGeometryProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitiveGeometryProperties>();
	}
};

// Class AtomModelImporterEditor.AtomPrimitiveViewerProperties
// 0x0010 (0x0070 - 0x0060)
class UAtomPrimitiveViewerProperties final : public UAtomEditorConnectionStateContainer
{
public:
	TArray<struct FAtomPrimitiveColorProperty>    AtomColors;                                        // 0x0060(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitiveViewerProperties">();
	}
	static class UAtomPrimitiveViewerProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitiveViewerProperties>();
	}
};

// Class AtomModelImporterEditor.AtomPrimitiveGeometryContainerNameProperties
// 0x0010 (0x0040 - 0x0030)
class UAtomPrimitiveGeometryContainerNameProperties : public UObject
{
public:
	class FString                                 StyleName;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitiveGeometryContainerNameProperties">();
	}
	static class UAtomPrimitiveGeometryContainerNameProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitiveGeometryContainerNameProperties>();
	}
};

// Class AtomModelImporterEditor.AtomPrimitiveGeometryContainerImportProperties
// 0x0010 (0x0050 - 0x0040)
class UAtomPrimitiveGeometryContainerImportProperties final : public UAtomPrimitiveGeometryContainerNameProperties
{
public:
	struct FFilePath                              FbxFileToImport;                                   // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitiveGeometryContainerImportProperties">();
	}
	static class UAtomPrimitiveGeometryContainerImportProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitiveGeometryContainerImportProperties>();
	}
};

// Class AtomModelImporterEditor.AtomPrimitiveGeometryContainerAddProperties
// 0x0010 (0x0050 - 0x0040)
class UAtomPrimitiveGeometryContainerAddProperties final : public UAtomPrimitiveGeometryContainerNameProperties
{
public:
	class UStaticMesh*                            ShellStaticMesh;                                   // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LODIndex;                                          // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitiveGeometryContainerAddProperties">();
	}
	static class UAtomPrimitiveGeometryContainerAddProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitiveGeometryContainerAddProperties>();
	}
};

// Class AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary
// 0x0000 (0x0030 - 0x0030)
class UAtomPrimitiveEditorBlueprintLibrary final : public UAtomPrimitiveBlueprintLibrary
{
public:
	static class UAtomPrimitiveGeometry* AddSkeletonToGeometry(class UAtomPrimitiveGeometry* Geometry, class USkeleton* Skeleton);
	static struct FAtomPrimitiveGeometryLODs AppendAtomPrimitiveGeometryLODs(struct FAtomPrimitiveGeometryLODs& BaseLODs, const struct FAtomPrimitiveGeometryLODs& AppendLODs, const struct FTransform& Transform);
	static class UAtomPrimitiveGeometry* BevelGeometry(class UAtomPrimitiveGeometry* GeometryToBevel, float BevelWidth, float AngleThresholdInDegrees, bool bIgnoreUVSeams, bool bOnlyBevelBlockLikeGeometry);
	static struct FGeometryScriptSimpleCollision Conv_AtomPrimitiveCollisionGeometryToGeometryScriptSimpleCollision(const struct FAtomPrimitiveCollisionGeometry& AtomCollision);
	static struct FAtomPrimitiveCollisionGeometry Conv_GeometryScriptSimpleCollisionToAtomPrimitiveCollisionGeometry(const struct FGeometryScriptSimpleCollision& GeometryScriptSimpleCollision);
	static class UDynamicMesh* ConvertAtomPrimitiveGeometryToDynamicMesh(const class UAtomPrimitiveGeometry* AtomPrimitiveGeometry, class UDynamicMesh* DynamicMesh);
	static class UAtomPrimitiveGeometry* ConvertDynamicMeshToAtomPrimitiveGeometry(const class UDynamicMesh* DynamicMesh, class UAtomPrimitiveGeometry* AtomPrimitiveGeometry);
	static void CreateSkeletalMeshFromGeometry(const TArray<class UAtomPrimitiveGeometry*>& GeometryLODs, const TArray<class UMaterialInterface*>& MaterialArray, class USkeleton* TemplateSkeleton, const class FString& Subpath, const class FString& SkeletonName, const class FString& MeshName, class USkeletalMesh** OutSkeletalMesh, class USkeleton** OutSkeleton);
	static class UStaticMesh* CreateStaticMeshFromGeometry(const struct FAtomPrimitiveGeometryLODs& GeometryLODs, class UAtomPrimitiveGeometry* NaniteHiResLOD, const TArray<class UMaterialInterface*>& MaterialArray, const class FString& Subpath, const class FString& StaticMeshName, bool bPreserveExistingCollision, bool bPreserveExistingSockets, bool bGenerateMeshDistanceFields, ECollisionTraceFlag TraceFlag, bool bSupportRaytracing);
	static struct FAtomPrimitiveGeometryLODs DuplicateAtomPrimitiveGeometryLODs(const struct FAtomPrimitiveGeometryLODs& GeometryLODs);
	static struct FAtomPrimitiveCollisionGeometry GenerateCollisionGeometry(class UAtomPrimitiveGeometry* Geometry, EPrimitiveAutoCollisionType CollisionType);
	static TArray<class UAtomModel*> GetAtomModelsReferencingPrimitive(class UAtomPrimitive* AtomPrimitive);
	static TArray<class UAtomModel*> GetAtomModelsReferencingPrimitives(const TArray<class UAtomPrimitive*>& AtomPrimitives);
	static class UAtomPrimitive* GetAtomPrimitiveById(int32 PrimitiveId);
	static class UStaticMesh* GetCommonPartStaticMesh(const class FString& ExportStyleName, EAtomCommonPartType CommonPartType, const class FString& CommonPartMeshPath);
	static class UObject* GetCustomPrimitiveProcessorTargetAsset(class UAtomModelProcessor* Processor, class UAtomPrimitive* Primitive, const struct FAtomOnProcessPrimitiveSettings& PrimitiveSettings);
	static bool GetIsPrimitiveProcessorValid();
	static class UObject* GetPrimitiveProcessorTargetAsset(class UAtomPrimitive* Primitive, const struct FAtomOnProcessPrimitiveSettings& PrimitiveSettings);
	static struct FAtomPrimitiveCollisionGeometry GetPrimitiveSourceCollision(const class UAtomPrimitive* Primitive, float PrimitiveScale);
	static bool IsGeometryBlockLike(class UAtomPrimitiveGeometry* Geometry);
	static struct FAtomProcessorResult RunCustomPrimitiveProcessor(class UAtomModelProcessor* Processor, class UAtomPrimitive* Primitive, const struct FAtomOnProcessPrimitiveSettings& PrimitiveSettings);
	static struct FAtomProcessorResult RunPrimitiveProcessor(class UAtomPrimitive* Primitive, const struct FAtomOnProcessPrimitiveSettings& PrimitiveSettings);
	static class UAtomPrimitiveGeometry* SubdivideGeometry(class UAtomPrimitiveGeometry* GeometryToSubdivide, int32 NumberOfSubdivisions);
	static bool UpdatePrimitiveArray(const TArray<class UAtomPrimitive*>& AtomPrimitives);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitiveEditorBlueprintLibrary">();
	}
	static class UAtomPrimitiveEditorBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitiveEditorBlueprintLibrary>();
	}
};

// Class AtomModelImporterEditor.AtomPrimitiveThumbnailRenderer
// 0x0008 (0x0040 - 0x0038)
class UAtomPrimitiveThumbnailRenderer final : public UDefaultSizedThumbnailRenderer
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitiveThumbnailRenderer">();
	}
	static class UAtomPrimitiveThumbnailRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitiveThumbnailRenderer>();
	}
};

// Class AtomModelImporterEditor.AtomPrimitiveCommonViewModel
// 0x0068 (0x0098 - 0x0030)
class UAtomPrimitiveCommonViewModel final : public UObject
{
public:
	uint32                                        PartId;                                            // 0x0030(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FAtomPrimitiveStyleImportData> ImportedStyles;                                    // 0x0038(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                MissingPrimitiveAtomModels;                        // 0x0088(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitiveCommonViewModel">();
	}
	static class UAtomPrimitiveCommonViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitiveCommonViewModel>();
	}
};

// Class AtomModelImporterEditor.AtomPrimitiveViewModel
// 0x0160 (0x0190 - 0x0030)
class alignas(0x10) UAtomPrimitiveViewModel final : public UObject
{
public:
	uint8                                         Pad_30[0xA0];                                      // 0x0030(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomPrimitiveCommonViewModel*          Common;                                            // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PartRevision;                                      // 0x00D8(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DesignName;                                        // 0x00E8(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomPlatform                                 AtomPlatform;                                      // 0x00F8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   AtomMainGroupText;                                 // 0x0100(0x0010)(Edit, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   AtomSubMainGroupText;                              // 0x0118(0x0010)(Edit, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_128[0x4];                                      // 0x0128(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          ExcludedByImportFilter;                            // 0x012C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSoftObjectPath>                Imported;                                          // 0x0130(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FAtomPrimitiveStyleImportData> StyleRevisions;                                    // 0x0140(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitiveViewModel">();
	}
	static class UAtomPrimitiveViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitiveViewModel>();
	}
};

// Class AtomModelImporterEditor.AtomEditSingleSelectionToolBuilderBase
// 0x0000 (0x0030 - 0x0030)
class UAtomEditSingleSelectionToolBuilderBase final : public UAtomEditToolBuilderBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomEditSingleSelectionToolBuilderBase">();
	}
	static class UAtomEditSingleSelectionToolBuilderBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomEditSingleSelectionToolBuilderBase>();
	}
};

// Class AtomModelImporterEditor.AtomMaterialFactory
// 0x0000 (0x0030 - 0x0030)
class UAtomMaterialFactory : public UObject
{
public:
	static class FString GetTextureFeatureHash(const struct FAtomMaterialFeatures& MaterialFeatures);

	void ApplyMaterialFeatures(class UMaterialInstanceConstant* Material, const struct FAtomMaterialFeatures& Features) const;
	class UMaterialInterface* GetBaseMaterial(const struct FAtomMaterialFeatures& MaterialFeatures) const;
	struct FAtomMaterialFeatures GetMaterialFeatures(class UMaterialInterface* Material) const;
	class FString GetMaterialNameForFeatures(const struct FAtomMaterialFeatures& MaterialFeatures) const;
	struct FTopLevelAssetPath GetMaterialPathForFeatures(const struct FAtomMaterialFeatures& MaterialFeatures) const;
	bool GetMaterialType(const class UMaterialInterface* Material, EAtomMaterialType* MaterialType) const;
	class UMaterialInterface* GetOrCreateMaterial(const struct FAtomMaterialFeatures& MaterialFeatures) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomMaterialFactory">();
	}
	static class UAtomMaterialFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomMaterialFactory>();
	}
};

// Class AtomModelImporterEditor.AtomMaterialDefaultFactory
// 0x0000 (0x0030 - 0x0030)
class UAtomMaterialDefaultFactory : public UAtomMaterialFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomMaterialDefaultFactory">();
	}
	static class UAtomMaterialDefaultFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomMaterialDefaultFactory>();
	}
};

// Class AtomModelImporterEditor.AtomTransientMaterialFactory
// 0x0000 (0x0030 - 0x0030)
class UAtomTransientMaterialFactory final : public UAtomMaterialDefaultFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomTransientMaterialFactory">();
	}
	static class UAtomTransientMaterialFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomTransientMaterialFactory>();
	}
};

// Class AtomModelImporterEditor.EditorAtomModelChildProcessor
// 0x0000 (0x0030 - 0x0030)
class UEditorAtomModelChildProcessor final : public UObject
{
public:
	struct FAtomProcessorResult OnFinalizeModel(class UAtomModel* Model, const struct FAtomModelPartsCollection& AtomModelPartsCollection, const TArray<class UObject*>& InputObjects);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorAtomModelChildProcessor">();
	}
	static class UEditorAtomModelChildProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorAtomModelChildProcessor>();
	}
};

// Class AtomModelImporterEditor.EditorAtomModelProcessor
// 0x0078 (0x00D8 - 0x0060)
class UEditorAtomModelProcessor final : public UAtomModelProcessor
{
public:
	bool                                          bUseAsImporterTemplate;                            // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAtomModelImporterTemplate             ImporterTemplate;                                  // 0x0068(0x0060)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FAtomChildProcessorEntry>       ChildProcessors;                                   // 0x00C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	struct FAtomProcessorResult InvokeChildProcessorOnFinalizeModels(class UAtomModel* Model, const struct FAtomModelPartsCollection& AtomModelPartsCollection, const TArray<class UObject*>& InputObjects);

	bool AreAnyChildProcessorsActive() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorAtomModelProcessor">();
	}
	static class UEditorAtomModelProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorAtomModelProcessor>();
	}
};

// Class AtomModelImporterEditor.AtomDatabaseListViewModel
// 0x0030 (0x0060 - 0x0030)
class UAtomDatabaseListViewModel final : public UObject
{
public:
	TArray<struct FInstancedStruct>               PrioritizedDatabaseList;                           // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomDatabaseListViewModel">();
	}
	static class UAtomDatabaseListViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomDatabaseListViewModel>();
	}
};

// Class AtomModelImporterEditor.AtomTool
// 0x0000 (0x0030 - 0x0030)
class IAtomTool final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomTool">();
	}
	static class IAtomTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAtomTool>();
	}
};

// Class AtomModelImporterEditor.AtomDatabaseManagementOptions
// 0x00C0 (0x00F0 - 0x0030)
class UAtomDatabaseManagementOptions final : public UObject
{
public:
	struct FAtomDatabaseManagementPageOptions     PrimitivesOptions;                                 // 0x0030(0x0060)(Config, NativeAccessSpecifierPublic)
	struct FAtomDatabaseManagementPageOptions     DecorationsOptions;                                // 0x0090(0x0060)(Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomDatabaseManagementOptions">();
	}
	static class UAtomDatabaseManagementOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomDatabaseManagementOptions>();
	}
};

// Class AtomModelImporterEditor.AtomDecorationsUIEditableTextureSettings
// 0x0008 (0x0038 - 0x0030)
class UAtomDecorationsUIEditableTextureSettings final : public UObject
{
public:
	struct FAtomTextureImportSettings             ImportSettings;                                    // 0x0030(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomDecorationsUIEditableTextureSettings">();
	}
	static class UAtomDecorationsUIEditableTextureSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomDecorationsUIEditableTextureSettings>();
	}
};

// Class AtomModelImporterEditor.AtomMergedMeshOptionsWrapper
// 0x0008 (0x0038 - 0x0030)
class UAtomMergedMeshOptionsWrapper final : public UObject
{
public:
	struct FAtomModelMergeOptions                 ModelMergeOptions;                                 // 0x0030(0x0006)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomMergedMeshOptionsWrapper">();
	}
	static class UAtomMergedMeshOptionsWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomMergedMeshOptionsWrapper>();
	}
};

// Class AtomModelImporterEditor.AtomProcessorWrapper
// 0x0028 (0x0058 - 0x0030)
class UAtomProcessorWrapper final : public UObject
{
public:
	struct FAtomModelProcessorInstance            ProcessorInstance;                                 // 0x0030(0x0028)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomProcessorWrapper">();
	}
	static class UAtomProcessorWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomProcessorWrapper>();
	}
};

// Class AtomModelImporterEditor.AtomModelActorFactory
// 0x0000 (0x0090 - 0x0090)
class UAtomModelActorFactory final : public UActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelActorFactory">();
	}
	static class UAtomModelActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelActorFactory>();
	}
};

// Class AtomModelImporterEditor.AtomMergedGeometryContainer
// 0x00D8 (0x0108 - 0x0030)
class UAtomMergedGeometryContainer final : public UObject
{
public:
	TMap<class FString, struct FAtomMergedGeometry> MergedGeometries;                                  // 0x0030(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FAtomModelHierarchicalScene            Scene;                                             // 0x0080(0x0010)(BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         MaxLODs;                                           // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         BakedFlexPrimitivesNames;                          // 0x0098(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<struct FAtomModelPartGuid, struct FAtomPrimitiveInstanceData> PrimitiveInstanceDataMap;                          // 0x00A8(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 ProcessorImportJson;                               // 0x00F8(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomMergedGeometryContainer">();
	}
	static class UAtomMergedGeometryContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomMergedGeometryContainer>();
	}
};

// Class AtomModelImporterEditor.AtomModelBlueprintLibrary
