#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AtomVKEditor

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "AtomModelImporter_structs.hpp"


namespace SDK
{

// Class AtomVKEditor.AtomVKEditorSettings
// 0x0060 (0x00C0 - 0x0060)
class UAtomVKEditorSettings final : public UDeveloperSettings
{
public:
	struct FAtomDatabasePath                      PrimitiveDatabaseDirectory;                        // 0x0060(0x0020)(Config, NativeAccessSpecifierPrivate)
	TArray<struct FAtomDatabasePath>              AdditionalPrimitiveDirectories;                    // 0x0080(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	class FName                                   PivotGroupName;                                    // 0x0090(0x000C)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   SocketsGroupName;                                  // 0x009C(0x000C)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseLegacyImportDialog;                            // 0x00A8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         AllowedImportTemplateLocations;                    // 0x00B0(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomVKEditorSettings">();
	}
	static class UAtomVKEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomVKEditorSettings>();
	}
};

}

