#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AtomModelImporterEditor

#include "Basic.hpp"

#include "GeometryScriptingCore_structs.hpp"
#include "AtomRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "AtomModelImporterEditor_structs.hpp"


namespace SDK::Params
{

// Function AtomModelImporterEditor.AtomDestructionBlueprintLibrary.SetGeometryCollectionSourceFromAtomModel
// 0x0038 (0x0038 - 0x0000)
struct AtomDestructionBlueprintLibrary_SetGeometryCollectionSourceFromAtomModel final
{
public:
	class UGeometryCollection*                    GeometryCollection;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomModel*                             AtomModel;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomModelProcessor*                    CustomPrimitiveProcessor;                          // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomOnProcessPrimitiveSettings        PrimitiveSettings;                                 // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	const class UAtomMaterialFactory*             MaterialFactory;                                   // 0x0030(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPartsCollectionEditorBlueprintLibrary.CreatePartInstanceFromPrimitive
// 0x00C8 (0x00C8 - 0x0000)
struct AtomPartsCollectionEditorBlueprintLibrary_CreatePartInstanceFromPrimitive final
{
public:
	class UAtomPrimitive*                         Primitive;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     Transforms;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAtomModelPartInstanceInfo             ReturnValue;                                       // 0x0018(0x00B0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPartsCollectionEditorBlueprintLibrary.CreatePartInstanceFromPrimitiveId
// 0x00C8 (0x00C8 - 0x0000)
struct AtomPartsCollectionEditorBlueprintLibrary_CreatePartInstanceFromPrimitiveId final
{
public:
	int32                                         PrimitiveId;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     Transforms;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAtomModelPartInstanceInfo             ReturnValue;                                       // 0x0018(0x00B0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.AddSkeletonToGeometry
// 0x0018 (0x0018 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_AddSkeletonToGeometry final
{
public:
	class UAtomPrimitiveGeometry*                 Geometry;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeleton*                              Skeleton;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.AppendAtomPrimitiveGeometryLODs
// 0x02C0 (0x02C0 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_AppendAtomPrimitiveGeometryLODs final
{
public:
	struct FAtomPrimitiveGeometryLODs             BaseLODs;                                          // 0x0000(0x00C8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAtomPrimitiveGeometryLODs             AppendLODs;                                        // 0x00C8(0x00C8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTransform                             Transform;                                         // 0x0190(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomPrimitiveGeometryLODs             ReturnValue;                                       // 0x01F0(0x00C8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.BevelGeometry
// 0x0020 (0x0020 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_BevelGeometry final
{
public:
	class UAtomPrimitiveGeometry*                 GeometryToBevel;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BevelWidth;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleThresholdInDegrees;                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreUVSeams;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyBevelBlockLikeGeometry;                       // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.Conv_AtomPrimitiveCollisionGeometryToGeometryScriptSimpleCollision
// 0x0100 (0x0100 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_Conv_AtomPrimitiveCollisionGeometryToGeometryScriptSimpleCollision final
{
public:
	struct FAtomPrimitiveCollisionGeometry        AtomCollision;                                     // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptSimpleCollision         ReturnValue;                                       // 0x0080(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.Conv_GeometryScriptSimpleCollisionToAtomPrimitiveCollisionGeometry
// 0x0100 (0x0100 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_Conv_GeometryScriptSimpleCollisionToAtomPrimitiveCollisionGeometry final
{
public:
	struct FGeometryScriptSimpleCollision         GeometryScriptSimpleCollision;                     // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAtomPrimitiveCollisionGeometry        ReturnValue;                                       // 0x0080(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.ConvertAtomPrimitiveGeometryToDynamicMesh
// 0x0018 (0x0018 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_ConvertAtomPrimitiveGeometryToDynamicMesh final
{
public:
	const class UAtomPrimitiveGeometry*           AtomPrimitiveGeometry;                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           DynamicMesh;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.ConvertDynamicMeshToAtomPrimitiveGeometry
// 0x0018 (0x0018 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_ConvertDynamicMeshToAtomPrimitiveGeometry final
{
public:
	const class UDynamicMesh*                     DynamicMesh;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 AtomPrimitiveGeometry;                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.CreateSkeletalMeshFromGeometry
// 0x0068 (0x0068 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_CreateSkeletalMeshFromGeometry final
{
public:
	TArray<class UAtomPrimitiveGeometry*>         GeometryLODs;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             MaterialArray;                                     // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class USkeleton*                              TemplateSkeleton;                                  // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Subpath;                                           // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SkeletonName;                                      // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MeshName;                                          // 0x0048(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          OutSkeletalMesh;                                   // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeleton*                              OutSkeleton;                                       // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.CreateStaticMeshFromGeometry
// 0x0110 (0x0110 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_CreateStaticMeshFromGeometry final
{
public:
	struct FAtomPrimitiveGeometryLODs             GeometryLODs;                                      // 0x0000(0x00C8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 NaniteHiResLOD;                                    // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             MaterialArray;                                     // 0x00D0(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Subpath;                                           // 0x00E0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StaticMeshName;                                    // 0x00F0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreserveExistingCollision;                        // 0x0100(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreserveExistingSockets;                          // 0x0101(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateMeshDistanceFields;                       // 0x0102(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionTraceFlag                           TraceFlag;                                         // 0x0103(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportRaytracing;                                // 0x0104(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            ReturnValue;                                       // 0x0108(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.DuplicateAtomPrimitiveGeometryLODs
// 0x0190 (0x0190 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_DuplicateAtomPrimitiveGeometryLODs final
{
public:
	struct FAtomPrimitiveGeometryLODs             GeometryLODs;                                      // 0x0000(0x00C8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAtomPrimitiveGeometryLODs             ReturnValue;                                       // 0x00C8(0x00C8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.GenerateCollisionGeometry
// 0x0090 (0x0090 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_GenerateCollisionGeometry final
{
public:
	class UAtomPrimitiveGeometry*                 Geometry;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPrimitiveAutoCollisionType                   CollisionType;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAtomPrimitiveCollisionGeometry        ReturnValue;                                       // 0x0010(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.GetAtomModelsReferencingPrimitive
// 0x0018 (0x0018 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_GetAtomModelsReferencingPrimitive final
{
public:
	class UAtomPrimitive*                         AtomPrimitive;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAtomModel*>                     ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.GetAtomModelsReferencingPrimitives
// 0x0020 (0x0020 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_GetAtomModelsReferencingPrimitives final
{
public:
	TArray<class UAtomPrimitive*>                 AtomPrimitives;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UAtomModel*>                     ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.GetAtomPrimitiveById
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_GetAtomPrimitiveById final
{
public:
	int32                                         PrimitiveId;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomPrimitive*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.GetCommonPartStaticMesh
// 0x0030 (0x0030 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_GetCommonPartStaticMesh final
{
public:
	class FString                                 ExportStyleName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomCommonPartType                           CommonPartType;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CommonPartMeshPath;                                // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.GetCustomPrimitiveProcessorTargetAsset
// 0x0030 (0x0030 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_GetCustomPrimitiveProcessorTargetAsset final
{
public:
	class UAtomModelProcessor*                    Processor;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitive*                         Primitive;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomOnProcessPrimitiveSettings        PrimitiveSettings;                                 // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.GetIsPrimitiveProcessorValid
// 0x0001 (0x0001 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_GetIsPrimitiveProcessorValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.GetPrimitiveProcessorTargetAsset
// 0x0028 (0x0028 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_GetPrimitiveProcessorTargetAsset final
{
public:
	class UAtomPrimitive*                         Primitive;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomOnProcessPrimitiveSettings        PrimitiveSettings;                                 // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.GetPrimitiveSourceCollision
// 0x0090 (0x0090 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_GetPrimitiveSourceCollision final
{
public:
	const class UAtomPrimitive*                   Primitive;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PrimitiveScale;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAtomPrimitiveCollisionGeometry        ReturnValue;                                       // 0x0010(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.IsGeometryBlockLike
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_IsGeometryBlockLike final
{
public:
	class UAtomPrimitiveGeometry*                 Geometry;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.RunCustomPrimitiveProcessor
// 0x0050 (0x0050 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_RunCustomPrimitiveProcessor final
{
public:
	class UAtomModelProcessor*                    Processor;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitive*                         Primitive;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomOnProcessPrimitiveSettings        PrimitiveSettings;                                 // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAtomProcessorResult                   ReturnValue;                                       // 0x0028(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.RunPrimitiveProcessor
// 0x0048 (0x0048 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_RunPrimitiveProcessor final
{
public:
	class UAtomPrimitive*                         Primitive;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomOnProcessPrimitiveSettings        PrimitiveSettings;                                 // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAtomProcessorResult                   ReturnValue;                                       // 0x0020(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.SubdivideGeometry
// 0x0018 (0x0018 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_SubdivideGeometry final
{
public:
	class UAtomPrimitiveGeometry*                 GeometryToSubdivide;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumberOfSubdivisions;                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomPrimitiveEditorBlueprintLibrary.UpdatePrimitiveArray
// 0x0018 (0x0018 - 0x0000)
struct AtomPrimitiveEditorBlueprintLibrary_UpdatePrimitiveArray final
{
public:
	TArray<class UAtomPrimitive*>                 AtomPrimitives;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomModelImporterEditor.AtomMaterialFactory.GetTextureFeatureHash
// 0x00B0 (0x00B0 - 0x0000)
struct AtomMaterialFactory_GetTextureFeatureHash final
{
public:
	struct FAtomMaterialFeatures                  MaterialFeatures;                                  // 0x0000(0x00A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x00A0(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomMaterialFactory.ApplyMaterialFeatures
// 0x00A8 (0x00A8 - 0x0000)
struct AtomMaterialFactory_ApplyMaterialFeatures final
{
public:
	class UMaterialInstanceConstant*              Material;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomMaterialFeatures                  Features;                                          // 0x0008(0x00A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomMaterialFactory.GetBaseMaterial
// 0x00A8 (0x00A8 - 0x0000)
struct AtomMaterialFactory_GetBaseMaterial final
{
public:
	struct FAtomMaterialFeatures                  MaterialFeatures;                                  // 0x0000(0x00A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     ReturnValue;                                       // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomMaterialFactory.GetMaterialFeatures
// 0x00A8 (0x00A8 - 0x0000)
struct AtomMaterialFactory_GetMaterialFeatures final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomMaterialFeatures                  ReturnValue;                                       // 0x0008(0x00A0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomMaterialFactory.GetMaterialNameForFeatures
// 0x00B0 (0x00B0 - 0x0000)
struct AtomMaterialFactory_GetMaterialNameForFeatures final
{
public:
	struct FAtomMaterialFeatures                  MaterialFeatures;                                  // 0x0000(0x00A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x00A0(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomMaterialFactory.GetMaterialPathForFeatures
// 0x00B8 (0x00B8 - 0x0000)
struct AtomMaterialFactory_GetMaterialPathForFeatures final
{
public:
	struct FAtomMaterialFeatures                  MaterialFeatures;                                  // 0x0000(0x00A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTopLevelAssetPath                     ReturnValue;                                       // 0x00A0(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomMaterialFactory.GetMaterialType
// 0x0010 (0x0010 - 0x0000)
struct AtomMaterialFactory_GetMaterialType final
{
public:
	const class UMaterialInterface*               Material;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomMaterialType                             MaterialType;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomModelImporterEditor.AtomMaterialFactory.GetOrCreateMaterial
// 0x00A8 (0x00A8 - 0x0000)
struct AtomMaterialFactory_GetOrCreateMaterial final
{
public:
	struct FAtomMaterialFeatures                  MaterialFeatures;                                  // 0x0000(0x00A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     ReturnValue;                                       // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.EditorAtomModelChildProcessor.OnFinalizeModel
// 0x00D0 (0x00D0 - 0x0000)
struct EditorAtomModelChildProcessor_OnFinalizeModel final
{
public:
	class UAtomModel*                             Model;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAtomModelPartsCollection              AtomModelPartsCollection;                          // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        InputObjects;                                      // 0x0090(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAtomProcessorResult                   ReturnValue;                                       // 0x00A0(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomModelImporterEditor.EditorAtomModelProcessor.InvokeChildProcessorOnFinalizeModels
// 0x00D0 (0x00D0 - 0x0000)
struct EditorAtomModelProcessor_InvokeChildProcessorOnFinalizeModels final
{
public:
	class UAtomModel*                             Model;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAtomModelPartsCollection              AtomModelPartsCollection;                          // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        InputObjects;                                      // 0x0090(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAtomProcessorResult                   ReturnValue;                                       // 0x00A0(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomModelImporterEditor.EditorAtomModelProcessor.AreAnyChildProcessorsActive
// 0x0001 (0x0001 - 0x0000)
struct EditorAtomModelProcessor_AreAnyChildProcessorsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.AddAtomModelReferenceToStaticMesh
// 0x0018 (0x0018 - 0x0000)
struct AtomModelBlueprintLibrary_AddAtomModelReferenceToStaticMesh final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomModel*                             AtomModel;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSaveConnectivityState;                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.AddAtomModelTagToStaticMesh
// 0x0018 (0x0018 - 0x0000)
struct AtomModelBlueprintLibrary_AddAtomModelTagToStaticMesh final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.AddCommonPartDescriptionToStaticMesh
// 0x0020 (0x0020 - 0x0000)
struct AtomModelBlueprintLibrary_AddCommonPartDescriptionToStaticMesh final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomCommonPartAssetDescription        Description;                                       // 0x0008(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.AddCommonPartInstanceToCache
// 0x00E0 (0x00E0 - 0x0000)
struct AtomModelBlueprintLibrary_AddCommonPartInstanceToCache final
{
public:
	struct FAtomCommonPartInstancesCache          Cache;                                             // 0x0000(0x0050)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTransform                             Transform;                                         // 0x0050(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            Mesh;                                              // 0x00B0(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Material;                                          // 0x00B8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPartGuid                     Guid;                                              // 0x00C0(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ColorId;                                           // 0x00D4(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.AddPrimitiveInstanceDataToStaticMesh
// 0x0058 (0x0058 - 0x0000)
struct AtomModelBlueprintLibrary_AddPrimitiveInstanceDataToStaticMesh final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FAtomModelPartGuid, struct FAtomPrimitiveInstanceData> InstanceDataMap;                                   // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.AddProcessorMaterialOverrideToStaticMesh
// 0x0058 (0x0058 - 0x0000)
struct AtomModelBlueprintLibrary_AddProcessorMaterialOverrideToStaticMesh final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<int32, class UMaterialInterface*>        MaterialOverrides;                                 // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.AddProcessorPrimitiveMeshOverrideToStaticMesh
// 0x0058 (0x0058 - 0x0000)
struct AtomModelBlueprintLibrary_AddProcessorPrimitiveMeshOverrideToStaticMesh final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FAtomModelPartGuid, class UStaticMesh*> PrimitiveMeshOverrides;                            // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.AddSkeletonToGeometryFromGroups
// 0x00A0 (0x00A0 - 0x0000)
struct AtomModelBlueprintLibrary_AddSkeletonToGeometryFromGroups final
{
public:
	class UAtomModel*                             AtomModel;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAtomModelPartsCollection              PartsCollection;                                   // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 Geometry;                                          // 0x0090(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.AppendPrimitiveToHISMContainer
// 0x00E8 (0x00E8 - 0x0000)
struct AtomModelBlueprintLibrary_AppendPrimitiveToHISMContainer final
{
public:
	class UHierarchicalInstancedStaticMeshComponent* Container;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPart                         Part;                                              // 0x0008(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.ApplyImportedSocketsToStaticMesh
// 0x0010 (0x0010 - 0x0000)
struct AtomModelBlueprintLibrary_ApplyImportedSocketsToStaticMesh final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UAtomModel*                       AtomModel;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.ApplyProcessorAssetImportDataToStaticMesh
// 0x0018 (0x0018 - 0x0000)
struct AtomModelBlueprintLibrary_ApplyProcessorAssetImportDataToStaticMesh final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UAtomModelProcessor*              Processor;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UAtomModel*                       AtomModel;                                         // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.ApplyProcessorAssetImportDataToStaticMeshWithJson
// 0x0020 (0x0020 - 0x0000)
struct AtomModelBlueprintLibrary_ApplyProcessorAssetImportDataToStaticMeshWithJson final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProcessorJson;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UAtomModel*                       AtomModel;                                         // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.CalculateMergedMeshScreenSizes
// 0x0038 (0x0038 - 0x0000)
struct AtomModelBlueprintLibrary_CalculateMergedMeshScreenSizes final
{
public:
	struct FAtomMergedMeshLODDistanceSettings     LODSettings;                                       // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMesh;                                        // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.CanPartFitIntoHISM
// 0x00E8 (0x00E8 - 0x0000)
struct AtomModelBlueprintLibrary_CanPartFitIntoHISM final
{
public:
	struct FAtomModelPart                         Part;                                              // 0x0000(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.ConvertToSortedPartList
// 0x0020 (0x0020 - 0x0000)
struct AtomModelBlueprintLibrary_ConvertToSortedPartList final
{
public:
	TArray<struct FAtomModelPrimitive>            Primitives;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FAtomModelPart>                 SortedParts;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.CreateBlueprintContainer
// 0x0040 (0x0040 - 0x0000)
struct AtomModelBlueprintLibrary_CreateBlueprintContainer final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AssetName;                                         // 0x0010(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ParentClass;                                       // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UActorComponent*>                Components;                                        // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UBlueprint*                             ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.CreateBlueprintContainerFromAtomModelScene
// 0x0090 (0x0090 - 0x0000)
struct AtomModelBlueprintLibrary_CreateBlueprintContainerFromAtomModelScene final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetName;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ParentClass;                                       // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelHierarchicalScene            Scene;                                             // 0x0028(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, class UStaticMesh*>       StaticMeshes;                                      // 0x0038(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UBlueprint*                             ReturnValue;                                       // 0x0088(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.CreateComponentForPart
// 0x00D0 (0x00D0 - 0x0000)
struct AtomModelBlueprintLibrary_CreateComponentForPart final
{
public:
	class AActor*                                 ActorOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        ParentComponent;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ParentClass;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPartInstanceInfo             Part;                                              // 0x0018(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USceneComponent*                        ReturnValue;                                       // 0x00C8(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.CreateHashForDecorationMaterial
// 0x0020 (0x0020 - 0x0000)
struct AtomModelBlueprintLibrary_CreateHashForDecorationMaterial final
{
public:
	TArray<struct FAtomModelPartDecorationInfo>   Decorations;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.CreateHISMContainerForPrimitive
// 0x00F8 (0x00F8 - 0x0000)
struct AtomModelBlueprintLibrary_CreateHISMContainerForPrimitive final
{
public:
	class AActor*                                 ActorOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        ParentComponent;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPart                         Part;                                              // 0x0010(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UHierarchicalInstancedStaticMeshComponent* ReturnValue;                                       // 0x00F0(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.CreateMaterialInstanceFromBaseMaterial
// 0x0038 (0x0038 - 0x0000)
struct AtomModelBlueprintLibrary_CreateMaterialInstanceFromBaseMaterial final
{
public:
	class UMaterialInterface*                     BaseMaterial;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Subpath;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MaterialInstanceName;                              // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverwriteExisting;                                // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlreadyExists;                                    // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.CreateModelMergedMesh
// 0x0038 (0x0038 - 0x0000)
struct AtomModelBlueprintLibrary_CreateModelMergedMesh final
{
public:
	class UAtomModel*                             AtomModel;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetPackageName;                                 // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SelectionSetFilter;                                // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMesh*>                    ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.CreateModelMergedMeshWithSettings
// 0x0228 (0x0228 - 0x0000)
struct AtomModelBlueprintLibrary_CreateModelMergedMeshWithSettings final
{
public:
	class UAtomModel*                             AtomModel;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetPackageName;                                 // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelMergingSettings              ModelMergingSettings;                              // 0x0018(0x0200)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UStaticMesh*>                    ReturnValue;                                       // 0x0218(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.CreateSceneComponentForPrimitive
// 0x00F8 (0x00F8 - 0x0000)
struct AtomModelBlueprintLibrary_CreateSceneComponentForPrimitive final
{
public:
	class AActor*                                 ActorOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        ParentComponent;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPart                         Part;                                              // 0x0010(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USceneComponent*                        ReturnValue;                                       // 0x00F0(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.DoPartsBelongToSameHISM
// 0x01C8 (0x01C8 - 0x0000)
struct AtomModelBlueprintLibrary_DoPartsBelongToSameHISM final
{
public:
	struct FAtomModelPart                         PartA;                                             // 0x0000(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAtomModelPart                         PartB;                                             // 0x00E0(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bAllowColorMismatch;                               // 0x01C0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x01C1(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.ExportProcessorToJson
// 0x0018 (0x0018 - 0x0000)
struct AtomModelBlueprintLibrary_ExportProcessorToJson final
{
public:
	const class UAtomModelProcessor*              Processor;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomModelImporterEditor.AtomModelBlueprintLibrary.FilterGroupChildren
// 0x0120 (0x0120 - 0x0000)
struct AtomModelBlueprintLibrary_FilterGroupChildren final
