#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AtomModelImporter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AtomRuntime_structs.hpp"


namespace SDK
{

// Enum AtomModelImporter.EAtomAPIStyleFlags
// NumValues: 0x0005
enum class EAtomAPIStyleFlags : uint8
{
	None                                     = 0,
	Realtime                                 = 1,
	Render                                   = 2,
	Game                                     = 4,
	EAtomAPIStyleFlags_MAX                   = 5,
};

// Enum AtomModelImporter.EAtomDatabaseType
// NumValues: 0x0005
enum class EAtomDatabaseType : uint32
{
	Unknown                                  = 0,
	File                                     = 1,
	Directory                                = 2,
	API                                      = 3,
	EAtomDatabaseType_MAX                    = 4,
};

// ScriptStruct AtomModelImporter.AtomGameDataAPIConnectionSettings
// 0x0028 (0x0028 - 0x0000)
struct FAtomGameDataAPIConnectionSettings final
{
public:
	class FString                                 BaseURL;                                           // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 APIKey;                                            // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Styles;                                            // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AtomModelImporter.PrimitiveStyleImportSettings
// 0x02D0 (0x02D0 - 0x0000)
struct FPrimitiveStyleImportSettings final
{
public:
	class FName                                   Name;                                              // 0x0000(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDirectoryPath                         MeshTargetContentFolder;                           // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         CommonMeshTargetContentFolder;                     // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         CombinedMeshTargetContentFolder;                   // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         MaterialTargetContentFolder;                       // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         TextureTargetContentFolder;                        // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      StandardMaterial;                                  // 0x0060(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      TransparentMaterial;                               // 0x0090(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      GlitterMaterial;                                   // 0x00C0(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      OpalescentMaterial;                                // 0x00F0(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      StandardMaterialWithVertexColors;                  // 0x0120(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      TransparentMaterialWithVertexColors;               // 0x0150(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      GlitterMaterialWithVertexColors;                   // 0x0180(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      OpalescentMaterialWithVertexColors;                // 0x01B0(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      StandardIndexColorMaterial;                        // 0x01E0(0x0030)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      MetalIndexColorMaterial;                           // 0x0210(0x0030)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      TransparentIndexColorMaterial;                     // 0x0240(0x0030)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      GlitterIndexColorMaterial;                         // 0x0270(0x0030)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      OpalescentIndexColorMaterial;                      // 0x02A0(0x0030)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporter.AtomTextureImportSettings
// 0x0008 (0x0008 - 0x0000)
struct FAtomTextureImportSettings final
{
public:
	bool                                          ResizeToPowerOfTwo;                                // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxTextureSize;                                    // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporter.AtomImportFilterSettings
// 0x0140 (0x0140 - 0x0000)
struct FAtomImportFilterSettings final
{
public:
	TSet<uint32>                                  PrimitivesToExclude;                               // 0x0000(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	TSet<EAtomPlatform>                           PlatformsToExclude;                                // 0x0050(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	TSet<int32>                                   MainGroupsToExclude;                               // 0x00A0(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	TSet<int32>                                   SubGroupsToExclude;                                // 0x00F0(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporter.AtomTagBudget
// 0x0010 (0x0010 - 0x0000)
struct FAtomTagBudget final
{
public:
	class FName                                   Name;                                              // 0x0000(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LODTriangleBudget;                                 // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AtomModelImporter.AtomDatabasePath
// 0x0020 (0x0020 - 0x0000)
struct FAtomDatabasePath final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Path;                                              // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomDatabaseType                             Type;                                              // 0x0018(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

