#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AtomModelImporter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AtomRuntime_structs.hpp"
#include "AtomRuntime_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "AtomModelImporter_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class AtomModelImporter.AtomDatabaseSubsystem
// 0x0010 (0x0048 - 0x0038)
class UAtomDatabaseSubsystem final : public UAtomDatabaseSubsystemBase
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomDatabaseSubsystem">();
	}
	static class UAtomDatabaseSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomDatabaseSubsystem>();
	}
};

// Class AtomModelImporter.AtomModelImporterSettings
// 0x03E0 (0x0440 - 0x0060)
class UAtomModelImporterSettings final : public UDeveloperSettings
{
public:
	float                                         PrimitiveGlobalScale;                              // 0x0060(0x0004)(ZeroConstructor, Config, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ModelGlobalScale;                                  // 0x0064(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLegacyFixedPipeline;                           // 0x0068(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCommonPartsMeshesWithExportStyleSubfolders;       // 0x0069(0x0001)(ZeroConstructor, Config, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MergedMeshPrefix;                                  // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMeshNaniteSettings                    MergedMeshNaniteSettings;                          // 0x0080(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	bool                                          bEnableDistanceField;                              // 0x00C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExtractCommonParts;                               // 0x00C1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBakeColorIDsIntoVertexColors;                     // 0x00C2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MergedMeshLODGroup;                                // 0x00C4(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSplitTransparentMeshes;                           // 0x00D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPerQualityLevelInt                    QualityLevelMinLOD;                                // 0x00D8(0x0078)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAtomMergedMeshLODDistanceSettings     MergedMeshLODSettings;                             // 0x0150(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         AtomPrimitiveTargetContentFolder;                  // 0x0180(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              PrimitiveColorDataTable;                           // 0x0190(0x0030)(Config, Deprecated, EditorOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPrimitiveStyleImportSettings>  PrimitiveImportStyles;                             // 0x01C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	struct FAtomPrimitiveBuildSettings            PrimitiveBuildSettings;                            // 0x01D0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FAtomPrimitiveBuildSettings            CommonPartsBuildSettings;                          // 0x01E8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	bool                                          bGenerateDecorationSurfaceUVs;                     // 0x0200(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateLightmapUVs;                              // 0x0201(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportCommonPartsFromPrimitiveSourceMeshes;       // 0x0202(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateCollision;                                // 0x0203(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPrimitiveAutoCollisionType                   DefaultSimpleCollisionShape;                       // 0x0204(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateComplexCollision;                         // 0x0205(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreCollisionOnCommonParts;                     // 0x0206(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_207[0x1];                                      // 0x0207(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PrimitiveImportBatchSize;                          // 0x0208(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SourceMeshFolder;                                  // 0x0210(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ValidAtomModelTags;                                // 0x0220(0x0010)(ZeroConstructor, Config, EditorOnly, NativeAccessSpecifierPublic)
	TArray<struct FAtomTagBudget>                 TagBudgets;                                        // 0x0230(0x0010)(ZeroConstructor, Config, EditorOnly, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   PrimitiveProcessor;                                // 0x0240(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         ProcessedPrimitiveContentFolder;                   // 0x0270(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomTextureImportSettings             DefaultTextureSettings;                            // 0x0280(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   PivotGroupName;                                    // 0x0288(0x000C)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketsGroupName;                                  // 0x0294(0x000C)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowCustomTemplate;                               // 0x02A0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLegacyImportDialog;                            // 0x02A1(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFilterAllowedImportTemplates;                     // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A3[0x5];                                      // 0x02A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         AllowedImportTemplateLocations;                    // 0x02A8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FAtomDatabasePath                      PrimitiveDatabaseDirectory;                        // 0x02B8(0x0020)(Edit, Config, EditConst, NativeAccessSpecifierPrivate)
	TArray<struct FAtomDatabasePath>              AdditionalPrimitiveDirectories;                    // 0x02D8(0x0010)(Edit, ZeroConstructor, Config, EditConst, NativeAccessSpecifierPrivate)
	struct FAtomImportFilterSettings              ImportFilter;                                      // 0x02E8(0x0140)(Edit, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_428[0x18];                                     // 0x0428(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void RebuildPrimitiveMeshes();

	TArray<class FName> GetLODGroupNames() const;
	TArray<class FName> GetTags() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelImporterSettings">();
	}
	static class UAtomModelImporterSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelImporterSettings>();
	}
};

}

