#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioShapes

#include "Basic.hpp"

#include "AudioGameplay_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class AudioShapes.AudioShapeComponent
// 0x0098 (0x0178 - 0x00E0)
class UAudioShapeComponent : public UAudioGameplayComponent
{
public:
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxDistanceOffset;                                 // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmoothingDistance;                                 // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeInTime;                                        // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutTime;                                       // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsAudible)> OnAudibleStateChanged;                             // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMap<class FName, class UAudioComponent*>     AudioComponents;                                   // 0x0108(0x0050)(ExportObject, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class APlayerController*>              LocalControllers;                                  // 0x0158(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_168[0x10];                                     // 0x0168(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Disable();
	void Enable();
	void UpdateAudioShape(const TArray<class APlayerController*>& InLocalControllers);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioShapeComponent">();
	}
	static class UAudioShapeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeComponent>();
	}
};

// Class AudioShapes.AudioShapePrimitiveComponent
// 0x00C8 (0x0240 - 0x0178)
#pragma pack(push, 0x1)
class alignas(0x10) UAudioShapePrimitiveComponent : public UAudioShapeComponent
{
public:
	class USoundBase*                             SoundOnEdge;                                       // 0x0178(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             SoundOnInside;                                     // 0x0180(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsInside)> OnInsideStateChanged;                              // 0x0188(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bUseOwningActorTransform;                          // 0x0198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoRefreshShape;                                 // 0x0199(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ActorTransformScale;                               // 0x01A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B8[0x80];                                     // 0x01B8(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UAudioComponent* GetEdgeAudioComponent();
	class UAudioComponent* GetInsideAudioComponent();

	bool GetIsPlayerInside() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioShapePrimitiveComponent">();
	}
	static class UAudioShapePrimitiveComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapePrimitiveComponent>();
	}
};
#pragma pack(pop)

// Class AudioShapes.AudioShapeBoxComponent
// 0x0060 (0x02A0 - 0x0240)
class UAudioShapeBoxComponent final : public UAudioShapePrimitiveComponent
{
public:
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BoxTransform;                                      // 0x0240(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetBoxTransform(const struct FTransform& InTransform);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioShapeBoxComponent">();
	}
	static class UAudioShapeBoxComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeBoxComponent>();
	}
};

// Class AudioShapes.AudioShapeCylinderComponent
// 0x0000 (0x0240 - 0x0240)
class UAudioShapeCylinderComponent final : public UAudioShapePrimitiveComponent
{
public:
	float                                         HalfHeight;                                        // 0x0238(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x023C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetHalfHeight(float InHalfHeight);
	void SetRadius(float InRadius);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioShapeCylinderComponent">();
	}
	static class UAudioShapeCylinderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeCylinderComponent>();
	}
};

// Class AudioShapes.AudioShapeLineComponent
// 0x0030 (0x0270 - 0x0240)
class UAudioShapeLineComponent final : public UAudioShapePrimitiveComponent
{
public:
	struct FVector                                StartPoint;                                        // 0x0238(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndPoint;                                          // 0x0250(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetEndPoint(const struct FVector& InEndPoint);
	void SetStartPoint(const struct FVector& InStartPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioShapeLineComponent">();
	}
	static class UAudioShapeLineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeLineComponent>();
	}
};

// Class AudioShapes.AudioShapeLineListComponent
// 0x0010 (0x0250 - 0x0240)
class UAudioShapeLineListComponent final : public UAudioShapePrimitiveComponent
{
public:
	TArray<struct FVector>                        PointList;                                         // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bClosedLoop;                                       // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 AddPoint(const struct FVector& InPoint);
	bool RemovePoint(int32 InIndex);
	bool UpdatePoint(int32 InIndex, const struct FVector& InPoint);

	void GetPoints(TArray<struct FVector>* OutPoints) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioShapeLineListComponent">();
	}
	static class UAudioShapeLineListComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeLineListComponent>();
	}
};

// Class AudioShapes.AudioShapeSphereComponent
// 0x0000 (0x0240 - 0x0240)
class UAudioShapeSphereComponent final : public UAudioShapePrimitiveComponent
{
public:
	float                                         Radius;                                            // 0x0238(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetRadius(float InRadius);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioShapeSphereComponent">();
	}
	static class UAudioShapeSphereComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeSphereComponent>();
	}
};

// Class AudioShapes.AudioShapeSubsystem
// 0x0058 (0x0090 - 0x0038)
class UAudioShapeSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x28];                                      // 0x0038(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAudioShapeComponent*>           AudioShapes;                                       // 0x0060(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class APlayerController*>              LocalControllers;                                  // 0x0070(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioShapeSubsystem">();
	}
	static class UAudioShapeSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeSubsystem>();
	}
};

}

