#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioProperties

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "AudioProperties_structs.hpp"
#include "AudioExtensions_classes.hpp"


namespace SDK
{

// Class AudioProperties.AudioPropertiesBindings
// 0x0050 (0x0080 - 0x0030)
class UAudioPropertiesBindings final : public UObject
{
public:
	TMap<class FName, class FName>                ObjectPropertyToSheetPropertyMap;                  // 0x0030(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioPropertiesBindings">();
	}
	static class UAudioPropertiesBindings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioPropertiesBindings>();
	}
};

// Class AudioProperties.AudioPropertiesParserBase
// 0x0000 (0x0030 - 0x0030)
class UAudioPropertiesParserBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioPropertiesParserBase">();
	}
	static class UAudioPropertiesParserBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioPropertiesParserBase>();
	}
};

// Class AudioProperties.AudioPropertiesParserNameMatch
// 0x0008 (0x0038 - 0x0030)
class UAudioPropertiesParserNameMatch : public UAudioPropertiesParserBase
{
public:
	TSubclassOf<class UObject>                    ValidationClass;                                   // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioPropertiesParserNameMatch">();
	}
	static class UAudioPropertiesParserNameMatch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioPropertiesParserNameMatch>();
	}
};

// Class AudioProperties.AudioPropertiesParserBindings
// 0x0008 (0x0040 - 0x0038)
class UAudioPropertiesParserBindings final : public UAudioPropertiesParserNameMatch
{
public:
	class UAudioPropertiesBindings*               BindingsAsset;                                     // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioPropertiesParserBindings">();
	}
	static class UAudioPropertiesParserBindings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioPropertiesParserBindings>();
	}
};

// Class AudioProperties.AudioPropertiesSheetAsset
// 0x0050 (0x0080 - 0x0030)
class UAudioPropertiesSheetAsset final : public UAudioPropertiesSheetAssetBase
{
public:
	struct FAudioPropertiesSheet                  PropertiesSheet;                                   // 0x0030(0x0030)(Edit, NativeAccessSpecifierPublic)
	class UAudioPropertiesParserBase*             PropertiesParser;                                  // 0x0060(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x18];                                      // 0x0068(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FitPropertiesForValidation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioPropertiesSheetAsset">();
	}
	static class UAudioPropertiesSheetAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioPropertiesSheetAsset>();
	}
};

}

