#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AutomationWindow

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct AutomationWindow.AutomationTestPreset
// 0x0038 (0x0038 - 0x0000)
struct FAutomationTestPreset final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Id;                                                // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name;                                              // 0x0018(0x0010)(NativeAccessSpecifierPrivate)
	TArray<class FString>                         EnabledTests;                                      // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};

}

