#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AutomationTest

#include "Basic.hpp"

#include "AutomationTest_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class AutomationTest.AutomationTestPlatformSettings
// 0x0010 (0x0040 - 0x0030)
class UAutomationTestPlatformSettings : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutomationTestPlatformSettings">();
	}
	static class UAutomationTestPlatformSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutomationTestPlatformSettings>();
	}
};

// Class AutomationTest.AutomationTestExcludelistSettings
// 0x0010 (0x0050 - 0x0040)
class UAutomationTestExcludelistSettings final : public UAutomationTestPlatformSettings
{
public:
	TArray<class FName>                           SupportedRHIs;                                     // 0x0040(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutomationTestExcludelistSettings">();
	}
	static class UAutomationTestExcludelistSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutomationTestExcludelistSettings>();
	}
};

// Class AutomationTest.AutomationTestExcludelistConfig
// 0x0068 (0x00A8 - 0x0040)
class UAutomationTestExcludelistConfig final : public UAutomationTestPlatformSettings
{
public:
	class FString                                 TaskTrackerURLHashtag;                             // 0x0040(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 TaskTrackerURLBase;                                // 0x0050(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FAutomationTestExcludelistEntry> ExcludeTest;                                       // 0x0060(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	uint8                                         Pad_70[0x38];                                      // 0x0070(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutomationTestExcludelistConfig">();
	}
	static class UAutomationTestExcludelistConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutomationTestExcludelistConfig>();
	}
};

// Class AutomationTest.AutomationTestExcludelist
// 0x00A8 (0x00D8 - 0x0030)
class UAutomationTestExcludelist final : public UObject
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UAutomationTestExcludelistConfig*       DefaultConfig;                                     // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, class UAutomationTestExcludelistConfig*> PlatformConfigs;                                   // 0x0088(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutomationTestExcludelist">();
	}
	static class UAutomationTestExcludelist* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutomationTestExcludelist>();
	}
};

}

