#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BallisticShieldBaseRuntime

#include "Basic.hpp"

#include "TacticalSprintRuntime_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "BallisticShieldBaseRuntime_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "TargetingSystem_classes.hpp"


namespace SDK
{

// Class BallisticShieldBaseRuntime.BallisticShieldItemLayerAnimInstance
// 0x00E0 (0x1580 - 0x14A0)
#pragma pack(push, 0x1)
class alignas(0x10) UBallisticShieldItemLayerAnimInstance : public UFortPlayerAnimInstanceProxy
{
public:
	bool                                          bIsRush;                                           // 0x1498(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEquipping;                                      // 0x1499(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReloading;                                      // 0x149A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnterLanding;                                     // 0x149B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExitLanding;                                      // 0x149C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsShieldBlocking;                                 // 0x149D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsStaggerBuildup;                                 // 0x149E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_149F[0x1];                                     // 0x149F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Yaw;                                               // 0x14A0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChargeAOAlpha;                                     // 0x14A4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GenderAndSize;                                     // 0x14A8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReloadUBAlpha;                                     // 0x14AC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaskLeftArmAlpha;                                  // 0x14B0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StaggerAmount;                                     // 0x14B4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14B8[0xC0];                                    // 0x14B8(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BallisticShieldItemLayerAnimInstance">();
	}
	static class UBallisticShieldItemLayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBallisticShieldItemLayerAnimInstance>();
	}
};
#pragma pack(pop)

// Class BallisticShieldBaseRuntime.BallisticShieldWeaponInterface
// 0x0000 (0x0030 - 0x0030)
class IBallisticShieldWeaponInterface final : public IInterface
{
public:
	void GetBallisticShieldData(EBallisticShieldPlayerActionState* BallisticShieldPlayerState, float* StaggerBuildupPercent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BallisticShieldWeaponInterface">();
	}
	static class IBallisticShieldWeaponInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBallisticShieldWeaponInterface>();
	}
};

// Class BallisticShieldBaseRuntime.FortMovementMode_ELBShieldSprint
// 0x0048 (0x0560 - 0x0518)
class UFortMovementMode_ELBShieldSprint final : public UFortMovementMode_ELTacSprint
{
public:
	struct FScalableFloat                         ChargeRotationRate;                                // 0x0518(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayAbility>           GrantedAbility;                                    // 0x0550(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_558[0x8];                                      // 0x0558(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ELBShieldSprint">();
	}
	static class UFortMovementMode_ELBShieldSprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ELBShieldSprint>();
	}
};

// Class BallisticShieldBaseRuntime.TargetingFilterTask_BShieldCharge
// 0x00B8 (0x00E8 - 0x0030)
class UTargetingFilterTask_BShieldCharge final : public UTargetingFilterTask_BasicFilterTemplate
{
public:
	TArray<TSubclassOf<class UObject>>            WalkableActorClasses;                              // 0x0030(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BashableActorAngle;                                // 0x0040(0x0038)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MainTraceDistance;                                 // 0x0078(0x0038)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         FloorHitZTolerance;                                // 0x00B0(0x0038)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingFilterTask_BShieldCharge">();
	}
	static class UTargetingFilterTask_BShieldCharge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingFilterTask_BShieldCharge>();
	}
};

}

