#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BeanstalkRuntime

#include "Basic.hpp"

#include "BeanstalkRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class BeanstalkRuntime.BeanAudioDataAsset
// 0x0050 (0x0088 - 0x0038)
class UBeanAudioDataAsset final : public UDataAsset
{
public:
	TMap<struct FBeanAudioKey, struct FBeanAudioSet> SoundListsByCategory;                              // 0x0038(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	const TMap<struct FBeanAudioKey, struct FBeanAudioSet> GetSoundListsByCategory() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeanAudioDataAsset">();
	}
	static class UBeanAudioDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBeanAudioDataAsset>();
	}
};

// Class BeanstalkRuntime.BeanCameraModeOverrideComponent
// 0x0010 (0x00F0 - 0x00E0)
class UBeanCameraModeOverrideComponent final : public UFortCameraModeOverrideComponent
{
public:
	TSubclassOf<class UFortCameraMode>            BeanCurrentCameraMode;                             // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UBeanCharConfigObject>   CharacterConfig;                                   // 0x00E8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeanCameraModeOverrideComponent">();
	}
	static class UBeanCameraModeOverrideComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBeanCameraModeOverrideComponent>();
	}
};

// Class BeanstalkRuntime.BeanCameraMode_ThirdPerson
// 0x0070 (0x1EB0 - 0x1E40)
class UBeanCameraMode_ThirdPerson final : public UFortCameraMode_ThirdPerson
{
public:
	bool                                          bEnableDraggedBehaviour;                           // 0x1E40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E41[0x7];                                     // 0x1E41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ControllerYawToleranceForDragEnable;               // 0x1E48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  DisableDraggedCameraTags;                          // 0x1E50(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	double                                        ResetCameraPitch;                                  // 0x1E70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E78[0x38];                                    // 0x1E78(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeanCameraMode_ThirdPerson">();
	}
	static class UBeanCameraMode_ThirdPerson* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBeanCameraMode_ThirdPerson>();
	}
};

// Class BeanstalkRuntime.BeanCharacter
// 0x0420 (0x6AE0 - 0x66C0)
class ABeanCharacter final : public AFortStandInPlayerPawn
{
public:
	uint8                                         Pad_66C0[0x8];                                     // 0x66C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySet*                        AbilitySet;                                        // 0x66C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBeanCharAnimInstance*                  AnimInstance;                                      // 0x66D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMotionWarpingComponent*                MotionWarpingComponent;                            // 0x66D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UBeanCharConfigObject>      ConfigurationClass;                                // 0x66E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputMappingContext*                   DefaultMappingContext;                             // 0x66E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputAction*                           DiveAction;                                        // 0x66F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputAction*                           GrabAction;                                        // 0x66F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           JumpButtonDiveIconOverrideTag;                     // 0x6700(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_670C[0x24];                                    // 0x670C(0x0024)(Fixing Size After Last Property [ Dumper-7 ])
	class UBeanCharMovementComponent*             MovementComponent;                                 // 0x6730(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBeanJiggleMotionComponent*             JiggleComponent;                                   // 0x6738(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6740[0x18];                                    // 0x6740(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UBeanCharStateMachine*                  StateMachine;                                      // 0x6758(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBeanStreamingManager*                  BeanStreamManager;                                 // 0x6760(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bPressedDive : 1;                                  // 0x6768(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_6769[0x2F];                                    // 0x6769(0x002F)(Fixing Size After Last Property [ Dumper-7 ])
	class UBeanCameraModeOverrideComponent*       BeanCameraModeOverrideComponent;                   // 0x6798(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBeanParticleSystemsComponent*          ParticleSystemsComponent;                          // 0x67A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBeanCharGrabComponent*                 GrabComponent;                                     // 0x67A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBeanCharBeingGrabbedComponent*         BeingGrabbedComponent;                             // 0x67B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           GrabFeatureEnabledTag;                             // 0x67B8(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bPressingGrab : 1;                                 // 0x67C4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_67C5[0x3];                                     // 0x67C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBeanCharMantleComponent*               MantleComponent;                                   // 0x67C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bWantsToMantle : 1;                                // 0x67D0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_67D1[0xF];                                     // 0x67D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	class UBeanCharRagdollComponent*              RagdollComponent;                                  // 0x67E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPhysicsConstraintComponent*            RagdollPhysicsConstraint;                          // 0x67E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCapsuleComponent*                      RagdollRootCapsule;                                // 0x67F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CapsuleUnscaledHalfHeight;                         // 0x67F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_67FC[0x4];                                     // 0x67FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNetworkPhysicsSettingsComponent*       NetworkPhysicsSettingsComponent;                   // 0x6800(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBeanCharCollisionManagerComponent*     CollisionManagerComponent;                         // 0x6808(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6810[0x10];                                    // 0x6810(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractSelection_Base*                PushedInteractionSelection;                        // 0x6820(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6828[0x30];                                    // 0x6828(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            MantleAnimationMontage;                            // 0x6858(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            GetupAnimationMontage_Front;                       // 0x6888(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            GetupAnimationMontage_Left;                        // 0x68B8(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            GetupAnimationMontage_Right;                       // 0x68E8(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            GetupAnimationMontage_Back;                        // 0x6918(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            LandStaggerAnimationMontage;                       // 0x6948(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            LandStaggerAnimationMontageAlt;                    // 0x6978(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UBeanCosmeticBackpackAllowList> BackpackAllowList;                                 // 0x69A8(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCharacterCosmeticsVisibility;                     // 0x69D8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBackpackCosmeticsVisibility;                      // 0x69D9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69DA[0x2];                                     // 0x69DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IdleBreakMinTime;                                  // 0x69DC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         IdleBreakMaxTime;                                  // 0x69E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69E4[0x4];                                     // 0x69E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  IdleBreakBlockingTags;                             // 0x69E8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FBeanCharIdleBreakDef>          IdleBreakAnimations;                               // 0x6A08(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FBeanCharIdleBreakDef>          LobbyIdleBreakAnimations;                          // 0x6A18(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_6A28[0x18];                                    // 0x6A28(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableInventoryMode;                              // 0x6A40(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6A41[0x9F];                                    // 0x6A41(0x009F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnBeanLocalInteractFailed(class AActor* Interactable);
	void Client_OnTeleport(const struct FVector& Location, const struct FRotator& Rotation);
	void Client_TeleportSucceeded();
	void Debug_ServerActivateRagdoll(const struct FVector& Force);
	class UNetworkPhysicsSettingsComponent* GetNetworkedPhysicsSettingsComponent();
	void OnRep_EnableInventoryMode();
	void PredictLaunch(TScriptInterface<class IBeanLaunchPredictorInterface> SourceImpactPredictor, class UObject* SourceOptionalSubobject, const struct FVector& LaunchVector);
	void ServerPlayEmote(const class UAthenaDanceItemDefinition* EmoteToPlay, EFortEmotePlayMode PlayMode);
	void TriggerRagdoll(const struct FVector& Force, bool bIsViaLaunch);

	TArray<class UMaterialInstanceDynamic*> GetAllCosmeticMaterials() const;
	class UBeanCharAnimInstance* GetBeanAnimInstance() const;
	class UBeanCharMovementComponent* GetBeanCharacterMovement() const;
	class UBeanCharBeingGrabbedComponent* GetBeingGrabbedComponent() const;
	class UBeanCharCollisionManagerComponent* GetCollisionManager() const;
	const class UBeanCharConfigObject* GetConfiguration() const;
	class UBeanCharGrabComponent* GetGrabComponent() const;
	class UBeanJiggleMotionComponent* GetJiggleMotionComponent() const;
	class UBeanCharMantleComponent* GetMantleComponent() const;
	float GetMeshScale() const;
	class UBeanCharRagdollComponent* GetRagdollComponent() const;
	bool IsBeingGrabbed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeanCharacter">();
	}
	static class ABeanCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABeanCharacter>();
	}
};

// Class BeanstalkRuntime.BeanCharAnimInstance
// 0x0180 (0x0580 - 0x0400)
class UBeanCharAnimInstance final : public UAnimInstance
{
public:
	bool                                          bIsSimulatedProxy;                                 // 0x03F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBeanCharStateID                              UpperStateID;                                      // 0x03F9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBeanCharStateID                              LowerStateID;                                      // 0x03FA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBeanCharStateID                              PrevLowerStateID;                                  // 0x03FB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMovementMode                                 MovementMode;                                      // 0x03FC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsMoving;                                         // 0x03FD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsGrounded;                                       // 0x03FE(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3FF[0x1];                                      // 0x03FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TurningPercentage;                                 // 0x0400(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpeedPercentage;                                   // 0x0404(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                CurrentVelocity;                                   // 0x0408(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsAnticipatingJumpLanding;                        // 0x0420(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LastRagdollImpactForce;                            // 0x0428(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                LastImpactForce;                                   // 0x0440(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                LastImpactRelativeDirection;                       // 0x0458(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBeanCharTurn180State                         TurnState;                                         // 0x0470(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsGrabbing;                                       // 0x0471(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasGrabTarget;                                    // 0x0472(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_473[0x1];                                      // 0x0473(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GrabStumbleDuration;                               // 0x0474(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                LeftHandIKPosition;                                // 0x0478(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                RightHandIKPosition;                               // 0x0490(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               LeftHandIKRotation;                                // 0x04A8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FRotator                               RightHandIKRotation;                               // 0x04C0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         IKAlpha;                                           // 0x04D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseImpactAnims;                                   // 0x04DC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bImpactTriggered;                                  // 0x04DD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBeanImpactAnimType                           ImpactAnimType;                                    // 0x04DE(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4DF[0x1];                                      // 0x04DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LowImpactUpperThresholdReciprocal;                 // 0x04E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MediumImpactUpperThresholdReciprocal;              // 0x04E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HighImpactUpperThresholdReciprocal;                // 0x04E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               JiggleRotator0;                                    // 0x04F0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FRotator                               JiggleRotator1;                                    // 0x0508(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FRotator                               JiggleRotator2;                                    // 0x0520(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bLowerStateUsesLocomotionAnim;                     // 0x0538(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortWeaponCoreAnimation                      WeaponCoreAnim;                                    // 0x0539(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_53A[0x2];                                      // 0x053A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UBeanCharConfigObject>   BeanCharacterConfig;                               // 0x053C(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_544[0x3C];                                     // 0x0544(0x003C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const class UBeanCharConfigObject* GetConfig() const;
	class ABeanCharacter* TryGetBeanCharacter() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeanCharAnimInstance">();
	}
	static class UBeanCharAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBeanCharAnimInstance>();
	}
};

// Class BeanstalkRuntime.BeanCharBeingGrabbedComponent
// 0x0058 (0x0130 - 0x00D8)
class UBeanCharBeingGrabbedComponent final : public UActorComponent
{
public:
	uint8                                         Pad_D8[0x58];                                      // 0x00D8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector GetGrabbeeDragForce(float DragDuration, const struct FVector& LocationOffset) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeanCharBeingGrabbedComponent">();
	}
	static class UBeanCharBeingGrabbedComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBeanCharBeingGrabbedComponent>();
	}
};

// Class BeanstalkRuntime.BeanCharCollisionManagerComponent
// 0x0070 (0x0148 - 0x00D8)
class UBeanCharCollisionManagerComponent final : public UActorComponent
{
public:
	uint8                                         Pad_D8[0x58];                                      // 0x00D8(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxConfigImpactThreshold;                          // 0x0130(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	double                                        NextImpactCueExecution;                            // 0x0138(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RagdollThresholdMultiplier;                        // 0x0140(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeanCharCollisionManagerComponent">();
	}
	static class UBeanCharCollisionManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBeanCharCollisionManagerComponent>();
	}
};

// Class BeanstalkRuntime.BeanCharConfigObject
// 0x0AF0 (0x0B20 - 0x0030)
class UBeanCharConfigObject final : public UObject
{
public:
	struct FBeanCharInteractionsConfig            Interaction;                                       // 0x0030(0x00F0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FBeanCharInventoryModeConfig           InventoryMode;                                     // 0x0120(0x0080)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FBeanCharMovementConfig                Movement;                                          // 0x01A0(0x0278)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FBeanCharJumpConfig                    Jump;                                              // 0x0418(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBeanCharDiveConfig                    Dive;                                              // 0x0460(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBeanCharImpactConfig                  Impact;                                            // 0x04B8(0x01A0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FBeanCharStaggerConfig                 Stagger;                                           // 0x0658(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_664[0x4];                                      // 0x0664(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBeanCharRagdollConfig                 Ragdoll;                                           // 0x0668(0x01A0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FBeanCharRollConfig                    Roll;                                              // 0x0808(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBeanCharGrabConfig                    Grab;                                              // 0x0830(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBeanCharGetupConfig                   Getup;                                             // 0x0900(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBeanCharGetupRollConfig               GetupRoll;                                         // 0x0928(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBeanCharMantleConfig                  Mantle;                                            // 0x0938(0x00C8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FBeanCharJostleConfig                  Jostle;                                            // 0x0A00(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBeanCharCameraConfig                  Camera;                                            // 0x0A30(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBeanCharCosmeticConfig                Cosmetics;                                         // 0x0A48(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FBeanCharSwimmingConfig                Swimming;                                          // 0x0A58(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBeanCharZiplineConfig                 Zipline;                                           // 0x0A78(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A7C[0x4];                                      // 0x0A7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBeanCharJiggleConfig                  Jiggle;                                            // 0x0A80(0x0070)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FBeanCharHUDConfig                     HUD;                                               // 0x0AF0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FBeanCharTouchControlsConfig           TouchControls;                                     // 0x0B10(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B1C[0x4];                                      // 0x0B1C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const struct FBeanCharCameraConfig GetCamera() const;
	const struct FBeanCharCosmeticConfig GetCosmetics() const;
	const struct FBeanCharDiveConfig GetDive() const;
	const struct FBeanCharGetupConfig GetGetup() const;
	const struct FBeanCharGetupRollConfig GetGetupRoll() const;
	const struct FBeanCharGrabConfig GetGrab() const;
	const struct FBeanCharHUDConfig GetHUD() const;
	const struct FBeanCharImpactConfig GetImpact() const;
	const struct FBeanCharInteractionsConfig GetInteraction() const;
	const struct FBeanCharInventoryModeConfig GetInventoryMode() const;
	const struct FBeanCharJiggleConfig GetJiggle() const;
	const struct FBeanCharJostleConfig GetJostle() const;
	const struct FBeanCharJumpConfig GetJump() const;
	const struct FBeanCharMantleConfig GetMantle() const;
	const struct FBeanCharMovementConfig GetMovement() const;
	const struct FBeanCharRagdollConfig GetRagdoll() const;
	const struct FBeanCharRollConfig GetRoll() const;
	const struct FBeanCharStaggerConfig GetStagger() const;
	const struct FBeanCharSwimmingConfig GetSwimming() const;
	const struct FBeanCharTouchControlsConfig GetTouchControls() const;
	const struct FBeanCharZiplineConfig GetZipline() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeanCharConfigObject">();
	}
	static class UBeanCharConfigObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBeanCharConfigObject>();
	}
};

// Class BeanstalkRuntime.BeanCharGrabComponent
// 0x0118 (0x01F0 - 0x00D8)
class UBeanCharGrabComponent final : public UActorComponent
{
public:
	class UAnimMontage*                           ArmsOutMontage;                                    // 0x00D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                LeftHandIKPosition;                                // 0x00E0(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RightHandIKPosition;                               // 0x00F8(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               LeftHandIKRotation;                                // 0x0110(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               RightHandIKRotation;                               // 0x0128(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         IKAlpha;                                           // 0x0140(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasIKTarget;                                      // 0x0144(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsGrabStumbling;                                  // 0x0145(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_146[0x22];                                     // 0x0146(0x0022)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  GrabTarget;                                        // 0x0168(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_170[0x10];                                     // 0x0170(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ServerLatestHoldStartTime;                         // 0x0180(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_184[0x6C];                                     // 0x0184(0x006C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector GetGrabberDragForce(float DragDuration);
	void HandleOnPawnJumped();
	void OnRep_GrabTarget();
	void OnRep_ServerLatestHoldStartTime();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeanCharGrabComponent">();
	}
	static class UBeanCharGrabComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBeanCharGrabComponent>();
	}
};

// Class BeanstalkRuntime.BeanCharMantleComponent
// 0x0058 (0x0130 - 0x00D8)
class UBeanCharMantleComponent final : public UActorComponent
{
public:
	struct FScalableFloat                         ClamberingEnabled;                                 // 0x00D8(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ABeanCharacter>          BeanCharacter;                                     // 0x0110(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CachedClamberingEnabledValue;                      // 0x0118(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LastClamberingEnabledCacheTime;                    // 0x0120(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	double                                        ClamberingEnableCacheInterval;                     // 0x0128(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeanCharMantleComponent">();
	}
	static class UBeanCharMantleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBeanCharMantleComponent>();
	}
};

// Class BeanstalkRuntime.BeanCharMovementComponent
// 0x0B40 (0x77D0 - 0x6C90)
class UBeanCharMovementComponent final : public UFortMovementComp_CharacterAthena
{
public:
	uint8                                         Pad_6C90[0xA0C];                                   // 0x6C90(0x0A0C)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MovementBaseVelocitySamplingPeriod;                // 0x769C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UPrimitiveComponent>     CurrentSampledMovementBase;                        // 0x76A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_76A8[0x109];                                   // 0x76A8(0x0109)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAllowFloorHeightAdjustments;                      // 0x77B1(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBeanCharTurn180State                         TurnState;                                         // 0x77B2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_77B3[0xD];                                     // 0x77B3(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UBeanCharConfigObject>   CharConfig;                                        // 0x77C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_77C8[0x8];                                     // 0x77C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyKnockbackImpulse(const struct FVector& Force);
	void Server_SetDebugForceCorrection(EBeanDebugForceCorrectionMode Mode);
	void ServerRequestPredictLaunch(class UObject* SourceObject, class UObject* SourceOptionalSubobject, const struct FVector& LaunchVector, float MovementTimestamp);
	void ServerSuggestImpartedMovementBaseVelocity(const struct FVector& ImpartedVelocity, float Timestamp);
	void SetTurn180State(EBeanCharTurn180State NewTurnState);

	class ABeanCharacter* GetBeanCharacter() const;
	EBeanCharTurn180State GetTurn180State() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeanCharMovementComponent">();
	}
	static class UBeanCharMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBeanCharMovementComponent>();
	}
};

// Class BeanstalkRuntime.BeanCharRagdollComponent
// 0x0318 (0x03F0 - 0x00D8)
class UBeanCharRagdollComponent final : public UActorComponent
{
public:
	struct FComponentReference                    PhysicsConstraintComponentReference;               // 0x00D8(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FComponentReference                    RootPrimitiveReference;                            // 0x0108(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FComponentReference                    SkeletalMeshReference;                             // 0x0138(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0x1];                                      // 0x0168(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsConfiguredCorrectly;                            // 0x0169(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasRequestedRagdollExit;                          // 0x016A(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_16B[0x5];                                      // 0x016B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             StartingMeshTransform;                             // 0x0170(0x0060)(Net, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FCollisionResponseContainer            OriginalActorRootCollisionResponse;                // 0x01D0(0x0020)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1F0[0x48];                                     // 0x01F0(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RagdollControlInputVector;                         // 0x0238(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsRagdollGrounded;                                // 0x0250(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeOnGround;                                      // 0x0254(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LatestRagdollFloorOffset;                          // 0x0260(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBeanCharRagdollImpactData             CurrentImpactData;                                 // 0x0278(0x0040)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	float                                         CurrentGravityZOverride;                           // 0x02B8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CurrentAdditionalGravity;                          // 0x02C0(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D8[0x10];                                     // 0x02D8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CachedMeshBodyIndexesForCCD;                       // 0x02E8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	double                                        LowerLinearDistanceTarget;                         // 0x02F8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	double                                        UpperLinearDistanceTarget;                         // 0x0300(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DefaultHardSnapLinearDistance;                     // 0x0308(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxHardsnapLinearDistance;                         // 0x0310(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasAddedIgnoredObjects;                           // 0x0318(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_319[0xAF];                                     // 0x0319(0x00AF)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBeanRagdollDebugComponentHistory      RagdollComponentHistory;                           // 0x03C8(0x0020)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyImpulse(const struct FVector& Force, bool bIsLaunch);
	void CleanupRagdollForAbruptExit();
	void Client_CleanupRagdollForAbruptExit();
	void Client_SignalRagdollExit(const struct FVector& EndLocation, const struct FQuat& EndRotation, const struct FVector& EndVelocity);
	void OnRagdollRootPrimitiveHit(class UPrimitiveComponent* HitComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void RequestRagdollExit();
	void Server_SignalClientExitedRagdoll();
	void ServerRPCRagdollControlInput(const struct FVector& InputVector);
	void SetRagdollEnabled(bool bShouldEnable);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeanCharRagdollComponent">();
	}
	static class UBeanCharRagdollComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBeanCharRagdollComponent>();
	}
};

// Class BeanstalkRuntime.BeanCharStateBase
// 0x0190 (0x01C0 - 0x0030)
class UBeanCharStateBase : public UObject
{
public:
	EBeanCharStateID                              StateID;                                           // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBeanCharStateLayerMask                       LayerMask;                                         // 0x0031(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMovementMode                                 MovementMode;                                      // 0x0032(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortCustomMovement                           FortCustomMovementMode;                            // 0x0033(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           GameplayTag;                                       // 0x0034(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayCueTag                        GameplayCue;                                       // 0x0040(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 GameplayCueParameters;                             // 0x0050(0x00E0)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          bShouldSetMovementMode;                            // 0x0130(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bReplicateToSimulatedProxies;                      // 0x0131(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExecuteCodeOnSimulatedProxies;                    // 0x0132(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTryActivateFailsIfAlreadyActive;                  // 0x0133(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bServerMustFlushStateManually;                     // 0x0134(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFlushPendingStateChangesOnStateExit;              // 0x0135(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_136[0x2];                                      // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Priority;                                          // 0x0138(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
