#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BeanstalkCosmeticsRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function BeanstalkCosmeticsRuntime.BeanFortPlayerMannequin.BP_UpdateCosmeticMaterials
// 0x0020 (0x0020 - 0x0000)
struct BeanFortPlayerMannequin_BP_UpdateCosmeticMaterials final
{
public:
	const class UBeanCosmeticItemDefinitionBase*  BeanCD;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               MaterialBody;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               MaterialCostume;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               MaterialHead;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BeanstalkCosmeticsRuntime.FortCosmeticStep_ApplyBeanCD.BP_UpdateCosmeticMaterials
// 0x0020 (0x0020 - 0x0000)
struct FortCosmeticStep_ApplyBeanCD_BP_UpdateCosmeticMaterials final
{
public:
	const class UBeanCosmeticItemDefinitionBase*  BeanCD;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               MaterialBody;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               MaterialCostume;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               MaterialHead;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

