#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BeanstalkGameDebuggersRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BeanstalkGameDebuggersRuntime_structs.hpp"
#include "InputCore_structs.hpp"
#include "FortImGuiCore_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class BeanstalkGameDebuggersRuntime.BeanCharacterDebuggerMenu
// 0x0110 (0x0760 - 0x0650)
class ABeanCharacterDebuggerMenu final : public AImGuiDebugMenuBase
{
public:
	TMap<struct FKey, bool>                       KeyToggleStates;                                   // 0x0648(0x0050)(Transient, NativeAccessSpecifierPrivate)
	class ABeanCharacter*                         MonitoredCharacter;                                // 0x0698(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ABeanCharacter*                         LocalPlayerCharacter;                              // 0x06A0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EBeanDebuggerTab                              CurrentTab;                                        // 0x06A8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6A9[0x7];                                      // 0x06A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LastPendingLaunchVelocity;                         // 0x06B0(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ABeanCharacter*>                 AvailableCharacters;                               // 0x06C8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMap<uint32, struct FBeanDebuggerVectorVisual> VectorDebugVisuals;                                // 0x06D8(0x0050)(Transient, NativeAccessSpecifierPrivate)
	bool                                          bIsInputSamplingPaused;                            // 0x0728(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_729[0x7];                                      // 0x0729(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 InputSizeHistory;                                  // 0x0730(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<float>                                 InputModifierHistory;                              // 0x0740(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<float>                                 ScaledAccelerationSizeHistory;                     // 0x0750(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeanCharacterDebuggerMenu">();
	}
	static class ABeanCharacterDebuggerMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABeanCharacterDebuggerMenu>();
	}
};

// Class BeanstalkGameDebuggersRuntime.BeanMantleHistoryMenu
// 0x0070 (0x06C0 - 0x0650)
class ABeanMantleHistoryMenu final : public AImGuiDebugMenuBase
{
public:
	class ABeanCharacter*                         LocalCharacter;                                    // 0x0648(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class APlayerController*                      LocalController;                                   // 0x0650(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBeanCharMovementComponent*             LocalCharacterMovement;                            // 0x0658(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsCharacterCorrectlySetup;                        // 0x0660(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, bool>                             DrawMantleCheckByIndex;                            // 0x0668(0x0050)(Transient, NativeAccessSpecifierPrivate)
	int32                                         MaxHistoryEntries;                                 // 0x06B8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6BC[0x4];                                      // 0x06BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeanMantleHistoryMenu">();
	}
	static class ABeanMantleHistoryMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABeanMantleHistoryMenu>();
	}
};

// Class BeanstalkGameDebuggersRuntime.BeanstalkGameDebuggersCheatManager
// 0x0000 (0x0030 - 0x0030)
class UBeanstalkGameDebuggersCheatManager final : public UCheatManagerExtension
{
public:
	void BeanDebugger();
	void BeanMantleHistory();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeanstalkGameDebuggersCheatManager">();
	}
	static class UBeanstalkGameDebuggersCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBeanstalkGameDebuggersCheatManager>();
	}
};

}

