#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BeatSyncedAnimMetaData

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class BeatSyncedAnimMetaData.BeatSyncedAnimMetaData
// 0x0008 (0x0038 - 0x0030)
class UBeatSyncedAnimMetaData : public UAnimMetaData
{
public:
	bool                                          bAllowBeatsyncing;                                 // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsForEmote;                                       // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideGroupEmoteBeatsyncingBehavior;            // 0x0032(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllowGroupEmoteLeaderToBeatSync;                  // 0x0033(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllowGroupEmoteFollowerToBeatSync;                // 0x0034(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeatSyncedAnimMetaData">();
	}
	static class UBeatSyncedAnimMetaData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBeatSyncedAnimMetaData>();
	}
};

// Class BeatSyncedAnimMetaData.PreciseBeatSyncedAnimMetaData
// 0x0018 (0x0050 - 0x0038)
class UPreciseBeatSyncedAnimMetaData final : public UBeatSyncedAnimMetaData
{
public:
	bool                                          bShouldHalfOrDoublePlayRate;                       // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideGlobalHalfOrDoublePlayRateLimits;         // 0x0039(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxPlayRateBeforeHalf;                             // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinPlayRateBeforeDouble;                           // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FirstBeatAtFrame;                                  // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BeatB;                                             // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PreciseBeatSyncedAnimMetaData">();
	}
	static class UPreciseBeatSyncedAnimMetaData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPreciseBeatSyncedAnimMetaData>();
	}
};

// Class BeatSyncedAnimMetaData.TimeSyncedBeatSyncedAnimMetaData
// 0x0008 (0x0040 - 0x0038)
class UTimeSyncedBeatSyncedAnimMetaData final : public UBeatSyncedAnimMetaData
{
public:
	float                                         AnimTimeZeroOffsetSeconds;                         // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TimeSyncedBeatSyncedAnimMetaData">();
	}
	static class UTimeSyncedBeatSyncedAnimMetaData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTimeSyncedBeatSyncedAnimMetaData>();
	}
};

}

