#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BehaviorTreeEditor

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "UnrealEd_classes.hpp"
#include "AIGraph_structs.hpp"
#include "AIGraph_classes.hpp"
#include "BehaviorTreeEditor_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class BehaviorTreeEditor.AssetDefinition_BehaviorTree
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_BehaviorTree final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_BehaviorTree">();
	}
	static class UAssetDefinition_BehaviorTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_BehaviorTree>();
	}
};

// Class BehaviorTreeEditor.AssetDefinition_Blackboard
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_Blackboard final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_Blackboard">();
	}
	static class UAssetDefinition_Blackboard* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_Blackboard>();
	}
};

// Class BehaviorTreeEditor.BehaviorTreeDecoratorGraph
// 0x0000 (0x00B0 - 0x00B0)
class UBehaviorTreeDecoratorGraph final : public UEdGraph
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BehaviorTreeDecoratorGraph">();
	}
	static class UBehaviorTreeDecoratorGraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehaviorTreeDecoratorGraph>();
	}
};

// Class BehaviorTreeEditor.BehaviorTreeDecoratorGraphNode
// 0x0008 (0x00C8 - 0x00C0)
class UBehaviorTreeDecoratorGraphNode : public UEdGraphNode
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BehaviorTreeDecoratorGraphNode">();
	}
	static class UBehaviorTreeDecoratorGraphNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehaviorTreeDecoratorGraphNode>();
	}
};

// Class BehaviorTreeEditor.BehaviorTreeDecoratorGraphNode_Decorator
// 0x0068 (0x0130 - 0x00C8)
class UBehaviorTreeDecoratorGraphNode_Decorator final : public UBehaviorTreeDecoratorGraphNode
{
public:
	class UObject*                                NodeInstance;                                      // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGraphNodeClassData                    ClassData;                                         // 0x00D0(0x0060)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BehaviorTreeDecoratorGraphNode_Decorator">();
	}
	static class UBehaviorTreeDecoratorGraphNode_Decorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehaviorTreeDecoratorGraphNode_Decorator>();
	}
};

// Class BehaviorTreeEditor.BehaviorTreeDecoratorGraphNode_Logic
// 0x0008 (0x00D0 - 0x00C8)
class UBehaviorTreeDecoratorGraphNode_Logic final : public UBehaviorTreeDecoratorGraphNode
{
public:
	EDecoratorLogicMode                           LogicMode;                                         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BehaviorTreeDecoratorGraphNode_Logic">();
	}
	static class UBehaviorTreeDecoratorGraphNode_Logic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehaviorTreeDecoratorGraphNode_Logic>();
	}
};

// Class BehaviorTreeEditor.BehaviorTreeEditorTypes
// 0x0000 (0x0030 - 0x0030)
class UBehaviorTreeEditorTypes final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BehaviorTreeEditorTypes">();
	}
	static class UBehaviorTreeEditorTypes* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehaviorTreeEditorTypes>();
	}
};

// Class BehaviorTreeEditor.BehaviorTreeFactory
// 0x0000 (0x0088 - 0x0088)
class UBehaviorTreeFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BehaviorTreeFactory">();
	}
	static class UBehaviorTreeFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehaviorTreeFactory>();
	}
};

// Class BehaviorTreeEditor.BehaviorTreeGraph
// 0x0010 (0x00C8 - 0x00B8)
class UBehaviorTreeGraph final : public UAIGraph
{
public:
	int32                                         ModCounter;                                        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUsingModCounter;                                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UBehaviorTreeGraphNode_Root> RootNodeClass;                                     // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BehaviorTreeGraph">();
	}
	static class UBehaviorTreeGraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehaviorTreeGraph>();
	}
};

// Class BehaviorTreeEditor.BehaviorTreeGraphNode
// 0x0040 (0x0198 - 0x0158)
class UBehaviorTreeGraphNode : public UAIGraphNode
{
public:
	TArray<class UBehaviorTreeGraphNode*>         Decorators;                                        // 0x0158(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UBehaviorTreeGraphNode*>         Services;                                          // 0x0168(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         bInjectedNode : 1;                                 // 0x0178(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_179[0x1F];                                     // 0x0179(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BehaviorTreeGraphNode">();
	}
	static class UBehaviorTreeGraphNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehaviorTreeGraphNode>();
	}
};

// Class BehaviorTreeEditor.BehaviorTreeGraphNode_Composite
// 0x0000 (0x0198 - 0x0198)
class UBehaviorTreeGraphNode_Composite : public UBehaviorTreeGraphNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BehaviorTreeGraphNode_Composite">();
	}
	static class UBehaviorTreeGraphNode_Composite* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehaviorTreeGraphNode_Composite>();
	}
};

// Class BehaviorTreeEditor.BehaviorTreeGraphNode_CompositeDecorator
// 0x0050 (0x01E8 - 0x0198)
class UBehaviorTreeGraphNode_CompositeDecorator final : public UBehaviorTreeGraphNode
{
public:
	class UEdGraph*                               BoundGraph;                                        // 0x0198(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CompositeName;                                     // 0x01A0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bShowOperations : 1;                               // 0x01B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanAbortFlow : 1;                                 // 0x01B0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1B1[0x17];                                     // 0x01B1(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	class UBTCompositeNode*                       ParentNodeInstance;                                // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D0[0x8];                                      // 0x01D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CachedDescription;                                 // 0x01D8(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BehaviorTreeGraphNode_CompositeDecorator">();
	}
	static class UBehaviorTreeGraphNode_CompositeDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehaviorTreeGraphNode_CompositeDecorator>();
	}
};

// Class BehaviorTreeEditor.BehaviorTreeGraphNode_Decorator
// 0x0000 (0x0198 - 0x0198)
class UBehaviorTreeGraphNode_Decorator final : public UBehaviorTreeGraphNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BehaviorTreeGraphNode_Decorator">();
	}
	static class UBehaviorTreeGraphNode_Decorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehaviorTreeGraphNode_Decorator>();
	}
};

// Class BehaviorTreeEditor.BehaviorTreeGraphNode_Root
// 0x0008 (0x01A0 - 0x0198)
class UBehaviorTreeGraphNode_Root final : public UBehaviorTreeGraphNode
{
public:
	class UBlackboardData*                        BlackboardAsset;                                   // 0x0198(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BehaviorTreeGraphNode_Root">();
	}
	static class UBehaviorTreeGraphNode_Root* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehaviorTreeGraphNode_Root>();
	}
};

// Class BehaviorTreeEditor.BehaviorTreeGraphNode_Service
// 0x0000 (0x0198 - 0x0198)
class UBehaviorTreeGraphNode_Service final : public UBehaviorTreeGraphNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BehaviorTreeGraphNode_Service">();
	}
	static class UBehaviorTreeGraphNode_Service* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehaviorTreeGraphNode_Service>();
	}
};

// Class BehaviorTreeEditor.BehaviorTreeGraphNode_SimpleParallel
// 0x0000 (0x0198 - 0x0198)
class UBehaviorTreeGraphNode_SimpleParallel final : public UBehaviorTreeGraphNode_Composite
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BehaviorTreeGraphNode_SimpleParallel">();
	}
	static class UBehaviorTreeGraphNode_SimpleParallel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehaviorTreeGraphNode_SimpleParallel>();
	}
};

// Class BehaviorTreeEditor.BehaviorTreeGraphNode_Task
// 0x0000 (0x0198 - 0x0198)
class UBehaviorTreeGraphNode_Task : public UBehaviorTreeGraphNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BehaviorTreeGraphNode_Task">();
	}
	static class UBehaviorTreeGraphNode_Task* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehaviorTreeGraphNode_Task>();
	}
};

// Class BehaviorTreeEditor.BehaviorTreeGraphNode_SubtreeTask
// 0x0018 (0x01B0 - 0x0198)
class UBehaviorTreeGraphNode_SubtreeTask final : public UBehaviorTreeGraphNode_Task
{
public:
	uint8                                         Pad_198[0x18];                                     // 0x0198(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BehaviorTreeGraphNode_SubtreeTask">();
	}
	static class UBehaviorTreeGraphNode_SubtreeTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehaviorTreeGraphNode_SubtreeTask>();
	}
};

// Class BehaviorTreeEditor.BlackboardDataFactory
// 0x0000 (0x0088 - 0x0088)
class UBlackboardDataFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlackboardDataFactory">();
	}
	static class UBlackboardDataFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlackboardDataFactory>();
	}
};

// Class BehaviorTreeEditor.EdGraphSchema_BehaviorTree
// 0x0020 (0x0050 - 0x0030)
class UEdGraphSchema_BehaviorTree final : public UAIGraphSchema
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EdGraphSchema_BehaviorTree">();
	}
	static class UEdGraphSchema_BehaviorTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEdGraphSchema_BehaviorTree>();
	}
};

// Class BehaviorTreeEditor.EdGraphSchema_BehaviorTreeDecorator
// 0x0010 (0x0040 - 0x0030)
class UEdGraphSchema_BehaviorTreeDecorator final : public UEdGraphSchema
{
public:
	class FString                                 PC_Boolean;                                        // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EdGraphSchema_BehaviorTreeDecorator">();
	}
	static class UEdGraphSchema_BehaviorTreeDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEdGraphSchema_BehaviorTreeDecorator>();
	}
};

}

