#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: billboard_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass billboard_device.billboard_device
// 0x0050 (0x0110 - 0x00C0)
class Ubillboard_device final : public UDevices_creative_device_base
{
public:
	class UDevices_device_function*               __verse_0x7D8CBE13_ShowTextFunction;               // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x7172579C_HideTextFunction;               // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x004139D1_UpdateDisplayFunction;          // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_logic*     __verse_0xCD3BB5F8_SetShowBorderFunction;          // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_logic*     __verse_0x87A1A7EB_GetShowBorderFunction;          // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_message*   __verse_0xB60BD386_SetTextFunction;                // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_string*    __verse_0x33ED5C00_GetTextFunction;                // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_int*       __verse_0xF7DDE2E6_SetTextSizeFunction;            // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_int*       __verse_0x612D6D3B_GetTextSizeFunction;            // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fFortnite_2ecom_2fDevices_2fbillboard__device_N_RGetShowBorder(const struct billboard_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fFortnite_2ecom_2fDevices_2fbillboard__device_N_RGetText(const struct billboard_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fDevices_2fbillboard__device_N_RGetTextSize(const struct billboard_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fbillboard__device_N_RHideText(const struct billboard_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fbillboard__device_N_RSetShowBorder_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fbillboard__device_N_RSetText_L_Nmessage_R(class UVerse_message* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fbillboard__device_N_RSetTextSize_L_Nint_R(int64 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fbillboard__device_N_RShowText(const struct billboard_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fbillboard__device_N_RUpdateDisplay(const struct billboard_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"billboard_device">();
	}
	static class Ubillboard_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubillboard_device>();
	}
};

// VerseClass billboard_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class billboard_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass billboard_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class billboard_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<billboard_device::U_SolarisSignatureFunctionOuter>();
	}
};

}

