#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlastBerryRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BlastBerryRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function BlastBerryRuntime.FortControllerComponent_BlastBerry.ClientHandlePreRespawn
// 0x0038 (0x0038 - 0x0000)
struct FortControllerComponent_BlastBerry_ClientHandlePreRespawn final
{
public:
	struct FVector                                RespawnLocation;                                   // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RespawnRotation;                                   // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         RespawnCameraDist;                                 // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlastBerryRuntime.FortControllerComponent_BlastBerry.ClientNotifyRespawnReward
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_BlastBerry_ClientNotifyRespawnReward final
{
public:
	EBlastBerryRespawnRewardType                  RewardType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RewardTime;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlastBerryRuntime.FortControllerComponent_BlastBerry.ClientNotifyTeammateRespawned
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_BlastBerry_ClientNotifyTeammateRespawned final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlastBerryRuntime.FortControllerComponent_BlastBerry.ClientNotifyTeammateRevived
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_BlastBerry_ClientNotifyTeammateRevived final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlastBerryRuntime.FortControllerComponent_BlastBerry.ClientNotifyWaitingForRespawn
// 0x0018 (0x0018 - 0x0000)
struct FortControllerComponent_BlastBerry_ClientNotifyWaitingForRespawn final
{
public:
	struct FVector                                DeathLocation;                                     // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlastBerryRuntime.FortControllerComponent_BlastBerry.HandleBotPawnRespawned
// 0x0010 (0x0010 - 0x0000)
struct FortControllerComponent_BlastBerry_HandleBotPawnRespawned final
{
public:
	class AAIController*                          BotController;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              BotPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlastBerryRuntime.FortControllerComponent_BlastBerry.HandleDBNOChanged
// 0x0010 (0x0010 - 0x0000)
struct FortControllerComponent_BlastBerry_HandleDBNOChanged final
{
public:
	class AFortPawn*                              Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDBNO;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlastBerryRuntime.FortControllerComponent_BlastBerry.HandlePlayerRespawnTimeUpdated
// 0x0010 (0x0010 - 0x0000)
struct FortControllerComponent_BlastBerry_HandlePlayerRespawnTimeUpdated final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ServerTimeForRespawn;                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlastBerryRuntime.FortControllerComponent_BlastBerry.HandleViewTargetChanged
// 0x0018 (0x0018 - 0x0000)
struct FortControllerComponent_BlastBerry_HandleViewTargetChanged final
{
public:
	class AFortPlayerController*                  InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OldViewTarget;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 NewViewTarget;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlastBerryRuntime.FortControllerComponent_BlastBerry.LocalHandlePreRespawn
// 0x0038 (0x0038 - 0x0000)
struct FortControllerComponent_BlastBerry_LocalHandlePreRespawn final
{
public:
	struct FVector                                RespawnLocation;                                   // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RespawnRotation;                                   // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         RespawnCameraDist;                                 // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlastBerryRuntime.FortControllerComponent_BlastBerry.GetLastTeamMemberAlive
// 0x0001 (0x0001 - 0x0000)
struct FortControllerComponent_BlastBerry_GetLastTeamMemberAlive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlastBerryRuntime.FortCheatManager_BlastBerry.BlastBerrySetTeamLives
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_BlastBerry_BlastBerrySetTeamLives final
{
public:
	int32                                         TeamLives;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlastBerryRuntime.FortGameStateComponent_BlastBerryManager.HandleBotPawnRespawned
// 0x0010 (0x0010 - 0x0000)
struct FortGameStateComponent_BlastBerryManager_HandleBotPawnRespawned final
{
public:
	class AAIController*                          BotController;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              BotPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlastBerryRuntime.FortGameStateComponent_BlastBerryManager.HandlePlayerRespawnTimeUpdated
// 0x0010 (0x0010 - 0x0000)
struct FortGameStateComponent_BlastBerryManager_HandlePlayerRespawnTimeUpdated final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ServerTimeForRespawn;                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlastBerryRuntime.FortGameStateComponent_BlastBerryManager.HandleTeamLifeRecharged
// 0x0001 (0x0001 - 0x0000)
struct FortGameStateComponent_BlastBerryManager_HandleTeamLifeRecharged final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlastBerryRuntime.FortGameStateComponent_BlastBerryManager.OnGamePhaseStepChanged
// 0x0001 (0x0001 - 0x0000)
struct FortGameStateComponent_BlastBerryManager_OnGamePhaseStepChanged final
{
public:
	struct FFortGamePhaseStepUpdatedEvent         Event;                                             // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function BlastBerryRuntime.FortGameStateComponent_BlastBerryManager.OnSafeZoneUpdated
// 0x0008 (0x0008 - 0x0000)
struct FortGameStateComponent_BlastBerryManager_OnSafeZoneUpdated final
{
public:
	struct FFortSafeZonePhaseUpdatedEvent         Event;                                             // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function BlastBerryRuntime.FortGameStateComponent_BlastBerryManager.UpdateTeamInfo
// 0x0002 (0x0002 - 0x0000)
struct FortGameStateComponent_BlastBerryManager_UpdateTeamInfo final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSendNotifications;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlastBerryRuntime.FortGameStateComponent_BlastBerryManager.ValidateRespawningViewTarget
// 0x0008 (0x0008 - 0x0000)
struct FortGameStateComponent_BlastBerryManager_ValidateRespawningViewTarget final
{
public:
	TWeakObjectPtr<class AFortPlayerStateAthena>  WeakPS;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlastBerryRuntime.FortGameStateComponent_BlastBerryManager.AreRespawnsActive
// 0x0001 (0x0001 - 0x0000)
struct FortGameStateComponent_BlastBerryManager_AreRespawnsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlastBerryRuntime.FortGameStateComponent_BlastBerryManager.GetRespawnDelay
// 0x0010 (0x0010 - 0x0000)
struct FortGameStateComponent_BlastBerryManager_GetRespawnDelay final
{
public:
	class AFortPlayerStateAthena*                 PS;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlastBerryRuntime.FortGameStateComponent_BlastBerryManager.GetTeamLivesRemaining
// 0x0008 (0x0008 - 0x0000)
struct FortGameStateComponent_BlastBerryManager_GetTeamLivesRemaining final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlastBerryRuntime.FortGameStateComponent_BlastBerryManager.GetTimeUntilRespawnDisabled
// 0x0004 (0x0004 - 0x0000)
struct FortGameStateComponent_BlastBerryManager_GetTimeUntilRespawnDisabled final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlastBerryRuntime.FortGameStateComponent_BlastBerryManager.GetTimeUntilTeamLivesRecharge
// 0x0008 (0x0008 - 0x0000)
struct FortGameStateComponent_BlastBerryManager_GetTimeUntilTeamLivesRecharge final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlastBerryRuntime.FortGameStateComponent_BlastBerryManager.IsWaveRespawnEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortGameStateComponent_BlastBerryManager_IsWaveRespawnEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

