#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlastBerryUIRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function BlastBerryUIRuntime.BlastBerryInstantRebootWidget.OnWidgetActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct BlastBerryInstantRebootWidget_OnWidgetActiveChanged final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlastBerryUIRuntime.BlastBerryPlayerInfoRespawn.HandleRespawnTimeReplicated
// 0x0010 (0x0010 - 0x0000)
struct BlastBerryPlayerInfoRespawn_HandleRespawnTimeReplicated final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeRemaining;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlastBerryUIRuntime.BlastBerryPlayerInfoRespawn.OnTickDown
// 0x0004 (0x0004 - 0x0000)
struct BlastBerryPlayerInfoRespawn_OnTickDown final
{
public:
	float                                         TimeRemaining;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlastBerryUIRuntime.BlastBerryPlayerInfoRespawn.GetTimeOfDeath
// 0x0004 (0x0004 - 0x0000)
struct BlastBerryPlayerInfoRespawn_GetTimeOfDeath final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

