#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlastBerryRuntime

#include "Basic.hpp"


namespace SDK
{

// Enum BlastBerryRuntime.EBlastBerryRespawnRewardType
// NumValues: 0x0004
enum class EBlastBerryRespawnRewardType : uint8
{
	Downed                                   = 0,
	Elimination                              = 1,
	TeamWipe                                 = 2,
	EBlastBerryRespawnRewardType_MAX         = 3,
};

// ScriptStruct BlastBerryRuntime.BlastBerryTeamLives
// 0x0008 (0x0008 - 0x0000)
struct FBlastBerryTeamLives final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          TeamLivesUsed;                                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ServerTimeForRecharge;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BlastBerryRuntime.BlastBerrySoloRespawnData
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FBlastBerrySoloRespawnData final
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

