#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlastBerryRuntime

#include "Basic.hpp"

#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "BlastBerryRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class BlastBerryRuntime.FortControllerComponent_BlastBerry
// 0x0098 (0x0178 - 0x00E0)
class UFortControllerComponent_BlastBerry final : public UFortControllerComponent
{
public:
	TMulticastInlineDelegate<void(bool bLastAlive)> OnLastTeamMemberAliveChanged;                      // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnNoRebootsRemaining;                              // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortPlayerStateAthena* PlayerState)> OnTeammateRespawned;                               // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortPlayerStateAthena* PlayerState)> OnTeammateRevived;                                 // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnEnemyTeamEliminated;                             // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EBlastBerryRespawnRewardType RewardType, float RewardTime)> OnRespawnReward;                                   // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_140[0x10];                                     // 0x0140(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bLastTeamMemberAlive;                              // 0x0150(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_151[0x27];                                     // 0x0151(0x0027)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CleanupPossessedPawn();
	void ClientHandlePreRespawn(const struct FVector& RespawnLocation, const struct FRotator& RespawnRotation, float RespawnCameraDist);
	void ClientNotifyEnemyTeamEliminated();
	void ClientNotifyNoRebootsRemaining();
	void ClientNotifyRespawnReward(EBlastBerryRespawnRewardType RewardType, float RewardTime);
	void ClientNotifyTeammateRespawned(class AFortPlayerStateAthena* PlayerState);
	void ClientNotifyTeammateRevived(class AFortPlayerStateAthena* PlayerState);
	void ClientNotifyWaitingForRespawn(const struct FVector& DeathLocation);
	void HandleBotPawnRespawned(class AAIController* BotController, class AFortPawn* BotPawn);
	void HandleDBNOChanged(class AFortPawn* Pawn, bool bIsDBNO);
	void HandlePlayerRespawnTimeUpdated(class AFortPlayerStateAthena* PlayerState, float ServerTimeForRespawn);
	void HandleViewTargetChanged(class AFortPlayerController* InController, class AActor* OldViewTarget, class AActor* NewViewTarget);
	void LocalHandlePreRespawn(const struct FVector& RespawnLocation, const struct FRotator& RespawnRotation, float RespawnCameraDist);
	void OnRep_LastTeamMemberAlive();
	void ServerRequestDeathFromDBNO();

	bool GetLastTeamMemberAlive() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortControllerComponent_BlastBerry">();
	}
	static class UFortControllerComponent_BlastBerry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerComponent_BlastBerry>();
	}
};

// Class BlastBerryRuntime.FortControllerComponent_BlastBerryUI
// 0x0210 (0x02F0 - 0x00E0)
class UFortControllerComponent_BlastBerryUI final : public UFortControllerComponent
{
public:
	struct FScalableFloat                         DeathLocationIndicatorDuration;                    // 0x00E0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   DeathLocationIndicatorWidget;                      // 0x0118(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            DeathLocationIndicatorIconBrush;                   // 0x0150(0x00D0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DeathLocationIndicatorClampedIconBrush;            // 0x0220(0x00D0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortControllerComponent_BlastBerryUI">();
	}
	static class UFortControllerComponent_BlastBerryUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerComponent_BlastBerryUI>();
	}
};

// Class BlastBerryRuntime.FortAthenaMutator_BlastBerry
// 0x0040 (0x0660 - 0x0620)
class AFortAthenaMutator_BlastBerry final : public AFortAthenaMutator_GameModeBase
{
public:
	struct FScalableFloat                         DBNOReviveTime;                                    // 0x0620(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_658[0x8];                                      // 0x0658(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_BlastBerry">();
	}
	static class AFortAthenaMutator_BlastBerry* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_BlastBerry>();
	}
};

// Class BlastBerryRuntime.FortCheatManager_BlastBerry
// 0x0000 (0x0030 - 0x0030)
class UFortCheatManager_BlastBerry final : public UChildCheatManager
{
public:
	void BlastBerryForceRespawn();
	void BlastBerrySetTeamLives(int32 TeamLives);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_BlastBerry">();
	}
	static class UFortCheatManager_BlastBerry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_BlastBerry>();
	}
};

// Class BlastBerryRuntime.FortGameStateComponent_BlastBerryManager
// 0x0678 (0x0750 - 0x00D8)
class UFortGameStateComponent_BlastBerryManager final : public UFortGameStateComponent
{
public:
	TMulticastInlineDelegate<void(class AFortPlayerPawn* PlayerPawn)> OnPlayerPawnRespawned;                             // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class APlayerController* LocalPC, uint8 TeamId, int32 RemainingLives, int32 Change)> OnLocalTeamLivesChanged;                           // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class APlayerController* LocalPC, uint8 TeamId, float TimeUntilRecharge, float Change)> OnLocalTimeUntilTeamLivesRechargeChanged;          // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRespawnsEnabled;                                 // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRespawnsDisabled;                                // 0x0118(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnTimeUntilRespawnsDisabledUpdated;                // 0x0128(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortPlayerStateAthena* PlayerState, int32 LivesConsumed)> OnConsumedRemainingTeamLives;                      // 0x0138(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         ServerTimeForRespawnsDisabled;                     // 0x0148(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerStateAthena*>         RespawnPendingPlayerStates;                        // 0x0150(0x0010)(Net, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	EAthenaGamePhaseStep                          CurrentGamePhaseStep;                              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentSafeZonePhaseIndex;                         // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxTeamLives;                                      // 0x0168(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         TeamLivesRechargeDuration;                         // 0x01A0(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RespawnHeight;                                     // 0x01D8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RespawnRange;                                      // 0x0210(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RespawnCameraDistance;                             // 0x0248(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         UseAdvancedSpawnBehavior;                          // 0x0280(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         UseSoloSpawnEQS;                                   // 0x02B8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SoloDisableEQSRadius;                              // 0x02F0(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SoloSpawnMaxDistanceFromDeathLocation;             // 0x0328(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AdvancedSpawnSafeZonePredictionTime;               // 0x0360(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AdvancedSpawnSafeZoneRadiusBuffer;                 // 0x0398(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AdvancedSpawnGroupProximityDistance;               // 0x03D0(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         WaveRespawnEnabled;                                // 0x0408(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         WaveRespawnDelay;                                  // 0x0440(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         IndividualRespawnDelay;                            // 0x0478(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RespawnDownedTimeReward;                           // 0x04B0(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RespawnEliminationTimeReward;                      // 0x04E8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RespawnTeamWipeTimeReward;                         // 0x0520(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UEnvQuery*                              SoloRespawnLocationQueryTemplate;                  // 0x0558(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FBlastBerryTeamLives>           TeamLives;                                         // 0x0560(0x0010)(Net, ZeroConstructor, Transient, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<struct FBlastBerryTeamLives>           PreviousTeamLives;                                 // 0x0570(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_580[0xF0];                                     // 0x0580(0x00F0)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class AFortPlayerStateAthena*, struct FTimerHandle> ActiveViewTargetValidationTimersMap;               // 0x0670(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<class AFortPlayerStateAthena*, struct FBlastBerrySoloRespawnData> SoloRespawnDataMap;                                // 0x06C0(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_710[0x40];                                     // 0x0710(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleBotPawnRespawned(class AAIController* BotController, class AFortPawn* BotPawn);
	void HandlePlayerRespawnTimeUpdated(class AFortPlayerStateAthena* PlayerState, float ServerTimeForRespawn);
	void HandleTeamLifeRecharged(uint8 TeamId);
	void HandleWaveRespawnTimerFinished();
	void OnGamePhaseStepChanged(const struct FFortGamePhaseStepUpdatedEvent& Event);
	void OnRep_ServerTimeForRespawnsDisabled();
	void OnRep_TeamLives();
	void OnSafeZoneUpdated(const struct FFortSafeZonePhaseUpdatedEvent& Event);
	void UpdateTeamInfo(uint8 TeamId, bool bSendNotifications);
	void ValidateRespawningViewTarget(TWeakObjectPtr<class AFortPlayerStateAthena> WeakPS);

	bool AreRespawnsActive() const;
	float GetRespawnDelay(class AFortPlayerStateAthena* PS) const;
	int32 GetTeamLivesRemaining(uint8 TeamId) const;
	float GetTimeUntilRespawnDisabled() const;
	float GetTimeUntilTeamLivesRecharge(uint8 TeamId) const;
	bool IsWaveRespawnEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameStateComponent_BlastBerryManager">();
	}
	static class UFortGameStateComponent_BlastBerryManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameStateComponent_BlastBerryManager>();
	}
};

// Class BlastBerryRuntime.FortQueryContext_BlastBerryAllEnemies
// 0x0000 (0x0030 - 0x0030)
class UFortQueryContext_BlastBerryAllEnemies final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryContext_BlastBerryAllEnemies">();
	}
	static class UFortQueryContext_BlastBerryAllEnemies* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryContext_BlastBerryAllEnemies>();
	}
};

// Class BlastBerryRuntime.FortQueryContext_BlastBerryDeathLocation
// 0x0000 (0x0030 - 0x0030)
class UFortQueryContext_BlastBerryDeathLocation final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryContext_BlastBerryDeathLocation">();
	}
	static class UFortQueryContext_BlastBerryDeathLocation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryContext_BlastBerryDeathLocation>();
	}
};

// Class BlastBerryRuntime.FortQueryContext_BlastBerryDefaultSpawnLocation
// 0x0000 (0x0030 - 0x0030)
class UFortQueryContext_BlastBerryDefaultSpawnLocation final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryContext_BlastBerryDefaultSpawnLocation">();
	}
	static class UFortQueryContext_BlastBerryDefaultSpawnLocation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryContext_BlastBerryDefaultSpawnLocation>();
	}
};

}

