#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlueprintEditorLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.AddFunctionGraph
// 0x0020 (0x0020 - 0x0000)
struct BlueprintEditorLibrary_AddFunctionGraph final
{
public:
	class UBlueprint*                             Blueprint;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FuncName;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEdGraph*                               ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.CompileBlueprint
// 0x0008 (0x0008 - 0x0000)
struct BlueprintEditorLibrary_CompileBlueprint final
{
public:
	class UBlueprint*                             Blueprint;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.CreateBlueprintAssetWithParent
// 0x0020 (0x0020 - 0x0000)
struct BlueprintEditorLibrary_CreateBlueprintAssetWithParent final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ParentClass;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlueprint*                             ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.FindEventGraph
// 0x0010 (0x0010 - 0x0000)
struct BlueprintEditorLibrary_FindEventGraph final
{
public:
	class UBlueprint*                             Blueprint;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEdGraph*                               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.FindGraph
// 0x0020 (0x0020 - 0x0000)
struct BlueprintEditorLibrary_FindGraph final
{
public:
	class UBlueprint*                             Blueprint;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GraphName;                                         // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEdGraph*                               ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.GeneratedClass
// 0x0010 (0x0010 - 0x0000)
struct BlueprintEditorLibrary_GeneratedClass final
{
public:
	class UBlueprint*                             BlueprintObj;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.GetBlueprintAsset
// 0x0010 (0x0010 - 0x0000)
struct BlueprintEditorLibrary_GetBlueprintAsset final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlueprint*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.RefreshOpenEditorsForBlueprint
// 0x0008 (0x0008 - 0x0000)
struct BlueprintEditorLibrary_RefreshOpenEditorsForBlueprint final
{
public:
	const class UBlueprint*                       BP;                                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.RemoveFunctionGraph
// 0x0018 (0x0018 - 0x0000)
struct BlueprintEditorLibrary_RemoveFunctionGraph final
{
public:
	class UBlueprint*                             Blueprint;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FuncName;                                          // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.RemoveGraph
// 0x0010 (0x0010 - 0x0000)
struct BlueprintEditorLibrary_RemoveGraph final
{
public:
	class UBlueprint*                             Blueprint;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEdGraph*                               Graph;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.RemoveUnusedNodes
// 0x0008 (0x0008 - 0x0000)
struct BlueprintEditorLibrary_RemoveUnusedNodes final
{
public:
	class UBlueprint*                             Blueprint;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.RemoveUnusedVariables
// 0x0010 (0x0010 - 0x0000)
struct BlueprintEditorLibrary_RemoveUnusedVariables final
{
public:
	class UBlueprint*                             Blueprint;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.RenameGraph
// 0x0018 (0x0018 - 0x0000)
struct BlueprintEditorLibrary_RenameGraph final
{
public:
	class UEdGraph*                               Graph;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewNameStr;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.ReparentBlueprint
// 0x0010 (0x0010 - 0x0000)
struct BlueprintEditorLibrary_ReparentBlueprint final
{
public:
	class UBlueprint*                             Blueprint;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 NewParentClass;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.ReplaceVariableReferences
// 0x0020 (0x0020 - 0x0000)
struct BlueprintEditorLibrary_ReplaceVariableReferences final
{
public:
	class UBlueprint*                             Blueprint;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OldVarName;                                        // 0x0008(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewVarName;                                        // 0x0014(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.SetBlueprintVariableExposeOnSpawn
// 0x0018 (0x0018 - 0x0000)
struct BlueprintEditorLibrary_SetBlueprintVariableExposeOnSpawn final
{
public:
	class UBlueprint*                             Blueprint;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VariableName;                                      // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExposeOnSpawn;                                    // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.SetBlueprintVariableExposeToCinematics
// 0x0018 (0x0018 - 0x0000)
struct BlueprintEditorLibrary_SetBlueprintVariableExposeToCinematics final
{
public:
	class UBlueprint*                             Blueprint;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VariableName;                                      // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExposeToCinematics;                               // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.SetBlueprintVariableInstanceEditable
// 0x0018 (0x0018 - 0x0000)
struct BlueprintEditorLibrary_SetBlueprintVariableInstanceEditable final
{
public:
	class UBlueprint*                             Blueprint;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VariableName;                                      // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInstanceEditable;                                 // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintEditorLibrary.BlueprintEditorLibrary.UpgradeOperatorNodes
// 0x0008 (0x0008 - 0x0000)
struct BlueprintEditorLibrary_UpgradeOperatorNodes final
{
public:
	class UBlueprint*                             Blueprint;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

