#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlueprintHeaderView

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum BlueprintHeaderView.EHeaderViewSortMethod
// NumValues: 0x0004
enum class EHeaderViewSortMethod : uint8
{
	None                                     = 0,
	SortByAccessSpecifier                    = 1,
	SortForOptimalPadding                    = 2,
	EHeaderViewSortMethod_MAX                = 3,
};

// ScriptStruct BlueprintHeaderView.HeaderViewSyntaxColors
// 0x0060 (0x0060 - 0x0000)
struct FHeaderViewSyntaxColors final
{
public:
	struct FLinearColor                           Comment;                                           // 0x0000(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Error;                                             // 0x0010(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Macro;                                             // 0x0020(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Typename;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Identifier;                                        // 0x0040(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Keyword;                                           // 0x0050(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

