#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlueprintRuntime

#include "Basic.hpp"


namespace SDK
{

// Enum BlueprintRuntime.EBlueprintWarningBehavior
// NumValues: 0x0004
enum class EBlueprintWarningBehavior : uint8
{
	Warn                                     = 0,
	Error                                    = 1,
	Suppress                                 = 2,
	EBlueprintWarningBehavior_MAX            = 3,
};

// ScriptStruct BlueprintRuntime.BlueprintWarningSettings
// 0x0028 (0x0028 - 0x0000)
struct FBlueprintWarningSettings final
{
public:
	class FName                                   WarningIdentifier;                                 // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   WarningDescription;                                // 0x0010(0x0010)(NativeAccessSpecifierPublic)
	EBlueprintWarningBehavior                     WarningBehavior;                                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

