#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlueprintGraph

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnrealEd_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum BlueprintGraph.ESaveOnCompile
// NumValues: 0x0004
enum class ESaveOnCompile : uint8
{
	SoC_Never                                = 0,
	SoC_SuccessOnly                          = 1,
	SoC_Always                               = 2,
	SoC_MAX                                  = 3,
};

// Enum BlueprintGraph.EEdGraphSchemaAction_K2Graph
// NumValues: 0x0006
enum class EEdGraphSchemaAction_K2Graph : uint8
{
	Graph                                    = 0,
	Subgraph                                 = 1,
	Function                                 = 2,
	Interface                                = 3,
	Macro                                    = 4,
	MAX                                      = 5,
};

// Enum BlueprintGraph.ETunnelBoundaryType
// NumValues: 0x0005
enum class ETunnelBoundaryType : uint8
{
	Unknown                                  = 0,
	EntrySite                                = 1,
	InputSite                                = 2,
	OutputSite                               = 3,
	ETunnelBoundaryType_MAX                  = 4,
};

// Enum BlueprintGraph.ESelfContextInfo
// NumValues: 0x0003
enum class ESelfContextInfo : uint8
{
	Unspecified                              = 0,
	NotSelfContext                           = 1,
	ESelfContextInfo_MAX                     = 2,
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_K2NewNode
// 0x0010 (0x0100 - 0x00F0)
struct FEdGraphSchemaAction_K2NewNode : public FEdGraphSchemaAction
{
public:
	class UK2Node*                                NodeTemplate;                                      // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGotoNode;                                         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_K2AssignDelegate
// 0x0000 (0x0100 - 0x0100)
struct FEdGraphSchemaAction_K2AssignDelegate final : public FEdGraphSchemaAction_K2NewNode
{
};

// ScriptStruct BlueprintGraph.PerBlueprintSettings
// 0x0020 (0x0020 - 0x0000)
struct FPerBlueprintSettings final
{
public:
	TArray<struct FBlueprintBreakpoint>           Breakpoints;                                       // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBlueprintWatchedPin>           WatchedPins;                                       // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct BlueprintGraph.AdditionalBlueprintCategory
// 0x0038 (0x0038 - 0x0000)
struct FAdditionalBlueprintCategory final
{
public:
	class FText                                   Name;                                              // 0x0000(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         ClassFilter;                                       // 0x0010(0x0028)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_K2Struct
// 0x0008 (0x00F8 - 0x00F0)
struct FEdGraphSchemaAction_K2Struct final : public FEdGraphSchemaAction
{
public:
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BlueprintGraph.BlueprintCallableFunctionRedirect
// 0x0050 (0x0050 - 0x0000)
struct FBlueprintCallableFunctionRedirect final
{
public:
	class FString                                 ClassName;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OldFunctionName;                                   // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewFunctionName;                                   // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BlueprintParamName;                                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClassParamName;                                    // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_K2ViewNode
// 0x0008 (0x00F8 - 0x00F0)
struct FEdGraphSchemaAction_K2ViewNode final : public FEdGraphSchemaAction
{
public:
	class UK2Node*                                NodePtr;                                           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_EventFromFunction
// 0x0008 (0x00F8 - 0x00F0)
struct FEdGraphSchemaAction_EventFromFunction final : public FEdGraphSchemaAction
{
public:
	class UFunction*                              SignatureFunction;                                 // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_K2AddComponent
// 0x0010 (0x0110 - 0x0100)
struct FEdGraphSchemaAction_K2AddComponent final : public FEdGraphSchemaAction_K2NewNode
{
public:
	TSubclassOf<class UActorComponent>            ComponentClass;                                    // 0x0100(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ComponentAsset;                                    // 0x0108(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_K2AddEvent
// 0x0000 (0x0100 - 0x0100)
struct FEdGraphSchemaAction_K2AddEvent final : public FEdGraphSchemaAction_K2NewNode
{
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_K2AddCustomEvent
// 0x0000 (0x0100 - 0x0100)
struct FEdGraphSchemaAction_K2AddCustomEvent final : public FEdGraphSchemaAction_K2NewNode
{
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_K2AddCallOnActor
// 0x0010 (0x0110 - 0x0100)
struct FEdGraphSchemaAction_K2AddCallOnActor final : public FEdGraphSchemaAction_K2NewNode
{
public:
	TArray<class AActor*>                         LevelActors;                                       // 0x0100(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_K2AddComment
// 0x0000 (0x00F0 - 0x00F0)
struct FEdGraphSchemaAction_K2AddComment final : public FEdGraphSchemaAction
{
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_K2TargetNode
// 0x0000 (0x0100 - 0x0100)
struct FEdGraphSchemaAction_K2TargetNode : public FEdGraphSchemaAction_K2NewNode
{
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_K2PasteHere
// 0x0000 (0x00F0 - 0x00F0)
struct FEdGraphSchemaAction_K2PasteHere final : public FEdGraphSchemaAction
{
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_K2Enum
// 0x0008 (0x00F8 - 0x00F0)
struct FEdGraphSchemaAction_K2Enum final : public FEdGraphSchemaAction
{
public:
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_BlueprintVariableBase
// 0x0018 (0x0108 - 0x00F0)
struct FEdGraphSchemaAction_BlueprintVariableBase : public FEdGraphSchemaAction
{
public:
	uint8                                         Pad_F0[0x18];                                      // 0x00F0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_K2Var
// 0x0000 (0x0108 - 0x0108)
struct FEdGraphSchemaAction_K2Var final : public FEdGraphSchemaAction_BlueprintVariableBase
{
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_K2LocalVar
// 0x0000 (0x0108 - 0x0108)
struct FEdGraphSchemaAction_K2LocalVar final : public FEdGraphSchemaAction_BlueprintVariableBase
{
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_K2Graph
// 0x0018 (0x0108 - 0x00F0)
struct FEdGraphSchemaAction_K2Graph final : public FEdGraphSchemaAction
{
public:
	uint8                                         Pad_F0[0x18];                                      // 0x00F0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_K2Event
// 0x0000 (0x0100 - 0x0100)
struct FEdGraphSchemaAction_K2Event final : public FEdGraphSchemaAction_K2TargetNode
{
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_K2InputAction
// 0x0000 (0x0100 - 0x0100)
struct FEdGraphSchemaAction_K2InputAction final : public FEdGraphSchemaAction_K2TargetNode
{
};

// ScriptStruct BlueprintGraph.EdGraphSchemaAction_K2Delegate
// 0x0008 (0x0110 - 0x0108)
struct FEdGraphSchemaAction_K2Delegate final : public FEdGraphSchemaAction_BlueprintVariableBase
{
public:
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BlueprintGraph.OptionalPinFromProperty
// 0x0040 (0x0040 - 0x0000)
struct FOptionalPinFromProperty final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PropertyFriendlyName;                              // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   PropertyTooltip;                                   // 0x0020(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FName                                   CategoryName;                                      // 0x0030(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bShowPin : 1;                                      // 0x003C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanToggleVisibility : 1;                          // 0x003C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bPropertyIsCustomized : 1;                         // 0x003C(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHasOverridePin : 1;                               // 0x003C(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsMarkedForAdvancedDisplay : 1;                   // 0x003C(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsOverrideEnabled : 1;                            // 0x003C(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsSetValuePinVisible : 1;                         // 0x003C(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsOverridePinVisible : 1;                         // 0x003C(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BlueprintGraph.CustomPin
// 0x001C (0x001C - 0x0000)
struct FCustomPin final
{
public:
	class FName                                   PinName;                                           // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CallFuncPinName;                                   // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValuePin;                                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BlueprintGraph.UserPinInfo
// 0x0098 (0x0098 - 0x0000)
struct FUserPinInfo final
{
public:
	class FName                                   PinName;                                           // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEdGraphPinType                        PinType;                                           // 0x0010(0x0070)(NoDestructor, NativeAccessSpecifierPublic)
	EEdGraphPinDirection                          DesiredPinDirection;                               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PinDefaultValue;                                   // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BlueprintGraph.KismetUserDeclaredFunctionMetadata
// 0x00B8 (0x00B8 - 0x0000)
struct FKismetUserDeclaredFunctionMetadata final
{
public:
	class FText                                   ToolTip;                                           // 0x0000(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   Category;                                          // 0x0010(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   Keywords;                                          // 0x0020(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   CompactNodeTitle;                                  // 0x0030(0x0010)(NativeAccessSpecifierPublic)
	struct FLinearColor                           InstanceTitleColor;                                // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DeprecationMessage;                                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDeprecated;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCallInEditor;                                     // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bThreadSafe;                                       // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUnsafeDuringActorConstruction;                  // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          HasLatentFunctions;                                // 0x0064(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FString>              MetaDataMap;                                       // 0x0068(0x0050)(NativeAccessSpecifierPrivate)
};

}

