#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlueprintGraph

#include "Basic.hpp"

#include "Kismet_structs.hpp"
#include "BlueprintGraph_structs.hpp"
#include "UnrealEd_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Slate_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Class BlueprintGraph.K2Node
// 0x0000 (0x00C0 - 0x00C0)
class UK2Node : public UEdGraphNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node">();
	}
	static class UK2Node* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node>();
	}
};

// Class BlueprintGraph.K2Node_EnumEquality
// 0x0000 (0x00C0 - 0x00C0)
class UK2Node_EnumEquality : public UK2Node
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_EnumEquality">();
	}
	static class UK2Node_EnumEquality* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_EnumEquality>();
	}
};

// Class BlueprintGraph.K2Node_EnumInequality
// 0x0000 (0x00C0 - 0x00C0)
class UK2Node_EnumInequality final : public UK2Node_EnumEquality
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_EnumInequality">();
	}
	static class UK2Node_EnumInequality* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_EnumInequality>();
	}
};

// Class BlueprintGraph.K2Node_EditablePinBase
// 0x0018 (0x00D8 - 0x00C0)
class UK2Node_EditablePinBase : public UK2Node
{
public:
	uint8                                         bIsEditable : 1;                                   // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_C1[0x17];                                      // 0x00C1(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_EditablePinBase">();
	}
	static class UK2Node_EditablePinBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_EditablePinBase>();
	}
};

// Class BlueprintGraph.K2Node_FunctionTerminator
// 0x0050 (0x0128 - 0x00D8)
class UK2Node_FunctionTerminator : public UK2Node_EditablePinBase
{
public:
	struct FMemberReference                       FunctionReference;                                 // 0x00D8(0x0038)(NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    SignatureClass;                                    // 0x0110(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   SignatureName;                                     // 0x0118(0x000C)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_FunctionTerminator">();
	}
	static class UK2Node_FunctionTerminator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_FunctionTerminator>();
	}
};

// Class BlueprintGraph.K2Node_FunctionEntry
// 0x00F8 (0x0220 - 0x0128)
class UK2Node_FunctionEntry final : public UK2Node_FunctionTerminator
{
public:
	class FName                                   CustomGeneratedFunctionName;                       // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKismetUserDeclaredFunctionMetadata    MetaData;                                          // 0x0138(0x00B8)(NativeAccessSpecifierPublic)
	TArray<struct FBPVariableDescription>         LocalVariables;                                    // 0x01F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bEnforceConstCorrectness;                          // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ExtraFlags;                                        // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_208[0x18];                                     // 0x0208(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_FunctionEntry">();
	}
	static class UK2Node_FunctionEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_FunctionEntry>();
	}
};

// Class BlueprintGraph.K2Node_CallFunction
// 0x0088 (0x0148 - 0x00C0)
class UK2Node_CallFunction : public UK2Node
{
public:
	uint8                                         bIsPureFunc : 1;                                   // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bWantsEnumToExecExpansion : 1;                     // 0x00C0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMemberReference                       FunctionReference;                                 // 0x00C8(0x0038)(NativeAccessSpecifierPublic)
	class FName                                   CallFunctionName;                                  // 0x0100(0x000C)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    CallFunctionClass;                                 // 0x0110(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_118[0x30];                                     // 0x0118(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_CallFunction">();
	}
	static class UK2Node_CallFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_CallFunction>();
	}
};

// Class BlueprintGraph.K2Node_CommutativeAssociativeBinaryOperator
// 0x0010 (0x0158 - 0x0148)
class UK2Node_CommutativeAssociativeBinaryOperator final : public UK2Node_CallFunction
{
public:
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumAdditionalInputs;                               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_CommutativeAssociativeBinaryOperator">();
	}
	static class UK2Node_CommutativeAssociativeBinaryOperator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_CommutativeAssociativeBinaryOperator>();
	}
};

// Class BlueprintGraph.EdGraphSchema_K2
// 0x0010 (0x0040 - 0x0030)
class UEdGraphSchema_K2 : public UEdGraphSchema
{
public:
	TArray<struct FBlueprintCallableFunctionRedirect> EditoronlyBPFunctionRedirects;                     // 0x0030(0x0010)(ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EdGraphSchema_K2">();
	}
	static class UEdGraphSchema_K2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEdGraphSchema_K2>();
	}
};

// Class BlueprintGraph.K2Node_EventNodeInterface
// 0x0000 (0x0030 - 0x0030)
class IK2Node_EventNodeInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_EventNodeInterface">();
	}
	static class IK2Node_EventNodeInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IK2Node_EventNodeInterface>();
	}
};

// Class BlueprintGraph.K2Node_ExecutionSequence
// 0x0008 (0x00C8 - 0x00C0)
class UK2Node_ExecutionSequence : public UK2Node
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_ExecutionSequence">();
	}
	static class UK2Node_ExecutionSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_ExecutionSequence>();
	}
};

// Class BlueprintGraph.K2Node_BaseAsyncTask
// 0x0030 (0x00F0 - 0x00C0)
class UK2Node_BaseAsyncTask : public UK2Node
{
public:
	class FName                                   ProxyFactoryFunctionName;                          // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    ProxyFactoryClass;                                 // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UObject>                    ProxyClass;                                        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ProxyActivateFunctionName;                         // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_BaseAsyncTask">();
	}
	static class UK2Node_BaseAsyncTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_BaseAsyncTask>();
	}
};

// Class BlueprintGraph.K2Node_EditorPropertyAccessBase
// 0x0000 (0x0148 - 0x0148)
class UK2Node_EditorPropertyAccessBase : public UK2Node_CallFunction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_EditorPropertyAccessBase">();
	}
	static class UK2Node_EditorPropertyAccessBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_EditorPropertyAccessBase>();
	}
};

// Class BlueprintGraph.K2Node_GetEditorProperty
// 0x0000 (0x0148 - 0x0148)
class UK2Node_GetEditorProperty final : public UK2Node_EditorPropertyAccessBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_GetEditorProperty">();
	}
	static class UK2Node_GetEditorProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_GetEditorProperty>();
	}
};

// Class BlueprintGraph.K2Node_Switch
// 0x0020 (0x00E0 - 0x00C0)
class UK2Node_Switch : public UK2Node
{
public:
	uint8                                         bHasDefaultPin : 1;                                // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   FunctionName;                                      // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    FunctionClass;                                     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_Switch">();
	}
	static class UK2Node_Switch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_Switch>();
	}
};

// Class BlueprintGraph.K2Node_ConstructObjectFromClass
// 0x0028 (0x00E8 - 0x00C0)
class UK2Node_ConstructObjectFromClass : public UK2Node
{
public:
	uint8                                         Pad_C0[0x28];                                      // 0x00C0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_ConstructObjectFromClass">();
	}
	static class UK2Node_ConstructObjectFromClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_ConstructObjectFromClass>();
	}
};

// Class BlueprintGraph.K2Node_AssignmentStatement
// 0x0000 (0x00C0 - 0x00C0)
class UK2Node_AssignmentStatement final : public UK2Node
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_AssignmentStatement">();
	}
	static class UK2Node_AssignmentStatement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_AssignmentStatement>();
	}
};

// Class BlueprintGraph.K2Node_Event
// 0x0088 (0x0160 - 0x00D8)
class UK2Node_Event : public UK2Node_EditablePinBase
{
public:
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EventSignatureName;                                // 0x00E0(0x000C)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    EventSignatureClass;                               // 0x00F0(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMemberReference                       EventReference;                                    // 0x00F8(0x0038)(NativeAccessSpecifierPublic)
	uint8                                         bOverrideFunction : 1;                             // 0x0130(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bInternalEvent : 1;                                // 0x0130(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CustomFunctionName;                                // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        FunctionFlags_0;                                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_144[0x1C];                                     // 0x0144(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_Event">();
	}
	static class UK2Node_Event* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_Event>();
	}
};

// Class BlueprintGraph.BlueprintNodeSpawner
// 0x00D0 (0x0100 - 0x0030)
class UBlueprintNodeSpawner : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UEdGraphNode>               NodeClass;                                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0xC0];                                      // 0x0040(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintNodeSpawner">();
	}
	static class UBlueprintNodeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintNodeSpawner>();
	}
};

// Class BlueprintGraph.BlueprintEventNodeSpawner
// 0x0018 (0x0118 - 0x0100)
class UBlueprintEventNodeSpawner : public UBlueprintNodeSpawner
{
public:
	class UFunction*                              EventFunc;                                         // 0x0100(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   CustomEventName;                                   // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintEventNodeSpawner">();
	}
	static class UBlueprintEventNodeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintEventNodeSpawner>();
	}
};

// Class BlueprintGraph.AnimNotifyEventNodeSpawner
// 0x0028 (0x0140 - 0x0118)
class UAnimNotifyEventNodeSpawner final : public UBlueprintEventNodeSpawner
{
public:
	struct FSoftObjectPath                        SkeletonObjectPath;                                // 0x0118(0x0028)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyEventNodeSpawner">();
	}
	static class UAnimNotifyEventNodeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyEventNodeSpawner>();
	}
};

// Class BlueprintGraph.BlueprintAssetNodeSpawner
// 0x0098 (0x0198 - 0x0100)
class UBlueprintAssetNodeSpawner final : public UBlueprintNodeSpawner
{
public:
	struct FAssetData                             AssetData;                                         // 0x0100(0x0098)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintAssetNodeSpawner">();
	}
	static class UBlueprintAssetNodeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintAssetNodeSpawner>();
	}
};

// Class BlueprintGraph.BlueprintBoundEventNodeSpawner
// 0x0030 (0x0148 - 0x0118)
class UBlueprintBoundEventNodeSpawner final : public UBlueprintEventNodeSpawner
{
public:
	TFieldPath<class FMulticastDelegateProperty>  EventDelegate;                                     // 0x0118(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintBoundEventNodeSpawner">();
	}
	static class UBlueprintBoundEventNodeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintBoundEventNodeSpawner>();
	}
};

// Class BlueprintGraph.BlueprintBoundNodeSpawner
// 0x0030 (0x0130 - 0x0100)
class UBlueprintBoundNodeSpawner final : public UBlueprintNodeSpawner
{
public:
	uint8                                         Pad_100[0x30];                                     // 0x0100(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintBoundNodeSpawner">();
	}
	static class UBlueprintBoundNodeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintBoundNodeSpawner>();
	}
};

// Class BlueprintGraph.BlueprintComponentNodeSpawner
// 0x0028 (0x0128 - 0x0100)
class UBlueprintComponentNodeSpawner final : public UBlueprintNodeSpawner
{
public:
	TSubclassOf<class UActorComponent>            ComponentClass;                                    // 0x0100(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 ComponentName;                                     // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 ComponentAssetName;                                // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintComponentNodeSpawner">();
	}
	static class UBlueprintComponentNodeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintComponentNodeSpawner>();
	}
};

// Class BlueprintGraph.BlueprintFieldNodeSpawner
// 0x0050 (0x0150 - 0x0100)
class UBlueprintFieldNodeSpawner : public UBlueprintNodeSpawner
{
public:
	uint8                                         Pad_100[0x10];                                     // 0x0100(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    OwnerClass;                                        // 0x0110(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UField*                                 Field;                                             // 0x0118(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TFieldPath<class FProperty>                   Property;                                          // 0x0120(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintFieldNodeSpawner">();
	}
	static class UBlueprintFieldNodeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintFieldNodeSpawner>();
	}
};

// Class BlueprintGraph.BlueprintDelegateNodeSpawner
// 0x0000 (0x0150 - 0x0150)
class UBlueprintDelegateNodeSpawner final : public UBlueprintFieldNodeSpawner
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintDelegateNodeSpawner">();
	}
	static class UBlueprintDelegateNodeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintDelegateNodeSpawner>();
	}
};

// Class BlueprintGraph.BlueprintEditorSettings
// 0x05F8 (0x0658 - 0x0060)
class UBlueprintEditorSettings final : public UDeveloperSettings
{
public:
	bool                                          bDrawMidpointArrowsInBlueprints;                   // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowGraphInstructionText;                         // 0x0061(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideUnrelatedNodes;                               // 0x0062(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowShortTooltips;                                // 0x0063(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowFunctionParameterIcon;                        // 0x0064(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowFunctionLocalVariableIcon;                    // 0x0065(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableInputTriggerSupportWarnings;                // 0x0066(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSplitContextTargetSettings;                       // 0x0067(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExposeAllMemberComponentFunctions;                // 0x0068(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowContextualFavorites;                          // 0x0069(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExposeDeprecatedFunctions;                        // 0x006A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCompactCallOnMemberNodes;                         // 0x006B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlattenFavoritesMenus;                            // 0x006C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoCastObjectConnections;                        // 0x006D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowViewportOnSimulate;                           // 0x006E(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSpawnDefaultBlueprintNodes;                       // 0x006F(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideConstructionScriptComponentsInDetailsView;    // 0x0070(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHostFindInBlueprintsInGlobalTab;                  // 0x0071(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNavigateToNativeFunctionsFromCallNodes;           // 0x0072(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoubleClickNavigatesToParent;                     // 0x0073(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableTypePromotion;                              // 0x0074(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FName>                             TypePromotionPinDenyList;                          // 0x0078(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	TArray<struct FAdditionalBlueprintCategory>   AdditionalBlueprintCategories;                     // 0x00C8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	EBlueprintBreakpointReloadMethod              BreakpointReloadMethod;                            // 0x00D8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnablePinValueInspectionTooltips;                 // 0x00DC(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableNamespaceEditorFeatures;                    // 0x00DD(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         NamespacesToAlwaysInclude;                         // 0x00E0(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bEnableContextMenuTimeSlicing;                     // 0x00F0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ContextMenuTimeSlicingThresholdMs;                 // 0x00F4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeActionsForSelectedAssetsInContextMenu;     // 0x00F8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLimitAssetActionBindingToSingleSelectionOnly;     // 0x00F9(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoadSelectedAssetsForContextMenuActionBinding;    // 0x00FA(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoNotMarkAllInstancesDirtyOnDefaultValueChange;   // 0x00FB(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFavorPureCastNodes;                               // 0x00FC(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESaveOnCompile                                SaveOnCompile;                                     // 0x00FD(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bJumpToNodeErrors;                                 // 0x00FE(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowExplicitImpureNodeDisabling;                 // 0x00FF(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowActionMenuItemSignatures;                     // 0x0100(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlueprintNodeUniqueNames;                         // 0x0101(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NodeTemplateCacheCapMB;                            // 0x0108(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFiBIndexAllPermission                        AllowIndexAllBlueprints;                           // 0x010C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowInheritedVariables;                           // 0x0110(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlwaysShowInterfacesInOverrides;                  // 0x0111(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowParentClassInOverrides;                       // 0x0112(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowEmptySections;                                // 0x0113(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowAccessSpecifier;                              // 0x0114(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGuid, struct FEditedDocumentInfo> Bookmarks;                                         // 0x0118(0x0050)(Config, NativeAccessSpecifierPublic)
	TArray<struct FBPEditorBookmarkNode>          BookmarkNodes;                                     // 0x0168(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TMap<class FString, struct FPerBlueprintSettings> PerBlueprintSettings;                              // 0x0178(0x0050)(Config, NativeAccessSpecifierPublic)
	bool                                          bIncludeCommentNodesInBookmarksTab;                // 0x01C8(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowBookmarksForCurrentDocumentOnlyInTab;         // 0x01C9(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FEditedDocumentInfo>       GraphEditorQuickJumps;                             // 0x01D0(0x0050)(Config, NativeAccessSpecifierPublic)
	bool                                          bEnableNamespaceFilteringFeatures;                 // 0x0220(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableNamespaceImportingFeatures;                 // 0x0221(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInheritImportedNamespacesFromParentBP;            // 0x0222(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_223[0x5];                                      // 0x0223(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           BaseClassesToAllowRecompilingDuringPlayInEditor;   // 0x0228(0x0010)(Edit, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_238[0x420];                                    // 0x0238(0x0420)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintEditorSettings">();
	}
	static class UBlueprintEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintEditorSettings>();
	}
};

// Class BlueprintGraph.BlueprintFunctionNodeSpawner
// 0x0000 (0x0150 - 0x0150)
class UBlueprintFunctionNodeSpawner final : public UBlueprintFieldNodeSpawner
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintFunctionNodeSpawner">();
	}
	static class UBlueprintFunctionNodeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintFunctionNodeSpawner>();
	}
};

// Class BlueprintGraph.BlueprintVariableNodeSpawner
// 0x00F0 (0x0240 - 0x0150)
class UBlueprintVariableNodeSpawner final : public UBlueprintFieldNodeSpawner
{
public:
	class UEdGraph*                               LocalVarOuter;                                     // 0x0150(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBPVariableDescription                 LocalVarDesc;                                      // 0x0158(0x00E8)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintVariableNodeSpawner">();
	}
	static class UBlueprintVariableNodeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintVariableNodeSpawner>();
	}
};

// Class BlueprintGraph.K2Node_ActorBoundEvent
// 0x0038 (0x0198 - 0x0160)
class UK2Node_ActorBoundEvent final : public UK2Node_Event
{
public:
	class FName                                   DelegatePropertyName;                              // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    DelegateOwnerClass;                                // 0x0170(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 EventOwner;                                        // 0x0178(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_180[0x18];                                     // 0x0180(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_ActorBoundEvent">();
	}
	static class UK2Node_ActorBoundEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_ActorBoundEvent>();
	}
};

// Class BlueprintGraph.K2Node_AddComponent
// 0x0020 (0x0168 - 0x0148)
class UK2Node_AddComponent final : public UK2Node_CallFunction
{
public:
	uint8                                         bHasExposedVariable : 1;                           // 0x0148(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TemplateBlueprint;                                 // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    TemplateType;                                      // 0x0160(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_AddComponent">();
	}
	static class UK2Node_AddComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_AddComponent>();
	}
};

// Class BlueprintGraph.K2Node_AddComponentByClass
// 0x0000 (0x00E8 - 0x00E8)
class UK2Node_AddComponentByClass final : public UK2Node_ConstructObjectFromClass
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_AddComponentByClass">();
	}
	static class UK2Node_AddComponentByClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_AddComponentByClass>();
	}
};

// Class BlueprintGraph.K2Node_BaseMCDelegate
// 0x0050 (0x0110 - 0x00C0)
class UK2Node_BaseMCDelegate : public UK2Node
{
public:
	struct FMemberReference                       DelegateReference;                                 // 0x00C0(0x0038)(NativeAccessSpecifierPublic)
	uint8                                         Pad_F8[0x18];                                      // 0x00F8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_BaseMCDelegate">();
	}
	static class UK2Node_BaseMCDelegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_BaseMCDelegate>();
	}
};

// Class BlueprintGraph.K2Node_AddDelegate
// 0x0000 (0x0110 - 0x0110)
class UK2Node_AddDelegate : public UK2Node_BaseMCDelegate
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_AddDelegate">();
	}
	static class UK2Node_AddDelegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_AddDelegate>();
	}
};

// Class BlueprintGraph.K2Node_AddPinInterface
// 0x0000 (0x0030 - 0x0030)
class IK2Node_AddPinInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_AddPinInterface">();
	}
	static class IK2Node_AddPinInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IK2Node_AddPinInterface>();
	}
};

// Class BlueprintGraph.K2Node_AssignDelegate
// 0x0018 (0x0128 - 0x0110)
class UK2Node_AssignDelegate final : public UK2Node_AddDelegate
{
public:
	uint8                                         Pad_110[0x18];                                     // 0x0110(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_AssignDelegate">();
	}
	static class UK2Node_AssignDelegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_AssignDelegate>();
	}
};

// Class BlueprintGraph.K2Node_AsyncAction
// 0x0000 (0x00F0 - 0x00F0)
class UK2Node_AsyncAction : public UK2Node_BaseAsyncTask
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_AsyncAction">();
	}
	static class UK2Node_AsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_AsyncAction>();
	}
};

// Class BlueprintGraph.K2Node_BitmaskLiteral
// 0x0010 (0x00D0 - 0x00C0)
class UK2Node_BitmaskLiteral final : public UK2Node
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnum*                                  BitflagsEnum;                                      // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_BitmaskLiteral">();
	}
	static class UK2Node_BitmaskLiteral* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_BitmaskLiteral>();
	}
};

// Class BlueprintGraph.K2Node_Variable
// 0x0058 (0x0118 - 0x00C0)
class UK2Node_Variable : public UK2Node
{
public:
	struct FMemberReference                       VariableReference;                                 // 0x00C0(0x0038)(NativeAccessSpecifierPublic)
	ESelfContextInfo                              SelfContextInfo;                                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    VariableSourceClass;                               // 0x0100(0x0008)(ZeroConstructor, Deprecated, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   VariableName;                                      // 0x0108(0x000C)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bSelfContext : 1;                                  // 0x0114(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Deprecated, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_Variable">();
	}
	static class UK2Node_Variable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_Variable>();
	}
};

// Class BlueprintGraph.K2Node_StructOperation
// 0x0008 (0x0120 - 0x0118)
class UK2Node_StructOperation : public UK2Node_Variable
{
public:
	class UScriptStruct*                          StructType;                                        // 0x0118(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_StructOperation">();
	}
	static class UK2Node_StructOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_StructOperation>();
	}
};

// Class BlueprintGraph.K2Node_StructMemberGet
// 0x0050 (0x0170 - 0x0120)
class UK2Node_StructMemberGet : public UK2Node_StructOperation
{
public:
	TArray<struct FOptionalPinFromProperty>       ShowPinForProperties;                              // 0x0120(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_130[0x40];                                     // 0x0130(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_StructMemberGet">();
	}
	static class UK2Node_StructMemberGet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_StructMemberGet>();
	}
};

// Class BlueprintGraph.K2Node_BreakStruct
// 0x0038 (0x01A8 - 0x0170)
class UK2Node_BreakStruct final : public UK2Node_StructMemberGet
{
public:
	bool                                          bMadeAfterOverridePinRemoval;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_171[0x37];                                     // 0x0171(0x0037)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_BreakStruct">();
	}
	static class UK2Node_BreakStruct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_BreakStruct>();
	}
};

// Class BlueprintGraph.K2Node_CallArrayFunction
// 0x0000 (0x0148 - 0x0148)
class UK2Node_CallArrayFunction final : public UK2Node_CallFunction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_CallArrayFunction">();
	}
	static class UK2Node_CallArrayFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_CallArrayFunction>();
	}
};

// Class BlueprintGraph.K2Node_CallDataTableFunction
// 0x0000 (0x0148 - 0x0148)
class UK2Node_CallDataTableFunction final : public UK2Node_CallFunction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_CallDataTableFunction">();
	}
	static class UK2Node_CallDataTableFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_CallDataTableFunction>();
	}
};

// Class BlueprintGraph.K2Node_CallDelegate
// 0x0000 (0x0110 - 0x0110)
class UK2Node_CallDelegate final : public UK2Node_BaseMCDelegate
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_CallDelegate">();
	}
	static class UK2Node_CallDelegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_CallDelegate>();
	}
};

// Class BlueprintGraph.K2Node_CallFunctionOnMember
// 0x0038 (0x0180 - 0x0148)
class UK2Node_CallFunctionOnMember final : public UK2Node_CallFunction
{
public:
	struct FMemberReference                       MemberVariableToCallOn;                            // 0x0148(0x0038)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_CallFunctionOnMember">();
	}
	static class UK2Node_CallFunctionOnMember* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_CallFunctionOnMember>();
	}
};

// Class BlueprintGraph.K2Node_CallMaterialParameterCollectionFunction
// 0x0000 (0x0148 - 0x0148)
class UK2Node_CallMaterialParameterCollectionFunction final : public UK2Node_CallFunction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_CallMaterialParameterCollectionFunction">();
	}
	static class UK2Node_CallMaterialParameterCollectionFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_CallMaterialParameterCollectionFunction>();
	}
};

// Class BlueprintGraph.K2Node_CallParentFunction
// 0x0000 (0x0148 - 0x0148)
class UK2Node_CallParentFunction final : public UK2Node_CallFunction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_CallParentFunction">();
	}
	static class UK2Node_CallParentFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_CallParentFunction>();
	}
};

// Class BlueprintGraph.K2Node_CastByteToEnum
// 0x0030 (0x00F0 - 0x00C0)
class UK2Node_CastByteToEnum final : public UK2Node
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnum*                                  Enum;                                              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSafe;                                             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x1F];                                      // 0x00D1(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_CastByteToEnum">();
	}
	static class UK2Node_CastByteToEnum* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_CastByteToEnum>();
	}
};

// Class BlueprintGraph.K2Node_DynamicCast
// 0x0028 (0x00E8 - 0x00C0)
class UK2Node_DynamicCast : public UK2Node
{
public:
	TSubclassOf<class UObject>                    TargetType;                                        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x1A];                                      // 0x00C8(0x001A)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsPureCast;                                       // 0x00E2(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_DynamicCast">();
	}
	static class UK2Node_DynamicCast* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_DynamicCast>();
	}
};

// Class BlueprintGraph.K2Node_ClassDynamicCast
// 0x0000 (0x00E8 - 0x00E8)
class UK2Node_ClassDynamicCast final : public UK2Node_DynamicCast
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_ClassDynamicCast">();
	}
	static class UK2Node_ClassDynamicCast* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_ClassDynamicCast>();
	}
};

// Class BlueprintGraph.K2Node_ClearDelegate
// 0x0000 (0x0110 - 0x0110)
class UK2Node_ClearDelegate final : public UK2Node_BaseMCDelegate
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_ClearDelegate">();
	}
	static class UK2Node_ClearDelegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_ClearDelegate>();
	}
};

// Class BlueprintGraph.K2Node_ComponentBoundEvent
// 0x0040 (0x01A0 - 0x0160)
class UK2Node_ComponentBoundEvent final : public UK2Node_Event
{
public:
	class FName                                   DelegatePropertyName;                              // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    DelegateOwnerClass;                                // 0x0170(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ComponentPropertyName;                             // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_184[0x1C];                                     // 0x0184(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_ComponentBoundEvent">();
	}
	static class UK2Node_ComponentBoundEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_ComponentBoundEvent>();
	}
};

// Class BlueprintGraph.K2Node_Tunnel
// 0x00E0 (0x01B8 - 0x00D8)
class UK2Node_Tunnel : public UK2Node_EditablePinBase
{
public:
	class UK2Node_Tunnel*                         OutputSourceNode;                                  // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UK2Node_Tunnel*                         InputSinkNode;                                     // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bCanHaveInputs : 1;                                // 0x00E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanHaveOutputs : 1;                               // 0x00E8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKismetUserDeclaredFunctionMetadata    MetaData;                                          // 0x00F0(0x00B8)(NativeAccessSpecifierPublic)
	uint8                                         Pad_1A8[0x10];                                     // 0x01A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_Tunnel">();
	}
	static class UK2Node_Tunnel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_Tunnel>();
	}
};

// Class BlueprintGraph.K2Node_Composite
// 0x0020 (0x01D8 - 0x01B8)
class UK2Node_Composite : public UK2Node_Tunnel
{
public:
	class UEdGraph*                               BoundGraph;                                        // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C0[0x18];                                     // 0x01C0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_Composite">();
	}
	static class UK2Node_Composite* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_Composite>();
	}
};

// Class BlueprintGraph.K2Node_ConvertAsset
// 0x0000 (0x00C0 - 0x00C0)
class UK2Node_ConvertAsset final : public UK2Node
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_ConvertAsset">();
	}
	static class UK2Node_ConvertAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_ConvertAsset>();
	}
};

// Class BlueprintGraph.K2Node_Copy
// 0x0000 (0x00C0 - 0x00C0)
class UK2Node_Copy final : public UK2Node
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_Copy">();
	}
	static class UK2Node_Copy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_Copy>();
	}
};

// Class BlueprintGraph.K2Node_CreateDelegate
// 0x0020 (0x00E0 - 0x00C0)
class UK2Node_CreateDelegate final : public UK2Node
{
public:
	class FName                                   SelectedFunctionName;                              // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  SelectedFunctionGuid;                              // 0x00CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_CreateDelegate">();
	}
	static class UK2Node_CreateDelegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_CreateDelegate>();
	}
};

// Class BlueprintGraph.K2Node_CustomEvent
// 0x00E8 (0x0248 - 0x0160)
class UK2Node_CustomEvent final : public UK2Node_Event
{
public:
	class FString                                 DeprecationMessage;                                // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDeprecated;                                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCallInEditor;                                     // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_172[0x1E];                                     // 0x0172(0x001E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKismetUserDeclaredFunctionMetadata    MetaData;                                          // 0x0190(0x00B8)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_CustomEvent">();
	}
