#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlueprintMaterialTextureNodes

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BlueprintMaterialTextureNodes.BlueprintMaterialTextureNodesBPLibrary.CreateMIC_EditorOnly
// 0x0020 (0x0020 - 0x0000)
struct BlueprintMaterialTextureNodesBPLibrary_CreateMIC_EditorOnly final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceConstant*              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintMaterialTextureNodes.BlueprintMaterialTextureNodesBPLibrary.RenderTarget_SampleRectangle_EditorOnly
// 0x0028 (0x0028 - 0x0000)
struct BlueprintMaterialTextureNodesBPLibrary_RenderTarget_SampleRectangle_EditorOnly final
{
public:
	class UTextureRenderTarget2D*                 InRenderTarget;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           InRect;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function BlueprintMaterialTextureNodes.BlueprintMaterialTextureNodesBPLibrary.RenderTarget_SampleUV_EditorOnly
// 0x0028 (0x0028 - 0x0000)
struct BlueprintMaterialTextureNodesBPLibrary_RenderTarget_SampleUV_EditorOnly final
{
public:
	class UTextureRenderTarget2D*                 InRenderTarget;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              UV;                                                // 0x0008(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintMaterialTextureNodes.BlueprintMaterialTextureNodesBPLibrary.SetMICBlendMode_EditorOnly
// 0x0010 (0x0010 - 0x0000)
struct BlueprintMaterialTextureNodesBPLibrary_SetMICBlendMode_EditorOnly final
{
public:
	class UMaterialInstanceConstant*              Material;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBlendMode                                    BlendMode;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintMaterialTextureNodes.BlueprintMaterialTextureNodesBPLibrary.SetMICDitheredLODTransition_EditorOnly
// 0x0010 (0x0010 - 0x0000)
struct BlueprintMaterialTextureNodesBPLibrary_SetMICDitheredLODTransition_EditorOnly final
{
public:
	class UMaterialInstanceConstant*              Material;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DitheredLODTransition;                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintMaterialTextureNodes.BlueprintMaterialTextureNodesBPLibrary.SetMICIsThinSurface_EditorOnly
// 0x0010 (0x0010 - 0x0000)
struct BlueprintMaterialTextureNodesBPLibrary_SetMICIsThinSurface_EditorOnly final
{
public:
	class UMaterialInstanceConstant*              Material;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsThinSurface;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintMaterialTextureNodes.BlueprintMaterialTextureNodesBPLibrary.SetMICScalarParam_EditorOnly
// 0x0020 (0x0020 - 0x0000)
struct BlueprintMaterialTextureNodesBPLibrary_SetMICScalarParam_EditorOnly final
{
public:
	class UMaterialInstanceConstant*              Material;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParamName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintMaterialTextureNodes.BlueprintMaterialTextureNodesBPLibrary.SetMICShadingModel_EditorOnly
// 0x0010 (0x0010 - 0x0000)
struct BlueprintMaterialTextureNodesBPLibrary_SetMICShadingModel_EditorOnly final
{
public:
	class UMaterialInstanceConstant*              Material;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMaterialShadingModel                         ShadingModel;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintMaterialTextureNodes.BlueprintMaterialTextureNodesBPLibrary.SetMICTextureParam_EditorOnly
// 0x0028 (0x0028 - 0x0000)
struct BlueprintMaterialTextureNodesBPLibrary_SetMICTextureParam_EditorOnly final
{
public:
	class UMaterialInstanceConstant*              Material;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParamName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             Texture;                                           // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintMaterialTextureNodes.BlueprintMaterialTextureNodesBPLibrary.SetMICTwoSided_EditorOnly
// 0x0010 (0x0010 - 0x0000)
struct BlueprintMaterialTextureNodesBPLibrary_SetMICTwoSided_EditorOnly final
{
public:
	class UMaterialInstanceConstant*              Material;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TwoSided;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintMaterialTextureNodes.BlueprintMaterialTextureNodesBPLibrary.SetMICVectorParam_EditorOnly
// 0x0030 (0x0030 - 0x0000)
struct BlueprintMaterialTextureNodesBPLibrary_SetMICVectorParam_EditorOnly final
{
public:
	class UMaterialInstanceConstant*              Material;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParamName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x0018(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function BlueprintMaterialTextureNodes.BlueprintMaterialTextureNodesBPLibrary.Texture2D_SampleUV_EditorOnly
// 0x0028 (0x0028 - 0x0000)
struct BlueprintMaterialTextureNodesBPLibrary_Texture2D_SampleUV_EditorOnly final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              UV;                                                // 0x0008(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BlueprintMaterialTextureNodes.BlueprintMaterialTextureNodesBPLibrary.UpdateMIC
// 0x0008 (0x0008 - 0x0000)
struct BlueprintMaterialTextureNodesBPLibrary_UpdateMIC final
{
public:
	class UMaterialInstanceConstant*              MIC;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

