#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blutility

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "EditorSubsystem_classes.hpp"
#include "Blutility_structs.hpp"
#include "UnrealEd_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ToolMenus_classes.hpp"
#include "UMGEditor_classes.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// Class Blutility.EditorUtilityObject
// 0x0008 (0x0038 - 0x0030)
class UEditorUtilityObject : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Run();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityObject">();
	}
	static class UEditorUtilityObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityObject>();
	}
};

// Class Blutility.ActorActionUtility
// 0x0018 (0x0050 - 0x0038)
class UActorActionUtility : public UEditorUtilityObject
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           SupportedClasses;                                  // 0x0040(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	class UClass* GetSupportedClass() const;
	const TArray<TSoftClassPtr<class UClass>> GetSupportedClasses() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorActionUtility">();
	}
	static class UActorActionUtility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorActionUtility>();
	}
};

// Class Blutility.AssetActionUtility
// 0x0030 (0x0068 - 0x0038)
class UAssetActionUtility final : public UEditorUtilityObject
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsActionForBlueprints;                            // 0x0040(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           SupportedClasses;                                  // 0x0048(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FAssetActionSupportCondition>   SupportedConditions;                               // 0x0058(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	class UClass* GetSupportedClass() const;
	const TArray<TSoftClassPtr<class UClass>> GetSupportedClasses() const;
	bool IsActionForBlueprints() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetActionUtility">();
	}
	static class UAssetActionUtility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetActionUtility>();
	}
};

// Class Blutility.AsyncCaptureScene
// 0x0028 (0x0060 - 0x0038)
class UAsyncCaptureScene final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class UTextureRenderTarget2D* Texture)> Complete;                                          // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class ASceneCapture2D*                        SceneCapture;                                      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 SceneCaptureRT;                                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncCaptureScene* CaptureSceneAsync(class UCameraComponent* ViewCamera, TSubclassOf<class ASceneCapture2D> SceneCaptureClass, int32 ResX, int32 ResY);
	static class UAsyncCaptureScene* CaptureSceneWithWarmupAsync(class UCameraComponent* ViewCamera, TSubclassOf<class ASceneCapture2D> SceneCaptureClass, int32 ResX, int32 ResY, int32 WarmUpFrames);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncCaptureScene">();
	}
	static class UAsyncCaptureScene* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncCaptureScene>();
	}
};

// Class Blutility.AsyncImageExport
// 0x0030 (0x0068 - 0x0038)
class UAsyncImageExport final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(bool bSuccess)> Complete;                                          // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UTexture*                               TextureToExport;                                   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         Quality;                                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TargetFile;                                        // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UAsyncImageExport* ExportImageAsync(class UTexture* Texture, const class FString& OutputFile, int32 Quality_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncImageExport">();
	}
	static class UAsyncImageExport* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncImageExport>();
	}
};

// Class Blutility.AsyncRegisterAndExecuteTask
// 0x0010 (0x0048 - 0x0038)
class UAsyncRegisterAndExecuteTask final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class UEditorUtilityTask* Task)> OnFinished;                                        // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UAsyncRegisterAndExecuteTask* RegisterAndExecuteTask(class UEditorUtilityTask* Task, class UEditorUtilityTask* OptionalParentTask);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncRegisterAndExecuteTask">();
	}
	static class UAsyncRegisterAndExecuteTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncRegisterAndExecuteTask>();
	}
};

// Class Blutility.EditorFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class UEditorFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorFunctionLibrary">();
	}
	static class UEditorFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorFunctionLibrary>();
	}
};

// Class Blutility.EditorUtilityActor
// 0x0010 (0x0430 - 0x0420)
class AEditorUtilityActor final : public AActor
{
public:
	class UInputComponent*                        EditorOnlyInputComponent;                          // 0x0420(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bReceivesEditorInput;                              // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Run();
	void SetReceivesEditorInput(bool bInValue);

	class UInputComponent* GetInputComponent() const;
	bool GetReceivesEditorInput() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityActor">();
	}
	static class AEditorUtilityActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEditorUtilityActor>();
	}
};

// Class Blutility.EditorUtilityActorComponent
// 0x0000 (0x00D8 - 0x00D8)
class UEditorUtilityActorComponent final : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityActorComponent">();
	}
	static class UEditorUtilityActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityActorComponent>();
	}
};

// Class Blutility.EditorUtilityBlueprint
// 0x0000 (0x0560 - 0x0560)
class UEditorUtilityBlueprint final : public UBlueprint
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityBlueprint">();
	}
	static class UEditorUtilityBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityBlueprint>();
	}
};

// Class Blutility.EditorUtilityBlueprintFactory
// 0x0018 (0x00A0 - 0x0088)
class UEditorUtilityBlueprintFactory final : public UFactory
{
public:
	TSubclassOf<class UObject>                    ParentClass;                                       // 0x0088(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x10];                                      // 0x0090(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityBlueprintFactory">();
	}
	static class UEditorUtilityBlueprintFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityBlueprintFactory>();
	}
};

// Class Blutility.EditorUtilityCamera
// 0x0000 (0x0B70 - 0x0B70)
class AEditorUtilityCamera final : public ACameraActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityCamera">();
	}
	static class AEditorUtilityCamera* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEditorUtilityCamera>();
	}
};

// Class Blutility.EditorUtilityBlueprintAsyncActionBase
// 0x0000 (0x0038 - 0x0038)
class UEditorUtilityBlueprintAsyncActionBase : public UBlueprintAsyncActionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityBlueprintAsyncActionBase">();
	}
	static class UEditorUtilityBlueprintAsyncActionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityBlueprintAsyncActionBase>();
	}
};

// Class Blutility.AsyncEditorDelay
// 0x0020 (0x0058 - 0x0038)
class UAsyncEditorDelay final : public UEditorUtilityBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              Complete;                                          // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncEditorDelay* AsyncEditorDelay(float Seconds, int32 MinimumFrames);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncEditorDelay">();
	}
	static class UAsyncEditorDelay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncEditorDelay>();
	}
};

// Class Blutility.AsyncEditorWaitForGameWorld
// 0x0018 (0x0050 - 0x0038)
class UAsyncEditorWaitForGameWorld final : public UEditorUtilityBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class UWorld* World)> Complete;                                          // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncEditorWaitForGameWorld* AsyncWaitForGameWorld(int32 Index_0, bool Server);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncEditorWaitForGameWorld">();
	}
	static class UAsyncEditorWaitForGameWorld* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncEditorWaitForGameWorld>();
	}
};

// Class Blutility.AsyncEditorOpenMapAndFocusActor
// 0x0048 (0x0080 - 0x0038)
class UAsyncEditorOpenMapAndFocusActor final : public UEditorUtilityBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              Complete;                                          // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x38];                                      // 0x0048(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncEditorOpenMapAndFocusActor* AsyncEditorOpenMapAndFocusActor(const struct FSoftObjectPath& Map, const class FString& FocusActorName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncEditorOpenMapAndFocusActor">();
	}
	static class UAsyncEditorOpenMapAndFocusActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncEditorOpenMapAndFocusActor>();
	}
};

// Class Blutility.EditorUtilityLibrary
// 0x0000 (0x0030 - 0x0030)
class UEditorUtilityLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ConvertToEditorUtilityWidget(class UWidgetBlueprint* WidgetBP);
	static struct FContentBrowserItemPath GetCurrentContentBrowserItemPath();
	static bool GetCurrentContentBrowserPath(class FString* OutPath);
	static TArray<struct FAssetData> GetSelectedAssetData();
	static TArray<class UObject*> GetSelectedAssets();
	static TArray<class UObject*> GetSelectedAssetsOfClass(class UClass* AssetClass);
	static TArray<class UClass*> GetSelectedBlueprintClasses();
	static TArray<class FString> GetSelectedFolderPaths();
	static TArray<class FString> GetSelectedPathViewFolderPaths();
	static void GetSelectionBounds(struct FVector* Origin, struct FVector* BoxExtent, float* SphereRadius);
	static TArray<class AActor*> GetSelectionSet();
	static void RenameAsset(class UObject* Asset, const class FString& NewName);
	static void SyncBrowserToFolders(const TArray<class FString>& FolderList);

	class AActor* GetActorReference(const class FString& PathToActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityLibrary">();
	}
	static class UEditorUtilityLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityLibrary>();
	}
};

// Class Blutility.EditorUtilitySubsystem
// 0x0268 (0x02A0 - 0x0038)
class alignas(0x10) UEditorUtilitySubsystem final : public UEditorSubsystem
{
public:
	TArray<struct FSoftObjectPath>                LoadedUIs;                                         // 0x0038(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                StartupObjects;                                    // 0x0048(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0xA0];                                      // 0x0058(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bIsSimulating)> OnBeginPIE;                                        // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsSimulating)> OnEndPIE;                                          // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x60];                                     // 0x0118(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UObject*, class UObject*>          ObjectInstances;                                   // 0x0178(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C8[0x68];                                     // 0x01C8(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEditorUtilityTask*>             ActiveTaskStack;                                   // 0x0230(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_240[0x10];                                     // 0x0240(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UObject*>                          ReferencedObjects;                                 // 0x0250(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	bool CloseTabByID(class FName NewTabID);
	bool DoesTabExist(class FName NewTabID);
	class UEditorUtilityWidget* FindUtilityWidgetFromBlueprint(class UEditorUtilityWidgetBlueprint* InBlueprint);
	void RegisterAndExecuteTask(class UEditorUtilityTask* NewTask, class UEditorUtilityTask* OptionalParentTask);
	void RegisterTabAndGetID(class UEditorUtilityWidgetBlueprint* InBlueprint, class FName* NewTabID);
	void RegisterTabAndGetIDGeneratedClass(class UClass* InGeneratedWidgetBlueprint, class FName* NewTabID);
	void ReleaseInstanceOfAsset(class UObject* Asset);
	class UEditorUtilityWidget* SpawnAndRegisterTab(class UEditorUtilityWidgetBlueprint* InBlueprint);
	class UEditorUtilityWidget* SpawnAndRegisterTabAndGetID(class UEditorUtilityWidgetBlueprint* InBlueprint, class FName* NewTabID);
	class UEditorUtilityWidget* SpawnAndRegisterTabAndGetIDGeneratedClass(class UClass* InGeneratedWidgetBlueprint, class FName* NewTabID);
	class UEditorUtilityWidget* SpawnAndRegisterTabGeneratedClass(class UClass* InGeneratedWidgetBlueprint);
	class UEditorUtilityWidget* SpawnAndRegisterTabWithId(class UEditorUtilityWidgetBlueprint* InBlueprint, class FName InTabID);
	class UEditorUtilityWidget* SpawnAndRegisterTabWithIdGeneratedClass(class UClass* InGeneratedWidgetBlueprint, class FName InTabID);
	bool SpawnRegisteredTabByID(class FName NewTabID);
	bool TryRun(class UObject* Asset);
	bool TryRunClass(class UClass* ObjectClass);
	bool UnregisterTabByID(class FName TabID);

	bool CanRun(class UObject* Asset) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilitySubsystem">();
	}
	static class UEditorUtilitySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilitySubsystem>();
	}
};

// Class Blutility.EditorUtilityTask
// 0x0038 (0x0068 - 0x0030)
class UEditorUtilityTask final : public UObject
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UEditorUtilitySubsystem*                MyTaskManager;                                     // 0x0048(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEditorUtilityTask*                     MyParentTask;                                      // 0x0050(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCancelRequested;                                  // 0x0058(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_59[0xF];                                       // 0x0059(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FinishExecutingTask();
	void ReceiveBeginExecution();
	void ReceiveCancelRequested();
	void Run();
	void SetTaskNotificationText(const class FText& Text);

	class FText GetTaskTitleOverride() const;
	bool WasCancelRequested() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityTask">();
	}
	static class UEditorUtilityTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityTask>();
	}
};

// Class Blutility.EditorUtilityToolMenuEntry
// 0x0000 (0x00D8 - 0x00D8)
class UEditorUtilityToolMenuEntry final : public UToolMenuEntryScript
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityToolMenuEntry">();
	}
	static class UEditorUtilityToolMenuEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityToolMenuEntry>();
	}
};

// Class Blutility.EditorUtilityToolMenuSection
// 0x0000 (0x0030 - 0x0030)
class UEditorUtilityToolMenuSection final : public UToolMenuSectionDynamic
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityToolMenuSection">();
	}
	static class UEditorUtilityToolMenuSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityToolMenuSection>();
	}
};

// Class Blutility.EditorUtilityWidget
// 0x0028 (0x0440 - 0x0418)
class UEditorUtilityWidget : public UUserWidget
{
public:
	class FText                                   TabDisplayName;                                    // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, AssetRegistrySearchable, Protected, NativeAccessSpecifierProtected)
	class FString                                 HelpText;                                          // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAlwaysReregisterWithWindowsMenu;                  // 0x0438(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoRunDefaultAction;                             // 0x0439(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_43A[0x6];                                      // 0x043A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Run();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityWidget">();
	}
	static class UEditorUtilityWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityWidget>();
	}
};

// Class Blutility.EditorUtilityWidgetBlueprint
// 0x0028 (0x05F8 - 0x05D0)
class UEditorUtilityWidgetBlueprint final : public UWidgetBlueprint
{
public:
	bool                                          bIsEnabledInPIE;                                   // 0x05D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsEnabledInDebugging;                             // 0x05D1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D2[0x1E];                                     // 0x05D2(0x001E)(Fixing Size After Last Property [ Dumper-7 ])
	class UEditorUtilityWidget*                   CreatedUMGWidget;                                  // 0x05F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityWidgetBlueprint">();
	}
	static class UEditorUtilityWidgetBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityWidgetBlueprint>();
	}
};

// Class Blutility.EditorUtilityWidgetBlueprintFactory
// 0x0018 (0x00A0 - 0x0088)
class UEditorUtilityWidgetBlueprintFactory final : public UFactory
{
public:
	EBlueprintType                                BlueprintType;                                     // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidget>                ParentClass;                                       // 0x0090(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityWidgetBlueprintFactory">();
	}
	static class UEditorUtilityWidgetBlueprintFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityWidgetBlueprintFactory>();
	}
};

// Class Blutility.EditorUtilityButton
// 0x0000 (0x0720 - 0x0720)
class UEditorUtilityButton final : public UButton
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityButton">();
	}
	static class UEditorUtilityButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityButton>();
	}
};

// Class Blutility.EditorUtilityCheckBox
// 0x0000 (0x0DC0 - 0x0DC0)
class UEditorUtilityCheckBox final : public UCheckBox
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityCheckBox">();
	}
	static class UEditorUtilityCheckBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityCheckBox>();
	}
};

// Class Blutility.EditorUtilityCircularThrobber
// 0x0000 (0x0350 - 0x0350)
class UEditorUtilityCircularThrobber final : public UCircularThrobber
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityCircularThrobber">();
	}
	static class UEditorUtilityCircularThrobber* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityCircularThrobber>();
	}
};

// Class Blutility.EditorUtilityComboBoxKey
// 0x0000 (0x1E90 - 0x1E90)
class UEditorUtilityComboBoxKey final : public UComboBoxKey
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityComboBoxKey">();
	}
	static class UEditorUtilityComboBoxKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityComboBoxKey>();
	}
};

// Class Blutility.EditorUtilityComboBoxString
// 0x0000 (0x1F20 - 0x1F20)
class UEditorUtilityComboBoxString final : public UComboBoxString
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityComboBoxString">();
	}
	static class UEditorUtilityComboBoxString* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityComboBoxString>();
	}
};

// Class Blutility.EditorUtilityEditableText
// 0x0000 (0x0610 - 0x0610)
class UEditorUtilityEditableText final : public UEditableText
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityEditableText">();
	}
	static class UEditorUtilityEditableText* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityEditableText>();
	}
};

// Class Blutility.EditorUtilityEditableTextBox
// 0x0000 (0x1220 - 0x1220)
class UEditorUtilityEditableTextBox final : public UEditableTextBox
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityEditableTextBox">();
	}
	static class UEditorUtilityEditableTextBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityEditableTextBox>();
	}
};

// Class Blutility.EditorUtilityExpandableArea
// 0x0000 (0x0560 - 0x0560)
class UEditorUtilityExpandableArea final : public UExpandableArea
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityExpandableArea">();
	}
	static class UEditorUtilityExpandableArea* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityExpandableArea>();
	}
};

// Class Blutility.EditorUtilityInputKeySelector
// 0x0000 (0x0A60 - 0x0A60)
class UEditorUtilityInputKeySelector final : public UInputKeySelector
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityInputKeySelector">();
	}
	static class UEditorUtilityInputKeySelector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityInputKeySelector>();
	}
};

// Class Blutility.EditorUtilityListView
// 0x0000 (0x0D80 - 0x0D80)
class UEditorUtilityListView final : public UListView
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityListView">();
	}
	static class UEditorUtilityListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityListView>();
	}
};

// Class Blutility.EditorUtilityMultiLineEditableText
// 0x0000 (0x0650 - 0x0650)
class UEditorUtilityMultiLineEditableText final : public UMultiLineEditableText
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityMultiLineEditableText">();
	}
	static class UEditorUtilityMultiLineEditableText* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityMultiLineEditableText>();
	}
};

// Class Blutility.EditorUtilityMultiLineEditableTextBox
// 0x0000 (0x1550 - 0x1550)
class UEditorUtilityMultiLineEditableTextBox final : public UMultiLineEditableTextBox
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityMultiLineEditableTextBox">();
	}
	static class UEditorUtilityMultiLineEditableTextBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityMultiLineEditableTextBox>();
	}
};

// Class Blutility.EditorUtilityProgressBar
// 0x0000 (0x0560 - 0x0560)
class UEditorUtilityProgressBar final : public UProgressBar
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityProgressBar">();
	}
	static class UEditorUtilityProgressBar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityProgressBar>();
	}
};

// Class Blutility.EditorUtilityScrollBar
// 0x0000 (0x0A00 - 0x0A00)
class UEditorUtilityScrollBar final : public UScrollBar
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityScrollBar">();
	}
	static class UEditorUtilityScrollBar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityScrollBar>();
	}
};

// Class Blutility.EditorUtilityScrollBox
// 0x0000 (0x0DE0 - 0x0DE0)
class UEditorUtilityScrollBox final : public UScrollBox
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityScrollBox">();
	}
	static class UEditorUtilityScrollBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityScrollBox>();
	}
};

// Class Blutility.EditorUtilitySlider
// 0x0000 (0x0810 - 0x0810)
class UEditorUtilitySlider final : public USlider
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilitySlider">();
	}
	static class UEditorUtilitySlider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilitySlider>();
	}
};

// Class Blutility.EditorUtilitySpinBox
// 0x0000 (0x0990 - 0x0990)
class UEditorUtilitySpinBox final : public USpinBox
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilitySpinBox">();
	}
	static class UEditorUtilitySpinBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilitySpinBox>();
	}
};

// Class Blutility.EditorUtilityThrobber
// 0x0000 (0x0340 - 0x0340)
class UEditorUtilityThrobber final : public UThrobber
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityThrobber">();
	}
	static class UEditorUtilityThrobber* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityThrobber>();
	}
};

// Class Blutility.EditorUtilityTreeView
// 0x0000 (0x0DE0 - 0x0DE0)
class UEditorUtilityTreeView final : public UTreeView
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityTreeView">();
	}
	static class UEditorUtilityTreeView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityTreeView>();
	}
};

// Class Blutility.EditorUtilityWidgetProjectSettings
// 0x01D8 (0x0470 - 0x0298)
class UEditorUtilityWidgetProjectSettings final : public UWidgetEditingProjectSettings
{
public:
	bool                                          bSearchGeneratedClassesForScriptedActions;         // 0x0298(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_299[0x1D7];                                    // 0x0299(0x01D7)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityWidgetProjectSettings">();
	}
	static class UEditorUtilityWidgetProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorUtilityWidgetProjectSettings>();
	}
};

// Class Blutility.GlobalEditorUtilityBase
// 0x0038 (0x0068 - 0x0030)
class UGlobalEditorUtilityBase final : public UObject
{
public:
	class FString                                 HelpText;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDirtiedSelectionSet;                              // 0x0040(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoRunDefaultAction;                             // 0x0041(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AActor* Actor, int32 Index)> OnEachSelectedActor;                               // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* Asset, int32 Index)> OnEachSelectedAsset;                               // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void ClearActorSelectionSet();
	void ForEachSelectedActor();
	void ForEachSelectedAsset();
	class AActor* GetActorReference(const class FString& PathToActor);
	class UEditorPerProjectUserSettings* GetEditorUserSettings();
	TArray<class UObject*> GetSelectedAssets();
	void GetSelectionBounds(struct FVector* Origin, struct FVector* BoxExtent, float* SphereRadius);
	TArray<class AActor*> GetSelectionSet();
	void OnDefaultActionClicked();
	void RenameAsset(class UObject* Asset, const class FString& NewName);
	void SelectNothing();
	void SetActorSelectionState(class AActor* Actor, bool bShouldBeSelected);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GlobalEditorUtilityBase">();
	}
	static class UGlobalEditorUtilityBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGlobalEditorUtilityBase>();
	}
};

// Class Blutility.EditorUtilityExtension
// 0x0000 (0x0030 - 0x0030)
class IEditorUtilityExtension final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorUtilityExtension">();
	}
	static class IEditorUtilityExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<IEditorUtilityExtension>();
	}
};

// Class Blutility.PlacedEditorUtilityBase
// 0x0010 (0x0430 - 0x0420)
class APlacedEditorUtilityBase final : public AActor
{
public:
	class FString                                 HelpText;                                          // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ClearActorSelectionSet();
	class AActor* GetActorReference(const class FString& PathToActor);
	bool GetLevelViewportCameraInfo(struct FVector* CameraLocation, struct FRotator* CameraRotation);
	TArray<class AActor*> GetSelectionSet();
	void SelectNothing();
	void SetActorSelectionState(class AActor* Actor, bool bShouldBeSelected);
	void SetLevelViewportCameraInfo(const struct FVector& CameraLocation, const struct FRotator& CameraRotation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlacedEditorUtilityBase">();
	}
	static class APlacedEditorUtilityBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlacedEditorUtilityBase>();
	}
};

// Class Blutility.ToolMenuWidget
// 0x0038 (0x0288 - 0x0250)
class UToolMenuWidget final : public UWidget
{
public:
	class FString                                 MenuName;                                          // 0x0250(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMultiBoxType                                 MenuType;                                          // 0x0260(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_261[0x17];                                     // 0x0261(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   FullMenuName;                                      // 0x0278(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolMenuWidget">();
	}
	static class UToolMenuWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolMenuWidget>();
	}
};

}

