#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blutility

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ContentBrowserData_structs.hpp"


namespace SDK::Params
{

// Function Blutility.ActorActionUtility.GetSupportedClass
// 0x0008 (0x0008 - 0x0000)
struct ActorActionUtility_GetSupportedClass final
{
public:
	class UClass*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.ActorActionUtility.GetSupportedClasses
// 0x0010 (0x0010 - 0x0000)
struct ActorActionUtility_GetSupportedClasses final
{
public:
	TArray<TSoftClassPtr<class UClass>>           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function Blutility.AssetActionUtility.GetSupportedClass
// 0x0008 (0x0008 - 0x0000)
struct AssetActionUtility_GetSupportedClass final
{
public:
	class UClass*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.AssetActionUtility.GetSupportedClasses
// 0x0010 (0x0010 - 0x0000)
struct AssetActionUtility_GetSupportedClasses final
{
public:
	TArray<TSoftClassPtr<class UClass>>           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function Blutility.AssetActionUtility.IsActionForBlueprints
// 0x0001 (0x0001 - 0x0000)
struct AssetActionUtility_IsActionForBlueprints final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.AsyncCaptureScene.CaptureSceneAsync
// 0x0020 (0x0020 - 0x0000)
struct AsyncCaptureScene_CaptureSceneAsync final
{
public:
	class UCameraComponent*                       ViewCamera;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASceneCapture2D>            SceneCaptureClass;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ResX;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ResY;                                              // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncCaptureScene*                     ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.AsyncCaptureScene.CaptureSceneWithWarmupAsync
// 0x0028 (0x0028 - 0x0000)
struct AsyncCaptureScene_CaptureSceneWithWarmupAsync final
{
public:
	class UCameraComponent*                       ViewCamera;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASceneCapture2D>            SceneCaptureClass;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ResX;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ResY;                                              // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WarmUpFrames;                                      // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncCaptureScene*                     ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.AsyncImageExport.ExportImageAsync
// 0x0028 (0x0028 - 0x0000)
struct AsyncImageExport_ExportImageAsync final
{
public:
	class UTexture*                               Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutputFile;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Quality_0;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncImageExport*                      ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.AsyncRegisterAndExecuteTask.RegisterAndExecuteTask
// 0x0018 (0x0018 - 0x0000)
struct AsyncRegisterAndExecuteTask_RegisterAndExecuteTask final
{
public:
	class UEditorUtilityTask*                     Task;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEditorUtilityTask*                     OptionalParentTask;                                // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncRegisterAndExecuteTask*           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilityActor.SetReceivesEditorInput
// 0x0001 (0x0001 - 0x0000)
struct EditorUtilityActor_SetReceivesEditorInput final
{
public:
	bool                                          bInValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilityActor.GetInputComponent
// 0x0008 (0x0008 - 0x0000)
struct EditorUtilityActor_GetInputComponent final
{
public:
	class UInputComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilityActor.GetReceivesEditorInput
// 0x0001 (0x0001 - 0x0000)
struct EditorUtilityActor_GetReceivesEditorInput final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.AsyncEditorDelay.AsyncEditorDelay
// 0x0010 (0x0010 - 0x0000)
struct AsyncEditorDelay_AsyncEditorDelay final
{
public:
	float                                         Seconds;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinimumFrames;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncEditorDelay*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.AsyncEditorWaitForGameWorld.AsyncWaitForGameWorld
// 0x0010 (0x0010 - 0x0000)
struct AsyncEditorWaitForGameWorld_AsyncWaitForGameWorld final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Server;                                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncEditorWaitForGameWorld*           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.AsyncEditorOpenMapAndFocusActor.AsyncEditorOpenMapAndFocusActor
// 0x0040 (0x0040 - 0x0000)
struct AsyncEditorOpenMapAndFocusActor_AsyncEditorOpenMapAndFocusActor final
{
public:
	struct FSoftObjectPath                        Map;                                               // 0x0000(0x0028)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FocusActorName;                                    // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncEditorOpenMapAndFocusActor*       ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilityLibrary.ConvertToEditorUtilityWidget
// 0x0008 (0x0008 - 0x0000)
struct EditorUtilityLibrary_ConvertToEditorUtilityWidget final
{
public:
	class UWidgetBlueprint*                       WidgetBP;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilityLibrary.GetCurrentContentBrowserItemPath
// 0x0018 (0x0018 - 0x0000)
struct EditorUtilityLibrary_GetCurrentContentBrowserItemPath final
{
public:
	struct FContentBrowserItemPath                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilityLibrary.GetCurrentContentBrowserPath
// 0x0018 (0x0018 - 0x0000)
struct EditorUtilityLibrary_GetCurrentContentBrowserPath final
{
public:
	class FString                                 OutPath;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Blutility.EditorUtilityLibrary.GetSelectedAssetData
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilityLibrary_GetSelectedAssetData final
{
public:
	TArray<struct FAssetData>                     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilityLibrary.GetSelectedAssets
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilityLibrary_GetSelectedAssets final
{
public:
	TArray<class UObject*>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilityLibrary.GetSelectedAssetsOfClass
// 0x0018 (0x0018 - 0x0000)
struct EditorUtilityLibrary_GetSelectedAssetsOfClass final
{
public:
	class UClass*                                 AssetClass;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilityLibrary.GetSelectedBlueprintClasses
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilityLibrary_GetSelectedBlueprintClasses final
{
public:
	TArray<class UClass*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilityLibrary.GetSelectedFolderPaths
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilityLibrary_GetSelectedFolderPaths final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilityLibrary.GetSelectedPathViewFolderPaths
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilityLibrary_GetSelectedPathViewFolderPaths final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilityLibrary.GetSelectionBounds
// 0x0038 (0x0038 - 0x0000)
struct EditorUtilityLibrary_GetSelectionBounds final
{
public:
	struct FVector                                Origin;                                            // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BoxExtent;                                         // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SphereRadius;                                      // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Blutility.EditorUtilityLibrary.GetSelectionSet
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilityLibrary_GetSelectionSet final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilityLibrary.RenameAsset
// 0x0018 (0x0018 - 0x0000)
struct EditorUtilityLibrary_RenameAsset final
{
public:
	class UObject*                                Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewName;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilityLibrary.SyncBrowserToFolders
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilityLibrary_SyncBrowserToFolders final
{
public:
	TArray<class FString>                         FolderList;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilityLibrary.GetActorReference
// 0x0018 (0x0018 - 0x0000)
struct EditorUtilityLibrary_GetActorReference final
{
public:
	class FString                                 PathToActor;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilitySubsystem.CloseTabByID
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilitySubsystem_CloseTabByID final
{
public:
	class FName                                   NewTabID;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Blutility.EditorUtilitySubsystem.DoesTabExist
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilitySubsystem_DoesTabExist final
{
public:
	class FName                                   NewTabID;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Blutility.EditorUtilitySubsystem.FindUtilityWidgetFromBlueprint
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilitySubsystem_FindUtilityWidgetFromBlueprint final
{
public:
	class UEditorUtilityWidgetBlueprint*          InBlueprint;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEditorUtilityWidget*                   ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilitySubsystem.RegisterAndExecuteTask
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilitySubsystem_RegisterAndExecuteTask final
{
public:
	class UEditorUtilityTask*                     NewTask;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEditorUtilityTask*                     OptionalParentTask;                                // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilitySubsystem.RegisterTabAndGetID
// 0x0018 (0x0018 - 0x0000)
struct EditorUtilitySubsystem_RegisterTabAndGetID final
{
public:
	class UEditorUtilityWidgetBlueprint*          InBlueprint;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewTabID;                                          // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Blutility.EditorUtilitySubsystem.RegisterTabAndGetIDGeneratedClass
// 0x0018 (0x0018 - 0x0000)
struct EditorUtilitySubsystem_RegisterTabAndGetIDGeneratedClass final
{
public:
	class UClass*                                 InGeneratedWidgetBlueprint;                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewTabID;                                          // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Blutility.EditorUtilitySubsystem.ReleaseInstanceOfAsset
// 0x0008 (0x0008 - 0x0000)
struct EditorUtilitySubsystem_ReleaseInstanceOfAsset final
{
public:
	class UObject*                                Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilitySubsystem.SpawnAndRegisterTab
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilitySubsystem_SpawnAndRegisterTab final
{
public:
	class UEditorUtilityWidgetBlueprint*          InBlueprint;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEditorUtilityWidget*                   ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilitySubsystem.SpawnAndRegisterTabAndGetID
// 0x0020 (0x0020 - 0x0000)
struct EditorUtilitySubsystem_SpawnAndRegisterTabAndGetID final
{
public:
	class UEditorUtilityWidgetBlueprint*          InBlueprint;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewTabID;                                          // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEditorUtilityWidget*                   ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilitySubsystem.SpawnAndRegisterTabAndGetIDGeneratedClass
// 0x0020 (0x0020 - 0x0000)
struct EditorUtilitySubsystem_SpawnAndRegisterTabAndGetIDGeneratedClass final
{
public:
	class UClass*                                 InGeneratedWidgetBlueprint;                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewTabID;                                          // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEditorUtilityWidget*                   ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilitySubsystem.SpawnAndRegisterTabGeneratedClass
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilitySubsystem_SpawnAndRegisterTabGeneratedClass final
{
public:
	class UClass*                                 InGeneratedWidgetBlueprint;                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEditorUtilityWidget*                   ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilitySubsystem.SpawnAndRegisterTabWithId
// 0x0020 (0x0020 - 0x0000)
struct EditorUtilitySubsystem_SpawnAndRegisterTabWithId final
{
public:
	class UEditorUtilityWidgetBlueprint*          InBlueprint;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InTabID;                                           // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEditorUtilityWidget*                   ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilitySubsystem.SpawnAndRegisterTabWithIdGeneratedClass
// 0x0020 (0x0020 - 0x0000)
struct EditorUtilitySubsystem_SpawnAndRegisterTabWithIdGeneratedClass final
{
public:
	class UClass*                                 InGeneratedWidgetBlueprint;                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InTabID;                                           // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEditorUtilityWidget*                   ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilitySubsystem.SpawnRegisteredTabByID
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilitySubsystem_SpawnRegisteredTabByID final
{
public:
	class FName                                   NewTabID;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Blutility.EditorUtilitySubsystem.TryRun
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilitySubsystem_TryRun final
{
public:
	class UObject*                                Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Blutility.EditorUtilitySubsystem.TryRunClass
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilitySubsystem_TryRunClass final
{
public:
	class UClass*                                 ObjectClass;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Blutility.EditorUtilitySubsystem.UnregisterTabByID
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilitySubsystem_UnregisterTabByID final
{
public:
	class FName                                   TabID;                                             // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Blutility.EditorUtilitySubsystem.CanRun
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilitySubsystem_CanRun final
{
public:
	class UObject*                                Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Blutility.EditorUtilityTask.SetTaskNotificationText
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilityTask_SetTaskNotificationText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilityTask.GetTaskTitleOverride
// 0x0010 (0x0010 - 0x0000)
struct EditorUtilityTask_GetTaskTitleOverride final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function Blutility.EditorUtilityTask.WasCancelRequested
// 0x0001 (0x0001 - 0x0000)
struct EditorUtilityTask_WasCancelRequested final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.GlobalEditorUtilityBase.GetActorReference
// 0x0018 (0x0018 - 0x0000)
struct GlobalEditorUtilityBase_GetActorReference final
{
public:
	class FString                                 PathToActor;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.GlobalEditorUtilityBase.GetEditorUserSettings
// 0x0008 (0x0008 - 0x0000)
struct GlobalEditorUtilityBase_GetEditorUserSettings final
{
public:
	class UEditorPerProjectUserSettings*          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.GlobalEditorUtilityBase.GetSelectedAssets
// 0x0010 (0x0010 - 0x0000)
struct GlobalEditorUtilityBase_GetSelectedAssets final
{
public:
	TArray<class UObject*>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function Blutility.GlobalEditorUtilityBase.GetSelectionBounds
// 0x0038 (0x0038 - 0x0000)
struct GlobalEditorUtilityBase_GetSelectionBounds final
{
public:
	struct FVector                                Origin;                                            // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BoxExtent;                                         // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SphereRadius;                                      // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Blutility.GlobalEditorUtilityBase.GetSelectionSet
// 0x0010 (0x0010 - 0x0000)
struct GlobalEditorUtilityBase_GetSelectionSet final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function Blutility.GlobalEditorUtilityBase.RenameAsset
// 0x0018 (0x0018 - 0x0000)
struct GlobalEditorUtilityBase_RenameAsset final
{
public:
	class UObject*                                Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewName;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.GlobalEditorUtilityBase.SetActorSelectionState
// 0x0010 (0x0010 - 0x0000)
struct GlobalEditorUtilityBase_SetActorSelectionState final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldBeSelected;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Blutility.PlacedEditorUtilityBase.GetActorReference
// 0x0018 (0x0018 - 0x0000)
struct PlacedEditorUtilityBase_GetActorReference final
{
public:
	class FString                                 PathToActor;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Blutility.PlacedEditorUtilityBase.GetLevelViewportCameraInfo
// 0x0038 (0x0038 - 0x0000)
struct PlacedEditorUtilityBase_GetLevelViewportCameraInfo final
{
public:
	struct FVector                                CameraLocation;                                    // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               CameraRotation;                                    // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Blutility.PlacedEditorUtilityBase.GetSelectionSet
// 0x0010 (0x0010 - 0x0000)
struct PlacedEditorUtilityBase_GetSelectionSet final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function Blutility.PlacedEditorUtilityBase.SetActorSelectionState
// 0x0010 (0x0010 - 0x0000)
struct PlacedEditorUtilityBase_SetActorSelectionState final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldBeSelected;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Blutility.PlacedEditorUtilityBase.SetLevelViewportCameraInfo
// 0x0030 (0x0030 - 0x0000)
struct PlacedEditorUtilityBase_SetLevelViewportCameraInfo final
{
public:
	struct FVector                                CameraLocation;                                    // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               CameraRotation;                                    // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

}

