#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blutility

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct Blutility.AssetActionSupportCondition
// 0x0028 (0x0028 - 0x0000)
struct FAssetActionSupportCondition final
{
public:
	class FString                                 Filter;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FailureReason;                                     // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowInMenuIfFilterFails;                          // 0x0020(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Blutility.BlutilityFunctionData
// 0x0070 (0x0070 - 0x0000)
struct FBlutilityFunctionData final
{
public:
	TSoftClassPtr<class UClass>                   Class;                                             // 0x0000(0x0030)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NameText;                                          // 0x0040(0x0010)(NativeAccessSpecifierPublic)
	class FString                                 Category;                                          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   TooltipText;                                       // 0x0060(0x0010)(NativeAccessSpecifierPublic)
};

}

