#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BuilderTool

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "BuilderTool_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class BuilderTool.BuilderToolSelectedActorInterface
// 0x0000 (0x0030 - 0x0030)
class IBuilderToolSelectedActorInterface final : public IInterface
{
public:
	void ReceiveSelectionSpawnedByBuilderTool(class ABuilderTool* BuilderTool, class UBuilderToolBehavior* Behavior, const struct FBuilderToolSelectionSpawnParams& SelectionSpawnParameters);
	void ReceiveSpawnedByBuilderTool(class ABuilderTool* BuilderTool, class UBuilderToolBehavior* Behavior);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuilderToolSelectedActorInterface">();
	}
	static class IBuilderToolSelectedActorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBuilderToolSelectedActorInterface>();
	}
};

// Class BuilderTool.BuilderTool
// 0x0070 (0x1930 - 0x18C0)
class ABuilderTool : public AFortWeapon
{
public:
	TMulticastInlineDelegate<void(class ABuilderTool* BuilderTool, class UBuilderToolBehavior* Behavior)> OnInteractionStarted;                              // 0x18C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class ABuilderTool* BuilderTool, class UBuilderToolBehavior* Behavior)> OnInteractionStopped;                              // 0x18D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UInputMappingContext*                   InputMappingContext;                               // 0x18E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         InputMappingPriority;                              // 0x18E8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_18EC[0x4];                                     // 0x18EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           UnEquipInputAction;                                // 0x18F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  ActivatedTags;                                     // 0x18F8(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<class UBuilderToolBehavior*>           Behaviors;                                         // 0x1918(0x0010)(Edit, ExportObject, Net, ZeroConstructor, Transient, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UBuilderToolBehavior*                   ActiveBehavior;                                    // 0x1928(0x0008)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ClientStartInteraction(class UBuilderToolBehavior* Behavior, const TArray<struct FBuilderToolSelectedActor>& SelectedActors, const struct FGuid& SelectionGUID);
	void ClientStopInteraction(const bool bIsExiting);
	void MulticastClearInteractionOnRemoteClients();
	void MulticastStartInteractionOnRemoteClients(class UBuilderToolBehavior* Behavior, const TArray<struct FBuilderToolSelectedActor>& SelectedActors, const struct FGuid& SelectionGUID);
	void ReceiveInteractionEnded(class UBuilderToolBehavior* Behavior);
	void ReceiveInteractionStarted(class UBuilderToolBehavior* Behavior);
	void RequestInteractionOnClient(const TSubclassOf<class AActor>& ActorClass, const struct FGuid& SelectionGUID);
	void RequestInteractionWithActorOnClient(const class AActor* Actor, const struct FGuid& SelectionGUID);
	void ServerClearInteraction(const bool bExited);
	void ServerStartInteraction(const TArray<struct FBuilderToolSelectedActor>& SelectedActors, const struct FGuid& SelectionGUID);

	const class UBuilderToolBehavior* GetActiveBehavior() const;
	TArray<struct FBuilderToolSelectedActor> GetSelectedActors() const;
	struct FGuid GetSelectionGUID() const;
	bool IsRunningOnOwningClient() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuilderTool">();
	}
	static class ABuilderTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABuilderTool>();
	}
};

// Class BuilderTool.BuilderToolBehavior
// 0x01C0 (0x0298 - 0x00D8)
class UBuilderToolBehavior : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(class UBuilderToolBehavior* Behavior)> OnInteractionStart;                                // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UBuilderToolBehavior* Behavior)> OnInteractionTrigger;                              // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UBuilderToolBehavior* Behavior)> OnInteractionEnd;                                  // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UBuilderToolBehavior* Behavior)> OnInteractionExit;                                 // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bShouldAddToParent;                                // 0x0118(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Priority;                                          // 0x011C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    ConfigData;                                        // 0x0120(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  ActivatedTags;                                     // 0x0138(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UInputMappingContext*                   InputMappingContext;                               // 0x0158(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         InputMappingPriority;                              // 0x0160(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           TriggerInputAction;                                // 0x0168(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInputAction*                           ExitInputAction;                                   // 0x0170(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_178[0x10];                                     // 0x0178(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortGameplayAbility>       StartInteractionAbility;                           // 0x0188(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortGameplayAbility>       EndInteractionAbility;                             // 0x0190(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortGameplayAbility>       FailAbility;                                       // 0x0198(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortGameplayAbility>       ExitAbility;                                       // 0x01A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBuilderToolActorClassSet              SupportedClasses;                                  // 0x01A8(0x00A0)(Edit, Transient, EditConst, NativeAccessSpecifierPrivate)
	TArray<struct FBuilderToolSelectedActor>      SelectedActors;                                    // 0x0248(0x0010)(Edit, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPrivate)
	struct FGuid                                  SelectionGUID;                                     // 0x0258(0x0010)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FBuilderToolTimedActors>        ClientPredictedActors;                             // 0x0268(0x0010)(Edit, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPrivate)
	TArray<struct FServerSpawnedActorPair>        ServerSpawnedActors;                               // 0x0278(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_288[0x10];                                     // 0x0288(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientOnServerSpawnSelectedActorsFailed(const TArray<class FName>& FailedNames);
	void OnRep_ServerSpawnedActors();
	void PlayGameplayAbility(const TSubclassOf<class UFortGameplayAbility> AbilityClass);
	void ReceiveClearInteractionOnRemoteClient();
	void ReceiveEndInteraction();
	void ReceiveExitInteraction(const bool bClearInteraction);
	void ReceiveSpawnedActor(class AActor* SpawnedActor);
	void ReceiveStartInteractionOnClient(const TArray<struct FBuilderToolSelectedActor>& Actors, const struct FGuid& GUID);
	void ReceiveStartInteractionOnRemoteClient(const TArray<struct FBuilderToolSelectedActor>& Actors, const struct FGuid& GUID);
	void ReceiveStartInteractionOnServer(const TArray<struct FBuilderToolSelectedActor>& Actors, const struct FGuid& GUID);
	void ReceiveTickInteraction();
	void ReceiveTriggerInteraction();
	void ServerOnSpawnedActorProcessedByClient(const class FName StableName);
	void ServerSpawnSelectedActors(const struct FBuilderToolSelectionSpawnParams& SelectionSpawnParameters);

	class ABuilderTool* GetBuilderTool() const;
	class AFortPlayerController* GetFortPlayerController() const;
	class APawn* GetInstigator() const;
	class APlayerController* GetPlayerController() const;
	const TArray<struct FBuilderToolSelectedActor> GetSelectedActors() const;
	const struct FGuid GetSelectionGUID() const;
	bool IsActiveBehavior() const;
	bool IsRunningOnOwningClient() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuilderToolBehavior">();
	}
	static class UBuilderToolBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuilderToolBehavior>();
	}
};

}

