#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BuilderTool

#include "Basic.hpp"

#include "BuilderTool_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BuilderTool.BuilderToolSelectedActorInterface.ReceiveSelectionSpawnedByBuilderTool
// 0x00C0 (0x00C0 - 0x0000)
struct BuilderToolSelectedActorInterface_ReceiveSelectionSpawnedByBuilderTool final
{
public:
	class ABuilderTool*                           BuilderTool;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBuilderToolBehavior*                   Behavior;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBuilderToolSelectionSpawnParams       SelectionSpawnParameters;                          // 0x0010(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderToolSelectedActorInterface.ReceiveSpawnedByBuilderTool
// 0x0010 (0x0010 - 0x0000)
struct BuilderToolSelectedActorInterface_ReceiveSpawnedByBuilderTool final
{
public:
	class ABuilderTool*                           BuilderTool;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBuilderToolBehavior*                   Behavior;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderTool.ClientStartInteraction
// 0x0028 (0x0028 - 0x0000)
struct BuilderTool_ClientStartInteraction final
{
public:
	class UBuilderToolBehavior*                   Behavior;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBuilderToolSelectedActor>      SelectedActors;                                    // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGuid                                  SelectionGUID;                                     // 0x0018(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderTool.ClientStopInteraction
// 0x0001 (0x0001 - 0x0000)
struct BuilderTool_ClientStopInteraction final
{
public:
	bool                                          bIsExiting;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderTool.MulticastStartInteractionOnRemoteClients
// 0x0028 (0x0028 - 0x0000)
struct BuilderTool_MulticastStartInteractionOnRemoteClients final
{
public:
	class UBuilderToolBehavior*                   Behavior;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBuilderToolSelectedActor>      SelectedActors;                                    // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGuid                                  SelectionGUID;                                     // 0x0018(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderTool.ReceiveInteractionEnded
// 0x0008 (0x0008 - 0x0000)
struct BuilderTool_ReceiveInteractionEnded final
{
public:
	class UBuilderToolBehavior*                   Behavior;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderTool.ReceiveInteractionStarted
// 0x0008 (0x0008 - 0x0000)
struct BuilderTool_ReceiveInteractionStarted final
{
public:
	class UBuilderToolBehavior*                   Behavior;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderTool.RequestInteractionOnClient
// 0x0018 (0x0018 - 0x0000)
struct BuilderTool_RequestInteractionOnClient final
{
public:
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  SelectionGUID;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderTool.RequestInteractionWithActorOnClient
// 0x0018 (0x0018 - 0x0000)
struct BuilderTool_RequestInteractionWithActorOnClient final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  SelectionGUID;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderTool.ServerClearInteraction
// 0x0001 (0x0001 - 0x0000)
struct BuilderTool_ServerClearInteraction final
{
public:
	bool                                          bExited;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderTool.ServerStartInteraction
// 0x0020 (0x0020 - 0x0000)
struct BuilderTool_ServerStartInteraction final
{
public:
	TArray<struct FBuilderToolSelectedActor>      SelectedActors;                                    // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGuid                                  SelectionGUID;                                     // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderTool.GetActiveBehavior
// 0x0008 (0x0008 - 0x0000)
struct BuilderTool_GetActiveBehavior final
{
public:
	const class UBuilderToolBehavior*             ReturnValue;                                       // 0x0000(0x0008)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderTool.GetSelectedActors
// 0x0010 (0x0010 - 0x0000)
struct BuilderTool_GetSelectedActors final
{
public:
	TArray<struct FBuilderToolSelectedActor>      ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderTool.GetSelectionGUID
// 0x0010 (0x0010 - 0x0000)
struct BuilderTool_GetSelectionGUID final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderTool.IsRunningOnOwningClient
// 0x0001 (0x0001 - 0x0000)
struct BuilderTool_IsRunningOnOwningClient final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderToolBehavior.ClientOnServerSpawnSelectedActorsFailed
// 0x0010 (0x0010 - 0x0000)
struct BuilderToolBehavior_ClientOnServerSpawnSelectedActorsFailed final
{
public:
	TArray<class FName>                           FailedNames;                                       // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderToolBehavior.PlayGameplayAbility
// 0x0008 (0x0008 - 0x0000)
struct BuilderToolBehavior_PlayGameplayAbility final
{
public:
	TSubclassOf<class UFortGameplayAbility>       AbilityClass;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderToolBehavior.ReceiveExitInteraction
// 0x0001 (0x0001 - 0x0000)
struct BuilderToolBehavior_ReceiveExitInteraction final
{
public:
	bool                                          bClearInteraction;                                 // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderToolBehavior.ReceiveSpawnedActor
// 0x0008 (0x0008 - 0x0000)
struct BuilderToolBehavior_ReceiveSpawnedActor final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderToolBehavior.ReceiveStartInteractionOnClient
// 0x0020 (0x0020 - 0x0000)
struct BuilderToolBehavior_ReceiveStartInteractionOnClient final
{
public:
	TArray<struct FBuilderToolSelectedActor>      Actors;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGuid                                  GUID;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderToolBehavior.ReceiveStartInteractionOnRemoteClient
// 0x0020 (0x0020 - 0x0000)
struct BuilderToolBehavior_ReceiveStartInteractionOnRemoteClient final
{
public:
	TArray<struct FBuilderToolSelectedActor>      Actors;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGuid                                  GUID;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderToolBehavior.ReceiveStartInteractionOnServer
// 0x0020 (0x0020 - 0x0000)
struct BuilderToolBehavior_ReceiveStartInteractionOnServer final
{
public:
	TArray<struct FBuilderToolSelectedActor>      Actors;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGuid                                  GUID;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderToolBehavior.ServerOnSpawnedActorProcessedByClient
// 0x000C (0x000C - 0x0000)
struct BuilderToolBehavior_ServerOnSpawnedActorProcessedByClient final
{
public:
	class FName                                   StableName;                                        // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderToolBehavior.ServerSpawnSelectedActors
// 0x00B0 (0x00B0 - 0x0000)
struct BuilderToolBehavior_ServerSpawnSelectedActors final
{
public:
	struct FBuilderToolSelectionSpawnParams       SelectionSpawnParameters;                          // 0x0000(0x00B0)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderToolBehavior.GetBuilderTool
// 0x0008 (0x0008 - 0x0000)
struct BuilderToolBehavior_GetBuilderTool final
{
public:
	class ABuilderTool*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderToolBehavior.GetFortPlayerController
// 0x0008 (0x0008 - 0x0000)
struct BuilderToolBehavior_GetFortPlayerController final
{
public:
	class AFortPlayerController*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderToolBehavior.GetInstigator
// 0x0008 (0x0008 - 0x0000)
struct BuilderToolBehavior_GetInstigator final
{
public:
	class APawn*                                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderToolBehavior.GetPlayerController
// 0x0008 (0x0008 - 0x0000)
struct BuilderToolBehavior_GetPlayerController final
{
public:
	class APlayerController*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderToolBehavior.GetSelectedActors
// 0x0010 (0x0010 - 0x0000)
struct BuilderToolBehavior_GetSelectedActors final
{
public:
	TArray<struct FBuilderToolSelectedActor>      ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderToolBehavior.GetSelectionGUID
// 0x0010 (0x0010 - 0x0000)
struct BuilderToolBehavior_GetSelectionGUID final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderToolBehavior.IsActiveBehavior
// 0x0001 (0x0001 - 0x0000)
struct BuilderToolBehavior_IsActiveBehavior final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function BuilderTool.BuilderToolBehavior.IsRunningOnOwningClient
// 0x0001 (0x0001 - 0x0000)
struct BuilderToolBehavior_IsRunningOnOwningClient final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

