#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BuilderTool

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// ScriptStruct BuilderTool.ServerSpawnedActorPair
// 0x0014 (0x0014 - 0x0000)
struct FServerSpawnedActorPair final
{
public:
	TWeakObjectPtr<class AActor>                  Actor;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StableName;                                        // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BuilderTool.BuilderToolSelectedActor
// 0x0070 (0x0070 - 0x0000)
struct FBuilderToolSelectedActor final
{
public:
	TSubclassOf<class AActor>                     Class;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ToSelection;                                       // 0x0010(0x0060)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BuilderTool.BuilderToolActorClassSet
// 0x00A0 (0x00A0 - 0x0000)
struct FBuilderToolActorClassSet final
{
public:
	TSet<TSoftClassPtr<class UClass>>             Classes;                                           // 0x0000(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)
	TSet<TSoftClassPtr<class UClass>>             ExcludedSubclasses;                                // 0x0050(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct BuilderTool.BuilderToolBehaviorRow
// 0x00A0 (0x00A8 - 0x0008)
struct FBuilderToolBehaviorRow : public FTableRowBase
{
public:
	struct FBuilderToolActorClassSet              SupportedClasses;                                  // 0x0008(0x00A0)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct BuilderTool.BuilderToolSupportActorComponentPair
// 0x0010 (0x0010 - 0x0000)
struct FBuilderToolSupportActorComponentPair final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BuilderTool.BuilderToolSupportCandidate
// 0x0010 (0x0010 - 0x0000)
struct FBuilderToolSupportCandidate final
{
public:
	TWeakObjectPtr<class AActor>                  Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UPrimitiveComponent>     Component;                                         // 0x0008(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BuilderTool.BuilderToolSelectionSpawnParams
// 0x00B0 (0x00B0 - 0x0000)
struct FBuilderToolSelectionSpawnParams final
{
public:
	TArray<struct FBuilderToolSelectedActor>      SelectedActors;                                    // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FTransform                             SelectionTransform;                                // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  Instigator;                                        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x0078(0x0020)(NativeAccessSpecifierPublic)
	TArray<class FName>                           StableNames;                                       // 0x0098(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BuilderTool.BuilderToolTimedActors
// 0x0018 (0x0018 - 0x0000)
struct FBuilderToolTimedActors final
{
public:
	TArray<TWeakObjectPtr<class AActor>>          Actors;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

