#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CacheTrackRecorder

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "CacheTrackRecorder_structs.hpp"


namespace SDK
{

// Class CacheTrackRecorder.CacheTrackRecorder
// 0x00F0 (0x0120 - 0x0030)
class UCacheTrackRecorder final : public UObject
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         SequenceAsset;                                     // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UWorld>                  WeakWorld;                                         // 0x0068(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FCacheRecorderParameters               Parameters;                                        // 0x0070(0x0030)(NativeAccessSpecifierPrivate)
	TArray<struct FCachedTrackSource>             CacheTracks;                                       // 0x00A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B0[0x70];                                      // 0x00B0(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class ULevelSequence* GetSequence() const;
	ECacheTrackRecorderState GetState() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CacheTrackRecorder">();
	}
	static class UCacheTrackRecorder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCacheTrackRecorder>();
	}
};

}

