#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: capture_item_spawner_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass capture_item_spawner_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class capture_item_spawner_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass capture_item_spawner_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class capture_item_spawner_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<capture_item_spawner_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass capture_item_spawner_device.capture_item_spawner_device
// 0x0030 (0x00F0 - 0x00C0)
class Ucapture_item_spawner_device final : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0xC528EB7B_ItemCapturedEvent;              // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x6DAE2196_ItemPickedUpEvent;              // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x63780F89_ItemDroppedEvent;               // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x1CA8091A_ItemReturnedEvent;              // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x5BDC7A5C_EnableFunction;                 // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC9184E23_DisableFunction;                // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fcapture__item__spawner__device_N_RDisable(const struct capture_item_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcapture__item__spawner__device_N_REnable(const struct capture_item_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"capture_item_spawner_device">();
	}
	static class Ucapture_item_spawner_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ucapture_item_spawner_device>();
	}
};

}

