#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CaretakerRuntime

#include "Basic.hpp"

#include "FortniteAI_structs.hpp"
#include "FortniteAI_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class CaretakerRuntime.FortAthenaCaretakerAIController
// 0x0008 (0x07B0 - 0x07A8)
class AFortAthenaCaretakerAIController final : public AAthenaAIController
{
public:
	uint8                                         Pad_7A8[0x8];                                      // 0x07A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DebugUpdate(float UpdateInterval);
	void OnMovementModeChanged(class ACharacter* CharacterOwner, EMovementMode PreviousMovementMode, uint8 PreviousCustomMode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaCaretakerAIController">();
	}
	static class AFortAthenaCaretakerAIController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaCaretakerAIController>();
	}
};

// Class CaretakerRuntime.FortBTTask_CaretakerMoveTo
// 0x0038 (0x0258 - 0x0220)
class UFortBTTask_CaretakerMoveTo final : public UBTTask_MoveTo
{
public:
	struct FBlackboardKeySelector                 FocalPointWhileMoving;                             // 0x0220(0x0030)(Edit, NativeAccessSpecifierPublic)
	EPathObstacleAction                           PathObstacleAction;                                // 0x0250(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bEnableSlowdownAtGoal : 1;                         // 0x0254(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMoveDirectlyTowards : 1;                          // 0x0254(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bStopAtGoal : 1;                                   // 0x0254(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFinishMoveOnOverlap : 1;                          // 0x0254(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBTTask_CaretakerMoveTo">();
	}
	static class UFortBTTask_CaretakerMoveTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBTTask_CaretakerMoveTo>();
	}
};

// Class CaretakerRuntime.FortNavigationFilter_Caretaker
// 0x0018 (0x0068 - 0x0050)
class UFortNavigationFilter_Caretaker final : public UFortNavigationFilter
{
public:
	float                                         EndPointAcceptableRadius;                          // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UNavigationQueryFilter>     EndPointFilterClass;                               // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEndPointReachTestIncludesAgentRadius : 1;         // 0x0060(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEndPointReachTestIncludesGoalRadius : 1;          // 0x0060(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortNavigationFilter_Caretaker">();
	}
	static class UFortNavigationFilter_Caretaker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortNavigationFilter_Caretaker>();
	}
};

// Class CaretakerRuntime.FortAITask_CaretakerMove
// 0x0000 (0x01B8 - 0x01B8)
class UFortAITask_CaretakerMove final : public UFortAbilityTask_MoveAI
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAITask_CaretakerMove">();
	}
	static class UFortAITask_CaretakerMove* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAITask_CaretakerMove>();
	}
};

// Class CaretakerRuntime.FortAIAnimInstance_Caretaker
// 0x0080 (0x06C0 - 0x0640)
class UFortAIAnimInstance_Caretaker final : public UFortAIAnimInstance
{
public:
	bool                                          bIsMoving;                                         // 0x0640(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_641[0x3];                                      // 0x0641(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WalkPlayRate;                                      // 0x0644(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimOffsetCurve;                                    // 0x0648(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFootPhase_StopLeftPlant;                          // 0x064C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFootPhase_StopLeftPass;                           // 0x064D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFootPhase_StopRightPlant;                         // 0x064E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFootPhase_StopRightPass;                          // 0x064F(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BreathingCurve;                                    // 0x0650(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovingTreshold;                                    // 0x0654(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CurveName_AimOffsetCurve;                          // 0x0658(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CurveName_FootPhase;                               // 0x0664(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CurveName_BreathingCurve;                          // 0x0670(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName_FX_Chest;                               // 0x067C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParamName_ChestSocketLocation;                     // 0x0688(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParamName_ChestSocketVector;                       // 0x0694(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FirstFootPhaseMin;                                 // 0x06A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondFootPhaseMin;                                // 0x06A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThirdFootPhaseMin;                                 // 0x06A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FourthFootPhaseMin;                                // 0x06AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootPhaseMax;                                      // 0x06B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6B4[0x4];                                      // 0x06B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAnimWorldStriderComponent*         WorldStriderComponent;                             // 0x06B8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetDelayedMaterialParameters();

	float GetStartAnimPosition() const;
	float GetWalkPlayRateValue() const;
	float GetWalkSpeedWarpingValue() const;
	class UFortAnimWorldStriderComponent* GetWorldStriderComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAIAnimInstance_Caretaker">();
	}
	static class UFortAIAnimInstance_Caretaker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAIAnimInstance_Caretaker>();
	}
};

}

