#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CascadeToNiagaraConverter

#include "Basic.hpp"

#include "Niagara_structs.hpp"
#include "CascadeToNiagaraConverter_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NiagaraEditor_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CascadeToNiagaraConverter.NiagaraSystemConversionContext.AddEmptyEmitter
// 0x0018 (0x0018 - 0x0000)
struct NiagaraSystemConversionContext_AddEmptyEmitter final
{
public:
	class FString                                 NewEmitterNameString;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraEmitterConversionContext*       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.AddEventHandler
// 0x00E0 (0x00E0 - 0x0000)
struct NiagaraEmitterConversionContext_AddEventHandler final
{
public:
	struct FNiagaraEventHandlerAddAction          EventScriptPropertiesBP;                           // 0x0000(0x00E0)(Parm, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.AddModuleEventScript
// 0x00F8 (0x00F8 - 0x0000)
struct NiagaraEmitterConversionContext_AddModuleEventScript final
{
public:
	class FString                                 ScriptNameString;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraScriptConversionContext*        ScriptConversionContext;                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraEventHandlerAddAction          EventScriptProps;                                  // 0x0018(0x00E0)(Parm, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.AddModuleScript
// 0x0020 (0x0020 - 0x0000)
struct NiagaraEmitterConversionContext_AddModuleScript final
{
public:
	class FString                                 ScriptNameString;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraScriptConversionContext*        ScriptConversionContext;                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScriptExecutionCategory                      ModuleScriptExecutionCategory;                     // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.AddRenderer
// 0x0018 (0x0018 - 0x0000)
struct NiagaraEmitterConversionContext_AddRenderer final
{
public:
	class FString                                 RendererNameString;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraRendererProperties*             NewRendererProperties;                             // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.FindModuleScript
// 0x0018 (0x0018 - 0x0000)
struct NiagaraEmitterConversionContext_FindModuleScript final
{
public:
	class FString                                 ScriptNameString;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraScriptConversionContext*        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.FindOrAddModuleEventScript
// 0x01A0 (0x01A0 - 0x0000)
struct NiagaraEmitterConversionContext_FindOrAddModuleEventScript final
{
public:
	class FString                                 ScriptNameString;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCreateScriptContextArgs               CreateScriptContextArgs;                           // 0x0010(0x00A8)(Parm, NativeAccessSpecifierPublic)
	struct FNiagaraEventHandlerAddAction          EventScriptProps;                                  // 0x00B8(0x00E0)(Parm, NativeAccessSpecifierPublic)
	class UNiagaraScriptConversionContext*        ReturnValue;                                       // 0x0198(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.FindOrAddModuleScript
// 0x00C8 (0x00C8 - 0x0000)
struct NiagaraEmitterConversionContext_FindOrAddModuleScript final
{
public:
	class FString                                 ScriptNameString;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCreateScriptContextArgs               CreateScriptContextArgs;                           // 0x0010(0x00A8)(Parm, NativeAccessSpecifierPublic)
	EScriptExecutionCategory                      ModuleScriptExecutionCategory;                     // 0x00B8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraScriptConversionContext*        ReturnValue;                                       // 0x00C0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.FindRenderer
// 0x0018 (0x0018 - 0x0000)
struct NiagaraEmitterConversionContext_FindRenderer final
{
public:
	class FString                                 RendererNameString;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraRendererProperties*             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.GetAllRenderers
// 0x0010 (0x0010 - 0x0000)
struct NiagaraEmitterConversionContext_GetAllRenderers final
{
public:
	TArray<class UNiagaraRendererProperties*>     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.GetEmitter
// 0x0008 (0x0008 - 0x0000)
struct NiagaraEmitterConversionContext_GetEmitter final
{
public:
	class UNiagaraEmitter*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.Log
// 0x0018 (0x0018 - 0x0000)
struct NiagaraEmitterConversionContext_Log final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraMessageSeverity                       Severity;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsVerbose;                                        // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.RemoveModuleScriptsForAssets
// 0x0010 (0x0010 - 0x0000)
struct NiagaraEmitterConversionContext_RemoveModuleScriptsForAssets final
{
public:
	TArray<struct FAssetData>                     ScriptsToRemove;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.SetDetailBitMask
// 0x0004 (0x0004 - 0x0000)
struct NiagaraEmitterConversionContext_SetDetailBitMask final
{
public:
	int32                                         BitMask;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct NiagaraEmitterConversionContext_SetEnabled final
{
public:
	bool                                          bInEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.SetLocalSpace
// 0x0001 (0x0001 - 0x0000)
struct NiagaraEmitterConversionContext_SetLocalSpace final
{
public:
	bool                                          bLocalSpace;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.SetParameterDirectly
// 0x0020 (0x0020 - 0x0000)
struct NiagaraEmitterConversionContext_SetParameterDirectly final
{
public:
	class FString                                 ParameterNameString;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraScriptConversionContextInput*   ParameterInput;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScriptExecutionCategory                      SetParameterExecutionCategory;                     // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.SetPastedFunctionCallNode
// 0x0008 (0x0008 - 0x0000)
struct NiagaraEmitterConversionContext_SetPastedFunctionCallNode final
{
public:
	class UNiagaraNodeFunctionCall*               InFunctionCallNode;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.SetRendererBinding
// 0x0028 (0x0028 - 0x0000)
struct NiagaraEmitterConversionContext_SetRendererBinding final
{
public:
	class UNiagaraRendererProperties*             InRendererProperties;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BindingName;                                       // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VariableToBindName;                                // 0x0014(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraRendererSourceDataMode                SourceDataMode;                                    // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.SetSimTarget
// 0x0001 (0x0001 - 0x0000)
struct NiagaraEmitterConversionContext_SetSimTarget final
{
public:
	ENiagaraSimTarget                             InTarget;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraEmitterConversionContext.GetEnabled
// 0x0001 (0x0001 - 0x0000)
struct NiagaraEmitterConversionContext_GetEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraScriptConversionContext.Log
// 0x0018 (0x0018 - 0x0000)
struct NiagaraScriptConversionContext_Log final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraMessageSeverity                       Severity;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsVerbose;                                        // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CascadeToNiagaraConverter.NiagaraScriptConversionContext.SetModuleEnabled
// 0x0001 (0x0001 - 0x0000)
struct NiagaraScriptConversionContext_SetModuleEnabled final
{
public:
	bool                                          bInModuleEnabled;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraScriptConversionContext.SetParameter
// 0x0020 (0x0020 - 0x0000)
struct NiagaraScriptConversionContext_SetParameter final
{
public:
	class FString                                 ParameterName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraScriptConversionContextInput*   ParameterInput;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInHasEditCondition;                               // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInEditConditionValue;                             // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CascadeToNiagaraConverter.NiagaraScriptConversionContext.GetModuleEnabled
// 0x0001 (0x0001 - 0x0000)
struct NiagaraScriptConversionContext_GetModuleEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.NiagaraScriptConversionContextInput.Init
// 0x0030 (0x0030 - 0x0000)
struct NiagaraScriptConversionContextInput_Init final
{
public:
	class UNiagaraClipboardFunctionInput*         InClipboardFunctionInput;                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraScriptInputType                       InInputType;                                       // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraTypeDefinition                 InTypeDefinition;                                  // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateAssetData
// 0x00A8 (0x00A8 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateAssetData final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAssetData                             ReturnValue;                                       // 0x0010(0x0098)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateComponentRendererProperties
// 0x0008 (0x0008 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateComponentRendererProperties final
{
public:
	class UNiagaraComponentRendererProperties*    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateFloatCurveDI
// 0x0018 (0x0018 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateFloatCurveDI final
{
public:
	TArray<struct FRichCurveKeyBP>                Keys;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UNiagaraDataInterfaceCurve*             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateLightRendererProperties
// 0x0008 (0x0008 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateLightRendererProperties final
{
public:
	class UNiagaraLightRendererProperties*        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateMeshRendererProperties
// 0x0008 (0x0008 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateMeshRendererProperties final
{
public:
	class UNiagaraMeshRendererProperties*         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateRibbonRendererProperties
// 0x0008 (0x0008 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateRibbonRendererProperties final
{
public:
	class UNiagaraRibbonRendererProperties*       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateScriptContext
// 0x00B0 (0x00B0 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateScriptContext final
{
public:
	struct FCreateScriptContextArgs               Args;                                              // 0x0000(0x00A8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UNiagaraScriptConversionContext*        ReturnValue;                                       // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateScriptInputBool
// 0x0010 (0x0010 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateScriptInputBool final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraScriptConversionContextInput*   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateScriptInputDI
// 0x0010 (0x0010 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateScriptInputDI final
{
public:
	class UNiagaraDataInterface*                  Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraScriptConversionContextInput*   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateScriptInputDynamic
// 0x0018 (0x0018 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateScriptInputDynamic final
{
public:
	class UNiagaraScriptConversionContext*        Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraScriptInputType                       InputType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraScriptConversionContextInput*   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateScriptInputEnum
// 0x0028 (0x0028 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateScriptInputEnum final
{
public:
	class FString                                 UserDefinedEnumAssetPath;                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserDefinedEnumValueNameString;                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraScriptConversionContextInput*   ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateScriptInputFloat
// 0x0010 (0x0010 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateScriptInputFloat final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraScriptConversionContextInput*   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateScriptInputInt
// 0x0010 (0x0010 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateScriptInputInt final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraScriptConversionContextInput*   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateScriptInputLinkedParameter
// 0x0020 (0x0020 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateScriptInputLinkedParameter final
{
public:
	class FString                                 ParameterNameString;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraScriptInputType                       InputType;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraScriptConversionContextInput*   ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateScriptInputStruct
// 0x0010 (0x0010 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateScriptInputStruct final
{
public:
	class UUserDefinedStruct*                     Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraScriptConversionContextInput*   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateScriptInputVec2
// 0x0018 (0x0018 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateScriptInputVec2 final
{
public:
	struct FVector2D                              Value;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraScriptConversionContextInput*   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateScriptInputVector
// 0x0020 (0x0020 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateScriptInputVector final
{
public:
	struct FVector                                Value;                                             // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraScriptConversionContextInput*   ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateSkeletalMeshDataInterface
// 0x0008 (0x0008 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateSkeletalMeshDataInterface final
{
public:
	class UNiagaraDataInterfaceSkeletalMesh*      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateSystemConversionContext
// 0x0010 (0x0010 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateSystemConversionContext final
{
public:
	class UNiagaraSystem*                         InSystem;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystemConversionContext*        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateVec2CurveDI
// 0x0028 (0x0028 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateVec2CurveDI final
{
public:
	TArray<struct FRichCurveKeyBP>                X_Keys;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRichCurveKeyBP>                Y_Keys;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UNiagaraDataInterfaceVector2DCurve*     ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateVec3CurveDI
// 0x0038 (0x0038 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateVec3CurveDI final
{
public:
	TArray<struct FRichCurveKeyBP>                X_Keys;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRichCurveKeyBP>                Y_Keys;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRichCurveKeyBP>                Z_Keys;                                            // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UNiagaraDataInterfaceVectorCurve*       ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.CreateVec4CurveDI
// 0x0048 (0x0048 - 0x0000)
struct FXConverterUtilitiesLibrary_CreateVec4CurveDI final
{
public:
	TArray<struct FRichCurveKeyBP>                X_Keys;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRichCurveKeyBP>                Y_Keys;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRichCurveKeyBP>                Z_Keys;                                            // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRichCurveKeyBP>                W_Keys;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UNiagaraDataInterfaceVector4Curve*      ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetCascadeEmitterLodLevel
// 0x0018 (0x0018 - 0x0000)
struct FXConverterUtilitiesLibrary_GetCascadeEmitterLodLevel final
{
public:
	class UParticleEmitter*                       Emitter;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Idx;                                               // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleLODLevel*                      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetCascadeEmitterName
// 0x0018 (0x0018 - 0x0000)
struct FXConverterUtilitiesLibrary_GetCascadeEmitterName final
{
public:
	class UParticleEmitter*                       Emitter;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetCascadeEmitterRenderMode
// 0x0010 (0x0010 - 0x0000)
struct FXConverterUtilitiesLibrary_GetCascadeEmitterRenderMode final
{
public:
	class UParticleEmitter*                       Emitter;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetCascadeSystemEmitters
// 0x0018 (0x0018 - 0x0000)
struct FXConverterUtilitiesLibrary_GetCascadeSystemEmitters final
{
public:
	const class UParticleSystem*                  System;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UParticleEmitter*>               ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetDistributionLockedAxes
// 0x0018 (0x0018 - 0x0000)
struct FXConverterUtilitiesLibrary_GetDistributionLockedAxes final
{
public:
	class UDistribution*                          Distribution;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EDistributionVectorLockFlags>          ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetDistributionMinMaxValues
// 0x0040 (0x0040 - 0x0000)
struct FXConverterUtilitiesLibrary_GetDistributionMinMaxValues final
{
public:
	class UDistribution*                          Distribution;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutSuccess;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutMinValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutMaxValue;                                       // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetDistributionType
// 0x0010 (0x0010 - 0x0000)
struct FXConverterUtilitiesLibrary_GetDistributionType final
{
public:
	class UDistribution*                          Distribution;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDistributionType                             OutDistributionType;                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDistributionValueType                        OutCascadeDistributionValueType;                   // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetFloatDistributionConstCurveValues
// 0x0020 (0x0020 - 0x0000)
struct FXConverterUtilitiesLibrary_GetFloatDistributionConstCurveValues final
{
public:
	class UDistributionFloatConstantCurve*        Distribution;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveFloat                      OutInterpCurveFloat;                               // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetFloatDistributionConstValues
// 0x0010 (0x0010 - 0x0000)
struct FXConverterUtilitiesLibrary_GetFloatDistributionConstValues final
{
public:
	class UDistributionFloatConstant*             Distribution;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutConstFloat;                                     // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetFloatDistributionParameterValues
// 0x0028 (0x0028 - 0x0000)
struct FXConverterUtilitiesLibrary_GetFloatDistributionParameterValues final
{
public:
	class UDistributionFloatParameterBase*        Distribution;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutParameterName;                                  // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutMinInput;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutMaxInput;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutMinOutput;                                      // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutMaxOutput;                                      // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetFloatDistributionUniformCurveValues
// 0x0020 (0x0020 - 0x0000)
struct FXConverterUtilitiesLibrary_GetFloatDistributionUniformCurveValues final
{
public:
	class UDistributionFloatUniformCurve*         Distribution;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveVector2D                   OutInterpCurveVector2D;                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetFloatDistributionUniformValues
// 0x0010 (0x0010 - 0x0000)
struct FXConverterUtilitiesLibrary_GetFloatDistributionUniformValues final
{
public:
	class UDistributionFloatUniform*              Distribution;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutMin;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutMax;                                            // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetLodLevelIsEnabled
// 0x0010 (0x0010 - 0x0000)
struct FXConverterUtilitiesLibrary_GetLodLevelIsEnabled final
{
public:
	class UParticleLODLevel*                      LodLevel;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetLodLevelModules
// 0x0018 (0x0018 - 0x0000)
struct FXConverterUtilitiesLibrary_GetLodLevelModules final
{
public:
	class UParticleLODLevel*                      LodLevel;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UParticleModule*>                ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetLodLevelRequiredModule
// 0x0010 (0x0010 - 0x0000)
struct FXConverterUtilitiesLibrary_GetLodLevelRequiredModule final
{
public:
	class UParticleLODLevel*                      LodLevel;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleModuleRequired*                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetLodLevelSpawnModule
// 0x0010 (0x0010 - 0x0000)
struct FXConverterUtilitiesLibrary_GetLodLevelSpawnModule final
{
public:
	class UParticleLODLevel*                      LodLevel;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleModuleSpawn*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetLodLevelTypeDataModule
// 0x0010 (0x0010 - 0x0000)
struct FXConverterUtilitiesLibrary_GetLodLevelTypeDataModule final
{
public:
	class UParticleLODLevel*                      LodLevel;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleModuleTypeDataBase*            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetLongPackagePath
// 0x0020 (0x0020 - 0x0000)
struct FXConverterUtilitiesLibrary_GetLongPackagePath final
{
public:
	class FString                                 InLongPackageName;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetParticleModuleAccelerationDragProps
// 0x0010 (0x0010 - 0x0000)
struct FXConverterUtilitiesLibrary_GetParticleModuleAccelerationDragProps final
{
public:
	class UParticleModuleAccelerationDrag*        ParticleModule;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDistribution*                          OutDragCoefficientRaw;                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetParticleModuleAccelerationDragScaleOverLifeProps
// 0x0010 (0x0010 - 0x0000)
struct FXConverterUtilitiesLibrary_GetParticleModuleAccelerationDragScaleOverLifeProps final
{
public:
	class UParticleModuleAccelerationDragScaleOverLife* ParticleModule;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDistribution*                          OutDragScaleRaw;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetParticleModuleAccelerationOverLifetimeProps
// 0x0010 (0x0010 - 0x0000)
struct FXConverterUtilitiesLibrary_GetParticleModuleAccelerationOverLifetimeProps final
{
public:
	class UParticleModuleAccelerationOverLifetime* ParticleModule;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDistribution*                          OutAccelOverLife;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetParticleModuleAccelerationProps
// 0x0018 (0x0018 - 0x0000)
struct FXConverterUtilitiesLibrary_GetParticleModuleAccelerationProps final
{
public:
	class UParticleModuleAcceleration*            ParticleModule;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDistribution*                          OutAcceleration;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutApplyOwnerScale;                               // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetParticleModuleAttractorLineProps
// 0x0048 (0x0048 - 0x0000)
struct FXConverterUtilitiesLibrary_GetParticleModuleAttractorLineProps final
{
public:
	class UParticleModuleAttractorLine*           ParticleModule;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutStartPoint;                                     // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutEndPoint;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDistribution*                          OutRange;                                          // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDistribution*                          OutStrength;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetParticleModuleAttractorParticleProps
// 0x0038 (0x0038 - 0x0000)
struct FXConverterUtilitiesLibrary_GetParticleModuleAttractorParticleProps final
{
public:
	class UParticleModuleAttractorParticle*       ParticleModule;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutEmitterName;                                    // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDistribution*                          OutRange;                                          // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutStrengthByDistance;                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDistribution*                          OutStrength;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutAffectBaseVelocity;                            // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttractorParticleSelectionMethod             OutSelectionMethod;                                // 0x0031(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutRenewSource;                                   // 0x0032(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutInheritSourceVelocity;                         // 0x0033(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetParticleModuleAttractorPointProps
// 0x0030 (0x0030 - 0x0000)
struct FXConverterUtilitiesLibrary_GetParticleModuleAttractorPointProps final
{
public:
	class UParticleModuleAttractorPoint*          ParticleModule;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDistribution*                          OutPosition;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDistribution*                          OutRange;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDistribution*                          OutStrength;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          boutStrengthByDistance;                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutAffectsBaseVelocity;                           // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutOverrideVelocity;                              // 0x0022(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutUseWorldSpacePosition;                         // 0x0023(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutPositiveX;                                     // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutPositiveY;                                     // 0x0025(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutPositiveZ;                                     // 0x0026(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutNegativeX;                                     // 0x0027(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutNegativeY;                                     // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutNegativeZ;                                     // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetParticleModuleCameraOffsetProps
// 0x0018 (0x0018 - 0x0000)
struct FXConverterUtilitiesLibrary_GetParticleModuleCameraOffsetProps final
{
public:
	class UParticleModuleCameraOffset*            ParticleModule;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDistribution*                          OutCameraOffset;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutSpawnTimeOnly;                                 // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EParticleCameraOffsetUpdateMethod             OutUpdateMethod;                                   // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CascadeToNiagaraConverter.FXConverterUtilitiesLibrary.GetParticleModuleCollisionProps
// 0x0068 (0x0068 - 0x0000)
struct FXConverterUtilitiesLibrary_GetParticleModuleCollisionProps final
{
public:
