#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CascadeToNiagaraConverter

#include "Basic.hpp"

#include "Niagara_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum CascadeToNiagaraConverter.ENiagaraEventHandlerAddMode
// NumValues: 0x0004
enum class ENiagaraEventHandlerAddMode : uint8
{
	AddEvent                                 = 0,
	AddEventAndEventGenerator                = 1,
	NONE                                     = 2,
	ENiagaraEventHandlerAddMode_MAX          = 3,
};

// Enum CascadeToNiagaraConverter.EScriptExecutionCategory
// NumValues: 0x0007
enum class EScriptExecutionCategory : uint8
{
	EmitterSpawn                             = 0,
	EmitterUpdate                            = 1,
	ParticleSpawn                            = 2,
	ParticleUpdate                           = 3,
	ParticleEvent                            = 4,
	NONE                                     = 5,
	EScriptExecutionCategory_MAX             = 6,
};

// Enum CascadeToNiagaraConverter.EDistributionType
// NumValues: 0x0007
enum class EDistributionType : uint8
{
	Const                                    = 0,
	ConstCurve                               = 1,
	Uniform                                  = 2,
	UniformCurve                             = 3,
	Parameter                                = 4,
	NONE                                     = 5,
	EDistributionType_MAX                    = 6,
};

// Enum CascadeToNiagaraConverter.EDistributionValueType
// NumValues: 0x0004
enum class EDistributionValueType : uint8
{
	Float                                    = 0,
	Vector                                   = 1,
	NONE                                     = 2,
	EDistributionValueType_MAX               = 3,
};

// Enum CascadeToNiagaraConverter.ECascadeRendererType
// NumValues: 0x0007
enum class ECascadeRendererType : uint8
{
	Sprite                                   = 0,
	Mesh                                     = 1,
	Ribbon                                   = 2,
	Beam                                     = 3,
	AnimTrail                                = 4,
	NONE                                     = 5,
	ECascadeRendererType_MAX                 = 6,
};

// Enum CascadeToNiagaraConverter.ENiagaraScriptInputType
// NumValues: 0x000E
enum class ENiagaraScriptInputType : uint8
{
	Int                                      = 0,
	Float                                    = 1,
	Vec2                                     = 2,
	Vec3                                     = 3,
	Vec4                                     = 4,
	LinearColor                              = 5,
	Quaternion                               = 6,
	Struct                                   = 7,
	Enum                                     = 8,
	DataInterface                            = 9,
	Bool                                     = 10,
	Position                                 = 11,
	NONE                                     = 12,
	ENiagaraScriptInputType_MAX              = 13,
};

// Enum CascadeToNiagaraConverter.ERibbonConversionMode
// NumValues: 0x0004
enum class ERibbonConversionMode : uint8
{
	Event                                    = 0,
	DirectRead                               = 1,
	NONE                                     = 2,
	ERibbonConversionMode_MAX                = 3,
};

// Enum CascadeToNiagaraConverter.EStackEntryAddActionMode
// NumValues: 0x0004
enum class EStackEntryAddActionMode : uint8
{
	Module                                   = 0,
	SetParameter                             = 1,
	NONE                                     = 2,
	EStackEntryAddActionMode_MAX             = 3,
};

// ScriptStruct CascadeToNiagaraConverter.LocationBoneSocketInfoBP
// 0x0000 (0x0028 - 0x0028)
struct FLocationBoneSocketInfoBP final : public FLocationBoneSocketInfo
{
};

// ScriptStruct CascadeToNiagaraConverter.NiagaraAddEventGeneratorOptions
// 0x00A8 (0x00A8 - 0x0000)
struct FNiagaraAddEventGeneratorOptions final
{
public:
	class FName                                   SourceEmitterName;                                 // 0x0000(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAssetData                             EventGeneratorScriptAssetData;                     // 0x0010(0x0098)(BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CascadeToNiagaraConverter.NiagaraEventHandlerAddAction
// 0x00E0 (0x00E0 - 0x0000)
struct FNiagaraEventHandlerAddAction final
{
public:
	ENiagaraEventHandlerAddMode                   Mode;                                              // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraAddEventGeneratorOptions       AddEventGeneratorOptions;                          // 0x0008(0x00A8)(BlueprintVisible, NativeAccessSpecifierPublic)
	EScriptExecutionMode                          ExecutionMode;                                     // 0x00B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpawnNumber;                                       // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxEventsPerFrame;                                 // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  SourceEmitterID;                                   // 0x00BC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SourceEventName;                                   // 0x00CC(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRandomSpawnNumber;                                // 0x00D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinSpawnNumber;                                    // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CascadeToNiagaraConverter.RichCurveKeyBP
// 0x0000 (0x001C - 0x001C)
struct FRichCurveKeyBP final : public FRichCurveKey
{
};

// ScriptStruct CascadeToNiagaraConverter.NiagaraScriptVersion
// 0x0008 (0x0008 - 0x0000)
struct FNiagaraScriptVersion final
{
public:
	int32                                         MajorVersion;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinorVersion;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CascadeToNiagaraConverter.CreateScriptContextArgs
// 0x00A8 (0x00A8 - 0x0000)
struct FCreateScriptContextArgs final
{
public:
	struct FAssetData                             ScriptAsset;                                       // 0x0000(0x0098)(BlueprintVisible, BlueprintReadOnly, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bScriptVersionSet;                                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraScriptVersion                  ScriptVersion;                                     // 0x009C(0x0008)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CascadeToNiagaraConverter.EmitterDynamicParameterBP
// 0x0040 (0x0040 - 0x0000)
struct FEmitterDynamicParameterBP final
{
public:
	class FName                                   ParamName;                                         // 0x0000(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseEmitterTime;                                   // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSpawnTimeOnly;                                    // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEmitterDynamicParameterValue                 ValueMethod;                                       // 0x000E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bScaleVelocityByParamValue;                        // 0x000F(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRawDistributionFloat                  ParamValue;                                        // 0x0010(0x0030)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// ScriptStruct CascadeToNiagaraConverter.OrbitOptionsBP
// 0x0003 (0x0003 - 0x0000)
struct FOrbitOptionsBP final
{
public:
	bool                                          bProcessDuringSpawn;                               // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProcessDuringUpdate;                              // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseEmitterTime;                                   // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CascadeToNiagaraConverter.ParticleBurstBlueprint
// 0x000C (0x000C - 0x0000)
struct FParticleBurstBlueprint final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CountLow;                                          // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CascadeToNiagaraConverter.StackEntryID
// 0x0010 (0x0010 - 0x0000)
struct FStackEntryID final
{
public:
	EScriptExecutionCategory                      ScriptExecutionCategory;                           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EventName;                                         // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CascadeToNiagaraConverter.StackEntryAddAction
// 0x0038 (0x0038 - 0x0000)
struct FStackEntryAddAction final
{
public:
	EStackEntryAddActionMode                      Mode;                                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraScriptConversionContext*        ScriptConversionContext;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraClipboardFunction*              ClipboardFunction;                                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStackEntryID                          StackEntryID;                                      // 0x0018(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   ModuleName;                                        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CascadeToNiagaraConverter.GenericConverterMessage
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FGenericConverterMessage final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

