#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosClothAssetDataflowNodes

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Chaos_structs.hpp"
#include "DataflowCore_structs.hpp"
#include "ChaosClothAssetEngine_structs.hpp"
#include "ClothingSystemRuntimeCommon_structs.hpp"


namespace SDK
{

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetRestAngleConstructionType
// NumValues: 0x0004
enum class EChaosClothAssetRestAngleConstructionType : uint8
{
	Use3DRestAngles                          = 0,
	FlatnessRatio                            = 1,
	RestAngle                                = 2,
	EChaosClothAssetRestAngleConstructionType_MAX = 3,
};

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetBendingConstraintType
// NumValues: 0x0003
enum class EChaosClothAssetBendingConstraintType : uint8
{
	FacesSpring                              = 0,
	HingeAngles                              = 1,
	EChaosClothAssetBendingConstraintType_MAX = 2,
};

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetConstraintDistributionType
// NumValues: 0x0003
enum class EChaosClothAssetConstraintDistributionType : uint8
{
	Anisotropic                              = 0,
	Isotropic                                = 1,
	EChaosClothAssetConstraintDistributionType_MAX = 2,
};

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetConstraintSolverType
// NumValues: 0x0003
enum class EChaosClothAssetConstraintSolverType : uint8
{
	XPBD                                     = 0,
	PBD                                      = 1,
	EChaosClothAssetConstraintSolverType_MAX = 2,
};

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetConstraintOverrideType
// NumValues: 0x0004
enum class EChaosClothAssetConstraintOverrideType : uint8
{
	None                                     = 0,
	Override                                 = 1,
	Multiply                                 = 2,
	EChaosClothAssetConstraintOverrideType_MAX = 3,
};

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetWeightMapTransferType
// NumValues: 0x0003
enum class EChaosClothAssetWeightMapTransferType : uint8
{
	Use2DSimMesh                             = 0,
	Use3DSimMesh                             = 1,
	EChaosClothAssetWeightMapTransferType_MAX = 2,
};

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetWeightMapMeshType
// NumValues: 0x0004
enum class EChaosClothAssetWeightMapMeshType : uint8
{
	Simulation                               = 0,
	Render                                   = 1,
	Both                                     = 2,
	EChaosClothAssetWeightMapMeshType_MAX    = 3,
};

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetWeightMapOverrideType
// NumValues: 0x0004
enum class EChaosClothAssetWeightMapOverrideType : uint8
{
	ReplaceAll                               = 0,
	ReplaceChanged                           = 1,
	Add                                      = 2,
	EChaosClothAssetWeightMapOverrideType_MAX = 3,
};

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetNodeAttributeType
// NumValues: 0x0004
enum class EChaosClothAssetNodeAttributeType : uint8
{
	Integer                                  = 0,
	Float                                    = 1,
	Vector                                   = 2,
	EChaosClothAssetNodeAttributeType_MAX    = 3,
};

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetElementType
// NumValues: 0x000D
enum class EChaosClothAssetElementType : uint8
{
	None                                     = 0,
	SimMesh                                  = 1,
	RenderMesh                               = 2,
	SimPattern                               = 3,
	RenderPattern                            = 4,
	SimVertex2D                              = 5,
	SimVertex3D                              = 6,
	RenderVertex                             = 7,
	SimFace                                  = 8,
	RenderFace                               = 9,
	Seam                                     = 10,
	Deprecated                               = 11,
	EChaosClothAssetElementType_MAX          = 12,
};

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetRemeshMethod
// NumValues: 0x0003
enum class EChaosClothAssetRemeshMethod : uint8
{
	Remesh                                   = 0,
	Simplify                                 = 1,
	EChaosClothAssetRemeshMethod_MAX         = 2,
};

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetSelectionType
// NumValues: 0x0007
enum class EChaosClothAssetSelectionType : uint8
{
	SimVertex2D                              = 0,
	SimVertex3D                              = 1,
	RenderVertex                             = 2,
	SimFace                                  = 3,
	RenderFace                               = 4,
	Deprecated                               = 5,
	EChaosClothAssetSelectionType_MAX        = 6,
};

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetSelectionOverrideType
// NumValues: 0x0003
enum class EChaosClothAssetSelectionOverrideType : uint8
{
	ReplaceAll                               = 0,
	Modify                                   = 1,
	EChaosClothAssetSelectionOverrideType_MAX = 2,
};

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetTransferSkinWeightsMethod
// NumValues: 0x0003
enum class EChaosClothAssetTransferSkinWeightsMethod : uint8
{
	ClosestPointOnSurface                    = 0,
	InpaintWeights                           = 1,
	EChaosClothAssetTransferSkinWeightsMethod_MAX = 2,
};

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetMaxNumInfluences
// NumValues: 0x0005
enum class EChaosClothAssetMaxNumInfluences : uint8
{
	Uninitialized                            = 0,
	Four                                     = 4,
	Eight                                    = 8,
	Twelve                                   = 12,
	EChaosClothAssetMaxNumInfluences_MAX     = 13,
};

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetTransferTargetMeshType
// NumValues: 0x0004
enum class EChaosClothAssetTransferTargetMeshType : uint8
{
	All                                      = 0,
	Simulation                               = 1,
	Render                                   = 2,
	EChaosClothAssetTransferTargetMeshType_MAX = 3,
};

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetTransferRenderMeshSource
// NumValues: 0x0003
enum class EChaosClothAssetTransferRenderMeshSource : uint8
{
	SkeletalMesh                             = 0,
	SimulationMesh                           = 1,
	EChaosClothAssetTransferRenderMeshSource_MAX = 2,
};

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetWeightMapMeshTarget
// NumValues: 0x0003
enum class EChaosClothAssetWeightMapMeshTarget : uint8
{
	Simulation                               = 0,
	Render                                   = 1,
	EChaosClothAssetWeightMapMeshTarget_MAX  = 2,
};

// Enum ChaosClothAssetDataflowNodes.EChaosClothAssetWeightMapConvertableSelectionType
// NumValues: 0x0004
enum class EChaosClothAssetWeightMapConvertableSelectionType : uint8
{
	SimVertices2D                            = 0,
	SimVertices3D                            = 1,
	SimFaces                                 = 2,
	EChaosClothAssetWeightMapConvertableSelectionType_MAX = 3,
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetConnectableStringValue
// 0x0020 (0x0020 - 0x0000)
struct FChaosClothAssetConnectableStringValue final
{
public:
	class FString                                 StringValue;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StringValue_Override;                              // 0x0010(0x0010)(Edit, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetConnectableIStringValue
// 0x0030 (0x0030 - 0x0000)
struct FChaosClothAssetConnectableIStringValue final
{
public:
	class FString                                 StringValue;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCouldUseFabrics;                                  // 0x0010(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StringValue_Override;                              // 0x0018(0x0010)(Edit, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBuildFabricMaps;                                  // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetConnectableIOStringValue
// 0x0020 (0x0020 - 0x0000)
struct FChaosClothAssetConnectableIOStringValue final
{
public:
	class FString                                 StringValue;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StringValue_Override;                              // 0x0010(0x0010)(Edit, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetImportedVectorValue
// 0x0010 (0x0010 - 0x0000)
struct FChaosClothAssetImportedVectorValue final
{
public:
	struct FVector3f                              ImportedValue;                                     // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseImportedValue;                                 // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetImportedIntValue
// 0x0008 (0x0008 - 0x0000)
struct FChaosClothAssetImportedIntValue final
{
public:
	int32                                         ImportedValue;                                     // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseImportedValue;                                 // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetImportedFloatValue
// 0x0008 (0x0008 - 0x0000)
struct FChaosClothAssetImportedFloatValue final
{
public:
	float                                         ImportedValue;                                     // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseImportedValue;                                 // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetImportFilePath
// 0x0018 (0x0018 - 0x0000)
struct FChaosClothAssetImportFilePath final
{
public:
	class FString                                 FilePath;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceReimport;                                    // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetSimulationBaseConfigNode
// 0x00B8 (0x0258 - 0x01A0)
struct FChaosClothAssetSimulationBaseConfigNode : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	bool                                          bWarnDuplicateProperty;                            // 0x0250(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetWeightedValue
// 0x0040 (0x0040 - 0x0000)
struct FChaosClothAssetWeightedValue final
{
public:
	bool                                          bIsAnimatable;                                     // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Low;                                               // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         High;                                              // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 WeightMap;                                         // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCouldUseFabrics;                                  // 0x0020(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 WeightMap_Override;                                // 0x0028(0x0010)(Edit, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportFabricBounds;                               // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBuildFabricMaps;                                  // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetWeightedValueNonAnimatable
// 0x0038 (0x0038 - 0x0000)
struct FChaosClothAssetWeightedValueNonAnimatable final
{
public:
	float                                         Low;                                               // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         High;                                              // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WeightMap;                                         // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCouldUseFabrics;                                  // 0x0018(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 WeightMap_Override;                                // 0x0020(0x0010)(Edit, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportFabricBounds;                               // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBuildFabricMaps;                                  // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetWeightedValueNonAnimatableNoLowHighRange
// 0x0020 (0x0020 - 0x0000)
struct FChaosClothAssetWeightedValueNonAnimatableNoLowHighRange final
{
public:
	class FString                                 WeightMap;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WeightMap_Override;                                // 0x0010(0x0010)(Edit, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetWeightedValueOverride
// 0x0008 (0x0008 - 0x0000)
struct FChaosClothAssetWeightedValueOverride final
{
public:
	float                                         Low;                                               // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         High;                                              // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetAddStitchNode
// 0x00E0 (0x0280 - 0x01A0)
struct FChaosClothAssetAddStitchNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableIStringValue MergeToSingleVertexSelection;                      // 0x0250(0x0030)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetAddWeightMapNode
// 0x01D8 (0x0378 - 0x01A0)
struct FChaosClothAssetAddWeightMapNode final : public FDataflowTerminalNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	struct FManagedArrayCollection                TransferCollection;                                // 0x0250(0x00B0)(Edit, EditConst, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0300(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableIStringValue InputName;                                         // 0x0310(0x0030)(Edit, EditConst, NativeAccessSpecifierPublic)
	EChaosClothAssetWeightMapOverrideType         MapOverrideType;                                   // 0x0340(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChaosClothAssetWeightMapTransferType         TransferType;                                      // 0x0341(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 VertexWeights;                                     // 0x0348(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	EChaosClothAssetWeightMapMeshType             MeshTarget;                                        // 0x0358(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 RenderVertexWeights;                               // 0x0360(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint32                                        TransferCollectionHash;                            // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetNodeAttributeGroup
// 0x0010 (0x0010 - 0x0000)
struct FChaosClothAssetNodeAttributeGroup final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetAttributeNode_V2
// 0x0108 (0x02A8 - 0x01A0)
struct FChaosClothAssetAttributeNode_V2 final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableIOStringValue Name;                                              // 0x0250(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetNodeAttributeGroup     Group;                                             // 0x0270(0x0010)(Edit, NativeAccessSpecifierPublic)
	EChaosClothAssetNodeAttributeType             Type;                                              // 0x0280(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IntValue;                                          // 0x0284(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatValue;                                        // 0x0288(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              VectorValue;                                       // 0x028C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_298[0x10];                                     // 0x0298(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetAttributeNode
// 0x00F8 (0x0298 - 0x01A0)
struct FChaosClothAssetAttributeNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0250(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChaosClothAssetNodeAttributeGroup     Group;                                             // 0x0260(0x0010)(Edit, NativeAccessSpecifierPublic)
	EChaosClothAssetNodeAttributeType             Type;                                              // 0x0270(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IntValue;                                          // 0x0274(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatValue;                                        // 0x0278(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              VectorValue;                                       // 0x027C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_288[0x10];                                     // 0x0288(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetBindToRootBoneNode
// 0x00B8 (0x0258 - 0x01A0)
struct FChaosClothAssetBindToRootBoneNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	bool                                          bBindSimMesh;                                      // 0x0250(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBindRenderMesh;                                   // 0x0251(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_252[0x6];                                      // 0x0252(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetCopySimulationToRenderMeshNode
// 0x00C0 (0x0260 - 0x01A0)
struct FChaosClothAssetCopySimulationToRenderMeshNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Material;                                          // 0x0250(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateSingleRenderPattern;                      // 0x0258(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetDatasmithImportNode
// 0x0170 (0x0310 - 0x01A0)
struct FChaosClothAssetDatasmithImportNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	struct FFilePath                              ImportFile;                                        // 0x0250(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_260[0xB0];                                     // 0x0260(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetNodeSelectionGroup
// 0x0010 (0x0010 - 0x0000)
struct FChaosClothAssetNodeSelectionGroup final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetDeleteElementNode
// 0x0118 (0x02B8 - 0x01A0)
struct FChaosClothAssetDeleteElementNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	EChaosClothAssetElementType                   ElementType;                                       // 0x0250(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteSimMesh;                                    // 0x0251(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteRenderMesh;                                 // 0x0252(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_253[0x5];                                      // 0x0253(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChaosClothAssetNodeSelectionGroup     Group;                                             // 0x0258(0x0010)(Edit, NativeAccessSpecifierPublic)
	TArray<int32>                                 Elements;                                          // 0x0268(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableIStringValue SelectionName;                                     // 0x0278(0x0030)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A8[0x10];                                     // 0x02A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetImportNodeRefreshAsset
// 0x0001 (0x0001 - 0x0000)
struct FChaosClothAssetImportNodeRefreshAsset final
{
public:
	bool                                          bRefreshAsset;                                     // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetImportNode
// 0x00C0 (0x0260 - 0x01A0)
struct FChaosClothAssetImportNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	class UChaosClothAsset*                       ClothAsset;                                        // 0x0250(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ImportLod;                                         // 0x0258(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChaosClothAssetImportNodeRefreshAsset ReimportAsset;                                     // 0x025C(0x0001)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetMergeClothCollectionsNode_v2
// 0x00C0 (0x0260 - 0x01A0)
struct FChaosClothAssetMergeClothCollectionsNode_v2 final : public FDataflowNode
{
public:
	TArray<struct FManagedArrayCollection>        Collections;                                       // 0x01A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FManagedArrayCollection                Collection;                                        // 0x01B0(0x00B0)(NativeAccessSpecifierPublic)
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetMergeClothCollectionsNode
// 0x0428 (0x05C8 - 0x01A0)
struct FChaosClothAssetMergeClothCollectionsNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	struct FManagedArrayCollection                Collection1;                                       // 0x0250(0x00B0)(NativeAccessSpecifierPublic)
	struct FManagedArrayCollection                Collection2;                                       // 0x0300(0x00B0)(NativeAccessSpecifierPublic)
	struct FManagedArrayCollection                Collection3;                                       // 0x03B0(0x00B0)(NativeAccessSpecifierPublic)
	struct FManagedArrayCollection                Collection4;                                       // 0x0460(0x00B0)(NativeAccessSpecifierPublic)
	struct FManagedArrayCollection                Collection5;                                       // 0x0510(0x00B0)(NativeAccessSpecifierPublic)
	int32                                         NumInputs;                                         // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C4[0x4];                                      // 0x05C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetSelectionFilterSet
// 0x0060 (0x0060 - 0x0000)
struct FChaosClothAssetSelectionFilterSet final
{
public:
	struct FChaosClothAssetConnectableIStringValue RenderSelection;                                   // 0x0000(0x0030)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableIStringValue SimSelection;                                      // 0x0030(0x0030)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetProxyDeformerNode_v2
// 0x0110 (0x02B0 - 0x01A0)
struct FChaosClothAssetProxyDeformerNode_v2 final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableIStringValue SimVertexSelection;                                // 0x0250(0x0030)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FChaosClothAssetSelectionFilterSet> SelectionFilterSets;                               // 0x0280(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bUseMultipleInfluences;                            // 0x0290(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InfluenceRadius;                                   // 0x0294(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSmoothTransition;                              // 0x0298(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SkinningBlendName;                                 // 0x02A0(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetProxyDeformerNode
// 0x0258 (0x03F8 - 0x01A0)
struct FChaosClothAssetProxyDeformerNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableIStringValue SimVertexSelection;                                // 0x0250(0x0030)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableIStringValue SelectionFilterSet0;                               // 0x0280(0x0030)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableStringValue SelectionFilterSet1;                               // 0x02B0(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableStringValue SelectionFilterSet2;                               // 0x02D0(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableStringValue SelectionFilterSet3;                               // 0x02F0(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableStringValue SelectionFilterSet4;                               // 0x0310(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableStringValue SelectionFilterSet5;                               // 0x0330(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableStringValue SelectionFilterSet6;                               // 0x0350(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableStringValue SelectionFilterSet7;                               // 0x0370(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableStringValue SelectionFilterSet8;                               // 0x0390(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableStringValue SelectionFilterSet9;                               // 0x03B0(0x0020)(Edit, NativeAccessSpecifierPublic)
	bool                                          bUseMultipleInfluences;                            // 0x03D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InfluenceRadius;                                   // 0x03D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSmoothTransition;                              // 0x03D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SkinningBlendName;                                 // 0x03E0(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumFilterSets;                                     // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetRemeshNode
// 0x00E8 (0x0288 - 0x01A0)
struct FChaosClothAssetRemeshNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	bool                                          bRemeshSim;                                        // 0x0250(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TargetPercentSim;                                  // 0x0254(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IterationsSim;                                     // 0x0258(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SmoothingSim;                                      // 0x0260(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemeshRender;                                     // 0x0268(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TargetPercentRender;                               // 0x026C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChaosClothAssetRemeshMethod                  RemeshMethodRender;                                // 0x0270(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IterationsRender;                                  // 0x0274(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        SmoothingRender;                                   // 0x0278(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemeshRenderSeams;                                // 0x0280(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RenderSeamRemeshIterations;                        // 0x0284(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetReverseNormalsNode
// 0x00E0 (0x0280 - 0x01A0)
struct FChaosClothAssetReverseNormalsNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	TArray<int32>                                 SimPatterns;                                       // 0x0250(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bReverseSimMeshNormals;                            // 0x0260(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverseSimMeshWindingOrder;                       // 0x0261(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 RenderPatterns;                                    // 0x0268(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bReverseRenderMeshNormals;                         // 0x0278(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverseRenderMeshWindingOrder;                    // 0x0279(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27A[0x6];                                      // 0x027A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetSelectionNode
// 0x0328 (0x04C8 - 0x01A0)
struct FChaosClothAssetSelectionNode final : public FDataflowTerminalNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	struct FManagedArrayCollection                TransferCollection;                                // 0x0250(0x00B0)(NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0300(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableIStringValue InputName;                                         // 0x0310(0x0030)(Edit, NativeAccessSpecifierPublic)
	EChaosClothAssetSelectionOverrideType         SelectionOverrideType;                             // 0x0340(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChaosClothAssetSelectionType                 Type;                                              // 0x0341(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChaosClothAssetNodeSelectionGroup     Group;                                             // 0x0348(0x0010)(Edit, NativeAccessSpecifierPublic)
	TSet<int32>                                   Indices;                                           // 0x0358(0x0050)(Edit, NativeAccessSpecifierPublic)
	TSet<int32>                                   RemoveIndices;                                     // 0x03A8(0x0050)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetNodeSelectionGroup     SecondaryGroup;                                    // 0x03F8(0x0010)(Edit, NativeAccessSpecifierPublic)
	TSet<int32>                                   SecondaryIndices;                                  // 0x0408(0x0050)(Edit, NativeAccessSpecifierPublic)
	TSet<int32>                                   RemoveSecondaryIndices;                            // 0x0458(0x0050)(Edit, NativeAccessSpecifierPublic)
	EChaosClothAssetWeightMapTransferType         SimTransferType;                                   // 0x04A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A9[0x3];                                      // 0x04A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TransferSelectionThreshold;                        // 0x04AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B0[0x10];                                     // 0x04B0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        TransferCollectionHash;                            // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetSelectionToIntMapNode
// 0x0110 (0x02B0 - 0x01A0)
struct FChaosClothAssetSelectionToIntMapNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableIStringValue SelectionName;                                     // 0x0250(0x0030)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetConnectableIOStringValue IntMapName;                                        // 0x0280(0x0020)(Edit, NativeAccessSpecifierPublic)
	bool                                          bKeepExistingUnselectedValues;                     // 0x02A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UnselectedValue;                                   // 0x02A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SelectedValue;                                     // 0x02A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetSelectionToWeightMapNode
// 0x00D8 (0x0278 - 0x01A0)
struct FChaosClothAssetSelectionToWeightMapNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	class FString                                 SelectionName;                                     // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WeightMapName;                                     // 0x0260(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnselectedValue;                                   // 0x0270(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SelectedValue;                                     // 0x0274(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetSetPhysicsAssetNode
// 0x00B8 (0x0258 - 0x01A0)
struct FChaosClothAssetSetPhysicsAssetNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x01A0(0x00B0)(NativeAccessSpecifierPublic)
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x0250(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetSimulationAerodynamicsConfigNode
// 0x0090 (0x02E8 - 0x0258)
struct FChaosClothAssetSimulationAerodynamicsConfigNode final : public FChaosClothAssetSimulationBaseConfigNode
{
public:
	float                                         FluidDensity;                                      // 0x0258(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              WindVelocity;                                      // 0x025C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChaosClothAssetWeightedValue          Drag;                                              // 0x0268(0x0040)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetWeightedValue          Lift;                                              // 0x02A8(0x0040)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetSimulationAnimDriveConfigNode
// 0x0080 (0x02D8 - 0x0258)
struct FChaosClothAssetSimulationAnimDriveConfigNode final : public FChaosClothAssetSimulationBaseConfigNode
{
public:
	struct FChaosClothAssetWeightedValue          AnimDriveStiffness;                                // 0x0258(0x0040)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetWeightedValue          AnimDriveDamping;                                  // 0x0298(0x0040)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetSimulationBackstopConfigNode
// 0x0080 (0x02D8 - 0x0258)
struct FChaosClothAssetSimulationBackstopConfigNode final : public FChaosClothAssetSimulationBaseConfigNode
{
public:
	struct FChaosClothAssetWeightedValue          BackstopDistance;                                  // 0x0258(0x0040)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetWeightedValue          BackstopRadius;                                    // 0x0298(0x0040)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetSimulationBendingConfigNode
// 0x0388 (0x05E0 - 0x0258)
struct FChaosClothAssetSimulationBendingConfigNode final : public FChaosClothAssetSimulationBaseConfigNode
{
public:
	EChaosClothAssetRestAngleConstructionType     RestAngleType;                                     // 0x0258(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChaosClothAssetWeightedValueNonAnimatable FlatnessRatio;                                     // 0x0260(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetWeightedValueNonAnimatable RestAngle;                                         // 0x0298(0x0038)(Edit, NativeAccessSpecifierPublic)
	EChaosClothAssetConstraintSolverType          SolverType;                                        // 0x02D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChaosClothAssetConstraintDistributionType    DistributionType;                                  // 0x02D1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChaosClothAssetBendingConstraintType         ConstraintType;                                    // 0x02D2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D3[0x5];                                      // 0x02D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChaosClothAssetWeightedValue          BendingStiffnessWarp;                              // 0x02D8(0x0040)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetWeightedValue          BendingStiffnessWeft;                              // 0x0318(0x0040)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetWeightedValue          BendingStiffnessBias;                              // 0x0358(0x0040)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetWeightedValue          BendingAnisoDamping;                               // 0x0398(0x0040)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetWeightedValue          AnisoBucklingRatio;                                // 0x03D8(0x0040)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetWeightedValue          BucklingStiffnessWarp;                             // 0x0418(0x0040)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetWeightedValue          BucklingStiffnessWeft;                             // 0x0458(0x0040)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetWeightedValue          BucklingStiffnessBias;                             // 0x0498(0x0040)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetWeightedValue          BendingStiffness;                                  // 0x04D8(0x0040)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetWeightedValue          BendingDamping;                                    // 0x0518(0x0040)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetWeightedValue          BucklingStiffness;                                 // 0x0558(0x0040)(Edit, NativeAccessSpecifierPublic)
	struct FChaosClothAssetWeightedValue          BucklingRatioWeighted;                             // 0x0598(0x0040)(Edit, NativeAccessSpecifierPublic)
	float                                         BucklingRatio;                                     // 0x05D8(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ChaosClothAssetDataflowNodes.ChaosClothAssetSimulationBendingOverrideConfigNode
// 0x0080 (0x02D8 - 0x0258)
struct FChaosClothAssetSimulationBendingOverrideConfigNode final : public FChaosClothAssetSimulationBaseConfigNode
{
public:
	EChaosClothAssetConstraintOverrideType        OverrideFlatnessRatio;                             // 0x0258(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChaosClothAssetWeightedValueOverride  FlatnessRatio;                                     // 0x025C(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EChaosClothAssetConstraintOverrideType        OverrideBendingStiffness;                          // 0x0264(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
