#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosClothGenerator

#include "Basic.hpp"

#include "ChaosClothAssetEngine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ChaosClothGenerator.ClothGeneratorComponent
// 0x0010 (0x0A40 - 0x0A30)
class UClothGeneratorComponent final : public UChaosClothComponent
{
public:
	uint8                                         Pad_A30[0x10];                                     // 0x0A30(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothGeneratorComponent">();
	}
	static class UClothGeneratorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothGeneratorComponent>();
	}
};

// Class ChaosClothGenerator.ClothGeneratorProperties
// 0x0050 (0x0080 - 0x0030)
class UClothGeneratorProperties final : public UObject
{
public:
	class USkinnedAsset*                          SkeletalMeshAsset;                                 // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChaosClothAsset*                       ClothAsset;                                        // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          AnimationSequence;                                 // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FramesToSimulate;                                  // 0x0048(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryCache*                         SimulatedCache;                                    // 0x0058(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebug;                                            // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        DebugFrame;                                        // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryCache*                         DebugCache;                                        // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeStep;                                          // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSteps;                                          // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumThreads;                                        // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothGeneratorProperties">();
	}
	static class UClothGeneratorProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothGeneratorProperties>();
	}
};

}

