#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosVD

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UnrealEd_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ChaosVD_structs.hpp"


namespace SDK
{

// Class ChaosVD.ChaosVDSettingsObjectBase
// 0x0028 (0x0058 - 0x0030)
class UChaosVDSettingsObjectBase : public UObject
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDSettingsObjectBase">();
	}
	static class UChaosVDSettingsObjectBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDSettingsObjectBase>();
	}
};

// Class ChaosVD.ChaosVDVisualizationSettingsObjectBase
// 0x0000 (0x0058 - 0x0058)
class UChaosVDVisualizationSettingsObjectBase : public UChaosVDSettingsObjectBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDVisualizationSettingsObjectBase">();
	}
	static class UChaosVDVisualizationSettingsObjectBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDVisualizationSettingsObjectBase>();
	}
};

// Class ChaosVD.ChaosVDAccelerationStructureVisualizationSettings
// 0x0010 (0x0068 - 0x0058)
class UChaosVDAccelerationStructureVisualizationSettings final : public UChaosVDVisualizationSettingsObjectBase
{
public:
	ESceneDepthPriorityGroup                      DepthPriority;                                     // 0x0058(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseThickness;                                     // 0x005C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        AccelerationStructureDataVisualizationFlags;       // 0x0060(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDAccelerationStructureVisualizationSettings">();
	}
	static class UChaosVDAccelerationStructureVisualizationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDAccelerationStructureVisualizationSettings>();
	}
};

// Class ChaosVD.ChaosVDCharacterConstraintsVisualizationSettings
// 0x0028 (0x0080 - 0x0058)
class UChaosVDCharacterConstraintsVisualizationSettings final : public UChaosVDVisualizationSettingsObjectBase
{
public:
	bool                                          bShowDebugText;                                    // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoSelectConstraintFromSelectedParticle;         // 0x0059(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESceneDepthPriorityGroup                      DepthPriority;                                     // 0x005A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ForceScale;                                        // 0x005C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TorqueScale;                                       // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GeneralScale;                                      // 0x0064(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseLineThickness;                                 // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 NormalForceColor;                                  // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 RadialForceColor;                                  // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 TorqueColor;                                       // 0x0074(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        GlobalCharacterGroundConstraintDataVisualizationFlags; // 0x0078(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDCharacterConstraintsVisualizationSettings">();
	}
	static class UChaosVDCharacterConstraintsVisualizationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDCharacterConstraintsVisualizationSettings>();
	}
};

// Class ChaosVD.ChaosVDCharacterGroundConstraintDataProviderInterface
// 0x0000 (0x0030 - 0x0030)
class IChaosVDCharacterGroundConstraintDataProviderInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDCharacterGroundConstraintDataProviderInterface">();
	}
	static class IChaosVDCharacterGroundConstraintDataProviderInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChaosVDCharacterGroundConstraintDataProviderInterface>();
	}
};

// Class ChaosVD.ChaosVDCollisionDataProviderInterface
// 0x0000 (0x0030 - 0x0030)
class IChaosVDCollisionDataProviderInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDCollisionDataProviderInterface">();
	}
	static class IChaosVDCollisionDataProviderInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChaosVDCollisionDataProviderInterface>();
	}
};

// Class ChaosVD.ChaosVDCollisionDataVisualizationSettings
// 0x0010 (0x0068 - 0x0058)
class UChaosVDCollisionDataVisualizationSettings final : public UChaosVDVisualizationSettingsObjectBase
{
public:
	bool                                          bShowDebugText;                                    // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESceneDepthPriorityGroup                      DepthPriority;                                     // 0x0059(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ContactCircleRadius;                               // 0x005C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ContactNormalScale;                                // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        CollisionDataVisualizationFlags;                   // 0x0064(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDCollisionDataVisualizationSettings">();
	}
	static class UChaosVDCollisionDataVisualizationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDCollisionDataVisualizationSettings>();
	}
};

// Class ChaosVD.ChaosVDSolverDataComponent
// 0x0018 (0x00F0 - 0x00D8)
class UChaosVDSolverDataComponent : public UActorComponent
{
public:
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDSolverDataComponent">();
	}
	static class UChaosVDSolverDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDSolverDataComponent>();
	}
};

// Class ChaosVD.ChaosVDConstraintDataComponent
// 0x0100 (0x01F0 - 0x00F0)
class UChaosVDConstraintDataComponent : public UChaosVDSolverDataComponent
{
public:
	uint8                                         Pad_F0[0x100];                                     // 0x00F0(0x0100)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDConstraintDataComponent">();
	}
	static class UChaosVDConstraintDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDConstraintDataComponent>();
	}
};

// Class ChaosVD.ChaosVDSettingsObjectsOuter
// 0x0000 (0x0030 - 0x0030)
class UChaosVDSettingsObjectsOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDSettingsObjectsOuter">();
	}
	static class UChaosVDSettingsObjectsOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDSettingsObjectsOuter>();
	}
};

// Class ChaosVD.ChaosVDCoreSettings
// 0x0118 (0x0170 - 0x0058)
class UChaosVDCoreSettings final : public UChaosVDSettingsObjectBase
{
public:
	TSoftObjectPtr<class UMaterial>               QueryOnlyMeshesMaterial;                           // 0x0058(0x0030)(Transient, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterial>               SimOnlyMeshesMaterial;                             // 0x0088(0x0030)(Transient, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterial>               InstancedMeshesMaterial;                           // 0x00B8(0x0030)(Transient, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterial>               InstancedMeshesQueryOnlyMaterial;                  // 0x00E8(0x0030)(Transient, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         SkySphereActorClass;                               // 0x0118(0x0028)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTextureCube>            AmbientCubeMapTexture;                             // 0x0140(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDCoreSettings">();
	}
	static class UChaosVDCoreSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDCoreSettings>();
	}
};

// Class ChaosVD.ChaosVDDataContainerBaseActor
// 0x0010 (0x0430 - 0x0420)
class AChaosVDDataContainerBaseActor : public AActor
{
public:
	uint8                                         Pad_420[0x10];                                     // 0x0420(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDDataContainerBaseActor">();
	}
	static class AChaosVDDataContainerBaseActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChaosVDDataContainerBaseActor>();
	}
};

// Class ChaosVD.ChaosVDEditorMode
// 0x0008 (0x0158 - 0x0150)
class UChaosVDEditorMode final : public UBaseLegacyWidgetEdMode
{
public:
	uint8                                         Pad_150[0x8];                                      // 0x0150(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDEditorMode">();
	}
	static class UChaosVDEditorMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDEditorMode>();
	}
};

// Class ChaosVD.ChaosVDGameFrameInfoActor
// 0x0008 (0x0438 - 0x0430)
class AChaosVDGameFrameInfoActor final : public AChaosVDDataContainerBaseActor
{
public:
	class UChaosVDGenericDebugDrawDataComponent*  GenericDebugDrawDataComponent;                     // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDGameFrameInfoActor">();
	}
	static class AChaosVDGameFrameInfoActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChaosVDGameFrameInfoActor>();
	}
};

// Class ChaosVD.ChaosVDGenericDebugDrawDataComponent
// 0x0040 (0x0130 - 0x00F0)
class UChaosVDGenericDebugDrawDataComponent final : public UChaosVDSolverDataComponent
{
public:
	uint8                                         Pad_F0[0x40];                                      // 0x00F0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDGenericDebugDrawDataComponent">();
	}
	static class UChaosVDGenericDebugDrawDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDGenericDebugDrawDataComponent>();
	}
};

// Class ChaosVD.ChaosVDGenericDebugDrawSettings
// 0x0010 (0x0068 - 0x0058)
class UChaosVDGenericDebugDrawSettings final : public UChaosVDSettingsObjectBase
{
public:
	bool                                          bShowDebugText;                                    // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESceneDepthPriorityGroup                      DepthPriority;                                     // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseThickness;                                     // 0x005C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        DebugDrawFlags;                                    // 0x0060(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDGenericDebugDrawSettings">();
	}
	static class UChaosVDGenericDebugDrawSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDGenericDebugDrawSettings>();
	}
};

// Class ChaosVD.ChaosVDGeometryContainer
// 0x0000 (0x0420 - 0x0420)
class AChaosVDGeometryContainer final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDGeometryContainer">();
	}
	static class AChaosVDGeometryContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChaosVDGeometryContainer>();
	}
};

// Class ChaosVD.ChaosVDGeometryComponent
// 0x0000 (0x0030 - 0x0030)
class IChaosVDGeometryComponent final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDGeometryComponent">();
	}
	static class IChaosVDGeometryComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChaosVDGeometryComponent>();
	}
};

// Class ChaosVD.ChaosVDGeometryOwnerInterface
// 0x0000 (0x0030 - 0x0030)
class IChaosVDGeometryOwnerInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDGeometryOwnerInterface">();
	}
	static class IChaosVDGeometryOwnerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChaosVDGeometryOwnerInterface>();
	}
};

// Class ChaosVD.ChaosVDGTAccelerationStructuresDataComponent
// 0x0010 (0x0100 - 0x00F0)
class UChaosVDGTAccelerationStructuresDataComponent final : public UChaosVDSolverDataComponent
{
public:
	uint8                                         Pad_F0[0x10];                                      // 0x00F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDGTAccelerationStructuresDataComponent">();
	}
	static class UChaosVDGTAccelerationStructuresDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDGTAccelerationStructuresDataComponent>();
	}
};

// Class ChaosVD.ChaosVDInstancedStaticMeshComponent
// 0x00D0 (0x0AF0 - 0x0A20)
class UChaosVDInstancedStaticMeshComponent final : public UInstancedStaticMeshComponent
{
public:
	uint8                                         Pad_A20[0x20];                                     // 0x0A20(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CurrentMaterial;                                   // 0x0A40(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EChaosVDMaterialType, class UMaterialInstanceDynamic*> CachedMaterialInstancesByID;                       // 0x0A48(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_A98[0x58];                                     // 0x0A98(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDInstancedStaticMeshComponent">();
	}
	static class UChaosVDInstancedStaticMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDInstancedStaticMeshComponent>();
	}
};

// Class ChaosVD.ChaosVDJointConstraintsVisualizationSettings
// 0x0020 (0x0078 - 0x0058)
class UChaosVDJointConstraintsVisualizationSettings final : public UChaosVDVisualizationSettingsObjectBase
{
public:
	bool                                          bShowDebugText;                                    // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESceneDepthPriorityGroup                      DepthPriority;                                     // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LinearImpulseScale;                                // 0x005C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularImpulseScale;                               // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GeneralScale;                                      // 0x0064(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseLineThickness;                                 // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CenterOfMassSize;                                  // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConstraintAxisLength;                              // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        GlobalJointsDataVisualizationFlags;                // 0x0074(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDJointConstraintsVisualizationSettings">();
	}
	static class UChaosVDJointConstraintsVisualizationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDJointConstraintsVisualizationSettings>();
	}
};

// Class ChaosVD.ChaosVDMiscSettings
// 0x0018 (0x0070 - 0x0058)
class UChaosVDMiscSettings final : public UChaosVDSettingsObjectBase
{
public:
	TArray<struct FChaosVDRecentFile>             RecentFiles;                                       // 0x0058(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	int32                                         MaxRecentFilesNum;                                 // 0x0068(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDMiscSettings">();
	}
	static class UChaosVDMiscSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDMiscSettings>();
	}
};

// Class ChaosVD.ChaosVDParticleActor
// 0x0100 (0x0520 - 0x0420)
class AChaosVDParticleActor final : public AActor
{
public:
	uint8                                         Pad_420[0x100];                                    // 0x0420(0x0100)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDParticleActor">();
	}
	static class AChaosVDParticleActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChaosVDParticleActor>();
	}
};

// Class ChaosVD.ChaosVDParticleDataComponent
// 0x0000 (0x00D8 - 0x00D8)
class UChaosVDParticleDataComponent final : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDParticleDataComponent">();
	}
	static class UChaosVDParticleDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDParticleDataComponent>();
	}
};

// Class ChaosVD.ChaosVDParticleVisualizationColorSettings
// 0x0030 (0x0088 - 0x0058)
class UChaosVDParticleVisualizationColorSettings final : public UChaosVDVisualizationSettingsObjectBase
{
public:
	EChaosVDParticleDebugColorMode                ParticleColorMode;                                 // 0x0058(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChaosDebugDrawColorsByShapeType       ColorsByShapeType;                                 // 0x005C(0x0014)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FChaosDebugDrawColorsByState           ColorsByParticleState;                             // 0x0070(0x0010)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FChaosDebugDrawColorsByClientServer    ColorsByClientServer;                              // 0x0080(0x0008)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDParticleVisualizationColorSettings">();
	}
	static class UChaosVDParticleVisualizationColorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDParticleVisualizationColorSettings>();
	}
};

// Class ChaosVD.ChaosVDParticleVisualizationDebugDrawSettings
// 0x00A8 (0x0100 - 0x0058)
class UChaosVDParticleVisualizationDebugDrawSettings final : public UChaosVDVisualizationSettingsObjectBase
{
public:
	bool                                          bShowDebugText;                                    // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESceneDepthPriorityGroup                      DepthPriority;                                     // 0x0059(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VelocityScale;                                     // 0x005C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularVelocityScale;                              // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AccelerationScale;                                 // 0x0064(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularAccelerationScale;                          // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearImpulseScale;                                // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularImpulseScale;                               // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CenterOfMassRadius;                                // 0x0074(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChaosParticleDataDebugDrawColors      ColorSettings;                                     // 0x0078(0x0080)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint32                                        ParticleDataVisualizationFlags;                    // 0x00F8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDParticleVisualizationDebugDrawSettings">();
	}
	static class UChaosVDParticleVisualizationDebugDrawSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDParticleVisualizationDebugDrawSettings>();
	}
};

// Class ChaosVD.ChaosVDParticleVisualizationSettings
// 0x0008 (0x0060 - 0x0058)
class UChaosVDParticleVisualizationSettings final : public UChaosVDVisualizationSettingsObjectBase
{
public:
	uint32                                        GeometryVisibilityFlags;                           // 0x0058(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDParticleVisualizationSettings">();
	}
	static class UChaosVDParticleVisualizationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDParticleVisualizationSettings>();
	}
};

// Class ChaosVD.ChaosVDPooledObject
// 0x0000 (0x0030 - 0x0030)
class IChaosVDPooledObject final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDPooledObject">();
	}
	static class IChaosVDPooledObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChaosVDPooledObject>();
	}
};

// Class ChaosVD.ChaosVDSceneQueryDataComponent
// 0x00B0 (0x01A0 - 0x00F0)
class UChaosVDSceneQueryDataComponent final : public UChaosVDSolverDataComponent
{
public:
	uint8                                         Pad_F0[0xB0];                                      // 0x00F0(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDSceneQueryDataComponent">();
	}
	static class UChaosVDSceneQueryDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDSceneQueryDataComponent>();
	}
};

// Class ChaosVD.ChaosVDSceneQueriesVisualizationSettings
// 0x0008 (0x0060 - 0x0058)
class UChaosVDSceneQueriesVisualizationSettings final : public UChaosVDVisualizationSettingsObjectBase
{
public:
	bool                                          bShowText;                                         // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESceneDepthPriorityGroup                      DepthPriority;                                     // 0x0059(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChaosVDSQFrameVisualizationMode              CurrentVisualizationMode;                          // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        GlobalSceneQueriesVisualizationFlags;              // 0x005C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDSceneQueriesVisualizationSettings">();
	}
	static class UChaosVDSceneQueriesVisualizationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDSceneQueriesVisualizationSettings>();
	}
};

// Class ChaosVD.ChaosVDSelectableObject
// 0x0000 (0x0030 - 0x0030)
class IChaosVDSelectableObject final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDSelectableObject">();
	}
	static class IChaosVDSelectableObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChaosVDSelectableObject>();
	}
};

// Class ChaosVD.ChaosVDSkySphereInterface
// 0x0000 (0x0030 - 0x0030)
class IChaosVDSkySphereInterface final : public IInterface
{
public:
	void Refresh();
	void SetDirectionalLightSource(class ADirectionalLight* NewLightSource);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDSkySphereInterface">();
	}
	static class IChaosVDSkySphereInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChaosVDSkySphereInterface>();
	}
};

// Class ChaosVD.ChaosVDSolverCharacterGroundConstraintDataComponent
// 0x0000 (0x01F0 - 0x01F0)
class UChaosVDSolverCharacterGroundConstraintDataComponent final : public UChaosVDConstraintDataComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDSolverCharacterGroundConstraintDataComponent">();
	}
	static class UChaosVDSolverCharacterGroundConstraintDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDSolverCharacterGroundConstraintDataComponent>();
	}
};

// Class ChaosVD.ChaosVDSolverCollisionDataComponent
// 0x0150 (0x0240 - 0x00F0)
class UChaosVDSolverCollisionDataComponent final : public UChaosVDSolverDataComponent
{
public:
	uint8                                         Pad_F0[0x150];                                     // 0x00F0(0x0150)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDSolverCollisionDataComponent">();
	}
	static class UChaosVDSolverCollisionDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDSolverCollisionDataComponent>();
	}
};

// Class ChaosVD.ChaosVDSolverInfoActor
// 0x0190 (0x05C0 - 0x0430)
class AChaosVDSolverInfoActor final : public AChaosVDDataContainerBaseActor
{
public:
	uint8                                         Pad_430[0x10];                                     // 0x0430(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SolverID;                                          // 0x0440(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_444[0xC];                                      // 0x0444(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SimulationTransform;                               // 0x0450(0x0060)(Edit, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   SolverName;                                        // 0x04B0(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChaosVDSolverCollisionDataComponent*   CollisionDataComponent;                            // 0x04C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<int32, class AChaosVDParticleActor*>     SolverParticlesByID;                               // 0x04C8(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_518[0x78];                                     // 0x0518(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class UChaosVDParticleDataComponent*          ParticleDataComponent;                             // 0x0590(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UChaosVDSolverJointConstraintDataComponent* JointsDataComponent;                               // 0x0598(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UChaosVDSolverCharacterGroundConstraintDataComponent* CharacterGroundConstraintDataComponent;            // 0x05A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UChaosVDGTAccelerationStructuresDataComponent* GTAccelerationStructuresDataComponent;             // 0x05A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UChaosVDSceneQueryDataComponent*        SceneQueryDataComponent;                           // 0x05B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UChaosVDGenericDebugDrawDataComponent*  GenericDebugDrawDataComponent;                     // 0x05B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDSolverInfoActor">();
	}
	static class AChaosVDSolverInfoActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChaosVDSolverInfoActor>();
	}
};

// Class ChaosVD.ChaosVDSolverJointConstraintDataComponent
// 0x0000 (0x01F0 - 0x01F0)
class UChaosVDSolverJointConstraintDataComponent final : public UChaosVDConstraintDataComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDSolverJointConstraintDataComponent">();
	}
	static class UChaosVDSolverJointConstraintDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDSolverJointConstraintDataComponent>();
	}
};

// Class ChaosVD.ChaosVDSolverTrackSettings
// 0x0008 (0x0060 - 0x0058)
class UChaosVDSolverTrackSettings final : public UChaosVDSettingsObjectBase
{
public:
	EChaosVDSyncTimelinesMode                     SyncMode;                                          // 0x0058(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDSolverTrackSettings">();
	}
	static class UChaosVDSolverTrackSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDSolverTrackSettings>();
	}
};

// Class ChaosVD.ChaosVDStaticMeshComponent
// 0x0080 (0x0720 - 0x06A0)
class UChaosVDStaticMeshComponent final : public UStaticMeshComponent
{
public:
	uint8                                         Pad_6A0[0x80];                                     // 0x06A0(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDStaticMeshComponent">();
	}
	static class UChaosVDStaticMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDStaticMeshComponent>();
	}
};

// Class ChaosVD.ChaosVDLogBrowserToolbarMenuContext
// 0x0010 (0x0040 - 0x0030)
class UChaosVDLogBrowserToolbarMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDLogBrowserToolbarMenuContext">();
	}
	static class UChaosVDLogBrowserToolbarMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDLogBrowserToolbarMenuContext>();
	}
};

// Class ChaosVD.ChaosVDMainToolbarMenuContext
// 0x0010 (0x0040 - 0x0030)
class UChaosVDMainToolbarMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDMainToolbarMenuContext">();
	}
	static class UChaosVDMainToolbarMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDMainToolbarMenuContext>();
	}
};

// Class ChaosVD.ChaosVDRecordingToolbarMenuContext
// 0x0010 (0x0040 - 0x0030)
class UChaosVDRecordingToolbarMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDRecordingToolbarMenuContext">();
	}
	static class UChaosVDRecordingToolbarMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDRecordingToolbarMenuContext>();
	}
};

// Class ChaosVD.ChaosVDSceneQueryBrowserToolbarMenuContext
// 0x0010 (0x0040 - 0x0030)
class UChaosVDSceneQueryBrowserToolbarMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDSceneQueryBrowserToolbarMenuContext">();
	}
	static class UChaosVDSceneQueryBrowserToolbarMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDSceneQueryBrowserToolbarMenuContext>();
	}
};

// Class ChaosVD.ChaosVDSolverTracksToolbarMenuContext
// 0x0010 (0x0040 - 0x0030)
class UChaosVDSolverTracksToolbarMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosVDSolverTracksToolbarMenuContext">();
	}
	static class UChaosVDSolverTracksToolbarMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosVDSolverTracksToolbarMenuContext>();
	}
};

}

