#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosClothAssetEditorTools

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MeshModelingToolsExp_classes.hpp"
#include "ModelingComponents_classes.hpp"
#include "InteractiveToolsFramework_classes.hpp"
#include "ChaosClothAssetDataflowNodes_structs.hpp"
#include "ChaosClothAssetEditorTools_structs.hpp"


namespace SDK
{

// Class ChaosClothAssetEditorTools.ChaosClothAssetEditorToolBuilder
// 0x0000 (0x0030 - 0x0030)
class IChaosClothAssetEditorToolBuilder final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChaosClothAssetEditorToolBuilder">();
	}
	static class IChaosClothAssetEditorToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChaosClothAssetEditorToolBuilder>();
	}
};

// Class ChaosClothAssetEditorTools.ClothEditorWeightMapPaintToolBuilder
// 0x0008 (0x0040 - 0x0038)
class UClothEditorWeightMapPaintToolBuilder final : public UMeshSurfacePointMeshEditingToolBuilder
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothEditorWeightMapPaintToolBuilder">();
	}
	static class UClothEditorWeightMapPaintToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothEditorWeightMapPaintToolBuilder>();
	}
};

// Class ChaosClothAssetEditorTools.ClothMeshSelectionToolBuilder
// 0x0008 (0x0038 - 0x0030)
class UClothMeshSelectionToolBuilder final : public UInteractiveToolWithToolTargetsBuilder
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothMeshSelectionToolBuilder">();
	}
	static class UClothMeshSelectionToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothMeshSelectionToolBuilder>();
	}
};

// Class ChaosClothAssetEditorTools.ClothTransferSkinWeightsToolBuilder
// 0x0008 (0x0038 - 0x0030)
class UClothTransferSkinWeightsToolBuilder final : public USingleSelectionMeshEditingToolBuilder
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothTransferSkinWeightsToolBuilder">();
	}
	static class UClothTransferSkinWeightsToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothTransferSkinWeightsToolBuilder>();
	}
};

// Class ChaosClothAssetEditorTools.ClothTransferSkinWeightsToolProperties
// 0x0058 (0x0108 - 0x00B0)
class UClothTransferSkinWeightsToolProperties final : public UInteractiveToolPropertySet
{
public:
	class USkeletalMesh*                          SourceMesh;                                        // 0x00B0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3d                              SourceMeshTranslation;                             // 0x00B8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3d                              SourceMeshRotation;                                // 0x00D0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3d                              SourceMeshScale;                                   // 0x00E8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideSourceMesh;                                   // 0x0100(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothTransferSkinWeightsToolProperties">();
	}
	static class UClothTransferSkinWeightsToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothTransferSkinWeightsToolProperties>();
	}
};

// Class ChaosClothAssetEditorTools.ClothTransferSkinWeightsTool
// 0x0060 (0x0118 - 0x00B8)
class UClothTransferSkinWeightsTool final : public USingleSelectionMeshEditingTool
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UClothTransferSkinWeightsToolProperties* ToolProperties;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UClothEditorContextObject*              ClothEditorContextObject;                          // 0x00C8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMeshOpPreviewWithBackgroundCompute*    TargetClothPreview;                                // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AInternalToolFrameworkActor*            SourceMeshParentActor;                             // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 SourceMeshComponent;                               // 0x00E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTransformProxy*                        SourceMeshTransformProxy;                          // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCombinedTransformGizmo*                SourceMeshTransformGizmo;                          // 0x00F0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x20];                                      // 0x00F8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothTransferSkinWeightsTool">();
	}
	static class UClothTransferSkinWeightsTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothTransferSkinWeightsTool>();
	}
};

// Class ChaosClothAssetEditorTools.WeightMapEraseBrushOpProps
// 0x0008 (0x00B8 - 0x00B0)
class UWeightMapEraseBrushOpProps final : public UMeshSculptBrushOpProps
{
public:
	double                                        AttributeValue;                                    // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WeightMapEraseBrushOpProps">();
	}
	static class UWeightMapEraseBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeightMapEraseBrushOpProps>();
	}
};

// Class ChaosClothAssetEditorTools.WeightMapPaintBrushOpProps
// 0x0010 (0x00C0 - 0x00B0)
class UWeightMapPaintBrushOpProps final : public UMeshSculptBrushOpProps
{
public:
	double                                        AttributeValue;                                    // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Strength;                                          // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WeightMapPaintBrushOpProps">();
	}
	static class UWeightMapPaintBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeightMapPaintBrushOpProps>();
	}
};

// Class ChaosClothAssetEditorTools.WeightMapSmoothBrushOpProps
// 0x0008 (0x00B8 - 0x00B0)
class UWeightMapSmoothBrushOpProps final : public UMeshSculptBrushOpProps
{
public:
	float                                         Strength;                                          // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WeightMapSmoothBrushOpProps">();
	}
	static class UWeightMapSmoothBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeightMapSmoothBrushOpProps>();
	}
};

// Class ChaosClothAssetEditorTools.ClothEditorContextObject
// 0x0040 (0x0070 - 0x0030)
class UClothEditorContextObject final : public UObject
{
public:
	uint8                                         Pad_30[0x40];                                      // 0x0030(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothEditorContextObject">();
	}
	static class UClothEditorContextObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothEditorContextObject>();
	}
};

// Class ChaosClothAssetEditorTools.ClothMeshSelectionMechanic
// 0x0000 (0x0B50 - 0x0B50)
class UClothMeshSelectionMechanic final : public UPolygonSelectionMechanic
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothMeshSelectionMechanic">();
	}
	static class UClothMeshSelectionMechanic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothMeshSelectionMechanic>();
	}
};

// Class ChaosClothAssetEditorTools.ClothMeshSelectionToolActions
// 0x0008 (0x00B8 - 0x00B0)
class UClothMeshSelectionToolActions final : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FloodSelection();
	void GrowSelection();
	void ImportFromCollection();
	void ImportSecondaryFromCollection();
	void ShrinkSelection();
	void TogglePrimarySecondary();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothMeshSelectionToolActions">();
	}
	static class UClothMeshSelectionToolActions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothMeshSelectionToolActions>();
	}
};

// Class ChaosClothAssetEditorTools.ClothMeshSelectionToolProperties
// 0x0018 (0x00C8 - 0x00B0)
class UClothMeshSelectionToolProperties final : public UInteractiveToolPropertySet
{
public:
	class FString                                 Name_0;                                            // 0x00B0(0x0010)(Edit, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChaosClothAssetSelectionOverrideType         SelectionOverrideType;                             // 0x00C0(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSecondarySelection;                               // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowVertices;                                     // 0x00C2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowEdges;                                        // 0x00C3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothMeshSelectionToolProperties">();
	}
	static class UClothMeshSelectionToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothMeshSelectionToolProperties>();
	}
};

// Class ChaosClothAssetEditorTools.ClothMeshSelectionTool
// 0x00B8 (0x0170 - 0x00B8)
class UClothMeshSelectionTool final : public USingleSelectionMeshEditingTool
{
public:
	class UClothMeshSelectionToolProperties*      ToolProperties;                                    // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPreviewMesh*                           PreviewMesh;                                       // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPolygonSelectionMechanic*              SelectionMechanic;                                 // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UClothEditorContextObject*              ClothEditorContextObject;                          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x88];                                      // 0x00D8(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	class UClothMeshSelectionToolActions*         ActionsProps;                                      // 0x0160(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothMeshSelectionTool">();
	}
	static class UClothMeshSelectionTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothMeshSelectionTool>();
	}
};

// Class ChaosClothAssetEditorTools.ClothEditorWeightMapPaintBrushFilterProperties
// 0x0040 (0x00F0 - 0x00B0)
class UClothEditorWeightMapPaintBrushFilterProperties final : public UInteractiveToolPropertySet
{
public:
	EClothEditorWeightMapDisplayType              ColorMap;                                          // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHighlightZeroAndOne;                              // 0x00B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EClothEditorWeightMapPaintInteractionType     SubToolType;                                       // 0x00B2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EClothEditorWeightMapPaintBrushType           PrimaryBrushType;                                  // 0x00B3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BrushSize;                                         // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitBackFaces;                                     // 0x00B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AttributeValue;                                    // 0x00C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Strength;                                          // 0x00C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        GradientHighValue;                                 // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        GradientLowValue;                                  // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleThreshold;                                    // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUVSeams;                                          // 0x00E4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNormalSeams;                                      // 0x00E5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EClothEditorWeightMapPaintVisibilityType      VisibilityFilter;                                  // 0x00E6(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E7[0x1];                                       // 0x00E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ValueAtBrush;                                      // 0x00E8(0x0008)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothEditorWeightMapPaintBrushFilterProperties">();
	}
	static class UClothEditorWeightMapPaintBrushFilterProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothEditorWeightMapPaintBrushFilterProperties>();
	}
};

// Class ChaosClothAssetEditorTools.ClothEditorMeshWeightMapPaintToolActions
// 0x0008 (0x00B8 - 0x00B0)
class UClothEditorMeshWeightMapPaintToolActions final : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearAll();
	void FloodFillCurrent();
	void Invert();
	void Multiply();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothEditorMeshWeightMapPaintToolActions">();
	}
	static class UClothEditorMeshWeightMapPaintToolActions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothEditorMeshWeightMapPaintToolActions>();
	}
};

// Class ChaosClothAssetEditorTools.ClothEditorUpdateWeightMapProperties
// 0x0018 (0x00C8 - 0x00B0)
class UClothEditorUpdateWeightMapProperties final : public UInteractiveToolPropertySet
{
public:
	class FString                                 Name_0;                                            // 0x00B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChaosClothAssetWeightMapOverrideType         MapOverrideType;                                   // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothEditorUpdateWeightMapProperties">();
	}
	static class UClothEditorUpdateWeightMapProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothEditorUpdateWeightMapProperties>();
	}
};

// Class ChaosClothAssetEditorTools.ClothEditorMeshWeightMapPaintToolShowHideProperties
// 0x0058 (0x0108 - 0x00B0)
class UClothEditorMeshWeightMapPaintToolShowHideProperties final : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, bool>                             ShowPatterns;                                      // 0x00B8(0x0050)(Edit, EditFixedSize, Transient, NativeAccessSpecifierPublic)

public:
	void ShowAll();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothEditorMeshWeightMapPaintToolShowHideProperties">();
	}
	static class UClothEditorMeshWeightMapPaintToolShowHideProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothEditorMeshWeightMapPaintToolShowHideProperties>();
	}
};

// Class ChaosClothAssetEditorTools.ClothEditorWeightMapPaintTool
// 0x0850 (0x13F0 - 0x0BA0)
class UClothEditorWeightMapPaintTool final : public UMeshSculptToolBase
{
public:
	class UClothEditorWeightMapPaintBrushFilterProperties* FilterProperties;                                  // 0x0BA0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWeightMapPaintBrushOpProps*            PaintBrushOpProperties;                            // 0x0BA8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWeightMapSmoothBrushOpProps*           SmoothBrushOpProperties;                           // 0x0BB0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWeightMapEraseBrushOpProps*            EraseBrushOpProperties;                            // 0x0BB8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UClothEditorMeshWeightMapPaintToolActions* ActionsProps;                                      // 0x0BC0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClothEditorUpdateWeightMapProperties*  UpdateWeightMapProperties;                         // 0x0BC8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BD0[0x8];                                      // 0x0BD0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UPolyLassoMarqueeMechanic*              PolyLassoMechanic;                                 // 0x0BD8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPolygonSelectionMechanic*              PolygonSelectionMechanic;                          // 0x0BE0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BE8[0x318];                                    // 0x0BE8(0x0318)(Fixing Size After Last Property [ Dumper-7 ])
	class UClothEditorMeshWeightMapPaintToolShowHideProperties* ShowHideProperties;                                // 0x0F00(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F08[0xB0];                                     // 0x0F08(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	class AInternalToolFrameworkActor*            PreviewMeshActor;                                  // 0x0FB8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicMeshComponent*                  DynamicMeshComponent;                              // 0x0FC0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshElementsVisualizer*                MeshElementsDisplay;                               // 0x0FC8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClothEditorContextObject*              ClothEditorContextObject;                          // 0x0FD0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FD8[0x418];                                    // 0x0FD8(0x0418)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothEditorWeightMapPaintTool">();
	}
	static class UClothEditorWeightMapPaintTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothEditorWeightMapPaintTool>();
	}
};

}

