#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChapWormGameplayRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "TacticalSprintRuntime_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class ChapWormGameplayRuntime.ChapWormLayerAnimInstance
// 0x0050 (0x14F0 - 0x14A0)
class UChapWormLayerAnimInstance final : public UFortPlayerAnimInstanceProxy
{
public:
	bool                                          bIsKineticEnergyIdle;                              // 0x1498(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEnterBaseToActivate;                           // 0x1499(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_149A[0x2];                                     // 0x149A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           KineticEnergyActivateTagName;                      // 0x149C(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ApplyOverpowerStatusTagName;                       // 0x14A8(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           AthenaInVehicleTagName;                            // 0x14B4(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SurfaceSwimmingTagName;                            // 0x14C0(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           IsGrindingTagName;                                 // 0x14CC(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           HoverActiveTagName;                                // 0x14D8(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ZipLiningOnSplineTagName;                          // 0x14E4(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChapWormLayerAnimInstance">();
	}
	static class UChapWormLayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChapWormLayerAnimInstance>();
	}
};

// Class ChapWormGameplayRuntime.FortCameraModifier_ChapWorm
// 0x0060 (0x0100 - 0x00A0)
class alignas(0x10) UFortCameraModifier_ChapWorm final : public UFortCameraModifier_Custom
{
public:
	float                                         CameraModifierLifetimeDuration;                    // 0x00A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           OverpoweredGameplayTag;                            // 0x00A4(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInterpCameraViewFov;                              // 0x00B0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FovInterpSpeed;                                    // 0x00B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TargetDeltaFov_Default;                            // 0x00B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TargetDeltaFov_Overpowered;                        // 0x00BC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInterpCameraViewLocation;                         // 0x00C0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeltaLocationInterpSpeed;                          // 0x00C4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TargetDeltaForwardDirectionOffset_Default;         // 0x00C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TargetDeltaForwardDirectionOffset_Overpowered;     // 0x00CC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWindingDown;                                      // 0x00D0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentDeltaFov;                                   // 0x00D4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                CurrentDeltaLocation;                              // 0x00D8(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           LifetimeDurationTimerHandle;                       // 0x00F0(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void WindDownAndRemove();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCameraModifier_ChapWorm">();
	}
	static class UFortCameraModifier_ChapWorm* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCameraModifier_ChapWorm>();
	}
};

// Class ChapWormGameplayRuntime.FortGameplayAbility_ChapWorm_InventoryPassive
// 0x0048 (0x0C10 - 0x0BC8)
class UFortGameplayAbility_ChapWorm_InventoryPassive final : public UFortGameplayAbility
{
public:
	uint8                                         Pad_BC8[0x48];                                     // 0x0BC8(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void IncrementKineticEnergy();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayAbility_ChapWorm_InventoryPassive">();
	}
	static class UFortGameplayAbility_ChapWorm_InventoryPassive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayAbility_ChapWorm_InventoryPassive>();
	}
};

// Class ChapWormGameplayRuntime.FortMovementMode_ChapWormSprint
// 0x0120 (0x0638 - 0x0518)
class UFortMovementMode_ChapWormSprint final : public UFortMovementMode_ELTacSprint
{
public:
	TSubclassOf<class UGameplayEffect>            GrantedGameplayEffect;                             // 0x0518(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           SprintThresholdGameplayTag;                        // 0x0520(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_52C[0x4];                                      // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         SprintThresholdSpeedMultiplier;                    // 0x0530(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SprintThresholdOverpowerSpeedMultiplier;           // 0x0568(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           OverpowerGameplayTag;                              // 0x05A0(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5AC[0x4];                                      // 0x05AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         OverpowerSpeedMultiplier;                          // 0x05B0(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         OverpowerJumpHeightMultiplier;                     // 0x05E8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FActiveGameplayEffectHandle            GrantedGameplayEffectHandle;                       // 0x0620(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_628[0x10];                                     // 0x0628(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ChapWormSprint">();
	}
	static class UFortMovementMode_ChapWormSprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ChapWormSprint>();
	}
};

}

