#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterDynamicsControlRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PhysicsControl_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct CharacterDynamicsControlRuntime.FortGravityOverrideParameters
// 0x0070 (0x0070 - 0x0000)
struct FFortGravityOverrideParameters final
{
public:
	struct FVector                                WindFrequency;                                     // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WindAmplitude;                                     // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WindOffset;                                        // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                GravityOverride;                                   // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   JointName;                                         // 0x0060(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CharacterDynamicsControlRuntime.FortCharacterDynamicsControlParameterSet
// 0x0010 (0x0010 - 0x0000)
struct FFortCharacterDynamicsControlParameterSet
{
public:
	TArray<class FName>                           StateNames;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CharacterDynamicsControlRuntime.FortGravityOverrideParameterSet
// 0x0010 (0x0020 - 0x0010)
struct FFortGravityOverrideParameterSet final : public FFortCharacterDynamicsControlParameterSet
{
public:
	TArray<struct FFortGravityOverrideParameters> Parameters;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CharacterDynamicsControlRuntime.BitArrayWrapper
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FBitArrayWrapper final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CharacterDynamicsControlRuntime.BitArrayBinaryDecisionTreeElement
// 0x0048 (0x0048 - 0x0000)
struct FBitArrayBinaryDecisionTreeElement final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBitArrayWrapper                       BitArrayMask;                                      // 0x0008(0x0020)(NativeAccessSpecifierPublic)
	struct FBitArrayWrapper                       BitArraySet;                                       // 0x0028(0x0020)(NativeAccessSpecifierPublic)
};

// ScriptStruct CharacterDynamicsControlRuntime.BitArrayBinaryDecisionTree
// 0x0010 (0x0010 - 0x0000)
struct FBitArrayBinaryDecisionTree final
{
public:
	TArray<struct FBitArrayBinaryDecisionTreeElement> TreeStructure;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CharacterDynamicsControlRuntime.BinaryDecisionTreeElement
// 0x0018 (0x0018 - 0x0000)
struct FBinaryDecisionTreeElement final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         BitMask;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         BitSet;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CharacterDynamicsControlRuntime.BinaryDecisionTree
// 0x0010 (0x0010 - 0x0000)
struct FBinaryDecisionTree final
{
public:
	TArray<struct FBinaryDecisionTreeElement>     TreeStructure;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CharacterDynamicsControlRuntime.FortClothParameterSet
// 0x0010 (0x0020 - 0x0010)
struct FFortClothParameterSet final : public FFortCharacterDynamicsControlParameterSet
{
public:
	TArray<struct FClothParameters>               Parameters;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CharacterDynamicsControlRuntime.FortRigidBodyAnimNodeParameters
// 0x0098 (0x0098 - 0x0000)
struct FFortRigidBodyAnimNodeParameters final
{
public:
	struct FVector                                ComponentLinearAccScale;                           // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ComponentLinearVelScale;                           // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSimSpaceSettings                      SimSpaceSettings;                                  // 0x0030(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CharacterDynamicsControlRuntime.FortRigidBodyAnimNodeParameterSet
// 0x0010 (0x0020 - 0x0010)
struct FFortRigidBodyAnimNodeParameterSet final : public FFortCharacterDynamicsControlParameterSet
{
public:
	TArray<struct FFortRigidBodyAnimNodeParameters> Parameters;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CharacterDynamicsControlRuntime.FortWindGustParameterSet
// 0x0010 (0x0020 - 0x0010)
struct FFortWindGustParameterSet final : public FFortCharacterDynamicsControlParameterSet
{
public:
	TArray<struct FWindGustParameters>            Parameters;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CharacterDynamicsControlRuntime.FortRigidBodyWithControlStateTransitionParameters
// 0x0038 (0x0038 - 0x0000)
struct FFortRigidBodyWithControlStateTransitionParameters final
{
public:
	struct FPhysicsControlControlAndModifierParameters ControlAndModifierParameters;                      // 0x0000(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         TransitionTimeSeconds;                             // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CharacterDynamicsControlRuntime.ProxyProperty
// 0x0028 (0x0028 - 0x0000)
struct FProxyProperty final
{
public:
	uint32                                        Operator;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBitArrayWrapper                       BitArrayMask;                                      // 0x0008(0x0020)(NativeAccessSpecifierPublic)
};

// ScriptStruct CharacterDynamicsControlRuntime.ProxyPropertyOrderingEditorData
// 0x0018 (0x0018 - 0x0000)
struct FProxyPropertyOrderingEditorData final
{
public:
	TArray<int32>                                 ReversePropertyOrder;                              // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ProxyPropertyIndex;                                // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

