#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterDynamicsControlRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CharacterDynamicsControlRuntime_structs.hpp"
#include "PhysicsControl_structs.hpp"


namespace SDK
{

// Class CharacterDynamicsControlRuntime.CharacterDynamicsControlBPLibrary
// 0x0000 (0x0030 - 0x0030)
class UCharacterDynamicsControlBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddCharacterDynamicsControlLogicLayer(const class UFortAnimInstance* InAnimInstance, const class FName LayerName, const class UFortCharacterDynamicsStateLogic* LayerStateLogic);
	static void ClothControllerFunction(const class UCustomCharacterPartAnimInstance* CharacterPartAnimInstance, const class FName ClothingAssetName, const struct FFortClothParameterSet& ClothParameterSet, const struct FClothCoreSettings& ClothCoreSettings, const struct FVector& ClothUpAxis, const float OnGroundMovingSpeedLimit, const float OnGroundMovingAngularVelMax, const float OnGroundMovingFictitiousVelMax, const float LinVelScaleFwdBwdClamp, const float LinVelScaleUpDwnClamp, const float DeltaTime, const float GameTimeInSeconds, const struct FFortWindGustParameterSet& WindGustParams, const struct FWindGustSettings& WindGustLocalSettings, const class FName StateLogicLayerName, class FName* OutCurrentState, struct FClothParameters* OutClothParameters, struct FClothCoreSettings* OutClothCoreSettings, struct FWindGustParameters* OutWindGustSettings, struct FWindGustSettings* OutWindGustLocalSettings, struct FVector* OutWindVelocity, struct FVector* OutLinearVelVector);
	static void ClothControllerParameterAssetFunction(const class UCustomCharacterPartAnimInstance* CharacterPartAnimInstance, const class FName ClothingAssetName, const struct FClothCoreSettings& ClothCoreSettings, const struct FVector& ClothUpAxis, const float OnGroundMovingSpeedLimit, const float OnGroundMovingAngularVelMax, const float OnGroundMovingFictitiousVelMax, const float LinVelScaleFwdBwdClamp, const float LinVelScaleUpDwnClamp, const float DeltaTime, const float GameTimeInSeconds, const struct FWindGustSettings& WindGustLocalSettings, const class FName StateLogicLayerName, const class UFortCharacterDynamicsParameters* Parameters, class FName* OutCurrentState, struct FClothParameters* OutClothParameters, struct FClothCoreSettings* OutClothCoreSettings, struct FWindGustParameters* OutWindGustSettings, struct FWindGustSettings* OutWindGustLocalSettings, struct FVector* OutWindVelocity, struct FVector* OutLinearVelVector);
	static class FName GetCharacterState(const class UFortAnimInstance* InAnimInstance);
	static class FName GetCharacterStateForLayer(const class UFortAnimInstance* InAnimInstance, const class FName StateLogicLayerName);
	static bool GetProperty(const class UFortAnimInstance* InAnimInstance, const class FName InPropertyName);
	static bool GetPropertyForLayer(const class UFortAnimInstance* InAnimInstance, const class FName InStateLogicLayerName, const class FName InPropertyName);
	static void GravityOverrideStateFunction(const class UCustomCharacterPartAnimInstance* CharacterPartAnimInstance, const float GameTimeInSeconds, const struct FFortGravityOverrideParameterSet& GravityOverrideParameters, const struct FFortRigidBodyAnimNodeParameterSet& RigidBodyAnimNodeParameters, const bool DebugDraw, const class FName DebugJointName, const class FName StateLogicLayerName, struct FVector* OutGravityOverride, class FName* OutCurrentState, struct FFortGravityOverrideParameters* OutGravityOverrideParameters, struct FFortRigidBodyAnimNodeParameters* OutRigidBodyAnimNodeParameters);
	static void GravityOverrideStateParameterAssetFunction(const class UCustomCharacterPartAnimInstance* CharacterPartAnimInstance, const float GameTimeInSeconds, const bool DebugDraw, const class FName DebugJointName, const class FName StateLogicLayerName, const class UFortCharacterDynamicsParameters* Parameters, struct FVector* OutGravityOverride, class FName* OutCurrentState, struct FFortGravityOverrideParameters* OutGravityOverrideParameters, struct FFortRigidBodyAnimNodeParameters* OutRigidBodyAnimNodeParameters);
	static bool HasCharacterDynamicsControlLogicLayer(const class UFortAnimInstance* InAnimInstance, const class FName LayerName);
	static void RemoveCharacterDynamicsControlLogicLayer(const class UFortAnimInstance* InAnimInstance, const class FName LayerName);
	static void RequestFullBodyPBALayer(const class UFortAnimInstance* InAnimInstance, const class FName ReasonForRequest);
	static void SetProperty(const class UFortAnimInstance* InAnimInstance, const class FName InPropertyName, bool InValue);
	static struct FRigidBodyWithControlReference UpdateRigidBodyWithControlNodeParameters(const struct FAnimUpdateContext& UpdateContext, const struct FRigidBodyWithControlReference& RigidBodyWithControl);
	static struct FRigidBodyWithControlReference UpdateRigidBodyWithControlNodeParametersForLayer(const struct FAnimUpdateContext& UpdateContext, const struct FRigidBodyWithControlReference& RigidBodyWithControl, const class FName StateLogicLayerName, const class UFortCharacterDynamicsParameters* Parameters);

	struct FRigidBodyWithControlReference UpdateRigidBodyWithControlNodeParametersFromAsset(const struct FAnimUpdateContext& UpdateContext, const struct FRigidBodyWithControlReference& RigidBodyWithControl, const class UFortCharacterDynamicsParameters* Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CharacterDynamicsControlBPLibrary">();
	}
	static class UCharacterDynamicsControlBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterDynamicsControlBPLibrary>();
	}
};

// Class CharacterDynamicsControlRuntime.CharacterDynamicsControlGameFeatureData
// 0x0010 (0x0698 - 0x0688)
class UCharacterDynamicsControlGameFeatureData final : public UFortGameFeatureData
{
public:
	class UFortCharacterDynamicsStateLogic*       DefaultStateLogic;                                 // 0x0688(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortCharacterDynamicsParameters*       DefaultParameters;                                 // 0x0690(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CharacterDynamicsControlGameFeatureData">();
	}
	static class UCharacterDynamicsControlGameFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterDynamicsControlGameFeatureData>();
	}
};

// Class CharacterDynamicsControlRuntime.FortCharacterDynamicsParameters
// 0x0070 (0x00B8 - 0x0048)
class UFortCharacterDynamicsParameters final : public UPrimaryDataAsset
{
public:
	TArray<class FName>                           StateNames;                                        // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FClothParameters>               ClothParameters;                                   // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWindGustParameters>            WindGustParameters;                                // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPhysicsControlControlAndModifierParameters> RBWCControlAndModifierParameters;                  // 0x0078(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FFortRigidBodyWithControlStateTransitionParameters> RBWCTransitionParameters;                          // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FFortGravityOverrideParameters> GravityOverrideParameters;                         // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FFortRigidBodyAnimNodeParameters> RigidBodyAnimNodeParameters;                       // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCharacterDynamicsParameters">();
	}
	static class UFortCharacterDynamicsParameters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCharacterDynamicsParameters>();
	}
};

// Class CharacterDynamicsControlRuntime.FortCharacterDynamicsStateLogic
// 0x0078 (0x00C0 - 0x0048)
class UFortCharacterDynamicsStateLogic final : public UPrimaryDataAsset
{
public:
	TArray<class FName>                           BlueprintCharacterPropertyNames;                   // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           ActivityStateNames;                                // 0x0058(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FBinaryDecisionTree                    ActivityStateBinaryDecisionTree;                   // 0x0068(0x0010)(Deprecated, NativeAccessSpecifierPublic)
	struct FBitArrayBinaryDecisionTree            DecisionTree;                                      // 0x0078(0x0010)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FProxyProperty>                 ProxyPropertyCollection;                           // 0x0088(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NativePropertyCount;                               // 0x0098(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinMovementSpeed;                                  // 0x009C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinRidingMovementSpeed;                            // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinUpwardVelocityThreshold;                        // 0x00A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxFallingThreshold;                               // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HighRevolutionsPerSecondThreshold;                 // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FProxyPropertyOrderingEditorData> ProxyPropertyOrdering;                             // 0x00B0(0x0010)(Edit, ZeroConstructor, EditorOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCharacterDynamicsStateLogic">();
	}
	static class UFortCharacterDynamicsStateLogic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCharacterDynamicsStateLogic>();
	}
};

// Class CharacterDynamicsControlRuntime.FortCharacterDynamicsComponent
// 0x00B0 (0x0188 - 0x00D8)
class UFortCharacterDynamicsComponent final : public UActorComponent
{
public:
	class UFortCharacterDynamicsStateLogic*       DefaultStateLogic;                                 // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortCharacterDynamicsParameters*       DefaultParameters;                                 // 0x00E0(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0xA0];                                      // 0x00E8(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddLayer(const class FName LayerName, const class UFortCharacterDynamicsStateLogic* LayerStateLogic);
	class FName CurrentStateName();
	class FName CurrentStateNameForLayer(const class FName LayerName);
	bool GetProperty(const class FName PropertyName);
	bool GetPropertyForLayer(const class FName LayerName, const class FName PropertyName);
	class FName PreviousStateName();
	class FName PreviousStateNameForLayer(const class FName LayerName);
	void RemoveLayer(const class FName LayerName);
	void SetProperty(const class FName PropertyName, const bool PropertyValue);

	float GetTimeInCurrentStateSeconds() const;
	float GetTimeInCurrentStateSecondsForLayer(const class FName LayerName) const;
	bool HasLayer(const class FName LayerName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCharacterDynamicsComponent">();
	}
	static class UFortCharacterDynamicsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCharacterDynamicsComponent>();
	}
};

}

