#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterCollectionMapScreen

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CollectionMapShared_classes.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class CharacterCollectionMapScreen.AthenaCollectionScreenMapCharacter
// 0x0028 (0x08F0 - 0x08C8)
class UAthenaCollectionScreenMapCharacter final : public UAthenaCollectionScreenMapBase
{
public:
	class UCollectionScreenServiceVisualData*     SharedServiceVisualData;                           // 0x08C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  ExcludedProducts;                                  // 0x08D0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCollectionScreenMapCharacter">();
	}
	static class UAthenaCollectionScreenMapCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCollectionScreenMapCharacter>();
	}
};

// Class CharacterCollectionMapScreen.CollectionNPCServiceInfoOverlay
// 0x0018 (0x0660 - 0x0648)
class UCollectionNPCServiceInfoOverlay final : public UAthenaCollectionScreenInfoOverlay
{
public:
	class UCollectionNPCServiceContainer*         Services;                                          // 0x0648(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_ServiceIcon;                                 // 0x0650(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCollectionScreenServiceVisualData*     SharedServiceVisualData;                           // 0x0658(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CollectionNPCServiceInfoOverlay">();
	}
	static class UCollectionNPCServiceInfoOverlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectionNPCServiceInfoOverlay>();
	}
};

}

