#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: character_device_controller_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass character_device_controller_device.character_device_controller_device
// 0x0030 (0x00F0 - 0x00C0)
class Ucharacter_device_controller_device final : public UDevices_creative_device_base
{
public:
	class UDevices_device_function*               __verse_0x1C4F454E_ChangeCharacterAppearanceFunction; // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xE622FFE6_ChangeCharacterIdleAnimatedFunction; // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x911AD69C_ChangeCharacterIdlePoseFunction; // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x0BB6C626_PerformEmoteFunction;           // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x36705EE9_ResetCharactersFunction;        // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fcharacter__device__controller__device_N_RChangeCharacterAppearance(const struct character_device_controller_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcharacter__device__controller__device_N_RChangeCharacterIdleAnimated(const struct character_device_controller_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcharacter__device__controller__device_N_RChangeCharacterIdlePose(const struct character_device_controller_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcharacter__device__controller__device_N_RPerformEmote(const struct character_device_controller_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcharacter__device__controller__device_N_RResetCharacters(const struct character_device_controller_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"character_device_controller_device">();
	}
	static class Ucharacter_device_controller_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ucharacter_device_controller_device>();
	}
};

// VerseClass character_device_controller_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class character_device_controller_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass character_device_controller_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class character_device_controller_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<character_device_controller_device::U_SolarisSignatureFunctionOuter>();
	}
};

}

