#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChooserUncooked

#include "Basic.hpp"

#include "BlueprintGraph_classes.hpp"
#include "Chooser_structs.hpp"
#include "BlendStackEditor_classes.hpp"
#include "ChooserUncooked_structs.hpp"


namespace SDK
{

// Class ChooserUncooked.AnimGraphNode_ChooserPlayer
// 0x0308 (0x05C8 - 0x02C0)
class UAnimGraphNode_ChooserPlayer final : public UAnimGraphNode_BlendStack_Base
{
public:
	uint8                                         Pad_2C0[0x20];                                     // 0x02C0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_ChooserPlayer                Node;                                              // 0x02E0(0x02E8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimGraphNode_ChooserPlayer">();
	}
	static class UAnimGraphNode_ChooserPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimGraphNode_ChooserPlayer>();
	}
};

// Class ChooserUncooked.K2Node_EvaluateChooser
// 0x0028 (0x00E8 - 0x00C0)
class UK2Node_EvaluateChooser final : public UK2Node
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UChooserTable*                          Chooser;                                           // 0x00C8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EEvaluateChooserMode                          Mode;                                              // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D4[0x14];                                      // 0x00D4(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_EvaluateChooser">();
	}
	static class UK2Node_EvaluateChooser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_EvaluateChooser>();
	}
};

// Class ChooserUncooked.K2Node_EvaluateChooser2
// 0x0028 (0x00E8 - 0x00C0)
class UK2Node_EvaluateChooser2 final : public UK2Node
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UChooserTable*                          Chooser;                                           // 0x00C8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EEvaluateChooserMode                          Mode;                                              // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D4[0x14];                                      // 0x00D4(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_EvaluateChooser2">();
	}
	static class UK2Node_EvaluateChooser2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_EvaluateChooser2>();
	}
};

}

