#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChooserEditor

#include "Basic.hpp"

#include "UnrealEd_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Persona_classes.hpp"
#include "Chooser_classes.hpp"


namespace SDK
{

// Class ChooserEditor.AssetDefinition_ChooserTable
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_ChooserTable final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_ChooserTable">();
	}
	static class UAssetDefinition_ChooserTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_ChooserTable>();
	}
};

// Class ChooserEditor.ChooserRowDetails
// 0x0020 (0x0050 - 0x0030)
class UChooserRowDetails final : public UObject
{
public:
	struct FInstancedPropertyBag                  Properties;                                        // 0x0030(0x0010)(Edit, NativeAccessSpecifierPublic)
	class UChooserTable*                          Chooser;                                           // 0x0040(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserRowDetails">();
	}
	static class UChooserRowDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserRowDetails>();
	}
};

// Class ChooserEditor.ChooserTableFactory
// 0x0000 (0x0088 - 0x0088)
class UChooserTableFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserTableFactory">();
	}
	static class UChooserTableFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserTableFactory>();
	}
};

// Class ChooserEditor.ChooserFindProperties
// 0x0000 (0x0140 - 0x0140)
class UChooserFindProperties final : public UAnimAssetFindReplaceProcessor_StringBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserFindProperties">();
	}
	static class UChooserFindProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserFindProperties>();
	}
};

// Class ChooserEditor.ChooserColumnDetails
// 0x0010 (0x0040 - 0x0030)
class UChooserColumnDetails final : public UObject
{
public:
	class UChooserTable*                          Chooser;                                           // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserColumnDetails">();
	}
	static class UChooserColumnDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserColumnDetails>();
	}
};

// Class ChooserEditor.ChooserEditorToolMenuContext
// 0x0010 (0x0040 - 0x0030)
class UChooserEditorToolMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserEditorToolMenuContext">();
	}
	static class UChooserEditorToolMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserEditorToolMenuContext>();
	}
};

// Class ChooserEditor.FloatAutoPopulatorBlueprint
// 0x0000 (0x0030 - 0x0030)
class UFloatAutoPopulatorBlueprint final : public UFloatAutoPopulator
{
public:
	void AutoPopulate(class UObject* Object, bool* Success, float* Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FloatAutoPopulatorBlueprint">();
	}
	static class UFloatAutoPopulatorBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFloatAutoPopulatorBlueprint>();
	}
};

}

