#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Chooser

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Chooser_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class Chooser.ChooserParameterBool_ContextProperty
// 0x0018 (0x0048 - 0x0030)
class UChooserParameterBool_ContextProperty final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PropertyBindingChain;                              // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterBool_ContextProperty">();
	}
	static class UChooserParameterBool_ContextProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserParameterBool_ContextProperty>();
	}
};

// Class Chooser.ChooserColumnBool
// 0x0028 (0x0058 - 0x0030)
class UChooserColumnBool final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IChooserParameterBool> InputValue;                                        // 0x0038(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<bool>                                  RowValues;                                         // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserColumnBool">();
	}
	static class UChooserColumnBool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserColumnBool>();
	}
};

// Class Chooser.ChooserParameterEnum_ContextProperty
// 0x0018 (0x0048 - 0x0030)
class UChooserParameterEnum_ContextProperty final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PropertyBindingChain;                              // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterEnum_ContextProperty">();
	}
	static class UChooserParameterEnum_ContextProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserParameterEnum_ContextProperty>();
	}
};

// Class Chooser.ChooserColumnEnum
// 0x0028 (0x0058 - 0x0030)
class UChooserColumnEnum final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IChooserParameterEnum> InputValue;                                        // 0x0038(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FChooserEnumRowData>            RowValues;                                         // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserColumnEnum">();
	}
	static class UChooserColumnEnum* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserColumnEnum>();
	}
};

// Class Chooser.FloatAutoPopulator
// 0x0000 (0x0030 - 0x0030)
class UFloatAutoPopulator : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FloatAutoPopulator">();
	}
	static class UFloatAutoPopulator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFloatAutoPopulator>();
	}
};

// Class Chooser.ChooserParameterFloat_ContextProperty
// 0x0018 (0x0048 - 0x0030)
class UChooserParameterFloat_ContextProperty final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PropertyBindingChain;                              // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterFloat_ContextProperty">();
	}
	static class UChooserParameterFloat_ContextProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserParameterFloat_ContextProperty>();
	}
};

// Class Chooser.ChooserColumnFloatRange
// 0x0028 (0x0058 - 0x0030)
class UChooserColumnFloatRange final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IChooserParameterFloat> InputValue;                                        // 0x0038(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FChooserFloatRangeRowData>      RowValues;                                         // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserColumnFloatRange">();
	}
	static class UChooserColumnFloatRange* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserColumnFloatRange>();
	}
};

// Class Chooser.ChooserParameterGameplayTag_ContextProperty
// 0x0018 (0x0048 - 0x0030)
class UChooserParameterGameplayTag_ContextProperty final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PropertyBindingChain;                              // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterGameplayTag_ContextProperty">();
	}
	static class UChooserParameterGameplayTag_ContextProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserParameterGameplayTag_ContextProperty>();
	}
};

// Class Chooser.ChooserColumnGameplayTag
// 0x0030 (0x0060 - 0x0030)
class UChooserColumnGameplayTag final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IChooserParameterGameplayTag> InputValue;                                        // 0x0038(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameplayContainerMatchType                   TagMatchType;                                      // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTagContainer>          RowValues;                                         // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserColumnGameplayTag">();
	}
	static class UChooserColumnGameplayTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserColumnGameplayTag>();
	}
};

// Class Chooser.ChooserColumn
// 0x0000 (0x0030 - 0x0030)
class IChooserColumn final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserColumn">();
	}
	static class IChooserColumn* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChooserColumn>();
	}
};

// Class Chooser.ChooserParameterBool
// 0x0000 (0x0030 - 0x0030)
class IChooserParameterBool final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterBool">();
	}
	static class IChooserParameterBool* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChooserParameterBool>();
	}
};

// Class Chooser.ChooserParameterEnum
// 0x0000 (0x0030 - 0x0030)
class IChooserParameterEnum final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterEnum">();
	}
	static class IChooserParameterEnum* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChooserParameterEnum>();
	}
};

// Class Chooser.ChooserParameterFloat
// 0x0000 (0x0030 - 0x0030)
class IChooserParameterFloat final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterFloat">();
	}
	static class IChooserParameterFloat* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChooserParameterFloat>();
	}
};

// Class Chooser.ChooserParameterGameplayTag
// 0x0000 (0x0030 - 0x0030)
class IChooserParameterGameplayTag final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterGameplayTag">();
	}
	static class IChooserParameterGameplayTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChooserParameterGameplayTag>();
	}
};

// Class Chooser.HasContextClass
// 0x0000 (0x0030 - 0x0030)
class IHasContextClass final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HasContextClass">();
	}
	static class IHasContextClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHasContextClass>();
	}
};

// Class Chooser.ObjectChooser
// 0x0000 (0x0030 - 0x0030)
class IObjectChooser final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectChooser">();
	}
	static class IObjectChooser* GetDefaultObj()
	{
		return GetDefaultObjImpl<IObjectChooser>();
	}
};

// Class Chooser.ObjectChooser_Asset
// 0x0010 (0x0040 - 0x0030)
class UObjectChooser_Asset final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Asset;                                             // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectChooser_Asset">();
	}
	static class UObjectChooser_Asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectChooser_Asset>();
	}
};

// Class Chooser.ChooserTable
// 0x0198 (0x01C8 - 0x0030)
class UChooserTable final : public UObject
{
public:
	uint8                                         Pad_30[0xF8];                                      // 0x0030(0x00F8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TScriptInterface<class IObjectChooser>> Results;                                           // 0x0128(0x0010)(ZeroConstructor, Deprecated, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    ContextObjectType;                                 // 0x0138(0x0008)(ZeroConstructor, Deprecated, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TScriptInterface<class IChooserColumn>> Columns;                                           // 0x0140(0x0010)(ZeroConstructor, Deprecated, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	class UChooserTable*                          ParentTable;                                       // 0x0150(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       FallbackResult;                                    // 0x0158(0x0010)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               ResultsStructs;                                    // 0x0168(0x0010)(Edit, ZeroConstructor, NoClear, EditorOnly, NativeAccessSpecifierPublic)
	TArray<bool>                                  DisabledRows;                                      // 0x0178(0x0010)(ZeroConstructor, EditorOnly, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               CookedResults;                                     // 0x0188(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               ColumnsStructs;                                    // 0x0198(0x0010)(Edit, ZeroConstructor, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               ContextData;                                       // 0x01A8(0x0010)(Edit, ZeroConstructor, NoClear, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    OutputObjectType;                                  // 0x01B8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EObjectChooserResultType                      ResultType;                                        // 0x01C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserTable">();
	}
	static class UChooserTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserTable>();
	}
};

// Class Chooser.ObjectChooser_EvaluateChooser
// 0x0010 (0x0040 - 0x0030)
class UObjectChooser_EvaluateChooser final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UChooserTable*                          Chooser;                                           // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectChooser_EvaluateChooser">();
	}
	static class UObjectChooser_EvaluateChooser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectChooser_EvaluateChooser>();
	}
};

// Class Chooser.ChooserColumnMenuContext
// 0x0018 (0x0048 - 0x0030)
class UChooserColumnMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserColumnMenuContext">();
	}
	static class UChooserColumnMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserColumnMenuContext>();
	}
};

// Class Chooser.ChooserFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class UChooserFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddChooserObjectInput(struct FChooserEvaluationContext& Context, class UObject* Object);
	static void AddChooserStructInput(struct FChooserEvaluationContext& Context, int32 Value);
	static class UObject* EvaluateChooser(const class UObject* ContextObject, const class UChooserTable* ChooserTable, TSubclassOf<class UObject> ObjectClass);
	static TArray<class UObject*> EvaluateChooserMulti(const class UObject* ContextObject, const class UChooserTable* ChooserTable, TSubclassOf<class UObject> ObjectClass);
	static class UObject* EvaluateObjectChooserBase(struct FChooserEvaluationContext& Context, const struct FInstancedStruct& ObjectChooser, TSubclassOf<class UObject> ObjectClass, bool bResultIsClass);
	static TArray<class UObject*> EvaluateObjectChooserBaseMulti(struct FChooserEvaluationContext& Context, const struct FInstancedStruct& ObjectChooser, TSubclassOf<class UObject> ObjectClass, bool bResultIsClass);
	static void GetChooserStructOutput(struct FChooserEvaluationContext& Context, int32 Index_0, int32* Value);
	static struct FChooserEvaluationContext MakeChooserEvaluationContext();
	static struct FInstancedStruct MakeEvaluateChooser(class UChooserTable* Chooser);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserFunctionLibrary">();
	}
	static class UChooserFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserFunctionLibrary>();
	}
};

}

