#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChronoWeaponGameplayRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class ChronoWeaponGameplayRuntime.AnimInstance_ChronoPanRifle
// 0x0010 (0x0410 - 0x0400)
class UAnimInstance_ChronoPanRifle final : public UAnimInstance
{
public:
	bool                                          bIsFiring;                                         // 0x03F8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReloading;                                      // 0x03F9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3FA[0x2];                                      // 0x03FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MagRotationValue;                                  // 0x03FC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ResetMagRotationCurveName;                         // 0x0400(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimInstance_ChronoPanRifle">();
	}
	static class UAnimInstance_ChronoPanRifle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimInstance_ChronoPanRifle>();
	}
};

}

