#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CilantroUI

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "CilantroUI_structs.hpp"


namespace SDK
{

// Class CilantroUI.FortPlaytimeBlock
// 0x0070 (0x05E8 - 0x0578)
class UFortPlaytimeBlock final : public UCommonActivatableWidget
{
public:
	class UCommonActivatableWidgetStack*          WidgetStack_Takeover;                              // 0x0578(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   FortLegalInfoClass;                                // 0x0580(0x0030)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   ParentalControlsClass;                             // 0x05B0(0x0030)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E0[0x8];                                      // 0x05E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisplayLegalModal();
	void DisplayReporting();
	void DisplayVoiceReporting();
	void LaunchSupportURL();
	void OnReturnFocusFromTakeover();
	void OpenParentalControls();
	void OpenReturnPanel();
	void TryClose(const bool bForceClose);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlaytimeBlock">();
	}
	static class UFortPlaytimeBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlaytimeBlock>();
	}
};

// Class CilantroUI.FortPlaytimeManagementScreen
// 0x00E8 (0x07B0 - 0x06C8)
class UFortPlaytimeManagementScreen final : public UFortPinScreen
{
public:
	class UCommonActivatableWidgetSwitcher*       Switcher_SubViews;                                 // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortSettingsPanel*                     Panel_PlaytimeSettings;                            // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortSettingsPanel*                     Panel_PlaytimeScheduleSettings;                    // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortSettingDetailView*                 Details_Settings;                                  // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortPlaytimeScheduleWidget*            PlaytimeScheduleWidget;                            // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6F0[0xC0];                                     // 0x06F0(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ExitScreen();
	void OnPlaytimeScheduleRequested();
	void RefreshPlaytimeScheduleSettings();
	void RefreshPlaytimeSettings();

	class FText GetTimezoneText() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlaytimeManagementScreen">();
	}
	static class UFortPlaytimeManagementScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlaytimeManagementScreen>();
	}
};

// Class CilantroUI.FortPlaytimeScheduleWidget
// 0x0000 (0x0418 - 0x0418)
class UFortPlaytimeScheduleWidget final : public UUserWidget
{
public:
	void OnScheduleTextsUpdated(const TArray<struct FPlaytimeScheduleEntryData>& UpdatedScheduleEntries);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlaytimeScheduleWidget">();
	}
	static class UFortPlaytimeScheduleWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlaytimeScheduleWidget>();
	}
};

// Class CilantroUI.FortPlaytimeReportSettingRegistry
// 0x0008 (0x0140 - 0x0138)
class UFortPlaytimeReportSettingRegistry final : public UFortSettingRegistry
{
public:
	class UFortSettingCollection*                 PlaytimeReportSettings;                            // 0x0138(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlaytimeReportSettingRegistry">();
	}
	static class UFortPlaytimeReportSettingRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlaytimeReportSettingRegistry>();
	}
};

// Class CilantroUI.FortPlaytimeSettingRegistry
// 0x0018 (0x0150 - 0x0138)
class UFortPlaytimeSettingRegistry final : public UFortSettingRegistry
{
public:
	class UFortSettingCollection*                 PlaytimeSettings;                                  // 0x0138(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_140[0x10];                                     // 0x0140(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlaytimeSettingRegistry">();
	}
	static class UFortPlaytimeSettingRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlaytimeSettingRegistry>();
	}
};

// Class CilantroUI.FortPlaytimeScheduleSettingRegistry
// 0x0008 (0x0140 - 0x0138)
class UFortPlaytimeScheduleSettingRegistry final : public UFortSettingRegistry
{
public:
	class UFortSettingCollection*                 PlaytimeScheduleSettings;                          // 0x0138(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlaytimeScheduleSettingRegistry">();
	}
	static class UFortPlaytimeScheduleSettingRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlaytimeScheduleSettingRegistry>();
	}
};

// Class CilantroUI.FortSettingValueDiscreteSupervisedScheduleToggle
// 0x0038 (0x01D0 - 0x0198)
class UFortSettingValueDiscreteSupervisedScheduleToggle final : public UFortSettingValueDiscrete
{
public:
	uint8                                         Pad_198[0x38];                                     // 0x0198(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSettingValueDiscreteSupervisedScheduleToggle">();
	}
	static class UFortSettingValueDiscreteSupervisedScheduleToggle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSettingValueDiscreteSupervisedScheduleToggle>();
	}
};

// Class CilantroUI.FortTimeLimitPanelStw
// 0x0008 (0x0580 - 0x0578)
class UFortTimeLimitPanelStw final : public UCommonActivatableWidget
{
public:
	class UCommonActivatableWidget*               ViewTimeLimitPanel;                                // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTimeLimitPanelStw">();
	}
	static class UFortTimeLimitPanelStw* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTimeLimitPanelStw>();
	}
};

// Class CilantroUI.FortViewTimeLimitPanel
// 0x0000 (0x0578 - 0x0578)
class UFortViewTimeLimitPanel final : public UCommonActivatableWidget
{
public:
	void OnSidebarVisibilityChanged(bool bIsVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortViewTimeLimitPanel">();
	}
	static class UFortViewTimeLimitPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortViewTimeLimitPanel>();
	}
};

// Class CilantroUI.PlayerPlaytimeVM
// 0x0058 (0x00D0 - 0x0078)
class UPlayerPlaytimeVM final : public UFortPerUserViewModel
{
public:
	uint8                                         Pad_78[0x30];                                      // 0x0078(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ElapsedSleepTime;                                  // 0x00A8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EPlaytimeState                                PlayState;                                         // 0x00AC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(EPlaytimeRequestState RequestStatus)> BP_OnGrantPlaytimeRequestStatusUpdate;             // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(EPlaytimeRequestState RequestStatus)> BP_OnRequestAdditionalPlaytimeStatusUpdate;        // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)

public:
	void CloseGame();
	void GrantAdditionalPlaytime(const class FString& UserPin, const int32 SecondsToGrant);
	void HandlePlaytimeStateChanged(EPlaytimeState NewState);
	void Init();
	void OpenParentalControlsSchedule();
	void OpenPinTimeGrant(class UUserWidget* Context);
	void RequestAdditionalPlaytime();
	void SetListenToRefresh(const bool bListenToRefresh);

	class FText ConvertServiceTimeToLocalTimeText(const struct FDateTime& ServiceTime) const;
	const TArray<int32> GetGrantPlaytimeDurations() const;
	class FText GetNextPlayPeriodText() const;
	struct FPlaytimeWindow GetNextWindowBounds() const;
	class FText GetPlaytimeAddResultText(const struct FTimespan& AddedTime) const;
	EPlaytimeActiveScheduling GetPlaytimeScheduling() const;
	class FText GetPlaytimeSummaryText() const;
	const struct FTimespan GetRemainingPlaytime() const;
	const struct FTimespan GetTimePlayed() const;
	struct FPlaytimeWindow GetWindowBounds() const;
	bool HasNextWindowBounds() const;
	bool HasWindowBounds() const;
	bool IsAskForMoreTimeBlocked() const;
	bool IsAskForMoreTimeEnabled() const;
	bool IsPlaytimeLimitsEnabled() const;
	bool IsReportingPlaytime() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerPlaytimeVM">();
	}
	static class UPlayerPlaytimeVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerPlaytimeVM>();
	}
};

// Class CilantroUI.TimeReportsManagementScreen
// 0x0070 (0x0738 - 0x06C8)
class UTimeReportsManagementScreen final : public UFortPinScreen
{
public:
	class UFortSettingsPanel*                     Panel_TimeReportSettings;                          // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortSettingDetailView*                 Details_Settings;                                  // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6D8[0x60];                                     // 0x06D8(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ExitScreen();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TimeReportsManagementScreen">();
	}
	static class UTimeReportsManagementScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTimeReportsManagementScreen>();
	}
};

// Class CilantroUI.FortPlaytimePinActivatableWidget
// 0x0000 (0x0578 - 0x0578)
class UFortPlaytimePinActivatableWidget final : public UCommonActivatableWidget
{
public:
	void OnUserPinProvided(const class FString& UserPin);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlaytimePinActivatableWidget">();
	}
	static class UFortPlaytimePinActivatableWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlaytimePinActivatableWidget>();
	}
};

}

