#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CilantroUI

#include "Basic.hpp"

#include "CilantroUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CilantroUI.FortPlaytimeBlock.TryClose
// 0x0001 (0x0001 - 0x0000)
struct FortPlaytimeBlock_TryClose final
{
public:
	bool                                          bForceClose;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CilantroUI.FortPlaytimeManagementScreen.GetTimezoneText
// 0x0010 (0x0010 - 0x0000)
struct FortPlaytimeManagementScreen_GetTimezoneText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function CilantroUI.FortPlaytimeScheduleWidget.OnScheduleTextsUpdated
// 0x0010 (0x0010 - 0x0000)
struct FortPlaytimeScheduleWidget_OnScheduleTextsUpdated final
{
public:
	TArray<struct FPlaytimeScheduleEntryData>     UpdatedScheduleEntries;                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CilantroUI.FortViewTimeLimitPanel.OnSidebarVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct FortViewTimeLimitPanel_OnSidebarVisibilityChanged final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.GrantAdditionalPlaytime
// 0x0018 (0x0018 - 0x0000)
struct PlayerPlaytimeVM_GrantAdditionalPlaytime final
{
public:
	class FString                                 UserPin;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SecondsToGrant;                                    // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CilantroUI.PlayerPlaytimeVM.HandlePlaytimeStateChanged
// 0x0001 (0x0001 - 0x0000)
struct PlayerPlaytimeVM_HandlePlaytimeStateChanged final
{
public:
	EPlaytimeState                                NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.OpenPinTimeGrant
// 0x0008 (0x0008 - 0x0000)
struct PlayerPlaytimeVM_OpenPinTimeGrant final
{
public:
	class UUserWidget*                            Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.SetListenToRefresh
// 0x0001 (0x0001 - 0x0000)
struct PlayerPlaytimeVM_SetListenToRefresh final
{
public:
	bool                                          bListenToRefresh;                                  // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.ConvertServiceTimeToLocalTimeText
// 0x0018 (0x0018 - 0x0000)
struct PlayerPlaytimeVM_ConvertServiceTimeToLocalTimeText final
{
public:
	struct FDateTime                              ServiceTime;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.GetGrantPlaytimeDurations
// 0x0010 (0x0010 - 0x0000)
struct PlayerPlaytimeVM_GetGrantPlaytimeDurations final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.GetNextPlayPeriodText
// 0x0010 (0x0010 - 0x0000)
struct PlayerPlaytimeVM_GetNextPlayPeriodText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.GetNextWindowBounds
// 0x0010 (0x0010 - 0x0000)
struct PlayerPlaytimeVM_GetNextWindowBounds final
{
public:
	struct FPlaytimeWindow                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.GetPlaytimeAddResultText
// 0x0018 (0x0018 - 0x0000)
struct PlayerPlaytimeVM_GetPlaytimeAddResultText final
{
public:
	struct FTimespan                              AddedTime;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.GetPlaytimeScheduling
// 0x0001 (0x0001 - 0x0000)
struct PlayerPlaytimeVM_GetPlaytimeScheduling final
{
public:
	EPlaytimeActiveScheduling                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.GetPlaytimeSummaryText
// 0x0010 (0x0010 - 0x0000)
struct PlayerPlaytimeVM_GetPlaytimeSummaryText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.GetRemainingPlaytime
// 0x0008 (0x0008 - 0x0000)
struct PlayerPlaytimeVM_GetRemainingPlaytime final
{
public:
	struct FTimespan                              ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.GetTimePlayed
// 0x0008 (0x0008 - 0x0000)
struct PlayerPlaytimeVM_GetTimePlayed final
{
public:
	struct FTimespan                              ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.GetWindowBounds
// 0x0010 (0x0010 - 0x0000)
struct PlayerPlaytimeVM_GetWindowBounds final
{
public:
	struct FPlaytimeWindow                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.HasNextWindowBounds
// 0x0001 (0x0001 - 0x0000)
struct PlayerPlaytimeVM_HasNextWindowBounds final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.HasWindowBounds
// 0x0001 (0x0001 - 0x0000)
struct PlayerPlaytimeVM_HasWindowBounds final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.IsAskForMoreTimeBlocked
// 0x0001 (0x0001 - 0x0000)
struct PlayerPlaytimeVM_IsAskForMoreTimeBlocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.IsAskForMoreTimeEnabled
// 0x0001 (0x0001 - 0x0000)
struct PlayerPlaytimeVM_IsAskForMoreTimeEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.IsPlaytimeLimitsEnabled
// 0x0001 (0x0001 - 0x0000)
struct PlayerPlaytimeVM_IsPlaytimeLimitsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CilantroUI.PlayerPlaytimeVM.IsReportingPlaytime
// 0x0001 (0x0001 - 0x0000)
struct PlayerPlaytimeVM_IsReportingPlaytime final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CilantroUI.FortPlaytimePinActivatableWidget.OnUserPinProvided
// 0x0010 (0x0010 - 0x0000)
struct FortPlaytimePinActivatableWidget_OnUserPinProvided final
{
public:
	class FString                                 UserPin;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

