#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClamberingCodeRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "ContextualTraversalRuntime_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "ClamberingCodeRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class ClamberingCodeRuntime.FortMovementMode_ClamberingRuntimeData
// 0x0030 (0x0160 - 0x0130)
class UFortMovementMode_ClamberingRuntimeData final : public UFortMovementMode_TraversalBaseRuntimeData
{
public:
	uint8                                         Pad_128[0x38];                                     // 0x0128(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector GetSyncPosition() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ClamberingRuntimeData">();
	}
	static class UFortMovementMode_ClamberingRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ClamberingRuntimeData>();
	}
};

// Class ClamberingCodeRuntime.FortMovementMode_ExtClambering
// 0x0070 (0x0230 - 0x01C0)
class UFortMovementMode_ExtClambering final : public UFortMovementMode_ExtLogicTraversalBase
{
public:
	TSubclassOf<class UFortCameraMode>            LedgeLaunchCameraMode;                             // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortCameraMode>            WindowClamberCameraMode;                           // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ClamberingTag;                                     // 0x01D0(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ClamberingStartedTag;                              // 0x01F0(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ClamberingFinishedTag;                             // 0x0200(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class UCameraShakeBase*                       CameraShake;                                       // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LedgeLaunchSyncPointInterpSpeed;                   // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LedgeLaunchPlayerCollideBounceSpeed;               // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_GetAnimationMontageInformation(const struct FClamberMontageInput& Context, class UAnimMontage** AnimMontage, class FName* StartSectionName, class FName* MontageMiddleSectionName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ExtClambering">();
	}
	static class UFortMovementMode_ExtClambering* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ExtClambering>();
	}
};

// Class ClamberingCodeRuntime.InstancedLedgeActor
// 0x0058 (0x0480 - 0x0428)
class AInstancedLedgeActor final : public AFortClientOnlyActor
{
public:
	class UInstancedStaticMeshComponent*          InstancedStaticMeshComponent;                      // 0x0428(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_430[0x50];                                     // 0x0430(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnAddInstance(const struct FTransform& LedgeTransform, int32 InstanceIndex);
	void BP_OnRemoveInstance(const struct FTransform& LedgeTransform, int32 InstanceIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedLedgeActor">();
	}
	static class AInstancedLedgeActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInstancedLedgeActor>();
	}
};

// Class ClamberingCodeRuntime.LedgeLaunchWorldSubsystem
// 0x0140 (0x0178 - 0x0038)
class ULedgeLaunchWorldSubsystem final : public UBuildingWallSubsystem
{
public:
	TSoftObjectPtr<class UPBWLedgeConfigurationData> ConfigurationData;                                 // 0x0038(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   InstancedLedgeActorClass;                          // 0x0068(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPBWLedgeConfigurationData*             CachedConfigurationData;                           // 0x0098(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AInstancedLedgeActor*                   InstancedLedgeActor;                               // 0x00A0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class UClass*, struct FLedgeLaunchConfigEntry> CachedLedgeLaunchMap;                              // 0x00A8(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x80];                                      // 0x00F8(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnWallDied(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LedgeLaunchWorldSubsystem">();
	}
	static class ULedgeLaunchWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULedgeLaunchWorldSubsystem>();
	}
};

// Class ClamberingCodeRuntime.PBWLedgeConfigurationData
// 0x0190 (0x01C8 - 0x0038)
class UPBWLedgeConfigurationData final : public UDataAsset
{
public:
	TMap<EPlayerBuiltWallType, TSoftClassPtr<class UClass>> MetalWalls;                                        // 0x0038(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<EPlayerBuiltWallType, TSoftClassPtr<class UClass>> StoneWalls;                                        // 0x0088(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<EPlayerBuiltWallType, TSoftClassPtr<class UClass>> WoodWalls;                                         // 0x00D8(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<EPlayerBuiltWallType, struct FLedgeLaunchConfigEntry> Transforms;                                        // 0x0128(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<EPlayerBuiltWallMaterialType, struct FLedgeLaunchTransformConfigEntry> PerMaterialTransforms;                             // 0x0178(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PBWLedgeConfigurationData">();
	}
	static class UPBWLedgeConfigurationData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPBWLedgeConfigurationData>();
	}
};

// Class ClamberingCodeRuntime.ClamberingAnalytics
// 0x0000 (0x0030 - 0x0030)
class UClamberingAnalytics final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClamberingAnalytics">();
	}
	static class UClamberingAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClamberingAnalytics>();
	}
};

// Class ClamberingCodeRuntime.ClamberingComponent
// 0x1210 (0x12F0 - 0x00E0)
class UClamberingComponent final : public UFortPawnOverrideComponent
{
public:
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EClamberingState                              LocalClamberingState;                              // 0x00E8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EClamberingState                              ReplicatedClamberingState;                         // 0x00E9(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClamberingTargetingData               LockedTargetingData;                               // 0x00F0(0x00E8)(BlueprintVisible, BlueprintReadOnly, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FReplicatedClamberingTargetingData_SimClient ReplicatedTargetingData;                           // 0x01D8(0x0040)(Net, Transient, RepNotify, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_218[0x8];                                      // 0x0218(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         ClamberingEnabled;                                 // 0x0220(0x0038)(Edit, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ClamberIndicatorEnabled;                           // 0x0258(0x0038)(Edit, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         ClamberStartMaxFallingDamageFraction;              // 0x0298(0x0038)(Edit, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bPerformTargetingWhileWalking;                     // 0x02D0(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPerformTargetingWhileSwimming;                    // 0x02D1(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         ServerFailDelay;                                   // 0x02D8(0x0038)(Edit, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ServerValidatePlayerMaxDistance;                   // 0x0310(0x0038)(Edit, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FClamberingInputConfig                 InputConfig;                                       // 0x0348(0x04A0)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FClamberingTargetingConfig_Ledge       TargetingConfig_Ledge;                             // 0x07E8(0x0690)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FClamberingInputConfig_CachedValues    InputConfigCachedValues;                           // 0x0E78(0x005C)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FClamberingTargetingConfig_Ledge_CachedContextualValues TargetingConfig_Ledge_CachedContextualValues;      // 0x0ED4(0x007C)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FClamberingMovementConfig_Ledge        MoveConfig_Ledge;                                  // 0x0F50(0x0070)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ClamberSyncTargetLedgeOffset;                      // 0x0FC0(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ClamberingMaxAnalyticsEvents;                      // 0x0FF8(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SynchedActionFailDelay;                            // 0x1030(0x0038)(Edit, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortMovementMode_ExtClambering> MovementModeExtension;                             // 0x1068(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           SynchedActionMMETag;                               // 0x1070(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           AllowTargetingTag;                                 // 0x107C(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   LedgeLaunchSyncPointName;                          // 0x1088(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1094[0x4];                                     // 0x1094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LastTeleportTime;                                  // 0x1098(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTutorialModeEnabled;                              // 0x10A0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_10A1[0x7];                                     // 0x10A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClamberingTargetingData               LocalTargetingData;                                // 0x10A8(0x00E8)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FClamberingTargetingData               ParallelTargetingData;                             // 0x1190(0x00E8)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	float                                         QueuedInputTimer;                                  // 0x1278(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InputEnabledTimer;                                 // 0x127C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bJumpInputPressed;                                 // 0x1280(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1281[0x3];                                     // 0x1281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         JumpHeldInAirTime;                                 // 0x1284(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1288[0x50];                                    // 0x1288(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Tag_DisableClambering;                             // 0x12D8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_12E4[0xC];                                     // 0x12E4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_HandleClamberingStateChanged(const EClamberingState OldClamberingState, const EClamberingState NewClamberingState);
	void BP_HandleSynchedActionStarted(const struct FSynchedActionInfo& SynchedActionInfo);
	void BP_OnMMEStarted();
	void DrawDebugHUD(class AHUD* HUD, class UCanvas* Canvas);
	void HandleClamberingTargetInActivationRange();
	void HandleClamberingTargetOutOfActivationRange();
	void HandleOwnerASCInitialized(class UFortAbilitySystemComponent* AbilitySystemComponent, class AFortPlayerPawn* AffectedPawn);
	void HandleOwnerASCInvalidated();
	void HandleOwnerDBNO();
	void HandleOwnerDied(class AFortPawn* DeadPawn);
	void HandleOwnerJumpInput(bool bPressed);
	void HandleOwnerMovementModeChanged(class ACharacter* Character, EMovementMode PreviousMovementMode, uint8 PreviousCustomMode);
	void HandleOwnerPersonalVehicleModeChanged(bool bIsMounted);
	void HandleOwnerTeleported(class AFortPawn* TeleportedOwner);
	void HandleTargetActorDestroyed(class AActor* Actor);
	void HandleTargetActorHealthChanged();
	void HandleTargetingDataInvalid();
	void HandleTargetingDataValid(const struct FClamberingTargetingData& TargetingData);
	void NetMulticast_ClamberingLedgeFailed(EClamberingFailedReason FailedReason, EClamberingState FailedState);
	void OnMutatorUpdated();
	void OnPlayerStatePawnSet(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);
	void OnRep_ReplicatedTargetingData();
	void RegisterMutatorUpdatedDelegate(class APawn* AffectedPawn);
	void ServerStartClambering(const struct FReplicatedClamberingTargetingData& InReplicatedTargetingData, const double ClientLastTeleportTime);
	void SetTutorialModeEnabled(bool bEnabled);
	void UnregisterMutatorUpdatedDelegate();

	void BP_CanStartClambering(bool* bCanStartClambering) const;
	void BP_CanStartTargeting(bool* bCanStartTargeting) const;
	void BP_IsValidTargetActor(const class AActor* TargetActor, bool* bIsValidTargetActor) const;
	void BP_TutorialModeDisabled() const;
	void BP_TutorialModeEnabled() const;
	bool IsAutoClamberingEnabled() const;
	bool IsClamberingEnabled() const;
	bool IsTutorialModeEnabled() const;
	bool ShouldShowClamberIndicator() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClamberingComponent">();
	}
	static class UClamberingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClamberingComponent>();
	}
};

// Class ClamberingCodeRuntime.ClamberingLibrary
// 0x0000 (0x0030 - 0x0030)
class UClamberingLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool PerformClamberingTargeting(const class ACharacter* Character, struct FClamberingTargetingData* OutTargetingData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClamberingLibrary">();
	}
	static class UClamberingLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClamberingLibrary>();
	}
};

// Class ClamberingCodeRuntime.FortAthenaMutator_LedgeLaunch
// 0x01C0 (0x0690 - 0x04D0)
class alignas(0x10) AFortAthenaMutator_LedgeLaunch final : public AFortAthenaMutator
{
public:
	uint8                                         Pad_4D0[0x1A0];                                    // 0x04D0(0x01A0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class ABuildingWall>>   CurrentWalls;                                      // 0x0670(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	bool                                          bShouldSpawnLedge;                                 // 0x0680(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_681[0xF];                                      // 0x0681(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_bShouldSpawnLedge();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_LedgeLaunch">();
	}
	static class AFortAthenaMutator_LedgeLaunch* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_LedgeLaunch>();
	}
};

}

