#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: class_selector_ui_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass class_selector_ui_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class class_selector_ui_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass class_selector_ui_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class class_selector_ui_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<class_selector_ui_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass class_selector_ui_device.class_selector_ui_device
// 0x0040 (0x0100 - 0x00C0)
class Uclass_selector_ui_device final : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0x5A38EC60_ClassSelectedEvent;             // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x57DA3B54_ClassChangedEvent;              // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xA90A6147_UIClosedEvent;                  // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xD6B4C9C4_UIOpenedEvent;                  // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x5BDC7A5C_EnableFunction;                 // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC9184E23_DisableFunction;                // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x670B509D_ShowFunction;                   // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fclass__selector__ui__device_N_RDisable(const struct class_selector_ui_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fclass__selector__ui__device_N_REnable(const struct class_selector_ui_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fclass__selector__ui__device_N_RShow_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"class_selector_ui_device">();
	}
	static class Uclass_selector_ui_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uclass_selector_ui_device>();
	}
};

}

