#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: class_and_team_selector_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass class_and_team_selector_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class class_and_team_selector_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass class_and_team_selector_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class class_and_team_selector_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<class_and_team_selector_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass class_and_team_selector_device.class_and_team_selector_device
// 0x0040 (0x0100 - 0x00C0)
class Uclass_and_team_selector_device final : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0x64289F20_ClassSwitchedEvent;             // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x28AEE6EC_TeamSwitchedEvent;              // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x5BDC7A5C_EnableFunction;                 // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC9184E23_DisableFunction;                // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x2DB0A081_ChangeClassFunction;            // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x2B9D4F84_ChangeTeamFunction;             // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x99D90AED_ChangeTeamAndClassFunction;     // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x6AA61266_ChangeSelectorTeamFunction;     // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fclass__and__team__selector__device_N_RChangeClass_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fclass__and__team__selector__device_N_RChangeSelectorTeam_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fclass__and__team__selector__device_N_RChangeTeam_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fclass__and__team__selector__device_N_RChangeTeamAndClass_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fclass__and__team__selector__device_N_RDisable(const struct class_and_team_selector_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fclass__and__team__selector__device_N_REnable(const struct class_and_team_selector_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"class_and_team_selector_device">();
	}
	static class Uclass_and_team_selector_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uclass_and_team_selector_device>();
	}
};

}

