#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClothingSystemRuntimeCommon

#include "Basic.hpp"

#include "ClothingSystemRuntimeCommon_structs.hpp"
#include "ClothingSystemRuntimeInterface_structs.hpp"
#include "ClothingSystemRuntimeInterface_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ClothingSystemRuntimeCommon.ClothConfigCommon
// 0x0000 (0x0030 - 0x0030)
class UClothConfigCommon : public UClothConfigBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothConfigCommon">();
	}
	static class UClothConfigCommon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothConfigCommon>();
	}
};

// Class ClothingSystemRuntimeCommon.ClothSharedConfigCommon
// 0x0000 (0x0030 - 0x0030)
class UClothSharedConfigCommon : public UClothConfigCommon
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothSharedConfigCommon">();
	}
	static class UClothSharedConfigCommon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothSharedConfigCommon>();
	}
};

// Class ClothingSystemRuntimeCommon.ClothingAssetCustomData
// 0x0000 (0x0030 - 0x0030)
class UClothingAssetCustomData final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothingAssetCustomData">();
	}
	static class UClothingAssetCustomData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothingAssetCustomData>();
	}
};

// Class ClothingSystemRuntimeCommon.ClothingAssetCommon
// 0x0200 (0x0250 - 0x0050)
class UClothingAssetCommon final : public UClothingAssetBase
{
public:
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class UClothConfigBase*>    ClothConfigs;                                      // 0x0058(0x0050)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, EditFixedSize, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	class UClothConfigBase*                       ClothSharedSimConfig;                              // 0x00A8(0x0008)(ZeroConstructor, Deprecated, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClothConfigBase*                       ClothSimConfig;                                    // 0x00B0(0x0008)(ZeroConstructor, Deprecated, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClothConfigBase*                       ChaosClothSimConfig;                               // 0x00B8(0x0008)(ZeroConstructor, Deprecated, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UClothLODDataCommon_Legacy*>     ClothLodData;                                      // 0x00C0(0x0010)(ZeroConstructor, Deprecated, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FClothLODDataCommon>            LodData;                                           // 0x00D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 LodMap;                                            // 0x00E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           UsedBoneNames;                                     // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 UsedBoneIndices;                                   // 0x0100(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReferenceBoneIndex;                                // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClothingAssetCustomData*               CustomData;                                        // 0x0118(0x0008)(ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClothConfig_Legacy                    ClothConfig;                                       // 0x0120(0x0130)(Deprecated, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothingAssetCommon">();
	}
	static class UClothingAssetCommon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothingAssetCommon>();
	}
};

// Class ClothingSystemRuntimeCommon.ClothLODDataCommon_Legacy
// 0x01F0 (0x0220 - 0x0030)
class UClothLODDataCommon_Legacy final : public UObject
{
public:
	class UClothPhysicalMeshDataBase_Legacy*      PhysicalMeshData;                                  // 0x0030(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClothPhysicalMeshData                 ClothPhysicalMeshData;                             // 0x0038(0x0178)(NativeAccessSpecifierPublic)
	struct FClothCollisionData                    CollisionData;                                     // 0x01B0(0x0040)(NativeAccessSpecifierPublic)
	TArray<struct FPointWeightMap>                ParameterMasks;                                    // 0x01F0(0x0010)(ZeroConstructor, EditorOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_200[0x20];                                     // 0x0200(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClothLODDataCommon_Legacy">();
	}
	static class UClothLODDataCommon_Legacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothLODDataCommon_Legacy>();
	}
};

}

