#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: collectible_object_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass collectible_object_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class collectible_object_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass collectible_object_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class collectible_object_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<collectible_object_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass collectible_object_device.collectible_object_device
// 0x0030 (0x00F0 - 0x00C0)
class Ucollectible_object_device final : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0xE64A4B0F_CollectedEvent;                 // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x41D94ED5_TurnVisibilityOnFunction;       // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x4FFF02AD_TurnVisibilityOffFunction;      // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x96A9B6EF_RespawnFunction;                // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x171A2246_RespawnForAllFunction;          // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fcollectible__object__device_N_RHide(const struct collectible_object_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcollectible__object__device_N_RRespawn_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcollectible__object__device_N_RRespawnForAll(const struct collectible_object_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcollectible__object__device_N_RShow(const struct collectible_object_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"collectible_object_device">();
	}
	static class Ucollectible_object_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ucollectible_object_device>();
	}
};

}

