#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollectionMapShared

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class CollectionMapShared.AthenaCollectionScreenMapBase
// 0x0090 (0x08C8 - 0x0838)
class UAthenaCollectionScreenMapBase : public UAthenaCollectionScreenBase
{
public:
	class UAthenaFullScreenMapBase*               MapWidget;                                         // 0x0838(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_840[0x10];                                     // 0x0840(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAthenaMapCollectionIcon>   CollectionIconType;                                // 0x0850(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, class UAthenaMapCollectionIcon*> MapCollectionIcons;                                // 0x0858(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8A8[0x20];                                     // 0x08A8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCollectionScreenMapBase">();
	}
	static class UAthenaCollectionScreenMapBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCollectionScreenMapBase>();
	}
};

// Class CollectionMapShared.AthenaMapCollectionIcon
// 0x0000 (0x04D8 - 0x04D8)
class UAthenaMapCollectionIcon final : public UAthenaMapNavigableIconCustom
{
public:
	void SetIsKnown(const bool bIsKnown);
	void SetSecondaryIcon(const TSoftObjectPtr<class UObject>& SecondaryIcon);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaMapCollectionIcon">();
	}
	static class UAthenaMapCollectionIcon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMapCollectionIcon>();
	}
};

}

