#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Component_0

#include "Basic.hpp"

#include "Component_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "VerseColors_structs.hpp"
#include "Verse_structs.hpp"
#include "VerseUI_0_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"


namespace SDK::Params
{

// Function Component.light_component.$InitCDO
// 0x0060 (0x0060 - 0x0000)
struct light_component__InitCDO final
{
public:
	EVerseFalse                                   _ExprResult_0;                                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_1;                                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_2;                                     // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_3;                                     // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_4;                                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_5 : 1;                                 // 0x0005(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_5_1 : 7;                                    // 0x0005(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_6 : 1;                                 // 0x0006(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_6_1 : 7;                                    // 0x0006(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_7 : 1;                                 // 0x0007(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_7_1 : 7;                                    // 0x0007(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_8 : 1;                                 // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_8_1 : 7;                                    // 0x0008(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_9 : 1;                                 // 0x0009(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_9_1 : 7;                                    // 0x0009(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_10 : 1;                                // 0x000A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_A_1 : 7;                                    // 0x000A(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_11 : 1;                                // 0x000B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_12;                                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColors_color                          _ExprResult_13;                                    // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVerseFalse                                   _ExprResult_14;                                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_15;                                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_16;                                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_17;                                    // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_18;                                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_19 : 1;                                // 0x0035(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_35_1 : 7;                                   // 0x0035(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_20 : 1;                                // 0x0036(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_36_1 : 7;                                   // 0x0036(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_21 : 1;                                // 0x0037(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_37_1 : 7;                                   // 0x0037(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_22 : 1;                                // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_38_1 : 7;                                   // 0x0038(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_23 : 1;                                // 0x0039(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_39_1 : 7;                                   // 0x0039(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_24 : 1;                                // 0x003A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_3A_1 : 7;                                   // 0x003A(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_25 : 1;                                // 0x003B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_26;                                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColors_color                          _ExprResult_27;                                    // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized
// 0x0001 (0x0001 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing
// 0x0001 (0x0001 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetAffectGlobalIllumination_L_Naccessor_R
// 0x0002 (0x0002 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetAffectGlobalIllumination_L_Naccessor_R final
{
public:
	EVerse_accessor                               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetAffectReflection_L_Naccessor_R
// 0x0002 (0x0002 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetAffectReflection_L_Naccessor_R final
{
public:
	EVerse_accessor                               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastDeepShadows_L_Naccessor_R
// 0x0002 (0x0002 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastDeepShadows_L_Naccessor_R final
{
public:
	EVerse_accessor                               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastShadows_L_Naccessor_R
// 0x0002 (0x0002 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastShadows_L_Naccessor_R final
{
public:
	EVerse_accessor                               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastVolumetricShadow_L_Naccessor_R
// 0x0002 (0x0002 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastVolumetricShadow_L_Naccessor_R final
{
public:
	EVerse_accessor                               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetColor_L_Naccessor_M_N_Kchar_R
// 0x03D0 (0x03D0 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetColor_L_Naccessor_M_N_Kchar_R final
{
public:
	struct Ftuple_Laccessor_M_Kchar_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x00000000__1;                             // 0x0020(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_0;                               // 0x0030(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_1;                                // 0x0040(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_2;                                     // 0x0058(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0068(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_4;                                     // 0x0078(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_5;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_7;                                     // 0x00A8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_8;                                     // 0x00B8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_9;                               // 0x00C8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_10;                               // 0x00D8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_11;                                    // 0x00F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_12;                                    // 0x0100(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_13;                                    // 0x0110(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_14;                                    // 0x0120(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x0130(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_16;                                    // 0x0140(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_17;                                    // 0x0150(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_18;                              // 0x0160(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_19;                               // 0x0170(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_20;                                    // 0x0188(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_21;                                    // 0x0198(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_22;                                    // 0x01A8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_23;                                    // 0x01B8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_24;                                    // 0x01C8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_25;                                    // 0x01D8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_26;                                    // 0x01E8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x00000000__6;                             // 0x01F8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_27;                              // 0x0208(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_28;                               // 0x0218(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_29;                                    // 0x0230(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_30;                                    // 0x0240(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_31;                                    // 0x0250(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_32;                                    // 0x0260(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_33;                                    // 0x0270(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_34;                                    // 0x0280(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_35;                                    // 0x0290(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_36;                              // 0x02A0(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_37;                               // 0x02B0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_38;                                    // 0x02C8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_39;                                    // 0x02D8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_40;                                    // 0x02E8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_41;                                    // 0x02F8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_42;                                    // 0x0308(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_43;                                    // 0x0318(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_44;                                    // 0x0328(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_45;                              // 0x0338(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_46;                               // 0x0348(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_47;                                    // 0x0360(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_48;                                    // 0x0370(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_49;                                    // 0x0380(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_50;                                    // 0x0390(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_51;                                    // 0x03A0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_52;                                    // 0x03B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_53;                                    // 0x03C0(0x0010)(HasGetValueTypeHash)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetColor_L_Naccessor_R
// 0x0020 (0x0020 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetColor_L_Naccessor_R final
{
public:
	EVerse_accessor                               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColors_color                          RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetIntensity_L_Naccessor_R
// 0x0010 (0x0010 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetIntensity_L_Naccessor_R final
{
public:
	EVerse_accessor                               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____AffectGlobalIllumination
// 0x0001 (0x0001 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____AffectGlobalIllumination final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____AffectReflection
// 0x0001 (0x0001 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____AffectReflection final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____CastDeepShadows
// 0x0001 (0x0001 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____CastDeepShadows final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____CastShadows
// 0x0001 (0x0001 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____CastShadows final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____CastVolumetricShadow
// 0x0001 (0x0001 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____CastVolumetricShadow final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____Color
// 0x0001 (0x0001 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____Color final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____Intensity
// 0x0001 (0x0001 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____Intensity final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetAffectGlobalIllumination_L_Naccessor_M_Nlogic_R
// 0x0002 (0x0002 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetAffectGlobalIllumination_L_Naccessor_M_Nlogic_R final
{
public:
	struct Component_0::Ftuple_Laccessor_Mlogic_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0002)(Parm, NoDestructor, HasGetValueTypeHash)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetAffectReflection_L_Naccessor_M_Nlogic_R
// 0x0002 (0x0002 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetAffectReflection_L_Naccessor_M_Nlogic_R final
{
public:
	struct Component_0::Ftuple_Laccessor_Mlogic_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0002)(Parm, NoDestructor, HasGetValueTypeHash)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastDeepShadows_L_Naccessor_M_Nlogic_R
// 0x0002 (0x0002 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastDeepShadows_L_Naccessor_M_Nlogic_R final
{
public:
	struct Component_0::Ftuple_Laccessor_Mlogic_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0002)(Parm, NoDestructor, HasGetValueTypeHash)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastShadows_L_Naccessor_M_Nlogic_R
// 0x0002 (0x0002 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastShadows_L_Naccessor_M_Nlogic_R final
{
public:
	struct Component_0::Ftuple_Laccessor_Mlogic_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0002)(Parm, NoDestructor, HasGetValueTypeHash)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastVolumetricShadow_L_Naccessor_M_Nlogic_R
// 0x0002 (0x0002 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastVolumetricShadow_L_Naccessor_M_Nlogic_R final
{
public:
	struct Component_0::Ftuple_Laccessor_Mlogic_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0002)(Parm, NoDestructor, HasGetValueTypeHash)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetColor_L_Naccessor_M_N_Kchar_M_Nfloat_R
// 0x0490 (0x0490 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetColor_L_Naccessor_M_N_Kchar_M_Nfloat_R final
{
public:
	struct Ftuple_Laccessor_M_Kchar_Mfloat_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	struct FColors_color                          __verse_0x8690B0C4_NewColor_2;                     // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         __verse_0x00000000__3;                             // 0x0038(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_0;                               // 0x0048(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_1;                                // 0x0058(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_2;                                     // 0x0070(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0080(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_4;                                     // 0x0090(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_5;                                     // 0x00A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x00B0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_7;                                     // 0x00C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_8;                                     // 0x00D0(0x0010)(HasGetValueTypeHash)
	double                                        _AssignmentScratch_9;                              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_10;                              // 0x00E8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_11;                               // 0x00F8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_12;                                    // 0x0110(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_13;                                    // 0x0120(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_14;                                    // 0x0130(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_15;                                    // 0x0140(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_16;                                    // 0x0150(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_17;                                    // 0x0160(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_18;                                    // 0x0170(0x0010)(HasGetValueTypeHash)
	double                                        _AssignmentScratch_19;                             // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_20;                              // 0x0188(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_21;                               // 0x0198(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_22;                                    // 0x01B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_23;                                    // 0x01C0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_24;                                    // 0x01D0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_25;                                    // 0x01E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_26;                                    // 0x01F0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_27;                                    // 0x0200(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_28;                                    // 0x0210(0x0010)(HasGetValueTypeHash)
	double                                        _AssignmentScratch_29;                             // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_30;                               // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FColors_color                          VerseClassVarProxySetterRHS_31;                    // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x8690B0C4_NewColor_10;                    // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         __verse_0x00000000__11;                            // 0x0270(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_32;                              // 0x0280(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_33;                               // 0x0290(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_34;                                    // 0x02A8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_35;                                    // 0x02B8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_36;                                    // 0x02C8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_37;                                    // 0x02D8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_38;                                    // 0x02E8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_39;                                    // 0x02F8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_40;                                    // 0x0308(0x0010)(HasGetValueTypeHash)
	double                                        _AssignmentScratch_41;                             // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_42;                              // 0x0320(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_43;                               // 0x0330(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_44;                                    // 0x0348(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_45;                                    // 0x0358(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_46;                                    // 0x0368(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_47;                                    // 0x0378(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_48;                                    // 0x0388(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_49;                                    // 0x0398(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_50;                                    // 0x03A8(0x0010)(HasGetValueTypeHash)
	double                                        _AssignmentScratch_51;                             // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_52;                              // 0x03C0(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_53;                               // 0x03D0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_54;                                    // 0x03E8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_55;                                    // 0x03F8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_56;                                    // 0x0408(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_57;                                    // 0x0418(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_58;                                    // 0x0428(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_59;                                    // 0x0438(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_60;                                    // 0x0448(0x0010)(HasGetValueTypeHash)
	double                                        _AssignmentScratch_61;                             // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColors_color                          _ExprResultStack_62;                               // 0x0460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FColors_color                          VerseClassVarProxySetterRHS_63;                    // 0x0478(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetColor_L_Naccessor_M_Ncolor_R
// 0x0020 (0x0020 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetColor_L_Naccessor_M_Ncolor_R final
{
public:
	struct Ftuple_Laccessor_Mcolor_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Component.light_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetIntensity_L_Naccessor_M_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct light_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetIntensity_L_Naccessor_M_Nfloat_R final
{
public:
	struct Component_0::Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Component._Root.float_range$Factory
// 0x0010 (0x0010 - 0x0000)
struct _Root_float_range_Factory final
{
public:
	struct Ffloat_range                           RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Component._Root.float_range$OverrideFactory
// 0x00C0 (0x00C0 - 0x0000)
struct _Root_float_range_OverrideFactory final
{
public:
	struct Ffloat_range                           RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0010(0x0050)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResultStack_0;                                // 0x0060(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_1;                                     // 0x0070(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         _ExprResultStack_2;                                // 0x0078(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_3;                                     // 0x0088(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         _ExprResultStack_4;                                // 0x0090(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_5;                                     // 0x00A0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         _ExprResultStack_6;                                // 0x00A8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_7;                                     // 0x00B8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function Component._Root.hit_result$Factory
// 0x0050 (0x0050 - 0x0000)
struct _Root_hit_result_Factory final
{
public:
	struct Fhit_result                            RetVal;                                            // 0x0000(0x0050)(Parm, OutParm, ReturnParm)
};

// Function Component._Root.hit_result$OverrideFactory
// 0x00A0 (0x00A0 - 0x0000)
struct _Root_hit_result_OverrideFactory final
{
public:
	struct Fhit_result                            RetVal;                                            // 0x0000(0x0050)(Parm, OutParm, ReturnParm)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0050(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function Component.local_hud_component.$InitCDO
// 0x0090 (0x0090 - 0x0000)
struct local_hud_component__InitCDO final
{
public:
	TArray<class USimulation_player*>             _ExprResult_0;                                     // 0x0000(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0010(0x0010)(ContainsInstancedReference)
	TArray<class USimulation_player*>             _ForResult_1;                                      // 0x0020(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_2;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0041(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_player*>             _ExprResult_5;                                     // 0x0048(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x0058(0x0010)(ContainsInstancedReference)
	TArray<class USimulation_player*>             _ForResult_6;                                      // 0x0068(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_7;                                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_8;                                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_9 : 1;                                 // 0x0089(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function Component.local_hud_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct local_hud_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function Component.local_hud_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation
// 0x0160 (0x0160 - 0x0000)
struct local_hud_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_1;                                     // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_player*>             _ForIterable_2;                                    // 0x0008(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_3;                                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_4;                                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_player*                     __verse_0xE5E3B371_Player_5;                       // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_player_ui*                          __verse_0x570A6C3F_PlayerUI_6;                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UUI_player_ui*, true>         _ExprResultStack_5;                                // 0x0038(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
	class UUI_player_ui*                          __verse_0x00000000__8;                             // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_7;                          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x0068(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Lcanvas_Mplayer__ui__slot_R     _ExprResult_9;                                     // 0x0080(0x0018)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_canvas*                             _ExprResultStack_10;                               // 0x0098(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FUI_player_ui_slot                     _ExprResultStack_11;                               // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVerseTrue                                    _InvokeSureResultDummy_12;                         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_13;                                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_player*>             _ForIterable_14;                                   // 0x00B8(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_15;                                      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_16;                                     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_player*                     __verse_0xE5E3B371_Player_13;                      // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_player_ui*                          __verse_0x570A6C3F_PlayerUI_14;                    // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UUI_player_ui*, true>         _ExprResultStack_17;                               // 0x00E8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_18;                                        // 0x00F0(0x0018)(HasGetValueTypeHash)
	class UUI_player_ui*                          __verse_0x00000000__16;                            // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_19;                         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_20;                                        // 0x0118(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Lcanvas_Mplayer__ui__slot_R     _ExprResult_21;                                    // 0x0130(0x0018)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_canvas*                             _ExprResultStack_22;                               // 0x0148(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FUI_player_ui_slot                     _ExprResultStack_23;                               // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Component.local_hud_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation
// 0x0118 (0x0118 - 0x0000)
struct local_hud_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation final
{
public:
	struct Component_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_player*>             _ForIterable_0;                                    // 0x0008(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_1;                                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_2;                                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_player*                     __verse_0xE5E3B371_Player_4;                       // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_player_ui*                          __verse_0x570A6C3F_PlayerUI_5;                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UUI_player_ui*, true>         _ExprResultStack_3;                                // 0x0038(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
	class UUI_player_ui*                          __verse_0x00000000__7;                             // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_5;                          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0068(0x0018)(HasGetValueTypeHash)
	class UUI_canvas*                             _ExprResultStack_7;                                // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_8;                          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_9;                                     // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_player*>             _ForIterable_10;                                   // 0x0090(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_11;                                      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_12;                                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_player*                     __verse_0xE5E3B371_Player_11;                      // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_player_ui*                          __verse_0x570A6C3F_PlayerUI_12;                    // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UUI_player_ui*, true>         _ExprResultStack_13;                               // 0x00C0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_14;                                        // 0x00C8(0x0018)(HasGetValueTypeHash)
	class UUI_player_ui*                          __verse_0x00000000__14;                            // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_15;                         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_16;                                        // 0x00F0(0x0018)(HasGetValueTypeHash)
	class UUI_canvas*                             _ExprResultStack_17;                               // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_18;                         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct Component_0::Ftuple_L_R                _ExprResult_19;                                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Component.local_hud_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flocal__hud__component_N_RHide_L_Nplayer_R
// 0x04E8 (0x04E8 - 0x0000)
struct local_hud_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flocal__hud__component_N_RHide_L_Nplayer_R final
{
public:
