#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CompanionAI_0

#include "Basic.hpp"

#include "VerseColors_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CompanionAI_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "VerseFortnite_0_structs.hpp"
#include "VerseFortnite_0_classes.hpp"
#include "UnrealEngineExperimental_0_structs.hpp"
#include "UnrealEngineExperimental_0_classes.hpp"
#include "VerseNative_0_classes.hpp"
#include "EpicGamesTemporary_0_structs.hpp"


namespace SDK
{

// VerseClass CompanionAI.CompanionAI_companion_ai
// 0x0068 (0x00C0 - 0x0058)
class UCompanionAI_companion_ai final : public UAI_npc_behavior
{
public:
	class UDiagnostics_log*                       __verse_0xF524C2AC_Logger;                         // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDiagnostics_debug_draw*                __verse_0x8E43B8AF_DebugDraw;                      // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         __verse_0x4222121E_DebugDisplay : 1;               // 0x0068(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColors_color                          __verse_0x71320F52_DebugScreenColor;               // 0x0070(0x0018)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor)
	double                                        __verse_0x2D4D6684_DebugScreenDuration;            // 0x0088(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x5155C58D_GoToLeashDistance;              // 0x0090(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4D92C49B_GoToAttackTargetDistance;       // 0x0098(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x8D041DAB_HoldPositionLeashDistance;      // 0x00A0(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x5EF17E77_BackToMeMovementThreshold;      // 0x00A8(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x80F3C16A_ReviveDistance;                 // 0x00B0(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x53BD03B7_AttackCommand_TargetProximityRadius; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UConcurrency_task* OnBegin(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CompanionAI_companion_ai">();
	}
	static class UCompanionAI_companion_ai* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompanionAI_companion_ai>();
	}
};

// VerseClass CompanionAI.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class CompanionAI_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass CompanionAI.$SolarisSignatureFunctionOuter", true>();
	}
	static class CompanionAI_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<CompanionAI_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass CompanionAI.CompanionAI
// 0x0000 (0x0030 - 0x0030)
class UCompanionAI final : public UObject
{
public:
	static TOptional<class USimulation_agent*, true> _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetAgent_U_L_Nentity_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct CompanionAI_0::Ftuple_Lentity_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static struct CompanionAI_0::Ftuple_Lfloat_Mfloat_R _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetNPCLeashRadius_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct CompanionAI_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TArray<class USimulation_agent*> _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetTeamMembers_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eIsBeingDBNOCarried_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct CompanionAI_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static FVerseStringProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Ncommand__type_R(ECompanionAI_PingCommand_command_type __verse_0xB2CDDD72_Argument);
	static FVerseStringProperty_ _L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Nentity__type_R(ECompanionAI_PingCommand_entity_type __verse_0xB2CDDD72_Argument);
	static struct FCompanionAI_ping_info CompanionAI_ping_info_Factory();
	static struct FCompanionAI_ping_info CompanionAI_ping_info_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CompanionAI">();
	}
	static class UCompanionAI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompanionAI>();
	}
};

// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$LookAroundAndCheckMovementAndReviveTask_L_Nping__info_R
// 0x0200 (0x02C8 - 0x00C8)
class Utask_CompanionAI_companion_ai_runtime_LookAroundAndCheckMovementAndReviveTask_L_Nping__info_R final : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*      _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCompanionAI_ping_info                 __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0038)(Parm)
	uint8                                         _AsyncBeginCount_0 : 1;                            // 0x0108(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_108_1 : 7;                                  // 0x0108(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _AsyncBeginCount_1 : 1;                            // 0x0109(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_2;                                      // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_3;                                 // 0x0118(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Lvector3_Mtype_7b0_2e500000_7d_Mtype_7b1_2e500000_7d_R _ExprResult_4;                                     // 0x0130(0x0028)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _AsyncResult_5;                                    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_6 : 1;                            // 0x0160(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_7;                                      // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_8;                                 // 0x0170(0x0018)(HasGetValueTypeHash)
	int64                                         _AsyncResult_9;                                    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_10 : 1;                           // 0x0190(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_11;                                     // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_12;                                // 0x01A0(0x0018)(HasGetValueTypeHash)
	int64                                         _AsyncResult_13;                                   // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_14;                                     // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_15;                                // 0x01C8(0x0018)(HasGetValueTypeHash)
	int64                                         _AsyncResult_16;                                   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_17 : 1;                           // 0x01E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_1E8_1 : 7;                                  // 0x01E8(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _AsyncBeginCount_18 : 1;                           // 0x01E9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_19;                                     // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_20;                                // 0x01F8(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Lvector3_Mtype_7b0_2e500000_7d_Mtype_7b1_2e500000_7d_R _ExprResult_21;                                    // 0x0210(0x0028)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _AsyncResult_22;                                   // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_23 : 1;                           // 0x0240(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_24;                                     // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_25;                                // 0x0250(0x0018)(HasGetValueTypeHash)
	int64                                         _AsyncResult_26;                                   // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_27 : 1;                           // 0x0270(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_28;                                     // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_29;                                // 0x0280(0x0018)(HasGetValueTypeHash)
	int64                                         _AsyncResult_30;                                   // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_31;                                     // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_32;                                // 0x02A8(0x0018)(HasGetValueTypeHash)
	int64                                         _AsyncResult_33;                                   // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_CompanionAI_companion_ai_runtime$LookAroundAndCheckMovementAndReviveTask_L_Nping__info_R">();
	}
	static class Utask_CompanionAI_companion_ai_runtime_LookAroundAndCheckMovementAndReviveTask_L_Nping__info_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_CompanionAI_companion_ai_runtime_LookAroundAndCheckMovementAndReviveTask_L_Nping__info_R>();
	}
};

// VerseClass CompanionAI.CompanionAI_follower_actions_component
// 0x0000 (0x0070 - 0x0070)
class UCompanionAI_follower_actions_component final : public UAI_fort_guard_actions_component
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffollower__actions__component_N_RIsFollowingBehaviorEnabled(const struct CompanionAI_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* RunDefaultBehavior(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CompanionAI_follower_actions_component">();
	}
	static class UCompanionAI_follower_actions_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompanionAI_follower_actions_component>();
	}
};

// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$WaitForDamageService
// 0x0268 (0x0330 - 0x00C8)
class Utask_CompanionAI_companion_ai_runtime_WaitForDamageService final : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*      _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x00D8(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x00F0(0x0010)(HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_3 : 1;                            // 0x0100(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_100_1 : 7;                                  // 0x0100(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _AsyncBeginCount_4 : 1;                            // 0x0101(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__3;                             // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__4;                             // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0118(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_6;                                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_7;                                      // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_8;                                 // 0x0140(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_9;                                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_10;                                   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_11 : 1;                           // 0x0168(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__6;                             // 0x0170(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__7;                             // 0x0178(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_12;                                        // 0x0180(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_13;                                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_14;                                     // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_15;                                // 0x01A8(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_16;                                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_17;                                   // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_18;                         // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_19;                                        // 0x01D8(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_20;                                    // 0x01F0(0x0010)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_21;                         // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_22;                                        // 0x0208(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_23;                                    // 0x0220(0x0010)(HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_24 : 1;                           // 0x0230(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_230_1 : 7;                                  // 0x0230(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _AsyncBeginCount_25 : 1;                           // 0x0231(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__11;                            // 0x0238(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__12;                            // 0x0240(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_26;                                        // 0x0248(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_27;                                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_28;                                     // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_29;                                // 0x0270(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_30;                                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_31;                                   // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_32 : 1;                           // 0x0298(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__14;                            // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__15;                            // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_33;                                        // 0x02B0(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_34;                                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_35;                                     // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_36;                                // 0x02D8(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_37;                                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_38;                                   // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_39;                         // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_40;                                        // 0x0308(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_41;                                    // 0x0320(0x0010)(HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_CompanionAI_companion_ai_runtime$WaitForDamageService">();
	}
	static class Utask_CompanionAI_companion_ai_runtime_WaitForDamageService* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_CompanionAI_companion_ai_runtime_WaitForDamageService>();
	}
};

// VerseClass CompanionAI.CompanionAI_companion_ai_message_module
// 0x0008 (0x0038 - 0x0030)
class UCompanionAI_companion_ai_message_module final : public UObject
{
public:
	class UVerse_message*                         __verse_0xB8255226_SettingsCategory;               // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CompanionAI_companion_ai_message_module">();
	}
	static class UCompanionAI_companion_ai_message_module* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompanionAI_companion_ai_message_module>();
	}
};

// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$WaitForTargetInVehicleService_L_Nfort__character_R
// 0x01A0 (0x0268 - 0x00C8)
class Utask_CompanionAI_companion_ai_runtime_WaitForTargetInVehicleService_L_Nfort__character_R final : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*      _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x00E0(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x00F8(0x0010)(HasGetValueTypeHash)
	class UObject*                                __verse_0x4BB95041_Vehicle_3;                      // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_3;                                // 0x0110(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0118(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_5;                                     // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_6;                                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_7;                                     // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_8;                                      // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_9;                                 // 0x0150(0x0018)(HasGetValueTypeHash)
	int64                                         _AsyncResult_10;                                   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_11;                         // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_12;                                        // 0x0178(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_13;                                    // 0x0190(0x0010)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_14;                         // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_15;                                        // 0x01A8(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_16;                                    // 0x01C0(0x0010)(HasGetValueTypeHash)
	class UObject*                                __verse_0x4BB95041_Vehicle_8;                      // 0x01D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_17;                               // 0x01D8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_18;                                        // 0x01E0(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_19;                                    // 0x01F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_20;                                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_21;                                    // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20A[0x6];                                      // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_22;                                     // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_23;                                // 0x0218(0x0018)(HasGetValueTypeHash)
	int64                                         _AsyncResult_24;                                   // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_25;                         // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_26;                                        // 0x0240(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_27;                                    // 0x0258(0x0010)(HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_CompanionAI_companion_ai_runtime$WaitForTargetInVehicleService_L_Nfort__character_R">();
	}
	static class Utask_CompanionAI_companion_ai_runtime_WaitForTargetInVehicleService_L_Nfort__character_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_CompanionAI_companion_ai_runtime_WaitForTargetInVehicleService_L_Nfort__character_R>();
	}
};

// VerseClass CompanionAI.CompanionAI_companion_ai_runtime
// 0x0030 (0x0060 - 0x0030)
class UCompanionAI_companion_ai_runtime final : public UObject
{
public:
	class UCompanionAI_companion_ai*              __verse_0xF8ADD547_CompanionAIScript;              // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x963EC691_Character;                      // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCompanionAI_follower_actions_component* __verse_0xA84F8C3F_GuardActions;                   // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xA4160F11_Leashable;                      // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCompanionAI_ping_component*            __verse_0x3FE20196_FortPing;                       // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAI_fort_guard_perception_component*    __verse_0xBCE0FEF0_GuardPerception;                // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_RCheckForDBNOTeamMembersInRange_L_Nping__info_R(const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	TOptional<struct FAI_fort_obstacle_info> _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_RGetObstacle(const struct CompanionAI_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<struct FAI_target_info> _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_RGetTarget(const struct CompanionAI_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_RLogAndDisplayOnScreen_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnConverted(const struct CompanionAI_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnConverted0_L_Nany_R_Nvoid(FVerseDynamicProperty_ __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnUnconverted(const struct CompanionAI_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_ROnUnconverted0_L_Nany_R_Nvoid(FVerseDynamicProperty_ __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* CheckForReviveTeamMembers_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* CheckIfCharacterHasMoved_L_Nvector3_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* CheckReviveTask_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* CrouchService(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* CrouchUntilHit(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* DrawSphere_L_Nvector3_M_Nfloat_M_Ncolor_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lvector3_Mfloat_Mcolor_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GameLoop(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GetAttackCommandTarget_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GetNewObstacle(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GetNewTarget(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GoToAndAttackTask_L_Ntarget__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FAI_target_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* GoToPositionTask_L_Nvector3_M_N_Qagent_M_Nlogic_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lvector3_M_Qagent_Mlogic_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleBackToMeCommand_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleGoTo_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleGoToCommand_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleHoldPositionCommand_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleNPCCommand_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleObstacleService_L_N_Qentity_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, TOptional<class Uentity*, true> __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* HandleReviveCommand_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* LookAroundAndCheckMovementAndReviveTask_L_Nping__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FCompanionAI_ping_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* LookAroundTask_L_Nvector3_M_Nfloat_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI_0::Ftuple_Lvector3_Mfloat_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* LookAtOrAttackTarget(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* LookAtTargetTask(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* ReviveCommand_L_Nagent_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class USimulation_agent* __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* SetLeashPosition_L_Nvector3_M_Nfloat_M_Nagent_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lvector3_Mfloat_Magent_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* ShootTargetService_L_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, double __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* TacticalSprintService(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* WaitForDamageService(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct CompanionAI_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* WaitForTargetInVehicleService_L_Nfort__character_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class UObject* __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* WaitForTargetMovementService_L_Nfort__character_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lfort__character_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CompanionAI_companion_ai_runtime">();
	}
	static class UCompanionAI_companion_ai_runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompanionAI_companion_ai_runtime>();
	}
};

// VerseClass CompanionAI.task_CompanionAI_companion_ai_runtime$HandleObstacleService_L_N_Qentity_R
// 0x0550 (0x0618 - 0x00C8)
class Utask_CompanionAI_companion_ai_runtime_HandleObstacleService_L_N_Qentity_R final : public UConcurrency_task
{
public:
	class UCompanionAI_companion_ai_runtime*      _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<class Uentity*, true>               __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0008)(Parm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x00E0(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x00F8(0x0010)(HasGetValueTypeHash)
	TOptional<struct FAI_fort_obstacle_info>      __verse_0x39C5E53E_ObstacleInfo_1;                 // 0x0108(0x0030)(ZeroConstructor, NoDestructor)
	TOptional<struct FAI_fort_obstacle_info>      _ExprResultStack_3;                                // 0x0138(0x0030)(ZeroConstructor, NoDestructor)
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0168(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_5;                                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_6 : 1;                            // 0x0181(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_181_1 : 7;                                  // 0x0181(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _AsyncBeginCount_7 : 1;                            // 0x0182(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_183[0x5];                                      // 0x0183(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAI_fort_obstacle_info                 __verse_0x82A44C52_Obstacle_4;                     // 0x0188(0x0028)(NoDestructor)
	TOptional<struct FAI_fort_obstacle_info>      _ExprResultStack_8;                                // 0x01B0(0x0030)(ZeroConstructor, NoDestructor)
	class Uentity*                                __verse_0xBD80729A_CurrentTarget_5;                // 0x01E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uentity*, true>               _ExprResultStack_9;                                // 0x01E8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_10;                              // 0x01F0(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_11;                               // 0x0200(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_12;                                    // 0x0218(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_13;                                    // 0x0228(0x0010)(HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_14;                                     // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_15;                                // 0x0240(0x0018)(HasGetValueTypeHash)
	int64                                         _AsyncResult_16;                                   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_17;                                // 0x0260(0x0018)(HasGetValueTypeHash)
	class UCompanionAI_follower_actions_component* __verse_0x00000000__7;                             // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_18;                                // 0x0280(0x0018)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_19;                                // 0x0298(0x0018)(HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_20 : 1;                           // 0x02B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FAI_fort_obstacle_info>      _AssignmentScratch_21;                             // 0x02B8(0x0030)(ZeroConstructor, NoDestructor)
	TOptional<struct FAI_fort_obstacle_info>      _ExprResult_22;                                    // 0x02E8(0x0030)(ZeroConstructor, NoDestructor)
	class UConcurrency_task*                      _AsyncTask_23;                                     // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_24;                                // 0x0320(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_25;                                    // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_26;                                   // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_27;                         // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_28;                                        // 0x0350(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_29;                                    // 0x0368(0x0010)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_30;                         // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_31;                                        // 0x0380(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_32;                                    // 0x0398(0x0010)(HasGetValueTypeHash)
	TOptional<struct FAI_fort_obstacle_info>      __verse_0x39C5E53E_ObstacleInfo_10;                // 0x03A8(0x0030)(ZeroConstructor, NoDestructor)
	TOptional<struct FAI_fort_obstacle_info>      _ExprResultStack_33;                               // 0x03D8(0x0030)(ZeroConstructor, NoDestructor)
	FVerseFunctionProperty_                       _Callee_34;                                        // 0x0408(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_35;                                    // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_36 : 1;                           // 0x0421(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_421_1 : 7;                                  // 0x0421(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _AsyncBeginCount_37 : 1;                           // 0x0422(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_423[0x5];                                      // 0x0423(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAI_fort_obstacle_info                 __verse_0x82A44C52_Obstacle_13;                    // 0x0428(0x0028)(NoDestructor)
	TOptional<struct FAI_fort_obstacle_info>      _ExprResultStack_38;                               // 0x0450(0x0030)(ZeroConstructor, NoDestructor)
	class Uentity*                                __verse_0xBD80729A_CurrentTarget_14;               // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uentity*, true>               _ExprResultStack_39;                               // 0x0488(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_40;                              // 0x0490(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_41;                               // 0x04A0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_42;                                    // 0x04B8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_43;                                    // 0x04C8(0x0010)(HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_44;                                     // 0x04D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_45;                                // 0x04E0(0x0018)(HasGetValueTypeHash)
	int64                                         _AsyncResult_46;                                   // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_47;                                // 0x0500(0x0018)(HasGetValueTypeHash)
	class UCompanionAI_follower_actions_component* __verse_0x00000000__16;                            // 0x0518(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_48;                                // 0x0520(0x0018)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_49;                                // 0x0538(0x0018)(HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_50 : 1;                           // 0x0550(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FAI_fort_obstacle_info>      _AssignmentScratch_51;                             // 0x0558(0x0030)(ZeroConstructor, NoDestructor)
	TOptional<struct FAI_fort_obstacle_info>      _ExprResult_52;                                    // 0x0588(0x0030)(ZeroConstructor, NoDestructor)
	class UConcurrency_task*                      _AsyncTask_53;                                     // 0x05B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_54;                                // 0x05C0(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_55;                                    // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D9[0x7];                                      // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_56;                                   // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
