#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Component

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class Component.CameraEntityProxyActor
// 0x0010 (0x0B80 - 0x0B70)
class ACameraEntityProxyActor final : public ACameraActor
{
public:
	class AActor*                                 SelectedCorrespondingActor;                        // 0x0B70(0x0008)(ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B78[0x8];                                      // 0x0B78(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraEntityProxyActor">();
	}
	static class ACameraEntityProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACameraEntityProxyActor>();
	}
};

// Class Component.LightProxyActor
// 0x0010 (0x0430 - 0x0420)
class ALightProxyActor : public AActor
{
public:
	class ULightComponent*                        LightComponent;                                    // 0x0420(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 SelectedCorrespondingActor;                        // 0x0428(0x0008)(ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LightProxyActor">();
	}
	static class ALightProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALightProxyActor>();
	}
};

// Class Component.DirectionalLightProxyActor
// 0x0000 (0x0430 - 0x0430)
class ADirectionalLightProxyActor final : public ALightProxyActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DirectionalLightProxyActor">();
	}
	static class ADirectionalLightProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADirectionalLightProxyActor>();
	}
};

// Class Component.StaticMeshEntityComponent_Implementation
// 0x01E0 (0x0210 - 0x0030)
class UStaticMeshEntityComponent_Implementation final : public UObject
{
public:
	uint8                                         Pad_30[0x1E0];                                     // 0x0030(0x01E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StaticMeshEntityComponent_Implementation">();
	}
	static class UStaticMeshEntityComponent_Implementation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStaticMeshEntityComponent_Implementation>();
	}
};

// Class Component.ParticleSystemProxyActor
// 0x0008 (0x0428 - 0x0420)
class AParticleSystemProxyActor final : public AActor
{
public:
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ParticleSystemProxyActor">();
	}
	static class AParticleSystemProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AParticleSystemProxyActor>();
	}
};

// Class Component.PhysicsEntityComponent_Implementation
// 0x01A8 (0x01D8 - 0x0030)
class UPhysicsEntityComponent_Implementation final : public UObject
{
public:
	struct FBodyInstance                          BodyInstance;                                      // 0x0030(0x0198)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C8[0x10];                                     // 0x01C8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsEntityComponent_Implementation">();
	}
	static class UPhysicsEntityComponent_Implementation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsEntityComponent_Implementation>();
	}
};

// Class Component.PointLightProxyActor
// 0x0000 (0x0430 - 0x0430)
class APointLightProxyActor final : public ALightProxyActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PointLightProxyActor">();
	}
	static class APointLightProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APointLightProxyActor>();
	}
};

// Class Component.RectLightProxyActor
// 0x0000 (0x0430 - 0x0430)
class ARectLightProxyActor final : public ALightProxyActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RectLightProxyActor">();
	}
	static class ARectLightProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARectLightProxyActor>();
	}
};

// Class Component.SoundProxyActor
// 0x0018 (0x0438 - 0x0420)
class ASoundProxyActor final : public AActor
{
public:
	class AActor*                                 SelectedCorrespondingActor;                        // 0x0420(0x0008)(ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0428(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AudioComponent;                                    // 0x0430(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnRep_StartTime();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SoundProxyActor">();
	}
	static class ASoundProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASoundProxyActor>();
	}
};

// Class Component.SpotLightProxyActor
// 0x0000 (0x0430 - 0x0430)
class ASpotLightProxyActor final : public ALightProxyActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpotLightProxyActor">();
	}
	static class ASpotLightProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpotLightProxyActor>();
	}
};

// Class Component.TextDisplayProxyActor
// 0x0060 (0x0480 - 0x0420)
class ATextDisplayProxyActor final : public AActor
{
public:
	class AActor*                                 SelectedCorrespondingActor;                        // 0x0420(0x0008)(ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_428[0x10];                                     // 0x0428(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextRenderComponent*                   TextRenderComponent;                               // 0x0438(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_440[0x10];                                     // 0x0440(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               TextMaterialInstanceDynamic;                       // 0x0450(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFont*                                  Font;                                              // 0x0458(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_460[0x20];                                     // 0x0460(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TextDisplayProxyActor">();
	}
	static class ATextDisplayProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATextDisplayProxyActor>();
	}
};

}

