#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComponentVisualizers

#include "Basic.hpp"

#include "UnrealEd_structs.hpp"
#include "Engine_classes.hpp"
#include "ComponentVisualizers_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ComponentVisualizers.Manipulator
// 0x0018 (0x0438 - 0x0420)
class AManipulator final : public AActor
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        AssociatedComponent;                               // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Manipulator">();
	}
	static class AManipulator* GetDefaultObj()
	{
		return GetDefaultObjImpl<AManipulator>();
	}
};

// Class ComponentVisualizers.SplineComponentVisualizerSelectionState
// 0x00C0 (0x00F0 - 0x0030)
class USplineComponentVisualizerSelectionState : public UObject
{
public:
	struct FComponentPropertyPath                 SplinePropertyPath;                                // 0x0030(0x0020)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSet<int32>                                   SelectedKeys;                                      // 0x0050(0x0050)(Protected, NativeAccessSpecifierProtected)
	int32                                         LastKeyIndexSelected;                              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SelectedSegmentIndex;                              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SelectedTangentHandle;                             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESelectedTangentHandle                        SelectedTangentHandleType;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                SelectedSplinePosition;                            // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  CachedRotation;                                    // 0x00D0(0x0020)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SplineComponentVisualizerSelectionState">();
	}
	static class USplineComponentVisualizerSelectionState* GetDefaultObj()
	{
		return GetDefaultObjImpl<USplineComponentVisualizerSelectionState>();
	}
};

// Class ComponentVisualizers.SplineGeneratorBase
// 0x0090 (0x00C0 - 0x0030)
class USplineGeneratorBase : public UObject
{
public:
	EShapeAddMode                                 ShapeAddMode;                                      // 0x0030(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x8F];                                      // 0x0031(0x008F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SplineGeneratorBase">();
	}
	static class USplineGeneratorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USplineGeneratorBase>();
	}
};

// Class ComponentVisualizers.CircleSplineGenerator
// 0x0010 (0x00D0 - 0x00C0)
class UCircleSplineGenerator final : public USplineGeneratorBase
{
public:
	int32                                         NumberOfPoints;                                    // 0x00C0(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x00C4(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverseDir;                                       // 0x00C8(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepFirstKeyTangent;                              // 0x00C9(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBranchRight;                                      // 0x00CA(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CircleSplineGenerator">();
	}
	static class UCircleSplineGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCircleSplineGenerator>();
	}
};

// Class ComponentVisualizers.ArcSplineGenerator
// 0x0010 (0x00D0 - 0x00C0)
class UArcSplineGenerator final : public USplineGeneratorBase
{
public:
	int32                                         NumberOfPoints;                                    // 0x00C0(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x00C4(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Degrees;                                           // 0x00C8(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverseDir;                                       // 0x00CC(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepFirstKeyTangent;                              // 0x00CD(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBranchRight;                                      // 0x00CE(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CF[0x1];                                       // 0x00CF(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArcSplineGenerator">();
	}
	static class UArcSplineGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArcSplineGenerator>();
	}
};

// Class ComponentVisualizers.SquareSplineGenerator
// 0x0008 (0x00C8 - 0x00C0)
class USquareSplineGenerator final : public USplineGeneratorBase
{
public:
	float                                         Length;                                            // 0x00C0(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBranchRight;                                      // 0x00C4(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SquareSplineGenerator">();
	}
	static class USquareSplineGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<USquareSplineGenerator>();
	}
};

// Class ComponentVisualizers.EllipseSplineGenerator
// 0x0010 (0x00D0 - 0x00C0)
class UEllipseSplineGenerator final : public USplineGeneratorBase
{
public:
	int32                                         NumberOfPoints;                                    // 0x00C0(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x00C4(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x00C8(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverseDir;                                       // 0x00CC(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepFirstKeyTangent;                              // 0x00CD(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBranchRight;                                      // 0x00CE(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CF[0x1];                                       // 0x00CF(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EllipseSplineGenerator">();
	}
	static class UEllipseSplineGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEllipseSplineGenerator>();
	}
};

// Class ComponentVisualizers.RectangleSplineGenerator
// 0x0010 (0x00D0 - 0x00C0)
class URectangleSplineGenerator final : public USplineGeneratorBase
{
public:
	float                                         Length;                                            // 0x00C0(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x00C4(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBranchRight;                                      // 0x00C8(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RectangleSplineGenerator">();
	}
	static class URectangleSplineGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<URectangleSplineGenerator>();
	}
};

// Class ComponentVisualizers.LineSplineGenerator
// 0x0018 (0x00D8 - 0x00C0)
class ULineSplineGenerator final : public USplineGeneratorBase
{
public:
	int32                                         NumberOfPoints;                                    // 0x00C0(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Length;                                            // 0x00C8(0x0008)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableUpToNextPoint;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpToNextPoint;                                    // 0x00D1(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LineSplineGenerator">();
	}
	static class ULineSplineGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULineSplineGenerator>();
	}
};

}

