#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Component_0

#include "Basic.hpp"

#include "VerseColors_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Verse_structs.hpp"
#include "Entity_0_classes.hpp"
#include "VerseNative_structs.hpp"
#include "VerseUI_0_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "Component_0_structs.hpp"


namespace SDK
{

// VerseClass Component.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class Component_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass Component.$SolarisSignatureFunctionOuter", true>();
	}
	static class Component_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<Component_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass Component.light_component
// 0x0078 (0x00C8 - 0x0050)
class Ulight_component : public Ucomponent
{
public:
	uint8                                         __verse_0x370AFB5F_CastShadows : 1;                // 0x0050(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_50_1 : 7;                                   // 0x0050(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x8E6057EF_CastVolumetricShadow : 1;       // 0x0051(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_51_1 : 7;                                   // 0x0051(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x1635313F_CastDeepShadows : 1;            // 0x0052(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_52_1 : 7;                                   // 0x0052(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x41208E8E_AffectReflection : 1;           // 0x0053(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_53_1 : 7;                                   // 0x0053(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0xF603D50E_AffectGlobalIllumination : 1;   // 0x0054(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0x06B3E864_Intensity;                      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColors_color                          __verse_0x65678AC7_Color;                          // 0x0060(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	uint8                                         __verse_0x00FBC2A9__CastShadows : 1;               // 0x0078(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Net, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_78_1 : 7;                                   // 0x0078(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0xA19307B9__CastVolumetricShadow : 1;      // 0x0079(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Net, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_79_1 : 7;                                   // 0x0079(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0xC5440B7D__CastDeepShadows : 1;           // 0x007A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Net, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_7A_1 : 7;                                   // 0x007A(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x94CA2752__AffectReflection : 1;          // 0x007B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Net, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_7B_1 : 7;                                   // 0x007B(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0xEE7CC240__AffectGlobalIllumination : 1;  // 0x007C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Net, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0x4E4E65F6__Intensity;                     // 0x0080(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColors_color                          __verse_0x89B83CD1__Color;                         // 0x0088(0x0018)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A0[0x28];                                      // 0x00A0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetAffectGlobalIllumination_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetAffectReflection_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastDeepShadows_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastShadows_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastVolumetricShadow_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetColor_L_Naccessor_M_N_Kchar_R(const struct Ftuple_Laccessor_M_Kchar_R& __verse_0xB2CDDD72_Argument);
	struct FColors_color _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetColor_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetIntensity_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____AffectGlobalIllumination(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____AffectReflection(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____CastDeepShadows(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____CastShadows(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____CastVolumetricShadow(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____Color(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep____Intensity(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetAffectGlobalIllumination_L_Naccessor_M_Nlogic_R(const struct Component_0::Ftuple_Laccessor_Mlogic_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetAffectReflection_L_Naccessor_M_Nlogic_R(const struct Component_0::Ftuple_Laccessor_Mlogic_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastDeepShadows_L_Naccessor_M_Nlogic_R(const struct Component_0::Ftuple_Laccessor_Mlogic_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastShadows_L_Naccessor_M_Nlogic_R(const struct Component_0::Ftuple_Laccessor_Mlogic_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastVolumetricShadow_L_Naccessor_M_Nlogic_R(const struct Component_0::Ftuple_Laccessor_Mlogic_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetColor_L_Naccessor_M_N_Kchar_M_Nfloat_R(const struct Ftuple_Laccessor_M_Kchar_Mfloat_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetColor_L_Naccessor_M_Ncolor_R(const struct Ftuple_Laccessor_Mcolor_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetIntensity_L_Naccessor_M_Nfloat_R(const struct Component_0::Ftuple_Laccessor_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"light_component">();
	}
	static class Ulight_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ulight_component>();
	}
};

// VerseClass Component._Root
// 0x0000 (0x0030 - 0x0030)
class Component_0::U_Root final : public UObject
{
public:
	static struct Ffloat_range float_range_Factory();
	static struct Ffloat_range float_range_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static struct Fhit_result hit_result_Factory();
	static struct Fhit_result hit_result_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass Component._Root", true>();
	}
	static class Component_0::U_Root* GetDefaultObj()
	{
		return GetDefaultObjImpl<Component_0::U_Root>();
	}
};

// VerseClass Component.local_hud_component
// 0x0028 (0x0078 - 0x0050)
class Ulocal_hud_component final : public Ucomponent
{
public:
	class UUI_canvas*                             __verse_0x89A21F20_Canvas;                         // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FUI_player_ui_slot                     __verse_0xF1214EFE_UISlot;                         // 0x0058(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	TArray<class USimulation_player*>             __verse_0x76952CF9_ShowingPlayerUI;                // 0x0068(0x0010)(InstancedReference, ContainsInstancedReference)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flocal__hud__component_N_RHide_L_Nplayer_R(class USimulation_player* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flocal__hud__component_N_RShow_L_Nplayer_R(class USimulation_player* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"local_hud_component">();
	}
	static class Ulocal_hud_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ulocal_hud_component>();
	}
};

// VerseClass Component.basic_camera_component
// 0x0030 (0x0080 - 0x0050)
class Ubasic_camera_component : public Ucomponent
{
public:
	double                                        __verse_0xE317D65E_FieldOfView;                    // 0x0050(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x28];                                      // 0x0058(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_RGetFieldOfView(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_ROnRep__FieldOfView(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_RSetFieldOfView_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_RUpdateFieldOfView(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"basic_camera_component">();
	}
	static class Ubasic_camera_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubasic_camera_component>();
	}
};

// VerseClass Component.damageable_component
// 0x0020 (0x0070 - 0x0050)
class Udamageable_component : public Ucomponent
{
public:
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x2DEDA279_DamagedEvent;                   // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdamageable__component_N_RDamage_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"damageable_component">();
	}
	static class Udamageable_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Udamageable_component>();
	}
};

// VerseClass Component.mesh_component
// 0x0088 (0x00D8 - 0x0050)
class Umesh_component final : public Ucomponent
{
public:
	class UAssets_mesh*                           __verse_0x71AD33A7_Mesh;                           // 0x0050(0x0008)(Edit, ExportObject, Net, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UObject*, true>               __verse_0xF2313B1F_Material;                       // 0x0058(0x0008)(Net, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_60[0x48];                                      // 0x0060(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         __verse_0x8892301A_bWantsImplementation : 1;       // 0x00A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_A8_1 : 7;                                   // 0x00A8(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x5CDFC2A5_Enabled : 1;                    // 0x00A9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Net, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_AA[0x2E];                                      // 0x00AA(0x002E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fmesh__component_N_ROnRep__Enabled(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fmesh__component_N_ROnRep__Material(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fmesh__component_N_ROnRep__Mesh(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"mesh_component">();
	}
	static class Umesh_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Umesh_component>();
	}
};

// VerseClass Component.point_light_component_base
// 0x0030 (0x00F8 - 0x00C8)
class Upoint_light_component_base : public Ulight_component
{
public:
	double                                        __verse_0xBAB0877B_AttenuationRadius;              // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x12542E15_SourceRadius;                   // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xAA17A810_SourceLength;                   // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x3835D83E__AttenuationRadius;             // 0x00E0(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x7E578E96__SourceRadius;                  // 0x00E8(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xC6140893__SourceLength;                  // 0x00F0(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RGetAttenuationRadius_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RGetSourceLength_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RGetSourceRadius_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_ROnRep____AttenuationRadius(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_ROnRep____SourceLength(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_ROnRep____SourceRadius(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RSetAttenuationRadius_L_Naccessor_M_Nfloat_R(const struct Component_0::Ftuple_Laccessor_Mfloat_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RSetSourceLength_L_Naccessor_M_Nfloat_R(const struct Component_0::Ftuple_Laccessor_Mfloat_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RSetSourceRadius_L_Naccessor_M_Nfloat_R(const struct Component_0::Ftuple_Laccessor_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"point_light_component_base">();
	}
	static class Upoint_light_component_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<Upoint_light_component_base>();
	}
};

// VerseClass Component.spot_light_component
// 0x0020 (0x0118 - 0x00F8)
class Uspot_light_component final : public Upoint_light_component_base
{
public:
	double                                        __verse_0x5C223359_InnerConeAngle;                 // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x9D05865C_OuterConeAngle;                 // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x9956C500__InnerConeAngle;                // 0x0108(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x58717005__OuterConeAngle;                // 0x0110(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__component_N_RGetInnerConeAngle_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__component_N_RGetOuterConeAngle_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__component_N_ROnRep____InnerConeAngle(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__component_N_ROnRep____OuterConeAngle(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__component_N_RSetInnerConeAngle_L_Naccessor_M_Nfloat_R(const struct Component_0::Ftuple_Laccessor_Mfloat_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__component_N_RSetOuterConeAngle_L_Naccessor_M_Nfloat_R(const struct Component_0::Ftuple_Laccessor_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"spot_light_component">();
	}
	static class Uspot_light_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uspot_light_component>();
	}
};

// VerseClass Component.directional_light_component
// 0x0010 (0x00D8 - 0x00C8)
class Udirectional_light_component final : public Ulight_component
{
public:
	double                                        __verse_0x7D2E69E8_ShadowOpacity;                  // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xECB66941__ShadowOpacity;                 // 0x00D0(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdirectional__light__component_N_RGetShadowOpacity_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdirectional__light__component_N_ROnRep____ShadowOpacity(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdirectional__light__component_N_RSetShadowOpacity_L_Naccessor_M_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R(const struct Ftuple_Laccessor_Mtype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"directional_light_component">();
	}
	static class Udirectional_light_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Udirectional_light_component>();
	}
};

// VerseClass Component.point_light_component
// 0x0000 (0x00F8 - 0x00F8)
class Upoint_light_component final : public Upoint_light_component_base
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"point_light_component">();
	}
	static class Upoint_light_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Upoint_light_component>();
	}
};

// VerseClass Component.parent_constraint_component
// 0x00E0 (0x0130 - 0x0050)
class Uparent_constraint_component final : public Ucomponent
{
public:
	uint8                                         __verse_0x1AEA3A6F_AutoAttachToOwner : 1;          // 0x0050(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FSpatialMath_transform>      __verse_0xDF51C8D3_RelativeTransform;              // 0x0060(0x0070)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference)
	TOptional<class Uentity*, true>               __verse_0x1F66826C_ParentEntity;                   // 0x00D0(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x58];                                      // 0x00D8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RAttachTo_L_Nentity_M_Ntransform_R(const struct Ftuple_Lentity_Mtransform_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RAttachTo_L_Nentity_R(class Uentity* __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RDetachFrom(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<struct FSpatialMath_transform> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RGetAttachedTransform(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_transform _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RGetRelativeTransform(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RSetRelativeTransform_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparent__constraint__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"parent_constraint_component">();
	}
	static class Uparent_constraint_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uparent_constraint_component>();
	}
};

// VerseClass Component.particle_system_component
// 0x00D8 (0x0128 - 0x0050)
class Uparticle_system_component final : public Ucomponent
{
public:
	class UAssets_particle_system*                __verse_0x1CB585BF_ParticleSystem;                 // 0x0050(0x0008)(Edit, ExportObject, Net, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_58[0x20];                                      // 0x0058(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         __verse_0xC40E3E14_AutoEnable : 1;                 // 0x0078(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         __verse_0xB6DCA931_EnableCounter;                  // 0x0080(0x0008)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x8892301A_bWantsImplementation : 1;       // 0x0088(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_88_1 : 7;                                   // 0x0088(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x3B072BB9_PreviewInEditor : 1;            // 0x0089(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   __verse_0x68030817_BeamStart;                      // 0x0090(0x0018)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0x86F3B4EC_BeamStartTangent;               // 0x00A8(0x0018)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0x9C23C07D_BeamEnd;                        // 0x00C0(0x0018)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0xBF08B3B8_BeamEndTangent;                 // 0x00D8(0x0018)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	double                                        __verse_0x46028BF2_BeamWidth;                      // 0x00F0(0x0008)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F8[0x30];                                      // 0x00F8(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamEnd(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamEndTangent(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamStart(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamStartTangent(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamWidth(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__EnableCounter(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__ParticleSystem(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamEnd_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamEndTangent_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamStart_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamStartTangent_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamWidth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"particle_system_component">();
	}
	static class Uparticle_system_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uparticle_system_component>();
	}
};

// VerseClass Component.physics_component
// 0x0070 (0x00C0 - 0x0050)
class Uphysics_component final : public Ucomponent
{
public:
	uint8                                         Pad_50[0x38];                                      // 0x0050(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         __verse_0x8892301A_bWantsImplementation : 1;       // 0x0088(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_88_1 : 7;                                   // 0x0088(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x5CDFC2A5_Enabled : 1;                    // 0x0089(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Net, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_8A[0x2E];                                      // 0x008A(0x002E)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x4BFA8E15_HitEvent;                       // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fphysics__component_N_ROnRep__Enabled(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"physics_component">();
	}
	static class Uphysics_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uphysics_component>();
	}
};

// VerseClass Component.rect_light_component
// 0x0050 (0x0118 - 0x00C8)
class Urect_light_component final : public Ulight_component
{
public:
	double                                        __verse_0xBAB0877B_AttenuationRadius;              // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x9F64F627_SourceWidth;                    // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xC3BD8CB5_SourceHeight;                   // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x23D81FBD_BarnDoorAngle;                  // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDC62E582_BarnDoorLength;                 // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x3835D83E__AttenuationRadius;             // 0x00F0(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xA895CFD1__SourceWidth;                   // 0x00F8(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xAFBE2C36__SourceHeight;                  // 0x0100(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xB2401F14__BarnDoorAngle;                 // 0x0108(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x191613DB__BarnDoorLength;                // 0x0110(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RGetAttenuationRadius_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RGetBarnDoorAngle_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RGetBarnDoorLength_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RGetSourceHeight_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RGetSourceWidth_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_ROnRep____AttenuationRadius(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_ROnRep____BarnDoorAngle(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_ROnRep____BarnDoorLength(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_ROnRep____SourceHeight(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_ROnRep____SourceWidth(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RSetAttenuationRadius_L_Naccessor_M_Nfloat_R(const struct Component_0::Ftuple_Laccessor_Mfloat_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RSetBarnDoorAngle_L_Naccessor_M_Nfloat_R(const struct Component_0::Ftuple_Laccessor_Mfloat_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RSetBarnDoorLength_L_Naccessor_M_Nfloat_R(const struct Component_0::Ftuple_Laccessor_Mfloat_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RSetSourceHeight_L_Naccessor_M_Nfloat_R(const struct Component_0::Ftuple_Laccessor_Mfloat_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2frect__light__component_N_RSetSourceWidth_L_Naccessor_M_Nfloat_R(const struct Component_0::Ftuple_Laccessor_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"rect_light_component">();
	}
	static class Urect_light_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Urect_light_component>();
	}
};

// VerseClass Component.sound_component
// 0x0070 (0x00C0 - 0x0050)
class Usound_component final : public Ucomponent
{
public:
	class UAssets_sound*                          __verse_0xF013250F_Sound;                          // 0x0050(0x0008)(Edit, ExportObject, Net, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_58[0x28];                                      // 0x0058(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         __verse_0x8892301A_bWantsImplementation : 1;       // 0x0080(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         __verse_0x38C2642B_StartCounter;                   // 0x0088(0x0008)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_90[0x30];                                      // 0x0090(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fsound__component_N_ROnRep__Sound(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fsound__component_N_ROnRep__StartCounter(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fsound__component_N_RPlay(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fsound__component_N_RStop(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"sound_component">();
	}
	static class Usound_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Usound_component>();
	}
};

// VerseClass Component.text_display_component
// 0x0080 (0x00D0 - 0x0050)
class Utext_display_component final : public Ucomponent
{
public:
	uint8                                         Pad_50[0x28];                                      // 0x0050(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         __verse_0x5CDFC2A5_Enabled : 1;                    // 0x0078(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Net, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         __verse_0x4069CADB_Text;                           // 0x0080(0x0010)(Edit, Net, InstancedReference, SaveGame, HasGetValueTypeHash)
	class UAssets_font*                           __verse_0x70A2AEEA_Font;                           // 0x0090(0x0008)(Edit, ExportObject, Net, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FColors_color                          __verse_0x65678AC7_Color;                          // 0x0098(0x0018)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor)
	struct Ffloat_range                           __verse_0x515E2844_VisibleDistance;                // 0x00B0(0x0010)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor)
	double                                        __verse_0xE725FDA9_FadeInTime;                     // 0x00C0(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x85320394_FadeOutTime;                    // 0x00C8(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
