#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CompanionAI_0

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "CompanionAI_0_structs.hpp"
#include "UnrealEngineExperimental_0_structs.hpp"
#include "VerseColors_structs.hpp"
#include "VerseFortnite_0_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"


namespace SDK::Params
{

// Function CompanionAI.CompanionAI_companion_ai.$InitCDO
// 0x0050 (0x0050 - 0x0000)
struct CompanionAI_companion_ai__InitCDO final
{
public:
	class UDiagnostics_log*                       _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 _ArchetypeFieldValue_2;                            // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDiagnostics_debug_draw*                _ExprResult_3;                                     // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_4;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDiagnostics_log*                       _ExprResult_5;                                     // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_6;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 _ArchetypeFieldValue_7;                            // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDiagnostics_debug_draw*                _ExprResult_8;                                     // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_9;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI_companion_ai.OnBegin
// 0x0028 (0x0028 - 0x0000)
struct CompanionAI_companion_ai_OnBegin final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetAgent_U_L_Nentity_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct CompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetAgent_U_L_Nentity_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct CompanionAI_0::Ftuple_Lentity_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetNPCLeashRadius_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0020 (0x0020 - 0x0000)
struct CompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetNPCLeashRadius_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct CompanionAI_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lfloat_Mfloat_R  RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetTeamMembers_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0020 (0x0020 - 0x0000)
struct CompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetTeamMembers_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class USimulation_agent*>              RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eIsBeingDBNOCarried_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct CompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eIsBeingDBNOCarried_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct CompanionAI_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Ncommand__type_R
// 0x02E8 (0x02E8 - 0x0000)
struct CompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Ncommand__type_R final
{
public:
	ECompanionAI_PingCommand_command_type         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_0;                               // 0x0018(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_1;                                // 0x0028(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_2;                                     // 0x0040(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_3;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_4;                               // 0x0060(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_5;                                // 0x0070(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_6;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_7;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_8;                               // 0x00A8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_9;                                // 0x00B8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_10;                                    // 0x00D0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_11;                                    // 0x00E0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_12;                              // 0x00F0(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_13;                               // 0x0100(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_14;                                    // 0x0118(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_15;                                    // 0x0128(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_16;                              // 0x0138(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_17;                               // 0x0148(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_18;                                    // 0x0160(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_19;                                    // 0x0170(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_20;                              // 0x0180(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_21;                               // 0x0190(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_22;                                    // 0x01A8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_23;                                    // 0x01B8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_24;                              // 0x01C8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_25;                               // 0x01D8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_26;                                    // 0x01F0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_27;                                    // 0x0200(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_28;                              // 0x0210(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_29;                               // 0x0220(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_30;                                    // 0x0238(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_31;                                    // 0x0248(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_32;                              // 0x0258(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_33;                               // 0x0268(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_34;                                    // 0x0280(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_35;                                    // 0x0290(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_36;                              // 0x02A0(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_37;                               // 0x02B0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_38;                                    // 0x02C8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_39;                                    // 0x02D8(0x0010)(HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Nentity__type_R
// 0x0378 (0x0378 - 0x0000)
struct CompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Nentity__type_R final
{
public:
	ECompanionAI_PingCommand_entity_type          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_0;                               // 0x0018(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_1;                                // 0x0028(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_2;                                     // 0x0040(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_3;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_4;                               // 0x0060(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_5;                                // 0x0070(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_6;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_7;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_8;                               // 0x00A8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_9;                                // 0x00B8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_10;                                    // 0x00D0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_11;                                    // 0x00E0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_12;                              // 0x00F0(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_13;                               // 0x0100(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_14;                                    // 0x0118(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_15;                                    // 0x0128(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_16;                              // 0x0138(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_17;                               // 0x0148(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_18;                                    // 0x0160(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_19;                                    // 0x0170(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_20;                              // 0x0180(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_21;                               // 0x0190(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_22;                                    // 0x01A8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_23;                                    // 0x01B8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_24;                              // 0x01C8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_25;                               // 0x01D8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_26;                                    // 0x01F0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_27;                                    // 0x0200(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_28;                              // 0x0210(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_29;                               // 0x0220(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_30;                                    // 0x0238(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_31;                                    // 0x0248(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_32;                              // 0x0258(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_33;                               // 0x0268(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_34;                                    // 0x0280(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_35;                                    // 0x0290(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_36;                              // 0x02A0(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_37;                               // 0x02B0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_38;                                    // 0x02C8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_39;                                    // 0x02D8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_40;                              // 0x02E8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_41;                               // 0x02F8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_42;                                    // 0x0310(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_43;                                    // 0x0320(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_44;                              // 0x0330(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_45;                               // 0x0340(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_46;                                    // 0x0358(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_47;                                    // 0x0368(0x0010)(HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI.CompanionAI_ping_info$Factory
// 0x0038 (0x0038 - 0x0000)
struct CompanionAI_CompanionAI_ping_info_Factory final
{
public:
	struct FCompanionAI_ping_info                 RetVal;                                            // 0x0000(0x0038)(Parm, OutParm, ReturnParm)
};

// Function CompanionAI.CompanionAI.CompanionAI_ping_info$OverrideFactory
// 0x0088 (0x0088 - 0x0000)
struct CompanionAI_CompanionAI_ping_info_OverrideFactory final
{
public:
	struct FCompanionAI_ping_info                 RetVal;                                            // 0x0000(0x0038)(Parm, OutParm, ReturnParm)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0038(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function CompanionAI.task_CompanionAI_companion_ai_runtime$LookAroundAndCheckMovementAndReviveTask_L_Nping__info_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_CompanionAI_companion_ai_runtime_LookAroundAndCheckMovementAndReviveTask_L_Nping__info_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI_follower_actions_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffollower__actions__component_N_RIsFollowingBehaviorEnabled
// 0x0002 (0x0002 - 0x0000)
struct CompanionAI_follower_actions_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2ffollower__actions__component_N_RIsFollowingBehaviorEnabled final
{
public:
	struct CompanionAI_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function CompanionAI.CompanionAI_follower_actions_component.RunDefaultBehavior
// 0x0028 (0x0028 - 0x0000)
struct CompanionAI_follower_actions_component_RunDefaultBehavior final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function CompanionAI.task_CompanionAI_companion_ai_runtime$WaitForDamageService.Update
// 0x0008 (0x0008 - 0x0000)
struct task_CompanionAI_companion_ai_runtime_WaitForDamageService_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI_companion_ai_message_module.$InitCDO
// 0x0360 (0x0360 - 0x0000)
struct CompanionAI_companion_ai_message_module__InitCDO final
{
public:
	class UVerse_message*                         _ExprResultStack_0;                                // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R _ExprResult_2;                                     // 0x0020(0x0070)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0090(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x00A0(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ExprResult_5;                                     // 0x00B0(0x0050)(ContainsInstancedReference)
	TMap<EVerseFalse, EVerseFalse>                __verse_0xC87067A2_Map_1;                          // 0x0100(0x0050)(ContainsInstancedReference)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ForResult_6;                                      // 0x0150(0x0050)(ContainsInstancedReference)
	int64                                         _ForIndex_7;                                       // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x589418B4_Key_3;                          // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x31A8F10C_Value_3;                        // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_8 : 1;                                 // 0x01AA(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_1AA_1 : 7;                                  // 0x01AA(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_9 : 1;                                 // 0x01AB(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerse_message*                         _ExprResultStack_10;                               // 0x01B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x01B8(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R _ExprResult_12;                                    // 0x01D0(0x0070)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_13;                                    // 0x0240(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_14;                                    // 0x0250(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ExprResult_15;                                    // 0x0260(0x0050)(ContainsInstancedReference)
	TMap<EVerseFalse, EVerseFalse>                __verse_0xC87067A2_Map_6;                          // 0x02B0(0x0050)(ContainsInstancedReference)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ForResult_16;                                     // 0x0300(0x0050)(ContainsInstancedReference)
	int64                                         _ForIndex_17;                                      // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x589418B4_Key_8;                          // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x31A8F10C_Value_8;                        // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_18 : 1;                                // 0x035A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_35A_1 : 7;                                  // 0x035A(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_19 : 1;                                // 0x035B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function CompanionAI.task_CompanionAI_companion_ai_runtime$WaitForTargetInVehicleService_L_Nfort__character_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_CompanionAI_companion_ai_runtime_WaitForTargetInVehicleService_L_Nfort__character_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI_companion_ai_runtime._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_RCheckForDBNOTeamMembersInRange_L_Nping__info_R
// 0x0B80 (0x0B80 - 0x0000)
struct CompanionAI_companion_ai_runtime__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_RCheckForDBNOTeamMembersInRange_L_Nping__info_R final
{
public:
	struct FCompanionAI_ping_info                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0038)(Parm)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0038(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_0;                                     // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xCFC3F3F6_success_1 : 1;                  // 0x003B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_agent*                      __verse_0xFD64D7AA_Emitter_2;                      // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResultStack_1;                                // 0x0048(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                __verse_0x6B4100B8_EmitterCharacter_2;             // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_2;                                // 0x0058(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0060(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_4;                                     // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_5;                                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_6;                                     // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_agent*                      __verse_0xC487D1E7_EmitterAgent_2;                 // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__3;                             // 0x0098(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResultStack_7;                                // 0x00A0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x00A8(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_9;                                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<double>                             _ExprResultStack_10;                               // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_11;                               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_12;                                        // 0x00E0(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lvector3_Mvector3_R _ExprResult_13;                                    // 0x00F8(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 _ExprResult_14;                                    // 0x0130(0x0060)(NoDestructor)
	class UObject*                                __verse_0x00000000__6;                             // 0x0190(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_15;                                        // 0x0198(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_16;                                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0xF];                                      // 0x01B1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 _ExprResult_17;                                    // 0x01C0(0x0060)(NoDestructor)
	class UObject*                                __verse_0x00000000__7;                             // 0x0220(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_18;                                        // 0x0228(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_19;                                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__8;                             // 0x0248(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_20;                               // 0x0250(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_21;                                        // 0x0258(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_22;                                    // 0x0270(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_23;                                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_24;                                    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_25;                               // 0x0282(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_26;                                        // 0x0288(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_27;                                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_28;                               // 0x02A1(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A3[0x5];                                      // 0x02A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_29;                                        // 0x02A8(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_30;                                    // 0x02C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_31;                               // 0x02D0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_32;                                        // 0x02D8(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_33;                                    // 0x02F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_34;                                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_35;                                    // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_36;                                    // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_37;                                    // 0x0303(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_agent*>              __verse_0xBFBCE682_TeamMembers_9;                  // 0x0308(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_38;                                        // 0x0318(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_39;                                    // 0x0330(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_40;                                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_41;                                    // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ForIndex_42;                                      // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_43;                                     // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                      __verse_0xAE35E375_TeamMember_12;                  // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_44;                               // 0x0360(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362[0x6];                                      // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<double>                             _ExprResultStack_45;                               // 0x0368(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_46;                               // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_47;                                        // 0x0380(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lvector3_Mvector3_R _ExprResult_48;                                    // 0x0398(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C8[0x8];                                      // 0x03C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 _ExprResult_49;                                    // 0x03D0(0x0060)(NoDestructor)
	class UObject*                                __verse_0x00000000__16;                            // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_50;                               // 0x0438(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_51;                                        // 0x0440(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_52;                                    // 0x0458(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_53;                                    // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_54;                                    // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46A[0x6];                                      // 0x046A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_55;                                        // 0x0470(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_56;                                    // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 _ExprResult_57;                                    // 0x0490(0x0060)(NoDestructor)
	class UObject*                                __verse_0x00000000__17;                            // 0x04F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_58;                                        // 0x04F8(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_59;                                    // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__18;                            // 0x0518(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_60;                               // 0x0520(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_61;                                        // 0x0528(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_62;                                    // 0x0540(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_63;                                    // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_64;                                    // 0x0551(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_65;                               // 0x0552(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_66;                                        // 0x0558(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_67;                                    // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_68;                               // 0x0571(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_573[0x5];                                      // 0x0573(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_69;                                        // 0x0578(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_70;                                    // 0x0590(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_71;                               // 0x05A0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_72;                                        // 0x05A8(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_73;                                    // 0x05C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_74;                                    // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_75;                                    // 0x05D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_76;                                    // 0x05D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_77;                                    // 0x05D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_78;                               // 0x05D4(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_79;                               // 0x05D6(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_80;                                    // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xCFC3F3F6_success_22 : 1;                 // 0x05D9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_5DA[0x6];                                      // 0x05DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_agent*                      __verse_0xFD64D7AA_Emitter_23;                     // 0x05E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResultStack_81;                               // 0x05E8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                __verse_0x6B4100B8_EmitterCharacter_23;            // 0x05F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_82;                               // 0x05F8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_83;                                        // 0x0600(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_84;                                    // 0x0618(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_85;                                    // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_86;                                    // 0x0629(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62A[0x6];                                      // 0x062A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_agent*                      __verse_0xC487D1E7_EmitterAgent_23;                // 0x0630(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__24;                            // 0x0638(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResultStack_87;                               // 0x0640(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_88;                                        // 0x0648(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_89;                                    // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<double>                             _ExprResultStack_90;                               // 0x0668(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_91;                               // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_92;                                        // 0x0680(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lvector3_Mvector3_R _ExprResult_93;                                    // 0x0698(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C8[0x8];                                      // 0x06C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 _ExprResult_94;                                    // 0x06D0(0x0060)(NoDestructor)
	class UObject*                                __verse_0x00000000__27;                            // 0x0730(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_95;                                        // 0x0738(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_96;                                    // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_751[0xF];                                      // 0x0751(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 _ExprResult_97;                                    // 0x0760(0x0060)(NoDestructor)
	class UObject*                                __verse_0x00000000__28;                            // 0x07C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_98;                                        // 0x07C8(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_99;                                    // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E1[0x7];                                      // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__29;                            // 0x07E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_100;                              // 0x07F0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_101;                                       // 0x07F8(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_102;                                   // 0x0810(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_103;                                   // 0x0820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_104;                                   // 0x0821(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_105;                              // 0x0822(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_824[0x4];                                      // 0x0824(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_106;                                       // 0x0828(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_107;                                   // 0x0840(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_108;                              // 0x0841(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_843[0x5];                                      // 0x0843(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_109;                                       // 0x0848(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_110;                                   // 0x0860(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_111;                              // 0x0870(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_112;                                       // 0x0878(0x0018)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_113;                                   // 0x0890(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_114;                                   // 0x08A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_115;                                   // 0x08A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_116;                                   // 0x08A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_117;                                   // 0x08A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A4[0x4];                                      // 0x08A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_agent*>              __verse_0xBFBCE682_TeamMembers_30;                 // 0x08A8(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_118;                                       // 0x08B8(0x0018)(HasGetValueTypeHash)
