#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Component_0

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "Verse_structs.hpp"
#include "VerseColors_structs.hpp"
#include "VerseUI_0_structs.hpp"


namespace SDK
{

// VerseStruct Component.float_range
// 0x0010 (0x0010 - 0x0000)
struct Ffloat_range final
{
public:
	double                                        __verse_0x91692725_Minimum;                        // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDF63CF93_Maximum;                        // 0x0008(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct Component.hit_result
// 0x0050 (0x0050 - 0x0000)
struct Fhit_result final
{
public:
	TOptional<class Uentity*, true>               __verse_0x9C8E9A95_ThisEntity;                     // 0x0000(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Ucomponent*, true>            __verse_0x0170A73A_ThisComponent;                  // 0x0008(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uentity*, true>               __verse_0x9E548E88_OtherEntity;                    // 0x0010(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Ucomponent*, true>            __verse_0x15DAA648_OtherComponent;                 // 0x0018(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xA0175DA6_HitNormal;                      // 0x0020(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0xE16733E1_HitLocation;                    // 0x0038(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
};

// VerseStruct Component.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct Component_0::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct Component.tuple_L_Kany_Mtuple_L_R_Many_R
// 0x0028 (0x0028 - 0x0000)
struct Component_0::Ftuple_L_Kany_Mtuple_L_R_Many_R final
{
public:
	TArray<FVerseDynamicProperty_>                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	struct Component_0::Ftuple_L_R                __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        __verse_0x932BF92E_Elem2;                          // 0x0018(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct Component.tuple_L_Kany_Mtuple_L_R_Mint_R
// 0x0020 (0x0020 - 0x0000)
struct Component_0::Ftuple_L_Kany_Mtuple_L_R_Mint_R final
{
public:
	TArray<FVerseDynamicProperty_>                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	struct Component_0::Ftuple_L_R                __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         __verse_0x932BF92E_Elem2;                          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct Component.tuple_Laccessor_M_Kchar_Mfloat_R
// 0x0020 (0x0020 - 0x0000)
struct Ftuple_Laccessor_M_Kchar_Mfloat_R final
{
public:
	EVerse_accessor                               __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, HasGetValueTypeHash)
	double                                        __verse_0x932BF92E_Elem2;                          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct Component.tuple_Laccessor_M_Kchar_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Laccessor_M_Kchar_R final
{
public:
	EVerse_accessor                               __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct Component.tuple_Laccessor_Mcolor_R
// 0x0020 (0x0020 - 0x0000)
struct Ftuple_Laccessor_Mcolor_R final
{
public:
	EVerse_accessor                               __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColors_color                          __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
};

// VerseStruct Component.tuple_Laccessor_Mfloat_R
// 0x0010 (0x0010 - 0x0000)
struct Component_0::Ftuple_Laccessor_Mfloat_R final
{
public:
	EVerse_accessor                               __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct Component.tuple_Laccessor_Mlogic_R
// 0x0002 (0x0002 - 0x0000)
struct Component_0::Ftuple_Laccessor_Mlogic_R final
{
public:
	EVerse_accessor                               __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x7D844C3C_Elem1 : 1;                      // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};

// VerseStruct Component.tuple_Laccessor_Mtype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Laccessor_Mtype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R final
{
public:
	EVerse_accessor                               __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct Component.tuple_Lcanvas_Mplayer__ui__slot_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lcanvas_Mplayer__ui__slot_R final
{
public:
	class UUI_canvas*                             __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FUI_player_ui_slot                     __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
};

// VerseStruct Component.tuple_Lentity_Mtransform_R
// 0x0070 (0x0070 - 0x0000)
struct Ftuple_Lentity_Mtransform_R final
{
public:
	class Uentity*                                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0060)(InstancedReference, NoDestructor)
};

// VerseStruct Component.tuple_Lsupertype_Lany_R_M_Kchar_R
// 0x0018 (0x0018 - 0x0000)
struct Component_0::Ftuple_Lsupertype_Lany_R_M_Kchar_R final
{
public:
	class UClass*                                 __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct Component.tuple_Ltype_Lfont_M_20font_R_M_Kchar_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Ltype_Lfont_M_20font_R_M_Kchar_R final
{
public:
	class UClass*                                 __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct Component.tuple_Lwidget_Mplayer__ui__slot_R
// 0x0018 (0x0018 - 0x0000)
struct Component_0::Ftuple_Lwidget_Mplayer__ui__slot_R final
{
public:
	class UUI_widget*                             __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FUI_player_ui_slot                     __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
};

}

