#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConcertServer

#include "Basic.hpp"

#include "ConcertTransport_structs.hpp"
#include "ConcertServer_structs.hpp"
#include "Concert_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ConcertServer.ConcertServerConfig
// 0x0128 (0x0158 - 0x0030)
class UConcertServerConfig final : public UObject
{
public:
	bool                                          bAutoArchiveOnReboot;                              // 0x0030(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoArchiveOnShutdown;                            // 0x0031(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCleanWorkingDir;                                  // 0x0032(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumSessionsToKeep;                                 // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerName;                                        // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultSessionName;                                // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FString>                           AuthorizedClientKeys;                              // 0x0058(0x0050)(Config, NativeAccessSpecifierPublic)
	class FString                                 DefaultSessionToRestore;                           // 0x00A8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertSessionVersionInfo             DefaultVersionInfo;                                // 0x00B8(0x0028)(NativeAccessSpecifierPublic)
	struct FConcertSessionSettings                DefaultSessionSettings;                            // 0x00E0(0x0028)(Edit, Config, NativeAccessSpecifierPublic)
	struct FConcertServerSettings                 ServerSettings;                                    // 0x0108(0x0008)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FConcertEndpointSettings               EndpointSettings;                                  // 0x0110(0x000C)(Edit, Config, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 WorkingDir;                                        // 0x0120(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ArchiveDir;                                        // 0x0130(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SessionRepositoryRootDir;                          // 0x0140(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMountDefaultSessionRepository;                    // 0x0150(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConcertServerConfig">();
	}
	static class UConcertServerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConcertServerConfig>();
	}
};

}

