#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConcertSharedSlate

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "ConcertSharedSlate_structs.hpp"


namespace SDK
{

// Class ConcertSharedSlate.ConcertSessionBrowserSettings
// 0x0008 (0x0038 - 0x0030)
class UConcertSessionBrowserSettings final : public UObject
{
public:
	ETimeFormat                                   LastModifiedTimeFormat;                            // 0x0030(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowActiveSessions;                               // 0x0034(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowArchivedSessions;                             // 0x0035(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDefaultServerSessionsOnly;                    // 0x0036(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConcertSessionBrowserSettings">();
	}
	static class UConcertSessionBrowserSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConcertSessionBrowserSettings>();
	}
};

}

