#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: conditional_button_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass conditional_button_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class conditional_button_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass conditional_button_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class conditional_button_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<conditional_button_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass conditional_button_device.conditional_button_device
// 0x00A0 (0x0160 - 0x00C0)
class Uconditional_button_device final : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0xC313E746_ActivatedEvent;                 // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x7A3F5B18_NotEnoughItemsEvent;            // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x5BDC7A5C_EnableFunction;                 // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC9184E23_DisableFunction;                // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x4D1E6968_ResetFunction;                  // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x5BB90C4F_ActivateFunction;               // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x92BB2F25_ToggleFunction;                 // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_message*   __verse_0xB60BD386_SetTextFunction;                // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_string*    __verse_0x33ED5C00_GetTextFunction;                // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_float*     __verse_0xAFBDB521_SetInteractionTimeFunction;     // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_float*     __verse_0xCBB0A2D8_GetInteractionTimeFunction;     // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_name* __verse_0x58EA7406_SetItemCountRequiredFunction;   // 0x0118(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0xD625F568_GetItemCountRequiredFunction;   // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0xBDD35526_GetRemainingItemCountRequiredFunction; // 0x0128(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_name* __verse_0x63F0D621_SetItemScoreFunction;           // 0x0130(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0x26174048_GetItemScoreFunction;           // 0x0138(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0x03555799_GetItemCountFunction;           // 0x0140(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0xBE173E58_HasAllItemsFunction;            // 0x0148(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0xC59F81CE_IsHoldingItemFunction;          // 0x0150(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0xBAB39E7F_IsHoldingItemAtIndexFunction;   // 0x0158(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fconditional__button__device_N_RActivate_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fconditional__button__device_N_RDisable(const struct conditional_button_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fconditional__button__device_N_REnable(const struct conditional_button_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fFortnite_2ecom_2fDevices_2fconditional__button__device_N_RGetInteractionText(const struct conditional_button_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fDevices_2fconditional__button__device_N_RGetInteractionTime(const struct conditional_button_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fDevices_2fconditional__button__device_N_RGetItemCount_L_Nagent_M_Nint_R(const struct conditional_button_device::Ftuple_Lagent_Mint_R& __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fDevices_2fconditional__button__device_N_RGetItemCountRequired_L_Nint_R(int64 __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fDevices_2fconditional__button__device_N_RGetItemScore_L_Nint_R(int64 __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fDevices_2fconditional__button__device_N_RGetRemainingItemCountRequired_L_Nint_R(int64 __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fconditional__button__device_N_RHasAllItems_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fconditional__button__device_N_RIsHoldingItem_L_Nagent_M_Nint_R(const struct conditional_button_device::Ftuple_Lagent_Mint_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fconditional__button__device_N_RIsHoldingItem_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fconditional__button__device_N_RReset(const struct conditional_button_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fconditional__button__device_N_RSetInteractionText_L_Nmessage_R(class UVerse_message* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fconditional__button__device_N_RSetInteractionTime_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fconditional__button__device_N_RSetItemCountRequired_L_Nint_M_Nint_R(const struct conditional_button_device::Ftuple_Lint_Mint_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fconditional__button__device_N_RSetItemScore_L_Nint_M_Nint_R(const struct conditional_button_device::Ftuple_Lint_Mint_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fconditional__button__device_N_RToggle_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"conditional_button_device">();
	}
	static class Uconditional_button_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uconditional_button_device>();
	}
};

}

