#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConfigEditor

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ConfigEditor.PropertyConfigFileDisplayRow
// 0x0048 (0x0078 - 0x0030)
class UPropertyConfigFileDisplayRow final : public UObject
{
public:
	class FString                                 ConfigFileName;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<class FProperty>                   ExternalProperty;                                  // 0x0040(0x0030)(Edit, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFileWritable;                                   // 0x0070(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropertyConfigFileDisplayRow">();
	}
	static class UPropertyConfigFileDisplayRow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyConfigFileDisplayRow>();
	}
};

// Class ConfigEditor.ConfigHierarchyPropertyView
// 0x0040 (0x0070 - 0x0030)
class UConfigHierarchyPropertyView final : public UObject
{
public:
	TFieldPath<class FProperty>                   EditProperty;                                      // 0x0030(0x0030)(Edit, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPropertyConfigFileDisplayRow*>  ConfigFilePropertyObjects;                         // 0x0060(0x0010)(Edit, ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConfigHierarchyPropertyView">();
	}
	static class UConfigHierarchyPropertyView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfigHierarchyPropertyView>();
	}
};

}

