#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlRigDeveloper

#include "Basic.hpp"

#include "RigVMDeveloper_structs.hpp"
#include "RigVMDeveloper_classes.hpp"
#include "AnimGraph_classes.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRigDeveloper_structs.hpp"
#include "RigVM_structs.hpp"


namespace SDK
{

// Class ControlRigDeveloper.ControlRigSchema
// 0x0000 (0x0050 - 0x0050)
class UControlRigSchema final : public URigVMSchema
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlRigSchema">();
	}
	static class UControlRigSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlRigSchema>();
	}
};

// Class ControlRigDeveloper.AnimGraphNode_ControlRig
// 0x0610 (0x08D8 - 0x02C8)
class UAnimGraphNode_ControlRig final : public UAnimGraphNode_CustomProperty
{
public:
	struct FAnimNode_ControlRig                   Node;                                              // 0x02C8(0x0558)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_820[0xB8];                                     // 0x0820(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimGraphNode_ControlRig">();
	}
	static class UAnimGraphNode_ControlRig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimGraphNode_ControlRig>();
	}
};

// Class ControlRigDeveloper.ControlRigBlueprint
// 0x0418 (0x1148 - 0x0D30)
class UControlRigBlueprint final : public URigVMBlueprint
{
public:
	uint8                                         Pad_D30[0x10];                                     // 0x0D30(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModularRigSettings                    ModularRigSettings;                                // 0x0D40(0x0001)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D41[0x3];                                      // 0x0D41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigHierarchySettings                  HierarchySettings;                                 // 0x0D44(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FRigModuleSettings                     RigModuleSettings;                                 // 0x0D48(0x0088)(Edit, AssetRegistrySearchable, NativeAccessSpecifierPublic)
	TArray<struct FModuleReferenceData>           ModuleReferenceData;                               // 0x0DD0(0x0010)(ZeroConstructor, AssetRegistrySearchable, NativeAccessSpecifierPublic)
	TMap<struct FRigElementKey, struct FRigElementKey> ConnectionMap;                                     // 0x0DE0(0x0050)(NativeAccessSpecifierPublic)
	uint8                                         Pad_E30[0x18];                                     // 0x0E30(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigVMOldPublicFunctionData>    PublicFunctions;                                   // 0x0E48(0x0010)(ZeroConstructor, Deprecated, AssetRegistrySearchable, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UControlRigShapeLibrary> GizmoLibrary;                                      // 0x0E58(0x0030)(Deprecated, EditorOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UControlRigShapeLibrary>> ShapeLibraries;                                    // 0x0E88(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FRigVMStatistics                       Statistics;                                        // 0x0E98(0x0038)(Transient, DuplicateTransient, Deprecated, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FRigVMDrawContainer                    DrawContainer;                                     // 0x0ED0(0x0018)(Edit, NativeAccessSpecifierPublic)
	struct FRigInfluenceMapPerEvent               Influences;                                        // 0x0EE8(0x0060)(Edit, NativeAccessSpecifierPublic)
	struct FRigHierarchyContainer                 HierarchyContainer;                                // 0x0F48(0x0040)(Deprecated, EditorOnly, NativeAccessSpecifierPublic)
	class URigHierarchy*                          Hierarchy;                                         // 0x0F88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModularRigModel                       ModularRigModel;                                   // 0x0F90(0x00A0)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	EControlRigType                               ControlRigType;                                    // 0x1030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1031[0x3];                                     // 0x1031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ItemTypeDisplayName;                               // 0x1034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportsInversion;                                // 0x1040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSupportsControls;                                 // 0x1041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1042[0x6];                                     // 0x1042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMesh>           PreviewSkeletalMesh;                               // 0x1048(0x0030)(EditorOnly, AssetRegistrySearchable, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UObject>                 SourceHierarchyImport;                             // 0x1078(0x0030)(Edit, DuplicateTransient, AssetRegistrySearchable, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UObject>                 SourceCurveImport;                                 // 0x10A8(0x0030)(Edit, DuplicateTransient, AssetRegistrySearchable, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bExposesAnimatableControls;                        // 0x10D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10D9[0x7];                                     // 0x10D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UControlRigValidator*                   Validator;                                         // 0x10E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10E8[0x48];                                    // 0x10E8(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ModulesRecompilationBracket;                       // 0x1130(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DebugBoneRadius;                                   // 0x1134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1138[0x10];                                    // 0x1138(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static TArray<class UControlRigBlueprint*> GetCurrentlyOpenRigBlueprints();

	TArray<class URigVMNode*> ConvertHierarchyElementsToSpawnerNodes(class URigHierarchy* InHierarchy, const TArray<struct FRigElementKey>& InKeys, bool bRemoveElements);
	class UControlRig* CreateControlRig();
	class UControlRig* GetDebuggedControlRig();
	class URigHierarchyController* GetHierarchyController();
	class UModularRigController* GetModularRigController();
	void RecompileModularRig();
	void SetPreviewMesh(class USkeletalMesh* PreviewMesh, bool bMarkAsDirty);
	bool TurnIntoControlRigModule_Blueprint();
	bool TurnIntoStandaloneRig_Blueprint();

	bool CanTurnIntoStandaloneRig_Blueprint() const;
	TArray<struct FModuleReferenceData> FindReferencesToModule() const;
	class UClass* GetControlRigClass() const;
	class USkeletalMesh* GetPreviewMesh() const;
	class UTexture2D* GetRigModuleIcon() const;
	bool IsControlRigModule() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlRigBlueprint">();
	}
	static class UControlRigBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlRigBlueprint>();
	}
};

// Class ControlRigDeveloper.ControlRigGraph
// 0x0088 (0x0238 - 0x01B0)
class UControlRigGraph final : public URigVMEdGraph
{
public:
	uint8                                         Pad_1B0[0x88];                                     // 0x01B0(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlRigGraph">();
	}
	static class UControlRigGraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlRigGraph>();
	}
};

// Class ControlRigDeveloper.ControlRigGraphNode
// 0x0000 (0x03B8 - 0x03B8)
class UControlRigGraphNode final : public URigVMEdGraphNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlRigGraphNode">();
	}
	static class UControlRigGraphNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlRigGraphNode>();
	}
};

// Class ControlRigDeveloper.ControlRigGraphSchema
// 0x0000 (0x00A8 - 0x00A8)
class UControlRigGraphSchema final : public URigVMEdGraphSchema
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlRigGraphSchema">();
	}
	static class UControlRigGraphSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlRigGraphSchema>();
	}
};

}

