#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContentBrowserData

#include "Basic.hpp"


namespace SDK
{

// Enum ContentBrowserData.EContentBrowserItemTypeFilter
// NumValues: 0x0005
enum class EContentBrowserItemTypeFilter : uint8
{
	IncludeNone                              = 0,
	IncludeFolders                           = 1,
	IncludeFiles                             = 2,
	IncludeAll                               = 3,
	EContentBrowserItemTypeFilter_MAX        = 4,
};

// Enum ContentBrowserData.EContentBrowserItemCategoryFilter
// NumValues: 0x0008
enum class EContentBrowserItemCategoryFilter : uint8
{
	IncludeNone                              = 0,
	IncludeAssets                            = 1,
	IncludeClasses                           = 2,
	IncludeCollections                       = 4,
	IncludeRedirectors                       = 8,
	IncludeMisc                              = 16,
	IncludeAll                               = 31,
	EContentBrowserItemCategoryFilter_MAX    = 32,
};

// Enum ContentBrowserData.EContentBrowserItemAttributeFilter
// NumValues: 0x0008
enum class EContentBrowserItemAttributeFilter : uint8
{
	IncludeNone                              = 0,
	IncludeProject                           = 1,
	IncludeEngine                            = 2,
	IncludePlugins                           = 4,
	IncludeDeveloper                         = 8,
	IncludeLocalized                         = 16,
	IncludeAll                               = 31,
	EContentBrowserItemAttributeFilter_MAX   = 32,
};

// Enum ContentBrowserData.EContentBrowserDataMenuContext_AddNewMenuDomain
// NumValues: 0x0004
enum class EContentBrowserDataMenuContext_AddNewMenuDomain : uint8
{
	Toolbar                                  = 0,
	AssetView                                = 1,
	PathView                                 = 2,
	EContentBrowserDataMenuContext_MAX       = 3,
};

// Enum ContentBrowserData.EContentBrowserPathType
// NumValues: 0x0004
enum class EContentBrowserPathType : uint8
{
	None                                     = 0,
	Internal                                 = 1,
	Virtual                                  = 2,
	EContentBrowserPathType_MAX              = 3,
};

// ScriptStruct ContentBrowserData.ContentBrowserDataFilter
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FContentBrowserDataFilter final
{
public:
	bool                                          bRecursivePaths;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EContentBrowserItemTypeFilter                 ItemTypeFilter;                                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EContentBrowserItemCategoryFilter             ItemCategoryFilter;                                // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EContentBrowserItemAttributeFilter            ItemAttributeFilter;                               // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x1C];                                       // 0x0004(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ContentBrowserData.ContentBrowserDataObjectFilter
// 0x00C8 (0x00C8 - 0x0000)
struct FContentBrowserDataObjectFilter final
{
public:
	TArray<class FName>                           ObjectNamesToInclude;                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           ObjectNamesToExclude;                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bOnDiskObjectsOnly;                                // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0xA7];                                      // 0x0021(0x00A7)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ContentBrowserData.ContentBrowserDataPackageFilter
// 0x0058 (0x0058 - 0x0000)
struct FContentBrowserDataPackageFilter final
{
public:
	TArray<class FName>                           PackageNamesToInclude;                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           PackageNamesToExclude;                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           PackagePathsToInclude;                             // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           PackagePathsToExclude;                             // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bRecursivePackagePathsToInclude;                   // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecursivePackagePathsToExclude;                   // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x16];                                      // 0x0042(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ContentBrowserData.ContentBrowserDataClassFilter
// 0x0038 (0x0038 - 0x0000)
struct FContentBrowserDataClassFilter final
{
public:
	TArray<class FString>                         ClassNamesToInclude;                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         ClassNamesToExclude;                               // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bRecursiveClassNamesToInclude;                     // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecursiveClassNamesToExclude;                     // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x16];                                      // 0x0022(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ContentBrowserData.ContentBrowserDataCollectionFilter
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FContentBrowserDataCollectionFilter final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIncludeChildCollections;                          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ContentBrowserData.ContentBrowserFolderContentsFilter
// 0x0003 (0x0003 - 0x0000)
struct FContentBrowserFolderContentsFilter final
{
public:
	EContentBrowserItemTypeFilter                 ItemTypeFilter;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EContentBrowserItemCategoryFilter             ItemCategoryFilter;                                // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EContentBrowserItemAttributeFilter            ItemAttributeFilter;                               // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ContentBrowserData.ContentBrowserDataUnsupportedClassFilter
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FContentBrowserDataUnsupportedClassFilter final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ContentBrowserData.ContentBrowserDataLegacyFilter
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FContentBrowserDataLegacyFilter final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ContentBrowserData.ContentBrowserCompiledSubsystemFilter
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FContentBrowserCompiledSubsystemFilter final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ContentBrowserData.ContentBrowserCompiledVirtualFolderFilter
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FContentBrowserCompiledVirtualFolderFilter final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ContentBrowserData.ContentBrowserItem
// 0x0060 (0x0060 - 0x0000)
struct alignas(0x08) FContentBrowserItem final
{
public:
	uint8                                         Pad_0[0x60];                                       // 0x0000(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ContentBrowserData.ContentBrowserItemPath
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x04) FContentBrowserItemPath final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

