#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContextualTraversalRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class ContextualTraversalRuntime.FortMovementMode_TraversalBaseRuntimeData
// 0x00E8 (0x0130 - 0x0048)
#pragma pack(push, 0x1)
class alignas(0x10) UFortMovementMode_TraversalBaseRuntimeData : public UFortMovementMode_BaseExtRuntimeData
{
public:
	class UAnimMontage*                           AnimMontage;                                       // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MontageStartSectionName;                           // 0x0050(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MontageMiddleSectionName;                          // 0x005C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSynchedActionWarpPointInfo_Replicated SynchedActionWarpPointInfo;                        // 0x0070(0x00B0)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_TraversalBaseRuntimeData">();
	}
	static class UFortMovementMode_TraversalBaseRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_TraversalBaseRuntimeData>();
	}
};
#pragma pack(pop)

// Class ContextualTraversalRuntime.FortMovementMode_ExtLogicTraversalBase
// 0x0078 (0x01C0 - 0x0148)
class UFortMovementMode_ExtLogicTraversalBase : public UFortMovementMode_BaseExtLogic
{
public:
	uint8                                         Pad_148[0x30];                                     // 0x0148(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           SynchedActionTag;                                  // 0x0178(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortCameraMode>            CameraMode;                                        // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           CameraModeTag;                                     // 0x0190(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           PreventWeaponHolsterTag;                           // 0x019C(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   MontageStartSectionName;                           // 0x01A8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseNextSectionAnimName;                           // 0x01B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverrideServerAllowablePositionError;              // 0x01B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         OverrideAnimBlendOutTimeWhenLanding;               // 0x01BC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ExtLogicTraversalBase">();
	}
	static class UFortMovementMode_ExtLogicTraversalBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ExtLogicTraversalBase>();
	}
};

}

