#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContentBrowserData

#include "Basic.hpp"

#include "ContentBrowserData_structs.hpp"


namespace SDK::Params
{

// Function ContentBrowserData.ContentBrowserDataSubsystem.ActivateDataSource
// 0x0010 (0x0010 - 0x0000)
struct ContentBrowserDataSubsystem_ActivateDataSource final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ContentBrowserData.ContentBrowserDataSubsystem.DeactivateDataSource
// 0x0010 (0x0010 - 0x0000)
struct ContentBrowserDataSubsystem_DeactivateDataSource final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ContentBrowserData.ContentBrowserDataSubsystem.GetActiveDataSources
// 0x0010 (0x0010 - 0x0000)
struct ContentBrowserDataSubsystem_GetActiveDataSources final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ContentBrowserData.ContentBrowserDataSubsystem.GetAvailableDataSources
// 0x0010 (0x0010 - 0x0000)
struct ContentBrowserDataSubsystem_GetAvailableDataSources final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ContentBrowserData.ContentBrowserDataSubsystem.GetItemAtPath
// 0x0070 (0x0070 - 0x0000)
struct ContentBrowserDataSubsystem_GetItemAtPath final
{
public:
	class FName                                   InPath;                                            // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EContentBrowserItemTypeFilter                 InItemTypeFilter;                                  // 0x000C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContentBrowserItem                    ReturnValue;                                       // 0x0010(0x0060)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ContentBrowserData.ContentBrowserDataSubsystem.GetItemsAtPath
// 0x0020 (0x0020 - 0x0000)
struct ContentBrowserDataSubsystem_GetItemsAtPath final
{
public:
	class FName                                   InPath;                                            // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EContentBrowserItemTypeFilter                 InItemTypeFilter;                                  // 0x000C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContentBrowserItem>            ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ContentBrowserData.ContentBrowserDataSubsystem.GetItemsUnderPath
// 0x0040 (0x0040 - 0x0000)
struct ContentBrowserDataSubsystem_GetItemsUnderPath final
{
public:
	class FName                                   InPath;                                            // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContentBrowserDataFilter              InFilter;                                          // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FContentBrowserItem>            ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ContentBrowserData.ContentBrowserItemLibrary.GetDisplayName
// 0x0070 (0x0070 - 0x0000)
struct ContentBrowserItemLibrary_GetDisplayName final
{
public:
	struct FContentBrowserItem                    Item;                                              // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0060(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ContentBrowserData.ContentBrowserItemLibrary.GetVirtualPath
// 0x0070 (0x0070 - 0x0000)
struct ContentBrowserItemLibrary_GetVirtualPath final
{
public:
	struct FContentBrowserItem                    Item;                                              // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0060(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ContentBrowserData.ContentBrowserItemLibrary.IsFile
// 0x0068 (0x0068 - 0x0000)
struct ContentBrowserItemLibrary_IsFile final
{
public:
	struct FContentBrowserItem                    Item;                                              // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ContentBrowserData.ContentBrowserItemLibrary.IsFolder
// 0x0068 (0x0068 - 0x0000)
struct ContentBrowserItemLibrary_IsFolder final
{
public:
	struct FContentBrowserItem                    Item;                                              // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ContentBrowserData.ContentBrowserItemPathExtensions.BreakContentBrowserItemPath
// 0x0030 (0x0030 - 0x0000)
struct ContentBrowserItemPathExtensions_BreakContentBrowserItemPath final
{
public:
	struct FContentBrowserItemPath                ItemPath;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   VirtualPath;                                       // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InternalPath;                                      // 0x0024(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ContentBrowserData.ContentBrowserItemPathExtensions.GetInternalPath
// 0x0024 (0x0024 - 0x0000)
struct ContentBrowserItemPathExtensions_GetInternalPath final
{
public:
	struct FContentBrowserItemPath                ItemPath;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ContentBrowserData.ContentBrowserItemPathExtensions.GetVirtualPath
// 0x0024 (0x0024 - 0x0000)
struct ContentBrowserItemPathExtensions_GetVirtualPath final
{
public:
	struct FContentBrowserItemPath                ItemPath;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ContentBrowserData.ContentBrowserItemPathExtensions.MakeContentBrowserItemPath
// 0x0028 (0x0028 - 0x0000)
struct ContentBrowserItemPathExtensions_MakeContentBrowserItemPath final
{
public:
	class FName                                   InPath;                                            // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EContentBrowserPathType                       InPathType;                                        // 0x000C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContentBrowserItemPath                ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function ContentBrowserData.ContentBrowserItemPathExtensions.SetPath
// 0x0028 (0x0028 - 0x0000)
struct ContentBrowserItemPathExtensions_SetPath final
{
public:
	struct FContentBrowserItemPath                ItemPath;                                          // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   InPath;                                            // 0x0018(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EContentBrowserPathType                       InPathType;                                        // 0x0024(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

