#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContextualAnimationEditor

#include "Basic.hpp"

#include "MovieScene_classes.hpp"
#include "UnrealEd_classes.hpp"
#include "Engine_structs.hpp"
#include "ContextualAnimation_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ContextualAnimationEditor.ContextualAnimNewIKTargetParams
// 0x0078 (0x00A8 - 0x0030)
class UContextualAnimNewIKTargetParams final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SourceRole;                                        // 0x0038(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         SourceBone;                                        // 0x0044(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EContextualAnimIKTargetProvider               Provider;                                          // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TargetRole;                                        // 0x005C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         TargetBone;                                        // 0x0068(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   GoalName;                                          // 0x007C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIdx;                                        // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UContextualAnimSceneAsset> SceneAssetPtr;                                     // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CachedRoles;                                       // 0x0098(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	TArray<class FString> GetTargetRoleOptions() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContextualAnimNewIKTargetParams">();
	}
	static class UContextualAnimNewIKTargetParams* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContextualAnimNewIKTargetParams>();
	}
};

// Class ContextualAnimationEditor.ContextualAnimFactory
// 0x0000 (0x0088 - 0x0088)
class UContextualAnimFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContextualAnimFactory">();
	}
	static class UContextualAnimFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContextualAnimFactory>();
	}
};

// Class ContextualAnimationEditor.ContextualAnimMovieSceneNotifySection
// 0x0010 (0x0158 - 0x0148)
class UContextualAnimMovieSceneNotifySection final : public UMovieSceneSection
{
public:
	struct FGuid                                  AnimNotifyEventGuid;                               // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContextualAnimMovieSceneNotifySection">();
	}
	static class UContextualAnimMovieSceneNotifySection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContextualAnimMovieSceneNotifySection>();
	}
};

// Class ContextualAnimationEditor.ContextualAnimMovieSceneNotifyTrack
// 0x0018 (0x0108 - 0x00F0)
class UContextualAnimMovieSceneNotifyTrack final : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x00F0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UAnimSequenceBase>       Animation;                                         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContextualAnimMovieSceneNotifyTrack">();
	}
	static class UContextualAnimMovieSceneNotifyTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContextualAnimMovieSceneNotifyTrack>();
	}
};

// Class ContextualAnimationEditor.ContextualAnimMovieSceneSection
// 0x0010 (0x0158 - 0x0148)
class UContextualAnimMovieSceneSection final : public UMovieSceneSection
{
public:
	int32                                         SectionIdx;                                        // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         AnimSetIdx;                                        // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         AnimTrackIdx;                                      // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContextualAnimMovieSceneSection">();
	}
	static class UContextualAnimMovieSceneSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContextualAnimMovieSceneSection>();
	}
};

// Class ContextualAnimationEditor.ContextualAnimMovieSceneSequence
// 0x0060 (0x00D8 - 0x0078)
class UContextualAnimMovieSceneSequence final : public UMovieSceneSequence
{
public:
	TMap<struct FGuid, TWeakObjectPtr<class AActor>> BoundActors;                                       // 0x0078(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x10];                                      // 0x00C8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContextualAnimMovieSceneSequence">();
	}
	static class UContextualAnimMovieSceneSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContextualAnimMovieSceneSequence>();
	}
};

// Class ContextualAnimationEditor.ContextualAnimMovieSceneTrack
// 0x0020 (0x0110 - 0x00F0)
class UContextualAnimMovieSceneTrack final : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x00F0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	class FName                                   Role;                                              // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContextualAnimMovieSceneTrack">();
	}
	static class UContextualAnimMovieSceneTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContextualAnimMovieSceneTrack>();
	}
};

}

