#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContentBrowserData

#include "Basic.hpp"

#include "ContentBrowserData_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "EditorSubsystem_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ContentBrowserData.ContentBrowserDataMenuContext_AddNewMenu
// 0x0030 (0x0060 - 0x0030)
class UContentBrowserDataMenuContext_AddNewMenu final : public UObject
{
public:
	TArray<class FName>                           SelectedPaths;                                     // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bContainsValidPackagePath;                         // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanBeModified;                                    // 0x0041(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EContentBrowserDataMenuContext_AddNewMenuDomain OwnerDomain;                                       // 0x0042(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x1D];                                      // 0x0043(0x001D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContentBrowserDataMenuContext_AddNewMenu">();
	}
	static class UContentBrowserDataMenuContext_AddNewMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContentBrowserDataMenuContext_AddNewMenu>();
	}
};

// Class ContentBrowserData.ContentBrowserDataMenuContext_FolderMenu
// 0x0028 (0x0058 - 0x0030)
class UContentBrowserDataMenuContext_FolderMenu final : public UObject
{
public:
	TArray<struct FContentBrowserItem>            SelectedItems;                                     // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bCanBeModified;                                    // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x17];                                      // 0x0041(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContentBrowserDataMenuContext_FolderMenu">();
	}
	static class UContentBrowserDataMenuContext_FolderMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContentBrowserDataMenuContext_FolderMenu>();
	}
};

// Class ContentBrowserData.ContentBrowserDataMenuContext_FileMenu
// 0x0058 (0x0088 - 0x0030)
class UContentBrowserDataMenuContext_FileMenu final : public UObject
{
public:
	TArray<struct FContentBrowserItem>            SelectedItems;                                     // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCanBeModified;                                    // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasCookedPackages;                                // 0x0051(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bContainsUnsupportedAssets;                        // 0x0052(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_53[0x35];                                      // 0x0053(0x0035)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContentBrowserDataMenuContext_FileMenu">();
	}
	static class UContentBrowserDataMenuContext_FileMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContentBrowserDataMenuContext_FileMenu>();
	}
};

// Class ContentBrowserData.ContentBrowserDataMenuContext_DragDropMenu
// 0x0088 (0x00B8 - 0x0030)
class UContentBrowserDataMenuContext_DragDropMenu final : public UObject
{
public:
	struct FContentBrowserItem                    DropTargetItem;                                    // 0x0030(0x0060)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FContentBrowserItem>            DraggedItems;                                      // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bCanMove;                                          // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanCopy;                                          // 0x00A1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A2[0x16];                                      // 0x00A2(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContentBrowserDataMenuContext_DragDropMenu">();
	}
	static class UContentBrowserDataMenuContext_DragDropMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContentBrowserDataMenuContext_DragDropMenu>();
	}
};

// Class ContentBrowserData.ContentBrowserDataSource
// 0x0100 (0x0130 - 0x0030)
class UContentBrowserDataSource : public UObject
{
public:
	uint8                                         Pad_30[0x100];                                     // 0x0030(0x0100)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContentBrowserDataSource">();
	}
	static class UContentBrowserDataSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContentBrowserDataSource>();
	}
};

// Class ContentBrowserData.ContentBrowserDataSubsystem
// 0x01A0 (0x01D8 - 0x0038)
class UContentBrowserDataSubsystem final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0x88];                                      // 0x0038(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           EnabledDataSources;                                // 0x00C0(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x108];                                     // 0x00D0(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateAllDataSources();
	bool ActivateDataSource(const class FName Name_0);
	void DeactivateAllDataSources();
	bool DeactivateDataSource(const class FName Name_0);

	TArray<class FName> GetActiveDataSources() const;
	TArray<class FName> GetAvailableDataSources() const;
	struct FContentBrowserItem GetItemAtPath(const class FName InPath, const EContentBrowserItemTypeFilter InItemTypeFilter) const;
	TArray<struct FContentBrowserItem> GetItemsAtPath(const class FName InPath, const EContentBrowserItemTypeFilter InItemTypeFilter) const;
	TArray<struct FContentBrowserItem> GetItemsUnderPath(const class FName InPath, const struct FContentBrowserDataFilter& InFilter) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContentBrowserDataSubsystem">();
	}
	static class UContentBrowserDataSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContentBrowserDataSubsystem>();
	}
};

// Class ContentBrowserData.ContentBrowserItemLibrary
// 0x0000 (0x0030 - 0x0030)
class UContentBrowserItemLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class FText GetDisplayName(const struct FContentBrowserItem& Item);
	static class FName GetVirtualPath(const struct FContentBrowserItem& Item);
	static bool IsFile(const struct FContentBrowserItem& Item);
	static bool IsFolder(const struct FContentBrowserItem& Item);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContentBrowserItemLibrary">();
	}
	static class UContentBrowserItemLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContentBrowserItemLibrary>();
	}
};

// Class ContentBrowserData.ContentBrowserItemPathExtensions
// 0x0000 (0x0030 - 0x0030)
class UContentBrowserItemPathExtensions final : public UBlueprintFunctionLibrary
{
public:
	static void BreakContentBrowserItemPath(const struct FContentBrowserItemPath& ItemPath, class FName* VirtualPath, class FName* InternalPath);
	static class FName GetInternalPath(const struct FContentBrowserItemPath& ItemPath);
	static class FName GetVirtualPath(const struct FContentBrowserItemPath& ItemPath);
	static struct FContentBrowserItemPath MakeContentBrowserItemPath(const class FName InPath, const EContentBrowserPathType InPathType);
	static void SetPath(struct FContentBrowserItemPath& ItemPath, const class FName InPath, const EContentBrowserPathType InPathType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContentBrowserItemPathExtensions">();
	}
	static class UContentBrowserItemPathExtensions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContentBrowserItemPathExtensions>();
	}
};

}

