#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlRigEditor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MovieSceneTools_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// Enum ControlRigEditor.ERigElementDetailsTransformComponent
// NumValues: 0x000A
enum class ERigElementDetailsTransformComponent : uint8
{
	TranslationX                             = 0,
	TranslationY                             = 1,
	TranslationZ                             = 2,
	RotationRoll                             = 3,
	RotationPitch                            = 4,
	RotationYaw                              = 5,
	ScaleX                                   = 6,
	ScaleY                                   = 7,
	ScaleZ                                   = 8,
	ERigElementDetailsTransformComponent_MAX = 9,
};

// Enum ControlRigEditor.ECastToControlRigBlueprintCases
// NumValues: 0x0003
enum class ECastToControlRigBlueprintCases : uint8
{
	CastSucceeded                            = 0,
	CastFailed                               = 1,
	ECastToControlRigBlueprintCases_MAX      = 2,
};

// Enum ControlRigEditor.EAnimToolBlendOperation
// NumValues: 0x0007
enum class EAnimToolBlendOperation : uint8
{
	Tween                                    = 0,
	BlendToNeighbor                          = 1,
	PushPull                                 = 2,
	BlendRelative                            = 3,
	BlendToEase                              = 4,
	SmoothRough                              = 5,
	EAnimToolBlendOperation_MAX              = 6,
};

// ScriptStruct ControlRigEditor.RigSpacePickerBakeSettings
// 0x0038 (0x0038 - 0x0000)
struct FRigSpacePickerBakeSettings final
{
public:
	struct FRigElementKey                         TargetSpace;                                       // 0x0000(0x0010)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBakingAnimationKeySettings            Settings;                                          // 0x0010(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FFrameNumber                           StartFrame;                                        // 0x0028(0x0004)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           EndFrame;                                          // 0x002C(0x0004)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReduceKeys;                                       // 0x0030(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Tolerance;                                         // 0x0034(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ControlRigEditor.ControlRigDrawContainerImportFbxSettings
// 0x000C (0x000C - 0x0000)
struct FControlRigDrawContainerImportFbxSettings final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Detail;                                            // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMergeCurves;                                      // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ControlRigEditor.ControlRigSequencerBindingProxy
// 0x0028 (0x0028 - 0x0000)
struct FControlRigSequencerBindingProxy final
{
public:
	struct FMovieSceneBindingProxy                Proxy;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UControlRig*                            ControlRig;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMovieSceneControlRigParameterTrack*    Track;                                             // 0x0020(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ControlRigEditor.AnimDetailProxyFloat
// 0x0008 (0x0008 - 0x0000)
struct FAnimDetailProxyFloat final
{
public:
	double                                        Float;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ControlRigEditor.AnimDetailProxyBool
// 0x0001 (0x0001 - 0x0000)
struct FAnimDetailProxyBool final
{
public:
	bool                                          Bool;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ControlRigEditor.ControlRigEnumControlProxyValue
// 0x0010 (0x0010 - 0x0000)
struct FControlRigEnumControlProxyValue final
{
public:
	class UEnum*                                  EnumType;                                          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EnumIndex;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ControlRigEditor.AnimDetailProxyInteger
// 0x0008 (0x0008 - 0x0000)
struct FAnimDetailProxyInteger final
{
public:
	int64                                         Integer;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ControlRigEditor.AnimDetailProxyVector3
// 0x0018 (0x0018 - 0x0000)
struct FAnimDetailProxyVector3 final
{
public:
	double                                        X;                                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Y;                                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Z;                                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ControlRigEditor.AnimDetailProxyLocation
// 0x0020 (0x0020 - 0x0000)
struct FAnimDetailProxyLocation final
{
public:
	double                                        LX;                                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        LY;                                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        LZ;                                                // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ControlRigEditor.AnimDetailProxyRotation
// 0x0020 (0x0020 - 0x0000)
struct FAnimDetailProxyRotation final
{
public:
	double                                        RX;                                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RY;                                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RZ;                                                // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ControlRigEditor.AnimDetailProxyScale
// 0x0020 (0x0020 - 0x0000)
struct FAnimDetailProxyScale final
{
public:
	double                                        SX;                                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        SY;                                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        SZ;                                                // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ControlRigEditor.AnimDetailProxyVector2D
// 0x0018 (0x0018 - 0x0000)
struct FAnimDetailProxyVector2D final
{
public:
	double                                        X;                                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Y;                                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ControlRigEditor.NameToProxyMap
// 0x0050 (0x0050 - 0x0000)
struct FNameToProxyMap final
{
public:
	TMap<class FName, class UControlRigControlsProxy*> NameToProxy;                                       // 0x0000(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct ControlRigEditor.ControlRigRigHierarchyDragAndDropContext
// 0x0020 (0x0020 - 0x0000)
struct FControlRigRigHierarchyDragAndDropContext final
{
public:
	TArray<struct FRigElementKey>                 DraggedElementKeys;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FRigElementKey                         TargetElementKey;                                  // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ControlRigEditor.ControlRigGraphNodeContextMenuContext
// 0x0018 (0x0018 - 0x0000)
struct FControlRigGraphNodeContextMenuContext final
{
public:
	class URigVMGraph*                            Graph;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URigVMNode*                             Node;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URigVMPin*                              Pin;                                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ControlRigEditor.ControlRigRigHierarchyToGraphDragAndDropContext
// 0x0028 (0x0028 - 0x0000)
struct FControlRigRigHierarchyToGraphDragAndDropContext final
{
public:
	TArray<struct FRigElementKey>                 DraggedElementKeys;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x18];                                      // 0x0010(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ControlRigEditor.RigHierarchyImportSettings
// 0x0008 (0x0008 - 0x0000)
struct FRigHierarchyImportSettings final
{
public:
	class USkeletalMesh*                          Mesh;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ControlRigEditor.ControlRigForWorldTransforms
// 0x0018 (0x0018 - 0x0000)
struct FControlRigForWorldTransforms final
{
public:
	TWeakObjectPtr<class UControlRig>             ControlRig;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ControlNames;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct ControlRigEditor.ControlRigSnapperSelection
// 0x0020 (0x0020 - 0x0000)
struct FControlRigSnapperSelection final
{
public:
	TArray<struct FActorForWorldTransforms>       Actors;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FControlRigForWorldTransforms>  ControlRigs;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

}

