#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContextualActionCodeRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "ContextualActionCodeRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class ContextualActionCodeRuntime.FortMovementMode_ExtLogicBaseSwinging
// 0x0040 (0x0188 - 0x0148)
class UFortMovementMode_ExtLogicBaseSwinging : public UFortMovementMode_BaseExtLogic
{
public:
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortPlayerAnimInstance_SwingingObject> SwingingAnimationLayer;                            // 0x0150(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GravitationalAcceleration;                         // 0x0158(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinimumInitialSpeed;                               // 0x015C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AccelerationMultiplier;                            // 0x0160(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DefaultAcceleration;                               // 0x0164(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NonBrakingFriction;                                // 0x0168(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrakingFriction;                                   // 0x016C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrakingDeceleration;                               // 0x0170(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxSpeed;                                          // 0x0174(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           SwingingTag;                                       // 0x0178(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnOwnerDBNO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ExtLogicBaseSwinging">();
	}
	static class UFortMovementMode_ExtLogicBaseSwinging* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ExtLogicBaseSwinging>();
	}
};

// Class ContextualActionCodeRuntime.FortMovementMode_SwingingObjectRuntimeData
// 0x00C8 (0x0110 - 0x0048)
class UFortMovementMode_SwingingObjectRuntimeData final : public UFortMovementMode_BaseExtRuntimeData
{
public:
	uint8                                         Pad_48[0xC8];                                      // 0x0048(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_SwingingObjectRuntimeData">();
	}
	static class UFortMovementMode_SwingingObjectRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_SwingingObjectRuntimeData>();
	}
};

// Class ContextualActionCodeRuntime.FortMovementMode_ExtLogicSwingingObject
// 0x0038 (0x01C0 - 0x0188)
class UFortMovementMode_ExtLogicSwingingObject final : public UFortMovementMode_ExtLogicBaseSwinging
{
public:
	struct FVector                                AttachOffset;                                      // 0x0188(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                HandIKOffset;                                      // 0x01A0(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAlignCharacterToObject;                           // 0x01B8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ExtLogicSwingingObject">();
	}
	static class UFortMovementMode_ExtLogicSwingingObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ExtLogicSwingingObject>();
	}
};

// Class ContextualActionCodeRuntime.FortMovementMode_SwingingRopeRuntimeData
// 0x0028 (0x0070 - 0x0048)
class UFortMovementMode_SwingingRopeRuntimeData final : public UFortMovementMode_BaseExtRuntimeData
{
public:
	uint8                                         Pad_48[0x28];                                      // 0x0048(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_SwingingRopeRuntimeData">();
	}
	static class UFortMovementMode_SwingingRopeRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_SwingingRopeRuntimeData>();
	}
};

// Class ContextualActionCodeRuntime.FortMovementMode_ExtLogicSwingingRope
// 0x0038 (0x01C0 - 0x0188)
class UFortMovementMode_ExtLogicSwingingRope final : public UFortMovementMode_ExtLogicBaseSwinging
{
public:
	class UFortInputMappingContext*               InputMappingContext;                               // 0x0188(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInputAction*                           SwingingAscendAction;                              // 0x0190(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInputAction*                           SwingingAscendActionRelease;                       // 0x0198(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinimumAscendRange;                                // 0x01A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AscendMaxSpeed;                                    // 0x01A4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DescendMaxSpeed;                                   // 0x01A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AscendingSettleInterpSpeed;                        // 0x01AC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AscendingSettleAngleThreshold;                     // 0x01B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B4[0xC];                                      // 0x01B4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ExtLogicSwingingRope">();
	}
	static class UFortMovementMode_ExtLogicSwingingRope* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ExtLogicSwingingRope>();
	}
};

// Class ContextualActionCodeRuntime.FortPlayerAnimInstance_Hijacker
// 0x0000 (0x0500 - 0x0500)
class UFortPlayerAnimInstance_Hijacker final : public UFortBaseLayerAnimInstance
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAnimInstance_Hijacker">();
	}
	static class UFortPlayerAnimInstance_Hijacker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAnimInstance_Hijacker>();
	}
};

// Class ContextualActionCodeRuntime.FortPlayerAnimInstance_SwingingObject
// 0x0040 (0x0540 - 0x0500)
class UFortPlayerAnimInstance_SwingingObject final : public UFortBaseLayerAnimInstance
{
public:
	struct FVector2D                              RelativeVelocity2D;                                // 0x0500(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                HandAttachLocation;                                // 0x0510(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LeftHandIKAlpha;                                   // 0x0528(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_52C[0x14];                                     // 0x052C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAnimInstance_SwingingObject">();
	}
	static class UFortPlayerAnimInstance_SwingingObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAnimInstance_SwingingObject>();
	}
};

// Class ContextualActionCodeRuntime.FortSwingingObject
// 0x0050 (0x0D70 - 0x0D20)
class AFortSwingingObject : public ABuildingGameplayActor
{
public:
	float                                         MaxSwingAngle;                                     // 0x0D20(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseCharacterSwingMovementMode;                    // 0x0D24(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanAscend;                                        // 0x0D25(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D26[0x2];                                      // 0x0D26(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FixedSwingDirection;                               // 0x0D28(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseFixedSwingDirection;                           // 0x0D40(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D41[0x3];                                      // 0x0D41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ForwardInteractOffset;                             // 0x0D44(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RightInteractOffset;                               // 0x0D48(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseClientTransformSmoothing;                      // 0x0D4C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D4D[0x3];                                      // 0x0D4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SmoothingWindow;                                   // 0x0D50(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D54[0x4];                                      // 0x0D54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        AttachPoint;                                       // 0x0D58(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D60[0x10];                                     // 0x0D60(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEndSwing_BP(class AFortPlayerPawn* AttachedActor);
	void OnStartSwing_BP(class AFortPlayerPawn* AttachedActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSwingingObject">();
	}
	static class AFortSwingingObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortSwingingObject>();
	}
};

// Class ContextualActionCodeRuntime.FortSwingingRope
// 0x0038 (0x0DA8 - 0x0D70)
class AFortSwingingRope final : public AFortSwingingObject
{
public:
	class UCableComponent*                        CableComponent;                                    // 0x0D70(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         UnattachedCableGravityScale;                       // 0x0D78(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         UnattachedSolverIterations;                        // 0x0D7C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CableLengthMultiplier;                             // 0x0D80(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D84[0x24];                                     // 0x0D84(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSwingingRope">();
	}
	static class AFortSwingingRope* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortSwingingRope>();
	}
};

// Class ContextualActionCodeRuntime.HijackerComponent
// 0x00E8 (0x01C8 - 0x00E0)
class UHijackerComponent final : public UFortPawnComponent
{
public:
	struct FVector                                HijackOffset;                                      // 0x00E0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   StartHijackInteractText;                           // 0x00F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   StartHijackInteractSubText;                        // 0x0108(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   CompleteHijackInteractText;                        // 0x0118(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   CompleteHijackInteractSubText;                     // 0x0128(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortPlayerAnimInstance_Hijacker> HijackerAnimInstanceClass;                         // 0x0138(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RequiredInteractionDuration;                       // 0x0140(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HijackCooldown;                                    // 0x0144(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                BaseThrownVelocity;                                // 0x0148(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AccelerationThresholdForEjectingHijacker;          // 0x0160(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinimumSpeedForEjectingHijacker;                   // 0x0164(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHijackingStatus                              HijackingStatus;                                   // 0x0168(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_169[0x5F];                                     // 0x0169(0x005F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnCleanup();
	void BP_OnCompleteHijack();
	void BP_OnHijackCancelled();
	void BP_OnHijackInterrupted();
	void BP_OnStartHijack();
	void CancelHijack_NetMulticast();
	void CancelHijack_Server();
	void EjectHijacker(class AActor* DamageCauser, const float Damage, const struct FVector& EventLocation);
	void HandleOwnerJumpInput(bool bPressed);
	void OnCompleteHijack();
	void OnStartHijack(class AActor* VehicleTarget);
	bool TryHijack(class AActor* VehicleTarget, const struct FInteractionType& InteractionType);

	void BP_CanCompleteHijack(bool* OutCanCompleteHijack) const;
	void BP_CanStartHijack(bool* OutCanStartHijack) const;
	void BP_GetThrownVelocity(class AActor* DamageCauser, const float Damage, const struct FVector& EventLocation, struct FVector* OutVelocity) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HijackerComponent">();
	}
	static class UHijackerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHijackerComponent>();
	}
};

// Class ContextualActionCodeRuntime.Hijack_InteractionOverrideComponent
// 0x0000 (0x00E8 - 0x00E8)
class UHijack_InteractionOverrideComponent final : public UFortVehicleInteractionOverrideComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Hijack_InteractionOverrideComponent">();
	}
	static class UHijack_InteractionOverrideComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHijack_InteractionOverrideComponent>();
	}
};

// Class ContextualActionCodeRuntime.RappellingComponent
// 0x0AD8 (0x0BB8 - 0x00E0)
class URappellingComponent final : public UFortPawnComponent
{
public:
	class UInputAction*                           RappelInputAction;                                 // 0x00E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputAction*                           RappelEndInputAction;                              // 0x00E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputMappingContext*                   RappelInputMappingContext;                         // 0x00F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ForwardTraceOffset;                                // 0x00F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DownwardTraceLength;                               // 0x00FC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ConnectionTraceOffset;                             // 0x0100(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxDistanceToRappellingEdge;                       // 0x0104(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         InitiateSwingAngleThreshold;                       // 0x0108(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         InitiateSwingSpeedThreshold;                       // 0x010C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinDistanceFromRappelPointToSwing;                 // 0x0110(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RappellingSwingTraceLength;                        // 0x0114(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RappellingSwingRecoveryForce;                      // 0x0118(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RappellingSwingLaunchSpeed;                        // 0x011C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RappellingSwingVerticalAttachOffset;               // 0x0120(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RappellingSwingVerticalDistanceThresholdToSlow;    // 0x0124(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RappellingSwingVerticalMaxSpeedWhileSlowing;       // 0x0128(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RappellingSwingVerticalMinDistanceToAttach;        // 0x012C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RappellingSwingVerticalMaxDistanceToAttach;        // 0x0130(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           RappellingSwingParametersTag;                      // 0x0134(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSwingingControlParams                 RappellingSwingParameters;                         // 0x0140(0x0A18)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	ERappellingState                              ReplicatedRappellingState;                         // 0x0B58(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B59[0x7];                                      // 0x0B59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RappellingEdge;                                    // 0x0B60(0x0018)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                RappellingNormal;                                  // 0x0B78(0x0018)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URappellingSwingMovementControls*       MovementControls;                                  // 0x0B90(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B98[0x20];                                     // 0x0B98(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EndRappelling();
	void EndRappelling_Server();
	void EndRappellingSwing_Server();
	void OnCapsuleHit(const class UPrimitiveComponent* HitComponent, const class AActor* OtherActor, const class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnEndRappelling();
	void OnInvalidTargeting();
	void OnOwnerMovementModeChanged(class ACharacter* Character, EMovementMode PreviousMovementMode, uint8 PreviousCustomMode);
	void OnRep_RappellingState();
	void OnStartRappelling();
	void OnValidTargeting();
	void RappellingCorrectFallingRotation_Client();
	void StartRappelling();
	void StartRappelling_Server(const struct FVector& NewGravityDirection, const struct FVector& ClientRappellingEdge, const struct FVector& ClientRappellingNormal);
	void StartRappellingSwing_Server();
	void TestToggleGravity();
	void TestToggleGravity_Server();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RappellingComponent">();
	}
	static class URappellingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URappellingComponent>();
	}
};

// Class ContextualActionCodeRuntime.RappellingSwingMovementControls
// 0x0000 (0x0040 - 0x0040)
class URappellingSwingMovementControls final : public UFortMovementControls
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RappellingSwingMovementControls">();
	}
	static class URappellingSwingMovementControls* GetDefaultObj()
	{
		return GetDefaultObjImpl<URappellingSwingMovementControls>();
	}
};

// Class ContextualActionCodeRuntime.SwingingObjectCameraMode
// 0x0030 (0x1E70 - 0x1E40)
class USwingingObjectCameraMode final : public UFortCameraMode_ThirdPerson
{
public:
	struct FVector                                MaxSwingAdditionalViewTargetOffset;                // 0x1E40(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxSwingFOV;                                       // 0x1E58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E5C[0x14];                                    // 0x1E5C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SwingingObjectCameraMode">();
	}
	static class USwingingObjectCameraMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<USwingingObjectCameraMode>();
	}
};

// Class ContextualActionCodeRuntime.SwingingObjectComponent
// 0x0078 (0x0158 - 0x00E0)
class USwingingObjectComponent final : public UFortPawnComponent
{
public:
	float                                         JumpHorizontalSpeedBoost;                          // 0x00E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         JumpVerticalSpeedBoost;                            // 0x00E4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinimumAscendRange;                                // 0x00E8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AscendMaxSpeed;                                    // 0x00EC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DescendMaxSpeed;                                   // 0x00F0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AscendingSettleInterpSpeed;                        // 0x00F4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AscendingSettleAngleThreshold;                     // 0x00F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinimumTimeBetweenRepeatSwings;                    // 0x00FC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaximumAngleForAutoAttach;                         // 0x0100(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinimumSpeedForAutoAttach;                         // 0x0104(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortMovementMode_BaseExtLogic> SwingingRopeMovementModeExtension;                 // 0x0108(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortMovementMode_BaseExtLogic> SwingingObjectMovementModeExtension;               // 0x0110(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ESwingingState                                SwingingState;                                     // 0x0118(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AFortSwingingObject>     ReplicatedSwingingObject;                          // 0x011C(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_124[0x34];                                     // 0x0124(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AttachToObject_Server(class AFortSwingingObject* Object);
	void BP_OnEndSwing();
	void BP_OnStartSwing();
	void DetachFromObject_Server(bool bJumpExit);
	void HandleOwnerJumpInput(bool bPressed);
	void OnRep_SwingingObject();

	void BP_CanStartSwing(class AFortSwingingObject* SwingTarget, bool* bCanStartSwing) const;
	struct FRotator GetAimRotation() const;
	void GetSwingDeltaAngle(struct FRotator* OutSwingRotation, struct FRotator* OutDeltaRotation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SwingingObjectComponent">();
	}
	static class USwingingObjectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USwingingObjectComponent>();
	}
};

}

