#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CoopNotesCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum CoopNotesCore.ECoopNotesNoteStatus
// NumValues: 0x0004
enum class ECoopNotesNoteStatus : uint32
{
	Open                                     = 0,
	Resolved                                 = 1,
	Unknown                                  = 2,
	ECoopNotesNoteStatus_MAX                 = 3,
};

// Enum CoopNotesCore.ECoopNotesNoteType
// NumValues: 0x0003
enum class ECoopNotesNoteType : uint8
{
	Projected                                = 0,
	Viewport                                 = 1,
	ECoopNotesNoteType_MAX                   = 2,
};

// Enum CoopNotesCore.ECoopNotesNotePinhole
// NumValues: 0x0005
enum class ECoopNotesNotePinhole : uint8
{
	TopLeft                                  = 0,
	TopRight                                 = 1,
	BottomRight                              = 2,
	BottomLeft                               = 3,
	ECoopNotesNotePinhole_MAX                = 4,
};

// Enum CoopNotesCore.ECoopNotesMimeType
// NumValues: 0x0003
enum class ECoopNotesMimeType : uint32
{
	Jpeg                                     = 0,
	Png                                      = 1,
	ECoopNotesMimeType_MAX                   = 2,
};

// Enum CoopNotesCore.ECoopNotesRevisionControlProvider
// NumValues: 0x0003
enum class ECoopNotesRevisionControlProvider : uint32
{
	Urc                                      = 0,
	Perforce                                 = 1,
	ECoopNotesRevisionControlProvider_MAX    = 2,
};

// ScriptStruct CoopNotesCore.CoopNotesRevisionControlCommit
// 0x0020 (0x0020 - 0x0000)
struct FCoopNotesRevisionControlCommit final
{
public:
	ECoopNotesRevisionControlProvider             Provider;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Id;                                                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              CommittedAt;                                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CoopNotesCore.CoopNotesInitializationParams
// 0x0070 (0x0070 - 0x0000)
struct FCoopNotesInitializationParams final
{
public:
	class FString                                 Jwt;                                               // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Language;                                          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Locale;                                            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LevelName;                                         // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LevelId;                                           // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCoopNotesRevisionControlCommit        RevisionControl;                                   // 0x0050(0x0020)(NativeAccessSpecifierPublic)
};

// ScriptStruct CoopNotesCore.CoopNotesNoteViewport
// 0x0010 (0x0010 - 0x0000)
struct FCoopNotesNoteViewport final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CoopNotesCore.CoopNotesNoteCamera
// 0x0058 (0x0058 - 0x0000)
struct FCoopNotesNoteCamera final
{
public:
	struct FVector                                Coordinates;                                       // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Orientation;                                       // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FCoopNotesNoteViewport                 Viewport;                                          // 0x0048(0x0010)(NativeAccessSpecifierPublic)
};

// ScriptStruct CoopNotesCore.CoopNotesNoteActor
// 0x0028 (0x0028 - 0x0000)
struct FCoopNotesNoteActor final
{
public:
	class FString                                 PathName;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CoopNotesCore.CoopNotesNoteLevel
// 0x0020 (0x0020 - 0x0000)
struct FCoopNotesNoteLevel final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Id;                                                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CoopNotesCore.CoopNotesNoteUEData
// 0x00D8 (0x00D8 - 0x0000)
struct FCoopNotesNoteUEData final
{
public:
	class FString                                 ProjectedActorPathName;                            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Coordinates;                                       // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsProjectedCoordsValid;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ProjectedCoordinates;                              // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCoopNotesNoteCamera                   Camera;                                            // 0x0050(0x0058)(NativeAccessSpecifierPublic)
	TArray<struct FCoopNotesNoteActor>            Actors;                                            // 0x00A8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FCoopNotesNoteLevel                    Level;                                             // 0x00B8(0x0020)(NativeAccessSpecifierPublic)
};

// ScriptStruct CoopNotesCore.CoopNotesNoteUser
// 0x0020 (0x0020 - 0x0000)
struct FCoopNotesNoteUser final
{
public:
	class FString                                 EpicAccountId;                                     // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DisplayName;                                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CoopNotesCore.CoopNotesRevisionControlData
// 0x0040 (0x0040 - 0x0000)
struct FCoopNotesRevisionControlData
{
public:
	struct FCoopNotesRevisionControlCommit        NoteCreated;                                       // 0x0000(0x0020)(NativeAccessSpecifierPublic)
	struct FCoopNotesRevisionControlCommit        NoteStatusUpdated;                                 // 0x0020(0x0020)(NativeAccessSpecifierPublic)
};

// ScriptStruct CoopNotesCore.CoopNotesNoteComment
// 0x00A0 (0x00A0 - 0x0000)
struct FCoopNotesNoteComment final
{
public:
	class FString                                 Id;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NoteId;                                            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContextId;                                         // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Number;                                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCoopNotesNoteUser                     CreatedBy;                                         // 0x0038(0x0020)(NativeAccessSpecifierPublic)
	class FString                                 Content;                                           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              CreatedAt;                                         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              LastModifiedAt;                                    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCoopNotesNoteUser                     LastModifiedBy;                                    // 0x0078(0x0020)(NativeAccessSpecifierPublic)
	struct FDateTime                              DeletedAt;                                         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CoopNotesCore.CoopNotesNoteMedia
// 0x00B8 (0x00B8 - 0x0000)
struct FCoopNotesNoteMedia final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContextId;                                         // 0x0010(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NoteId;                                            // 0x0020(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CommentId;                                         // 0x0030(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCoopNotesNoteUser                     CreatedBy;                                         // 0x0040(0x0020)(Transient, NativeAccessSpecifierPublic)
	ECoopNotesMimeType                            ContentType;                                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DataBase64;                                        // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Checksum;                                          // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ChecksumAlgorithm;                                 // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Size;                                              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Path;                                              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CoopNotesCore.CoopNotesNote
// 0x0210 (0x0210 - 0x0000)
struct FCoopNotesNote final
{
public:
	class FString                                 Id;                                                // 0x0000(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 ContextId;                                         // 0x0010(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        Number;                                            // 0x0020(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECoopNotesNoteStatus                          Status;                                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FCoopNotesNoteUser                     CreatedBy;                                         // 0x0028(0x0020)(Transient, NativeAccessSpecifierPrivate)
	struct FCoopNotesNoteUser                     Assignee;                                          // 0x0048(0x0020)(Transient, NativeAccessSpecifierPrivate)
	class FString                                 Content;                                           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDateTime                              CreatedAt;                                         // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDateTime                              LastModifiedAt;                                    // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FCoopNotesNoteUser                     LastModifiedBy;                                    // 0x0088(0x0020)(Transient, NativeAccessSpecifierPrivate)
	struct FCoopNotesNoteUser                     StatusUpdatedBy;                                   // 0x00A8(0x0020)(Transient, NativeAccessSpecifierPrivate)
	TArray<class FString>                         Tags;                                              // 0x00C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FCoopNotesNoteUEData                   UeData;                                            // 0x00D8(0x00D8)(NativeAccessSpecifierPrivate)
	struct FCoopNotesRevisionControlData          RevisionControlData;                               // 0x01B0(0x0040)(NativeAccessSpecifierPrivate)
	TArray<struct FCoopNotesNoteComment>          Comments;                                          // 0x01F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FCoopNotesNoteMedia>            Media;                                             // 0x0200(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct CoopNotesCore.CoopNotesNoteEntry
// 0x0070 (0x0070 - 0x0000)
struct FCoopNotesNoteEntry final
{
public:
	class FString                                 Type;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Username;                                          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Timestamp;                                         // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EditUsername;                                      // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EditTimestamp;                                     // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCoopNotesNoteMedia>            Media;                                             // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CoopNotesCore.CoopNotesNoteOwner
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FCoopNotesNoteOwner final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CoopNotesCore.CoopNotesNoteURCData
// 0x0010 (0x0050 - 0x0040)
struct FCoopNotesNoteURCData final : public FCoopNotesRevisionControlData
{
public:
	class FString                                 AdditionalProperty1;                               // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

