#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticsDebuggersRuntime

#include "Basic.hpp"

#include "CosmeticsFrameworkLoadouts_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum CosmeticsDebuggersRuntime.ECosmeticsDebuggerMenuTab
// NumValues: 0x0005
enum class ECosmeticsDebuggerMenuTab : uint8
{
	None                                     = 0,
	Client                                   = 1,
	Server                                   = 2,
	Budgeting                                = 3,
	ECosmeticsDebuggerMenuTab_MAX            = 4,
};

// Enum CosmeticsDebuggersRuntime.EActorSelectionSortMetric
// NumValues: 0x0003
enum class EActorSelectionSortMetric : uint8
{
	Alphabetical                             = 0,
	DistanceFromLocalPlayer                  = 1,
	EActorSelectionSortMetric_MAX            = 2,
};

// Enum CosmeticsDebuggersRuntime.ECosmeticLoadoutContentsFilterPolicy
// NumValues: 0x0004
enum class ECosmeticLoadoutContentsFilterPolicy : uint8
{
	ShowAllCosmetics                         = 0,
	ShowOnlyNonDefaultCosmetics              = 1,
	ShowOnlyDefaultCosmetics                 = 2,
	ECosmeticLoadoutContentsFilterPolicy_MAX = 3,
};

// ScriptStruct CosmeticsDebuggersRuntime.CosmeticLoadoutSnapshot
// 0x0148 (0x0148 - 0x0000)
struct FCosmeticLoadoutSnapshot final
{
public:
	struct FCosmeticLoadout                       CosmeticLoadout;                                   // 0x0000(0x0010)(NativeAccessSpecifierPublic)
	struct FFortAthenaLoadout                     AthenaLoadout;                                     // 0x0010(0x0138)(NativeAccessSpecifierPublic)
};

// ScriptStruct CosmeticsDebuggersRuntime.AppliedCosmeticSlotSnapshot
// 0x0020 (0x0020 - 0x0000)
struct FAppliedCosmeticSlotSnapshot final
{
public:
	EFortCustomPartType                           Type;                                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 MeshComponent;                                     // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCustomCharacterPart*                   SourcePart;                                        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SlotHiddenRequesters;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SlotHiddenForOwnerRequesters;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CosmeticsDebuggersRuntime.CosmeticActorVisibilitySnapshot
// 0x0002 (0x0002 - 0x0000)
struct FCosmeticActorVisibilitySnapshot final
{
public:
	bool                                          bIsActorHidden;                                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsActorHiddenForOwner;                            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CosmeticsDebuggersRuntime.HIDFactoryInfo
// 0x0020 (0x0020 - 0x0000)
struct FHIDFactoryInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CosmeticsDebuggersRuntime.CosmeticStateSnapshot
// 0x0300 (0x0300 - 0x0000)
struct FCosmeticStateSnapshot final
{
public:
	struct FCosmeticActorVisibilitySnapshot       SubjectActorVisibilityInfo;                        // 0x0000(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCosmeticLoadoutSnapshot               SubjectActorLoadoutSnapshot;                       // 0x0008(0x0148)(NativeAccessSpecifierPublic)
	struct FCosmeticLoadoutSnapshot               LocalPlayerControllerLoadoutSnapshot;              // 0x0150(0x0148)(NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ActiveCosmeticTags;                                // 0x0298(0x0020)(NativeAccessSpecifierPublic)
	struct FGameplayTag                           ActiveProductTag;                                  // 0x02B8(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           CurrentContextProductTag;                          // 0x02C4(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           CurrentLinkProductID;                              // 0x02D0(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAppliedCosmeticSlotSnapshot>   AppliedCosmeticSlots;                              // 0x02E0(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FHIDFactoryInfo>                RegisteredHeroTypeFactories;                       // 0x02F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

}

