#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticsFrameworkFlowgraphTests

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct CosmeticsFrameworkFlowgraphTests.CosmeticFlowData_TestStructBase
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FCosmeticFlowData_TestStructBase
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CosmeticsFrameworkFlowgraphTests.CosmeticFlowData_TestStructDerived
// 0x0004 (0x0008 - 0x0004)
struct FCosmeticFlowData_TestStructDerived final : public FCosmeticFlowData_TestStructBase
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CosmeticsFrameworkFlowgraphTests.OperationSequenceData_TestInner
// 0x0008 (0x0008 - 0x0000)
struct FOperationSequenceData_TestInner final
{
public:
	class UOperationSequenceTest_HandleInner*     Inner;                                             // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CosmeticsFrameworkFlowgraphTests.OperationSequenceData_TestInitialData
// 0x000C (0x000C - 0x0000)
struct alignas(0x04) FOperationSequenceData_TestInitialData final
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CosmeticsFrameworkFlowgraphTests.OperationSequenceData_TestOperationData
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FOperationSequenceData_TestOperationData final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

