#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticsFrameworkLoadouts

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct CosmeticsFrameworkLoadouts.CosmeticCustomizationInfo
// 0x0028 (0x0028 - 0x0000)
struct FCosmeticCustomizationInfo final
{
public:
	struct FGameplayTag                           ChannelTag;                                        // 0x0000(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VariantTag;                                        // 0x000C(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AdditionalData;                                    // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CosmeticsFrameworkLoadouts.CosmeticBackendLoadoutSlot
// 0x0040 (0x0040 - 0x0000)
struct FCosmeticBackendLoadoutSlot final
{
public:
	struct FPrimaryAssetId                        SlotTemplate;                                      // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPrimaryAssetId                        EquippedItem;                                      // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCosmeticCustomizationInfo>     CustomizationInfo;                                 // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CosmeticsFrameworkLoadouts.CosmeticBackendLoadoutGroupSlot
// 0x0028 (0x0028 - 0x0000)
struct FCosmeticBackendLoadoutGroupSlot final
{
public:
	class FString                                 LinkedItemId;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCosmeticBackendLoadoutSlot>    Slots;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bShuffled;                                         // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CosmeticsFrameworkLoadouts.CosmeticBackendLoadoutGroup
// 0x0060 (0x0060 - 0x0000)
struct FCosmeticBackendLoadoutGroup final
{
public:
	TMap<class FString, struct FCosmeticBackendLoadoutGroupSlot> Slots;                                             // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 DisplayName;                                       // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CosmeticsFrameworkLoadouts.CosmeticLoadoutActiveArchetype
// 0x0018 (0x0018 - 0x0000)
struct FCosmeticLoadoutActiveArchetype final
{
public:
	struct FGameplayTag                           ArchetypeGroupTag;                                 // 0x0000(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ArchetypeTag;                                      // 0x000C(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CosmeticsFrameworkLoadouts.CosmeticLoadoutSlot
// 0x0020 (0x0020 - 0x0000)
struct FCosmeticLoadoutSlot final
{
public:
	class UCosmeticLoadoutSlotTemplate*           SlotTemplate;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UObject*                                EquippedItemDefinitionObject;                      // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FCosmeticCustomizationInfo>     CustomizationInfo;                                 // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct CosmeticsFrameworkLoadouts.CosmeticLoadout
// 0x0010 (0x0010 - 0x0000)
struct FCosmeticLoadout final
{
public:
	TArray<struct FCosmeticLoadoutSlot>           Slots;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct CosmeticsFrameworkLoadouts.CosmeticBackendLoadout
// 0x0050 (0x0050 - 0x0000)
struct FCosmeticBackendLoadout final
{
public:
	class FString                                 ItemId;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCosmeticBackendLoadoutSlot>    Slots;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  UserTags;                                          // 0x0020(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 DisplayName;                                       // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CosmeticsFrameworkLoadouts.CosmeticLoadoutSlotRequirements
// 0x0050 (0x0050 - 0x0000)
struct FCosmeticLoadoutSlotRequirements final
{
public:
	struct FGameplayTagContainer                  RequiredTags;                                      // 0x0000(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  DeniedTags;                                        // 0x0020(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FPrimaryAssetType>              AllowedItemTypes;                                  // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

}

