#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticsFrameworkLoadouts

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CosmeticsFrameworkLoadouts_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class CosmeticsFrameworkLoadouts.BasicCosmeticLoadoutContext
// 0x0008 (0x0038 - 0x0030)
class UBasicCosmeticLoadoutContext : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BasicCosmeticLoadoutContext">();
	}
	static class UBasicCosmeticLoadoutContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasicCosmeticLoadoutContext>();
	}
};

// Class CosmeticsFrameworkLoadouts.CosmeticCustomizableItemDefinition
// 0x0000 (0x0030 - 0x0030)
class ICosmeticCustomizableItemDefinition final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticCustomizableItemDefinition">();
	}
	static class ICosmeticCustomizableItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICosmeticCustomizableItemDefinition>();
	}
};

// Class CosmeticsFrameworkLoadouts.CosmeticLoadoutContext
// 0x0000 (0x0030 - 0x0030)
class ICosmeticLoadoutContext final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticLoadoutContext">();
	}
	static class ICosmeticLoadoutContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICosmeticLoadoutContext>();
	}
};

// Class CosmeticsFrameworkLoadouts.CosmeticLoadoutItemDefinition
// 0x0000 (0x0030 - 0x0030)
class ICosmeticLoadoutItemDefinition final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticLoadoutItemDefinition">();
	}
	static class ICosmeticLoadoutItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICosmeticLoadoutItemDefinition>();
	}
};

// Class CosmeticsFrameworkLoadouts.CosmeticLoadoutSchema
// 0x0068 (0x00B0 - 0x0048)
class UCosmeticLoadoutSchema final : public UPrimaryDataAsset
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0050(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0060(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           ArchetypeTag;                                      // 0x0090(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCosmeticLoadoutSlotTemplate*>   Slots;                                             // 0x00A0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticLoadoutSchema">();
	}
	static class UCosmeticLoadoutSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmeticLoadoutSchema>();
	}
};

// Class CosmeticsFrameworkLoadouts.CosmeticLoadoutSlotTemplate
// 0x00B8 (0x0100 - 0x0048)
class UCosmeticLoadoutSlotTemplate final : public UPrimaryDataAsset
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           SlotTag;                                           // 0x0050(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  MetaTags;                                          // 0x0060(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FCosmeticLoadoutSlotRequirements       Requirements;                                      // 0x0080(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FString                                 ShortName;                                         // 0x00D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPrimaryAssetId                        DefaultCosmeticItemId;                             // 0x00E0(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAlwaysUseDefaultCosmeticItemId;                   // 0x00F8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsEquippable;                                     // 0x00F9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticLoadoutSlotTemplate">();
	}
	static class UCosmeticLoadoutSlotTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmeticLoadoutSlotTemplate>();
	}
};

// Class CosmeticsFrameworkLoadouts.CosmeticLoadoutArchetype
// 0x0060 (0x00A8 - 0x0048)
class UCosmeticLoadoutArchetype final : public UPrimaryDataAsset
{
public:
	class FText                                   DisplayName;                                       // 0x0048(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0058(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           ArchetypeGroupTag;                                 // 0x0088(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCosmeticLoadoutSchema*>         Schemas;                                           // 0x0098(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticLoadoutArchetype">();
	}
	static class UCosmeticLoadoutArchetype* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmeticLoadoutArchetype>();
	}
};

// Class CosmeticsFrameworkLoadouts.CosmeticLoadoutSubsystem
// 0x0050 (0x0088 - 0x0038)
class UCosmeticLoadoutSubsystem : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CosmeticLoadoutSubsystem">();
	}
	static class UCosmeticLoadoutSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmeticLoadoutSubsystem>();
	}
};

}

