#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CraftingUI

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "CommonUI_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonUILegacy_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class CraftingUI.FortCraftingListItem
// 0x0148 (0x0178 - 0x0030)
class UFortCraftingListItem final : public UObject
{
public:
	uint8                                         Pad_30[0x148];                                     // 0x0030(0x0148)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCraftingListItem">();
	}
	static class UFortCraftingListItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCraftingListItem>();
	}
};

// Class CraftingUI.AthenaCraftingQuickBarButton
// 0x0020 (0x1830 - 0x1810)
class UAthenaCraftingQuickBarButton final : public UAthenaQuickBarSlotButtonBase
{
public:
	uint8                                         Pad_1810[0x20];                                    // 0x1810(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCanCraftNowChanged(const bool bCanCraftNow);
	void OnIsCraftableItemChanged(const bool bIsCraftableItem);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCraftingQuickBarButton">();
	}
	static class UAthenaCraftingQuickBarButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCraftingQuickBarButton>();
	}
};

// Class CraftingUI.AthenaEquippedItemCraftingIndicator
// 0x0020 (0x0460 - 0x0440)
class UAthenaEquippedItemCraftingIndicator final : public UCommonUserWidget
{
public:
	uint8                                         Pad_440[0x20];                                     // 0x0440(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleInventoryActiveChanged(bool bInventoryActive);
	void HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void OnCanCraftNowChanged(const bool bCanCraftNow);
	void OnIsCraftableItemChanged(const bool bIsCraftableItem);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaEquippedItemCraftingIndicator">();
	}
	static class UAthenaEquippedItemCraftingIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaEquippedItemCraftingIndicator>();
	}
};

// Class CraftingUI.AthenaInventoryItemInfoCraftingIndicator
// 0x0020 (0x0460 - 0x0440)
class UAthenaInventoryItemInfoCraftingIndicator final : public UCommonUserWidget
{
public:
	uint8                                         Pad_440[0x20];                                     // 0x0440(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleInventoryItemSelected(class UFortItem* SelectedItem);
	void OnCanCraftNowChanged(const bool bCanCraftNow);
	void OnIsCraftableItemChanged(const bool bIsCraftableItem);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaInventoryItemInfoCraftingIndicator">();
	}
	static class UAthenaInventoryItemInfoCraftingIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryItemInfoCraftingIndicator>();
	}
};

// Class CraftingUI.AthenaQuickBarSlotCraftingIndicator
// 0x0030 (0x0478 - 0x0448)
class UAthenaQuickBarSlotCraftingIndicator final : public UAthenaQuickBarSlotExtensionWidgetBase
{
public:
	uint8                                         Pad_448[0x20];                                     // 0x0448(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCheckForIngredientChangesWhenCraftable;           // 0x0468(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_469[0xF];                                      // 0x0469(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleInventoryActiveChanged(bool bInventoryActive);
	void HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void OnCanCraftNowChanged(const bool bCanCraftNow);
	void OnIngredientChanged(const bool bCanCraftNow);
	void OnIsCraftableItemChanged(const bool bIsCraftableItem);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaQuickBarSlotCraftingIndicator">();
	}
	static class UAthenaQuickBarSlotCraftingIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaQuickBarSlotCraftingIndicator>();
	}
};

// Class CraftingUI.FortCookingScreen
// 0x0058 (0x05D0 - 0x0578)
class UFortCookingScreen final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CloseInputAction;                                  // 0x0580(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_598[0x8];                                      // 0x0598(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    Button_EjectAll;                                   // 0x05A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Cancel;                                     // 0x05A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RecipeName;                                   // 0x05B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RecipeDescription;                            // 0x05B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_Recipe;                                      // 0x05C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSlottedRadialMenu*                 RadialMenu_Recipes;                                // 0x05C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCookingScreen">();
	}
	static class UFortCookingScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCookingScreen>();
	}
};

// Class CraftingUI.FortCraftingFormulaIngredientsWidget
// 0x0008 (0x0448 - 0x0440)
class UFortCraftingFormulaIngredientsWidget final : public UCommonUserWidget
{
public:
	class UDynamicEntryBox*                       EntryBox_Ingredients;                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCraftingFormulaIngredientsWidget">();
	}
	static class UFortCraftingFormulaIngredientsWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCraftingFormulaIngredientsWidget>();
	}
};

// Class CraftingUI.FortCraftingIngredientWidget
// 0x0028 (0x0468 - 0x0440)
class UFortCraftingIngredientWidget final : public UCommonUserWidget
{
public:
	uint8                                         Pad_440[0x8];                                      // 0x0440(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_NumAvailable;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_NumRequired;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaItemIcon*                        ItemIcon;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLazyImage*                       LazyImage_Icon;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnIngredientWidgetUpdated(const int32 NumAvailable, const int32 NumRequired, const bool bIsPrimaryIngredient, const bool bIsLastIngredient);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCraftingIngredientWidget">();
	}
	static class UFortCraftingIngredientWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCraftingIngredientWidget>();
	}
};

// Class CraftingUI.FortCraftingItemInfoWidget
// 0x0060 (0x05D8 - 0x0578)
class UFortCraftingItemInfoWidget final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RarityTextFormat;                                  // 0x0580(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemName;                                     // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemRarity;                                   // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemCategory;                                 // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemCategoryIndicator*             ItemCategoryIndicator;                             // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemDescription;                              // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaInventoryItemStatsWidget*        ItemStatsWidget;                                   // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCraftingFormulaIngredientsWidget*  IngredientsWidget;                                 // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_StartCrafting;                              // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D0[0x8];                                      // 0x05D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnItemRaritySet(const EFortRarity Rarity, const struct FFortRarityItemData& RarityItemData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCraftingItemInfoWidget">();
	}
	static class UFortCraftingItemInfoWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCraftingItemInfoWidget>();
	}
};

// Class CraftingUI.FortCraftingListEntry
// 0x0020 (0x1870 - 0x1850)
class UFortCraftingListEntry final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_1850[0x8];                                     // 0x1850(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaItemIcon*                        ItemIcon;                                          // 0x1858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCanCraftItem;                                     // 0x1860(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1861[0xF];                                     // 0x1861(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCraftingListItemSet();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCraftingListEntry">();
	}
	static class UFortCraftingListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCraftingListEntry>();
	}
};

// Class CraftingUI.FortCraftingTab
// 0x0178 (0x06F0 - 0x0578)
class UFortCraftingTab final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TabNameId;                                         // 0x0580(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58C[0x4];                                      // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0590(0x0120)(Edit, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  PrimaryIngredientTags;                             // 0x06B0(0x0020)(Edit, NativeAccessSpecifierPrivate)
	class UFortCraftingItemInfoWidget*            CraftingItemInfo;                                  // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonListView*                        ListView_Recipes;                                  // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaQuickbarEditorBase*              QuickbarEditor;                                    // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaInventoryItemInfo*               ItemInfoWidget;                                    // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleInventoryItemSelected(class UFortItem* Item);
	void OnFormulaListUpdated(const int32 NumFormulas);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCraftingTab">();
	}
	static class UFortCraftingTab* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCraftingTab>();
	}
};

// Class CraftingUI.FortPotContentsPopup
// 0x0028 (0x0440 - 0x0418)
class UFortPotContentsPopup final : public UUserWidget
{
public:
	int32                                         MaxItemsToShow;                                    // 0x0418(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_41C[0xC];                                      // 0x041C(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTileView*                        TileView_PotContents;                              // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_MoreItems;                                    // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_Popup;                                     // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetOwningCraftingObject(class ACraftingObjectBGA* InCraftingObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPotContentsPopup">();
	}
	static class UFortPotContentsPopup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPotContentsPopup>();
	}
};

// Class CraftingUI.FortPotContentsTile
// 0x0010 (0x1860 - 0x1850)
class UFortPotContentsTile final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_1850[0x8];                                     // 0x1850(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonLazyImage*                       Image_Item;                                        // 0x1858(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPotContentsTile">();
	}
	static class UFortPotContentsTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPotContentsTile>();
	}
};

// Class CraftingUI.FortUIGameFeatureAction_SetCraftMenuWidget
// 0x0040 (0x0070 - 0x0030)
class UFortUIGameFeatureAction_SetCraftMenuWidget final : public UFortUIGameFeatureAction
{
public:
	TSubclassOf<class ACraftingObjectBGA>         CraftingObject;                                    // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   CraftingMenuWidget;                                // 0x0038(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIGameFeatureAction_SetCraftMenuWidget">();
	}
	static class UFortUIGameFeatureAction_SetCraftMenuWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIGameFeatureAction_SetCraftMenuWidget>();
	}
};

}

