#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CraftingRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CraftingRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class CraftingRuntime.CraftingObjectBGA
// 0x0078 (0x0D98 - 0x0D20)
class ACraftingObjectBGA : public ABuildingGameplayActor
{
public:
	uint8                                         Pad_D20[0x8];                                      // 0x0D20(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortInventory*                         Inventory;                                         // 0x0D28(0x0008)(Net, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D30[0x18];                                     // 0x0D30(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       SphereComponent_InteractionRange;                  // 0x0D48(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   MenuWidget;                                        // 0x0D50(0x0030)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetComponent*                       WidgetComponent_PotContents;                       // 0x0D80(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowCraftingUI;                                   // 0x0D88(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSendEventMessageOnLocalInteract;                  // 0x0D89(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRunServerInteractionWhenSendingEventMessage;      // 0x0D8A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8B[0x5];                                      // 0x0D8B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CraftingObjectMesh;                                // 0x0D90(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleInteractionRangeBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void HandleInteractionRangeEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CraftingObjectBGA">();
	}
	static class ACraftingObjectBGA* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACraftingObjectBGA>();
	}
};

// Class CraftingRuntime.CraftingCheatManager
// 0x0000 (0x0030 - 0x0030)
class UCraftingCheatManager final : public UChildCheatManager
{
public:
	void StartSelfCrafting(class FName FormulaName);
	void ToggleFreeCrafting();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CraftingCheatManager">();
	}
	static class UCraftingCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCraftingCheatManager>();
	}
};

// Class CraftingRuntime.CraftingObjectComponent
// 0x0508 (0x05E0 - 0x00D8)
class UCraftingObjectComponent final : public UGameFrameworkComponent
{
public:
	TMulticastInlineDelegate<void(struct FCraftingObjectStateChangedEvent& Payload)> CraftingObjectStateChanged;                        // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName& FormulaRowName, bool bIsCraftable)> OnFormulaCraftableChanged;                         // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(struct FCraftingObjectSuccessEvent& Payload)> OnCraftingSuccess;                                 // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TDelegate<void(struct FCraftingObjectAdditionalValidationEvent& Payload)> OnCraftingAdditionalValidationCheck;               // 0x0108(0x0014)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C[0x1C];                                     // 0x011C(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCraftingObjectRepStateData            CraftingObjectRepStateData;                        // 0x0138(0x0018)(Net, Transient, RepNotify, NativeAccessSpecifierPrivate)
	TMap<struct FCraftingMultiKey, struct FCraftingObjectServerStateData> CraftingObjectServerStateData;                     // 0x0150(0x0050)(Transient, NativeAccessSpecifierPrivate)
	class FName                                   LastCraftedItemFormulaRow;                         // 0x01A0(0x000C)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LastIngredientStringForAnalytics;                  // 0x01B0(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 LastFormulaStringForAnalytics;                     // 0x01C0(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 LastResultsStringForAnalytics;                     // 0x01D0(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayAbilitySpecHandle             WhileCraftingAbilitySpecHandle;                    // 0x01E0(0x0004)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayAbilitySpecHandle             OwnerCraftingAbilitySpecHandle;                    // 0x01E4(0x0004)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           CraftingObjectTag;                                 // 0x01E8(0x000C)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CraftingObjectTags;                                // 0x01F8(0x0020)(Edit, Net, DisableEditOnInstance, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CraftingTimeLength;                                // 0x0218(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ReadyTimeLength;                                   // 0x0250(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         OverCraftingTimeLength;                            // 0x0288(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ResettingTimeLength;                               // 0x02C0(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DefaultCraftingSpeedMultiplier;                    // 0x02F8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                   OverCraftingLootTierKey;                           // 0x0330(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bTakeItemsAtCraftingStart : 1;                     // 0x033C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DecayRate;                                         // 0x0340(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bGiveIngredientsToCraftingObject : 1;              // 0x0344(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bGiveIngredientsToInstigator : 1;                  // 0x0344(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_345[0x3];                                      // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                IngredientSpawnOffset;                             // 0x0348(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bPrioritizeSmallestIngredientStacks : 1;           // 0x0360(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bGiveToCraftingObject : 1;                         // 0x0360(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bGiveResultToInstigator : 1;                       // 0x0360(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   OwnerCraftingAbility;                              // 0x0368(0x0030)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   WhileCraftingAbility;                              // 0x0398(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   InstigatorWhileCraftingAbility;                    // 0x03C8(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bScaleMultiCraftingTime;                           // 0x03F8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CraftingFailedTags;                                // 0x0400(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_420[0x148];                                    // 0x0420(0x0148)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  IngredientsInventoryGroupTag;                      // 0x0568(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_588[0x50];                                     // 0x0588(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          FreeCraftingEnabled;                               // 0x05D8(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D9[0x7];                                      // 0x05D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandlePickupCraftingItemPickedUp(class AFortPickup* Pickup, class AFortPawn* InteractingPawn);
	void OnRep_CraftingObjectRepStateData(const struct FCraftingObjectRepStateData& OldValue);
	void OnRep_CraftingObjectTags();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CraftingObjectComponent">();
	}
	static class UCraftingObjectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCraftingObjectComponent>();
	}
};

// Class CraftingRuntime.FortControllerComponent_CraftingNetworkEvents
// 0x0010 (0x00F0 - 0x00E0)
class UFortControllerComponent_CraftingNetworkEvents final : public UFortControllerComponent
{
public:
	TMulticastInlineDelegate<void(struct FCraftingObjectSuccessEvent& Payload)> OnCraftingSuccess;                                 // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void ClientNotifyCraftingFailed(class AActor* CraftingObject, const struct FGameplayTagContainer& FailedReason, const struct FCraftingMultiKey& Key);
	void ClientNotifyCraftingSuccess(class AActor* CraftingObject, const class FName& FormulaRowName, const TArray<struct FFortItemEntry>& ConsumedIngredients, const struct FCraftingMultiKey& Key);
	void NotifyCraftingSuccess(class AActor* CraftingObject, const class FName& FormulaRowName, const TArray<struct FFortItemEntry>& ConsumedIngredients, const struct FCraftingMultiKey& Key);
	void ServerCancelCrafting(class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	void ServerClaimCraftingResults(class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	void ServerEjectItems(class AActor* CraftingObject);
	void ServerPauseCrafting(class AActor* CraftingObject, bool bDecayPausedTime, const struct FCraftingMultiKey& Key);
	void ServerPickupItemAndStartCrafting(class AActor* CraftingObject, class AFortPickup* Pickup, const class FName& CraftingFormulaName, const struct FCraftingMultiKey& Key);
	void ServerReportCraftingSuccess(class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	void ServerResumeCrafting(class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	void ServerStartCrafting(class AActor* CraftingObject, const class FName& CraftingFormulaName, const int32 NumberToCraft, const struct FCraftingMultiKey& Key, const float OverriddenObjectStateLength);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortControllerComponent_CraftingNetworkEvents">();
	}
	static class UFortControllerComponent_CraftingNetworkEvents* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerComponent_CraftingNetworkEvents>();
	}
};

// Class CraftingRuntime.FortGameStateComponent_Crafting
// 0x01C0 (0x0298 - 0x00D8)
class UFortGameStateComponent_Crafting : public UFortGameStateComponent
{
public:
	struct FDataRegistryType                      CraftingFormulaRegistryType;                       // 0x00D8(0x000C)(ZeroConstructor, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataRegistryType                      CraftingIngredientsUIDataRegistryType;             // 0x00E4(0x000C)(ZeroConstructor, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x148];                                     // 0x00F0(0x0148)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCraftingResult>                CraftingResultsList;                               // 0x0238(0x0010)(Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_248[0x50];                                     // 0x0248(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPlaylistDataReady(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnRep_CraftingResultsList();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameStateComponent_Crafting">();
	}
	static class UFortGameStateComponent_Crafting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameStateComponent_Crafting>();
	}
};

// Class CraftingRuntime.FortPickupInteractOverrideComponent_Crafting
// 0x0028 (0x0120 - 0x00F8)
class UFortPickupInteractOverrideComponent_Crafting final : public UFortPickupInteractOverrideComponent
{
public:
	class UItemDefinitionBase*                    LastPickupItemDef;                                 // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UItemDefinitionBase*                    LastFocusedItemDef;                                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   LastTargetFormulaName;                             // 0x0108(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ContextualCraftingInteractDuration;                // 0x0114(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETInteractionType                             CachedInteractionType;                             // 0x0118(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EInteractionBeingAttempted                    CachedInteractionBeingAttempted;                   // 0x0119(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPickupInteractOverrideComponent_Crafting">();
	}
	static class UFortPickupInteractOverrideComponent_Crafting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPickupInteractOverrideComponent_Crafting>();
	}
};

// Class CraftingRuntime.FortContextualTutorial_CraftingComplete
// 0x0000 (0x00F8 - 0x00F8)
class UFortContextualTutorial_CraftingComplete final : public UFortContextualTutorial
{
public:
	void OnCraftingSuccess(const struct FCraftingObjectSuccessEvent& Event);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContextualTutorial_CraftingComplete">();
	}
	static class UFortContextualTutorial_CraftingComplete* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContextualTutorial_CraftingComplete>();
	}
};

// Class CraftingRuntime.FortContextualTutorial_CraftingReady
// 0x0000 (0x00F8 - 0x00F8)
class UFortContextualTutorial_CraftingReady final : public UFortContextualTutorial
{
public:
	void HandleFormulaCraftableChanged(const class FName& FormulaRowName, bool bIsCraftable);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContextualTutorial_CraftingReady">();
	}
	static class UFortContextualTutorial_CraftingReady* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContextualTutorial_CraftingReady>();
	}
};

// Class CraftingRuntime.FortContextualTutorial_CraftingTabOpen
// 0x0008 (0x0100 - 0x00F8)
class UFortContextualTutorial_CraftingTabOpen final : public UFortContextualTutorial
{
public:
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleFormulaCraftableChanged(const class FName& FormulaRowName, bool bIsCraftable);
	void HandleInventoryTabChanged(const class FName InventoryTabNameId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContextualTutorial_CraftingTabOpen">();
	}
	static class UFortContextualTutorial_CraftingTabOpen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContextualTutorial_CraftingTabOpen>();
	}
};

// Class CraftingRuntime.CraftingLibrary
// 0x0000 (0x0030 - 0x0030)
class UCraftingLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddCraftingIngredientUIDataRow(class UDataTable* DataTable, const class FName& RowName, const struct FCraftingIngredientUIData& NewRowStruct);
	static void CancelAllCrafting(class AActor* CraftingObject);
	static void CancelCrafting(class AFortPlayerController* Instigator, class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static bool CanCraftFormula(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, const class FName CraftingFormulaRow, TArray<struct FCraftingIngredientQueryState>* OutIngredientStates, const int32 NumberToCraft, const struct FGameplayTagContainer& InInventoryGroups);
	static bool CanCraftFormulaWithAdditionalItems(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, const class FName CraftingFormulaRow, const TArray<struct FItemAndCount>& AdditionalItems, TArray<struct FCraftingIngredientQueryState>* OutIngredientStates, const int32 NumberToCraft, const struct FGameplayTagContainer& InInventoryGroups);
	static void ClaimCraftingResults(class AFortPlayerController* Instigator, class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static void EjectItems(class AFortPlayerController* Instigator, class AActor* CraftingObject);
	static void GetAllCraftableFormulas(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, TArray<class FName>* OutFormulas);
	static void GetAllCraftingFormulas(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, TArray<class FName>* OutFormulas);
	static void GetAllValidIngredients(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, TArray<struct FGameplayTagContainer>* OutIngredients);
	static TArray<class UFortWorldItem*> GetCraftedResults_TempItems(class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static bool GetCraftingFormulaIngredientRequirements(class UObject* WorldContextObject, const class FName& CraftingFormulaRow, TArray<struct FCraftingIngredientRequirement>* OutIngredientRequirements);
	static class FName GetCraftingFormulaNameBeingCrafted(class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static void GetCraftingFormulasForCraftingObject(const class AActor* CraftingObject, TArray<class FName>* OutFormulas);
	static TArray<class UFortWorldItem*> GetCraftingIngredients_TempItems(class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static class UCraftingObjectComponent* GetCraftingObjectComponent(const class AActor* CraftingObject);
	static ECraftingObjectState GetCraftingObjectCraftingState(class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static float GetCraftingObjectCurrentCraftingStateEndTime(const class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static float GetCraftingObjectCurrentCraftingStateStartTime(const class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static float GetCraftingObjectCurrentCraftingStateTimeLeft(const class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static float GetCraftingObjectPausedTime(const class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static struct FGameplayTagContainer GetCraftingObjectTags(const class AActor* CraftingObject);
	static void GetCraftingResultsForRowName(const class UObject* WorldContextObject, const class FName& CraftingFormulaRow, TArray<struct FItemAndCount>* OutResults, int32 NumToCraft);
	static TArray<class UFortWorldItem*> GetIngredientsInCraftingObject(class AActor* CraftingObject);
	static void GetKnownCraftingFormulas(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, TArray<class FName>* OutFormulas);
	static class FName GetLastCraftedItemFormulaName(class AActor* CraftingObject);
	static float GetTimeToCraftRecipe(const class AActor* CraftingObject, const class FName& CraftingFormulaName);
	static void GetUIDataForCraftingIngredientTags(class UObject* WorldContextObject, const struct FGameplayTagContainer& IngredientTags, TArray<TSoftObjectPtr<class UItemDefinitionBase>>* OutItemDefs, TArray<TSoftObjectPtr<class UObject>>* OutIcons);
	static void GetValidIngredientsInInventory(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, TArray<class UFortWorldItem*>* OutIngredients);
	static void GiveItemToCraftingObject(class AFortPlayerController* Instigator, class AActor* CraftingObject, const struct FFortItemEntry& ItemEntryToGrant);
	static bool IsFreeCraftingEnabled(const class AActor* CraftingObject);
	static bool IsValidIngredient(const class AFortPlayerController* FortPC, const class AActor* CraftingObject, const class UItemDefinitionBase* ItemDef);
	static void PauseCrafting(class AFortPlayerController* Instigator, class AActor* CraftingObject, bool bDecayPausedTime, const struct FCraftingMultiKey& Key);
	static void PickupItemAndStartCrafting(class AFortPlayerController* Instigator, class AActor* CraftingObject, class AFortPickup* Pickup, const class FName& CraftingFormulaName, const struct FCraftingMultiKey& Key);
	static void ReportCraftingSuccess(class AFortPlayerController* Instigator, class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static void ResumeCrafting(class AFortPlayerController* Instigator, class AActor* CraftingObject, const struct FCraftingMultiKey& Key);
	static void StartCrafting(class AFortPlayerController* Instigator, class AActor* CraftingObject, const class FName& CraftingFormulaName, const int32 NumberToCraft, const struct FCraftingMultiKey& Key, const float OverriddenCraftingLength);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CraftingLibrary">();
	}
	static class UCraftingLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCraftingLibrary>();
	}
};

}

