#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrashReporter

#include "Basic.hpp"


namespace SDK::Params
{

// Function CrashReporter.CrashReporterBlueprintLibrary.LogException
// 0x0010 (0x0010 - 0x0000)
struct CrashReporterBlueprintLibrary_LogException final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrashReporter.CrashReporterBlueprintLibrary.LogMessage
// 0x0010 (0x0010 - 0x0000)
struct CrashReporterBlueprintLibrary_LogMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrashReporter.CrashReporterBlueprintLibrary.SetBooleanKey
// 0x0018 (0x0018 - 0x0000)
struct CrashReporterBlueprintLibrary_SetBooleanKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CrashReporter.CrashReporterBlueprintLibrary.SetFloatKey
// 0x0018 (0x0018 - 0x0000)
struct CrashReporterBlueprintLibrary_SetFloatKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CrashReporter.CrashReporterBlueprintLibrary.SetIntegerKey
// 0x0018 (0x0018 - 0x0000)
struct CrashReporterBlueprintLibrary_SetIntegerKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CrashReporter.CrashReporterBlueprintLibrary.SetStringKey
// 0x0020 (0x0020 - 0x0000)
struct CrashReporterBlueprintLibrary_SetStringKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrashReporter.CrashReporterBlueprintLibrary.SetUserEmail
// 0x0010 (0x0010 - 0x0000)
struct CrashReporterBlueprintLibrary_SetUserEmail final
{
public:
	class FString                                 Email;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrashReporter.CrashReporterBlueprintLibrary.SetUserIdentifier
// 0x0010 (0x0010 - 0x0000)
struct CrashReporterBlueprintLibrary_SetUserIdentifier final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CrashReporter.CrashReporterBlueprintLibrary.SetUserName
// 0x0010 (0x0010 - 0x0000)
struct CrashReporterBlueprintLibrary_SetUserName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

