#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRD_ClassSelectorUI

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "UMG_classes.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CRD_ClassSelectorRuntime_structs.hpp"


namespace SDK
{

// Class CRD_ClassSelectorUI.ClassSelectorLoadoutContainer
// 0x0048 (0x0488 - 0x0440)
class UClassSelectorLoadoutContainer final : public UCommonUserWidget
{
public:
	class UWrapBox*                               WrapBox;                                           // 0x0440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAthenaItemElementWidgetBase> EntryWidgetClass;                                  // 0x0448(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAthenaItemElementWidgetBase*>   EntryWidgets;                                      // 0x0450(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UFortItemDefinition*                    PreviewItemDef;                                    // 0x0460(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumPreviewEntries;                                 // 0x0468(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_46C[0x1C];                                     // 0x046C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClassSelectorLoadoutContainer">();
	}
	static class UClassSelectorLoadoutContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClassSelectorLoadoutContainer>();
	}
};

// Class CRD_ClassSelectorUI.ClassSelectorTabButtons
// 0x00C8 (0x0508 - 0x0440)
class UClassSelectorTabButtons final : public UCommonUserWidget
{
public:
	class UCommonActionWidget*                    LeftActionWidget;                                  // 0x0440(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonActionWidget*                    RightActionWidget;                                 // 0x0448(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScrollBox*                             TabButtonsScrollBox;                               // 0x0450(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      LeftButton;                                        // 0x0458(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      RightButton;                                       // 0x0460(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    LeftInputAction;                                   // 0x0468(0x0018)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_480[0x8];                                      // 0x0480(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    RightInputAction;                                  // 0x0488(0x0018)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A0[0x8];                                      // 0x04A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClassSelectorTeamTile*>         TabButtons;                                        // 0x04A8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSubclassOf<class UClassSelectorTeamTile>     TabButtonClass;                                    // 0x04B8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMargin                                TabButtonPadding;                                  // 0x04C0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4D0[0x8];                                      // 0x04D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           DesignerPreviewTabNames;                           // 0x04D8(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                         ButtonScrollAmount;                                // 0x04E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4EC[0x1C];                                     // 0x04EC(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClassSelectorTabButtons">();
	}
	static class UClassSelectorTabButtons* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClassSelectorTabButtons>();
	}
};

// Class CRD_ClassSelectorUI.ClassSelectorTeamInfoWidget
// 0x0018 (0x0430 - 0x0418)
class UClassSelectorTeamInfoWidget final : public UUserWidget
{
public:
	class UCommonTextBlock*                       TeamName;                                          // 0x0418(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       TeamCountText;                                     // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       TeamDescription;                                   // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClassSelectorTeamInfoWidget">();
	}
	static class UClassSelectorTeamInfoWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClassSelectorTeamInfoWidget>();
	}
};

// Class CRD_ClassSelectorUI.CreativeClassSelectorButton
// 0x0040 (0x1840 - 0x1800)
class UCreativeClassSelectorButton : public UCommonButtonBase
{
public:
	class UCommonTextBlock*                       ButtonTextBlock;                                   // 0x1800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonActionWidget*                    ActionWidget;                                      // 0x1808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   ButtonText;                                        // 0x1810(0x0010)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ButtonInputAction;                                 // 0x1820(0x0018)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bAutoCapitalize;                                   // 0x1838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1839[0x7];                                     // 0x1839(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetButtonText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeClassSelectorButton">();
	}
	static class UCreativeClassSelectorButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeClassSelectorButton>();
	}
};

// Class CRD_ClassSelectorUI.ClassSelectorTeamTile
// 0x00C0 (0x1900 - 0x1840)
class UClassSelectorTeamTile final : public UCreativeClassSelectorButton
{
public:
	uint8                                         Pad_1840[0xA0];                                    // 0x1840(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             PlayerCount;                                       // 0x18E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonLazyImage*                       TeamIconImage;                                     // 0x18E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_18F0[0x10];                                    // 0x18F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPlayerCountSet(int32 NewPlayerCount);
	void OnTeamColorIndexSet(int32 TeamColorIndex);
	void OnTeamIconSet(const struct FCreativeIconOption& NewTeamIcon);
	void OnTeamSet(const struct FMinigameTeam& NewTeamData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClassSelectorTeamTile">();
	}
	static class UClassSelectorTeamTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClassSelectorTeamTile>();
	}
};

// Class CRD_ClassSelectorUI.ClassSelectorTeamTiles
// 0x0048 (0x0488 - 0x0440)
class UClassSelectorTeamTiles final : public UCommonUserWidget
{
public:
	uint8                                         Pad_440[0x8];                                      // 0x0440(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClassSelectorTeamTile*>         TeamTiles;                                         // 0x0448(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UUniformGridPanel*                      RootPanel;                                         // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UClassSelectorTeamTile>     EntryClass;                                        // 0x0460(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DesignerPreviewEntries;                            // 0x0468(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_46C[0x1C];                                     // 0x046C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClassSelectorTeamTiles">();
	}
	static class UClassSelectorTeamTiles* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClassSelectorTeamTiles>();
	}
};

// Class CRD_ClassSelectorUI.CreativeClassItemInfo
// 0x0048 (0x0078 - 0x0030)
class UCreativeClassItemInfo final : public UObject
{
public:
	struct FMinigameClassSlot                     ClassSlot;                                         // 0x0030(0x0040)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeClassItemInfo">();
	}
	static class UCreativeClassItemInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeClassItemInfo>();
	}
};

// Class CRD_ClassSelectorUI.CreativeClassEntry
// 0x0010 (0x1850 - 0x1840)
class UCreativeClassEntry final : public UCreativeClassSelectorButton
{
public:
	uint8                                         Pad_1840[0x8];                                     // 0x1840(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCreativeClassItemInfo*                 ItemInfo;                                          // 0x1848(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnBrowsingLoadout(const bool bBrowsingLoadout);
	void OnClassEntryDataSet(const bool bIsCurrentClass, const bool bIsPendingClass);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeClassEntry">();
	}
	static class UCreativeClassEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeClassEntry>();
	}
};

// Class CRD_ClassSelectorUI.CreativeClassSelector
// 0x0140 (0x06B8 - 0x0578)
class UCreativeClassSelector final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x10];                                     // 0x0578(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UClassSelectorTabButtons*               TabButtons_TeamSelection;                          // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonListView*                        ListView_Classes;                                  // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UCreativeClassItemInfo*>         ClassItemInfos;                                    // 0x0598(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UScrollBox*                             LoadoutScrollBox;                                  // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClassSelectorLoadoutContainer*         LoadoutContainer_Inventory;                        // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClassSelectorLoadoutContainer*         LoadoutContainer_Resources;                        // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_SelectLoadout;                              // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_RandomClass;                                // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                        Switcher_Descriptions;                             // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           ClassAndTeamDescriptionContainer;                  // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           ItemDescriptionContainer;                          // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           InventoryPanel;                                    // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           ResourcesPanel;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       ItemRarity;                                        // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       ItemName;                                          // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       ItemDescription;                                   // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           TeamDescriptionContainer;                          // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClassSelectorTeamInfoWidget*           TeamInfoWidget_FullView;                           // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClassSelectorTeamInfoWidget*           TeamInfoWidget_TeamsOnly;                          // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                        DisplaySwitcher;                                   // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           ClassAndTeamSelectionContainer;                    // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           OnlyTeamSelectionContainer;                        // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           InvalidDataContainer;                              // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClassSelectorTeamTiles*                TeamTiles;                                         // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCreativeClassSelectorButton> TeamSelectionTabClass;                             // 0x0650(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsModalVersion;                                   // 0x0658(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableModalTimeLimit;                             // 0x0659(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_65A[0x2];                                      // 0x065A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ModalTimeLimitInSeconds;                           // 0x065C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_660[0x10];                                     // 0x0660(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EClassSelectorDisplayMode                     DisplayMode;                                       // 0x0670(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDeferRespawn;                                     // 0x0671(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_672[0x6];                                      // 0x0672(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ReturnToClassSelectionInputAction;                 // 0x0678(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         LoadoutScrollPadding;                              // 0x0690(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_694[0x1C];                                     // 0x0694(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	class UCreativeClassItemInfo*                 SelectedClassItemInfo;                             // 0x06B0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleMinigameStateChanged(class AFortMinigame* Minigame, EFortMinigameState MinigameState);
	void OnClassSelectionChanged(const class FText& NewClassName, const class FText& NewClassDescription);
	void OnClassSelectorUIPopulated(const bool bHasValidData);
	void OnLoadoutCommitted(const class FText& NewClassName, const class FText& NewTeamName, const bool bNewLoadout, const bool bDefer, uint8 SelectedClassIndex);
	void OnTimerCountdown(const int32 RemainingTime);

	class UWidget* GetFirstLoadoutItem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeClassSelector">();
	}
	static class UCreativeClassSelector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeClassSelector>();
	}
};

// Class CRD_ClassSelectorUI.CreativeClassSelectorMapTab
// 0x0088 (0x0600 - 0x0578)
class UCreativeClassSelectorMapTab final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x28];                                     // 0x0578(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaMapScreenContainerTabInfo       MapTabInfo;                                        // 0x05A0(0x0058)(Edit, NativeAccessSpecifierPublic)
	class UCreativeClassSelector*                 CreativeClassSelector;                             // 0x05F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetTabName(const class FText& TabName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeClassSelectorMapTab">();
	}
	static class UCreativeClassSelectorMapTab* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeClassSelectorMapTab>();
	}
};

// Class CRD_ClassSelectorUI.Mutator_ClassSelectorUI
// 0x0000 (0x04D0 - 0x04D0)
class AMutator_ClassSelectorUI final : public AFortAthenaMutator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Mutator_ClassSelectorUI">();
	}
	static class AMutator_ClassSelectorUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMutator_ClassSelectorUI>();
	}
};

}

