#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRD_HUDControllerUI

#include "Basic.hpp"

#include "DynamicUI_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class CRD_HUDControllerUI.HUDControllerDynamicUIDirector
// 0x0018 (0x0468 - 0x0450)
class AHUDControllerDynamicUIDirector final : public ADynamicUIDirectorBase
{
public:
	class UDynamicUIScene*                        PlayerInfoWidgetOverrideScene;                     // 0x0450(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UDynamicUIScene*>                AddedScenes;                                       // 0x0458(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void HandleHUDElementVisibilityRefreshed();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDControllerDynamicUIDirector">();
	}
	static class AHUDControllerDynamicUIDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHUDControllerDynamicUIDirector>();
	}
};

// Class CRD_HUDControllerUI.HUDControllerWidgetBase
// 0x0050 (0x0468 - 0x0418)
class UHUDControllerWidgetBase final : public UUserWidget
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UMVVMViewModelBase>         ViewModelClass;                                    // 0x0420(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUserWidget*                            ContentWidget;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMVVMViewModelBase*                     ViewModel;                                         // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_438[0x30];                                     // 0x0438(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleHUDElementVisibilityRefreshed();
	void OnContentWidgetSet();
	void OnViewModelCreated();

	TSoftClassPtr<class UClass> GetContentWidgetClass(const class AFortAthenaMutator_HUDElementVisibility* HUDElementVisibilityMutator) const;
	class UContentWidget* GetContentWidgetContainer() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDControllerWidgetBase">();
	}
	static class UHUDControllerWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDControllerWidgetBase>();
	}
};

}

