#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRD_AudioPlayerRuntime

#include "Basic.hpp"

#include "CRD_AudioPlayerRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class CRD_AudioPlayerRuntime.CreativeAudioComponent
// 0x0198 (0x0270 - 0x00D8)
class UCreativeAudioComponent final : public UActorComponent
{
public:
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StereoSpreadScaleFactor;                           // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E4[0x24];                                      // 0x00E4(0x0024)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeInDuration;                                    // 0x0108(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         FadeOutDuration;                                   // 0x010C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSyncPlayerAudio;                                  // 0x0110(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRestartAudioOnPlay;                               // 0x0111(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECreativeAudioPlayerTargetListener            CanBeHeardBy;                                      // 0x0112(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECreativeAudioPlayerTargetLocation            PlayLocation;                                      // 0x0113(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EAutoplayOptions                              AutoplayOptions;                                   // 0x0114(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMinigameProgressComponent*         FortMinigameProgressComponent;                     // 0x0118(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCreativeProxyManagerComponent*         CreativeProxyManager;                              // 0x0120(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCreativeRegisteredPlayersManagerComponent* CreativeRegisteredPlayersManagerComponent;         // 0x0128(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAudioComponent*                        AudioComponent;                                    // 0x0130(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FUniqueNetIdRepl, class UAudioComponent*> PlayerAudioComponents;                             // 0x0138(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	class ACreativeAudioPlayerReplicationProxy*   ClientCachedProxy;                                 // 0x0188(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundBase*                             LastSoundPlayed;                                   // 0x0190(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FCreativeAudioPlayerData               ServerInstigatorData;                              // 0x0198(0x0040)(Net, Transient, RepNotify, NativeAccessSpecifierPrivate)
	bool                                          bEnabled;                                          // 0x01D8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D9[0x27];                                     // 0x01D9(0x0027)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAudioLoaded;                                      // 0x0200(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCreativeAudioPlayerData               CachedInstigatorData;                              // 0x0208(0x0040)(Transient, NativeAccessSpecifierPrivate)
	TArray<struct FUniqueNetIdRepl>               RegisteredPlayerIds;                               // 0x0248(0x0010)(Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate)
	TArray<struct FUniqueNetIdRepl>               NonRegisteredPlayerIds;                            // 0x0258(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	EAutoplayOptions                              CurrentAutoplayState;                              // 0x0268(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAllPlayersUnregistered();
	void OnAudioLoadComplete(const struct FSoftObjectPath& Audio);
	void OnEnabledStateChanged(bool bIsEnabled);
	void OnMinigameEnded();
	void OnMinigameStarted();
	void OnMinigameStateChanged(class AFortMinigame* Minigame, EFortMinigameState NewMinigameState);
	void OnPlayerAdded(const struct FUniqueNetIdRepl& NetId, bool bIsLocalPlayer);
	void OnPlayerRegistered(const class AFortPlayerState* PlayerState);
	void OnPlayerRemoved(const struct FUniqueNetIdRepl& NetId, bool bIsLocalPlayer);
	void OnPlayerUnregistered(const class AFortPlayerState* PlayerState);
	void OnProxyDataChanged(class ACreativePlayerReplicationProxy* ProxyData);
	void OnRep_RegisteredPlayerIds();
	void OnRep_ServerInstigatorData();
	void PlayAudio(class AController* Player);
	void ResetDevice();
	void RetryClientPlayAudio(const struct FCreativeAudioPlayerData& InstigatorData);
	void RetryUpdateAutoplayStatusOnMinigameAdd(class AFortMinigame* Minigame);
	void SetProperties(const TSoftObjectPtr<class USoundBase>& Audio, const float Volume, const float PlaybackSpeed, const float NewFadeInDuration, const float NewFadeOutDuration, const bool bEnableVolumeAttenuation, const bool bEnableSpatialization, const float StereoSpread, const EAttenuationDistanceModel DistanceModel, const float AttenuationMinDistance, const float AttenuationFalloffDistance, const bool bNewSyncPlayerAudio, const bool bNewRestartAudioOnPlay, const int32 NewCanBeHeardBy, const int32 NewPlayLocation, const int32 NewAutoplayOptions);
	void StopAudio(class AController* Player);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeAudioComponent">();
	}
	static class UCreativeAudioComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeAudioComponent>();
	}
};

// Class CRD_AudioPlayerRuntime.CreativeAudioPlayerReplicationProxy
// 0x0040 (0x0470 - 0x0430)
class ACreativeAudioPlayerReplicationProxy final : public ACreativePlayerReplicationProxy
{
public:
	struct FCreativeAudioPlayerData               InstigatorData;                                    // 0x0430(0x0040)(Net, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeAudioPlayerReplicationProxy">();
	}
	static class ACreativeAudioPlayerReplicationProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreativeAudioPlayerReplicationProxy>();
	}
};

}

