#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRD_AudioMixerRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class CRD_AudioMixerRuntime.CreativeAudioMixerDevice
// 0x0098 (0x1288 - 0x11F0)
class ACreativeAudioMixerDevice final : public AFortCreativeDeviceProp
{
public:
	uint8                                         Pad_11F0[0x8];                                     // 0x11F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundControlBusMix*                    Mix;                                               // 0x11F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundControlBus*                       Bus;                                               // 0x1200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FaderValue;                                        // 0x1208(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECreativeRegisteredPlayerGroups               CanBeHeardBy;                                      // 0x120C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivateInEditMode;                               // 0x120D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivateOnGameStart;                              // 0x120E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_120F[0x1];                                     // 0x120F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UCreativeProxyManagerComponent*         CreativeProxyManagerComponent;                     // 0x1210(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortMinigameProgressComponent*         FortMinigameProgressComponent;                     // 0x1218(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCreativeRegisteredPlayersManagerComponent* CreativeRegisteredPlayersManagerComponent;         // 0x1220(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActorOptionsComponent*             FortActorOptionsComponent;                         // 0x1228(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCachedIsActive;                                   // 0x1230(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1231[0x7];                                     // 0x1231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CachedInstigator;                                  // 0x1238(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ACreativeAudioMixerReplicationProxy*    ClientCachedProxy;                                 // 0x1240(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundControlBusMix*                    CachedBusMix;                                      // 0x1248(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   CachedBusMixName;                                  // 0x1250(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_125C[0x4];                                     // 0x125C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FUniqueNetIdRepl>               RegisteredPlayerIds;                               // 0x1260(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FUniqueNetIdRepl>               NonRegisteredPlayerIds;                            // 0x1270(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	bool                                          bHasUpdatedStateInEditMode;                        // 0x1280(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasUpdatedStateInGameplay;                        // 0x1281(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1282[0x6];                                     // 0x1282(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateMix();
	void DeactivateMix();
	void OnAllPlayersUnregistered();
	void OnMinigameEnded();
	void OnMinigameStarted();
	void OnPlayerAdded(const struct FUniqueNetIdRepl& NetId, bool bIsLocalPlayer);
	void OnPlayerRegistered(const class AFortPlayerState* PlayerState);
	void OnPlayerUnregistered(const class AFortPlayerState* PlayerState);
	void OnPreAnyPropertyChanged();
	void OnProxyDataChanged(class ACreativePlayerReplicationProxy* ProxyData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeAudioMixerDevice">();
	}
	static class ACreativeAudioMixerDevice* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreativeAudioMixerDevice>();
	}
};

// Class CRD_AudioMixerRuntime.CreativeAudioMixerReplicationProxy
// 0x0008 (0x0438 - 0x0430)
class ACreativeAudioMixerReplicationProxy final : public ACreativePlayerReplicationProxy
{
public:
	bool                                          bIsActive;                                         // 0x0430(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeAudioMixerReplicationProxy">();
	}
	static class ACreativeAudioMixerReplicationProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreativeAudioMixerReplicationProxy>();
	}
};

}

