#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRD_GameStreamRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "PlayspaceSystem_classes.hpp"


namespace SDK
{

// Class CRD_GameStreamRuntime.CreativeGameStreamDeviceComponent
// 0x0010 (0x00E8 - 0x00D8)
class UCreativeGameStreamDeviceComponent final : public UActorComponent
{
public:
	FMulticastSparseDelegateProperty_             OnTriggered;                                       // 0x00D8(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UFortMinigameLogicComponent> MinigameLogicComponent;                            // 0x00DC(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddToEndGameQueue();
	void Init(class UFortMinigameLogicComponent* InMinigameLogicComponent);
	void OnMinigameStateChanged(class AFortMinigame* Minigame, const EFortMinigameState NewMinigameState);
	void RemoveFromEndGameQueue();

	bool IsWithinPublishedPlayspace() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeGameStreamDeviceComponent">();
	}
	static class UCreativeGameStreamDeviceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeGameStreamDeviceComponent>();
	}
};

// Class CRD_GameStreamRuntime.CreativeGameStreamDeviceCoordinatorComponent
// 0x0018 (0x00F0 - 0x00D8)
class UCreativeGameStreamDeviceCoordinatorComponent final : public UPlayspaceComponent
{
public:
	TArray<TWeakObjectPtr<class UCreativeGameStreamDeviceComponent>> EndGameCreativeGameStreamDeviceComponentQueue;     // 0x00D8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AFortMinigame>           Minigame;                                          // 0x00E8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnMinigameStateChanged(class AFortMinigame* InMinigame, const EFortMinigameState NewMinigameState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeGameStreamDeviceCoordinatorComponent">();
	}
	static class UCreativeGameStreamDeviceCoordinatorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeGameStreamDeviceCoordinatorComponent>();
	}
};

}

