#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRDLevelInstanceRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class CRDLevelInstanceRuntime.FortAthenaMutator_LevelInstanceDevice
// 0x0008 (0x04D8 - 0x04D0)
class AFortAthenaMutator_LevelInstanceDevice final : public AFortAthenaMutator
{
public:
	TWeakObjectPtr<class ALevelInstanceGameplayVolume> CachedGameplayVolume;                              // 0x04D0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_LevelInstanceDevice">();
	}
	static class AFortAthenaMutator_LevelInstanceDevice* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_LevelInstanceDevice>();
	}
};

// Class CRDLevelInstanceRuntime.LevelInstanceGameplayVolume
// 0x01D0 (0x06A0 - 0x04D0)
class ALevelInstanceGameplayVolume final : public AGameplayVolume
{
public:
	uint8                                         Pad_4D0[0x8];                                      // 0x04D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class ALevelInstanceGameplayVolume* LevelInstanceGameplayVolume, bool bSucceeded)> OnLevelInstanceResolved;                           // 0x04D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E8[0x30];                                     // 0x04E8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bNewDisabled)> OnDisabledStateChanged;                            // 0x0518(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class ALevelInstanceGameplayVolume* LevelInstanceGameplayVolume, const struct FGuid& LevelInstanceGuid)> OnLevelInstanceGuidChanged;                        // 0x0528(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class ALevelInstanceGameplayVolume* LevelInstanceGameplayVolume, const class FString& LevelInstanceName)> OnLevelInstanceNameChanged;                        // 0x0538(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class ALevelInstanceGameplayVolume* LevelInstanceGameplayVolume, int32 SizeX, int32 SizeY, int32 Height)> OnLevelInstanceSizeChanged;                        // 0x0548(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class ALevelInstanceGameplayVolume* LevelInstanceGameplayVolume, TSoftObjectPtr<class UFortCreativeActorCollection> ContentCollection)> OnLevelInstanceContentCollectionChanged;           // 0x0558(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_568[0x1];                                      // 0x0568(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEditMode;                                         // 0x0569(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisabled;                                         // 0x056A(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESpatialLoadingState                          LoadingState;                                      // 0x056B(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LevelInstanceName;                                 // 0x0570(0x0010)(Net, ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInstanceLoaded;                                   // 0x0580(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWantsLevelLoaded;                                 // 0x0581(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_582[0x1];                                      // 0x0582(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bConvertStructuresToProps;                         // 0x0583(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_584[0x4];                                      // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortMinigame*                          CachedMinigame;                                    // 0x0588(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortMutatorListComponent*              MutatorListComponent;                              // 0x0590(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortClassTrackerComponent*             ClassFilterComponent;                              // 0x0598(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class UObject>>            BlacklistedClasses;                                // 0x05A0(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_5B0[0x50];                                     // 0x05B0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  LevelInstanceSaveActorGuid;                        // 0x0600(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortLevelInstanceSaveActor*            LevelInstanceSaveActor;                            // 0x0610(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_618[0x88];                                     // 0x0618(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CheckForOverlappingVolumes();
	class AFortLevelInstanceSaveActor* CreateLevelInstanceSaveActor();
	void HandleActorHealthChanged(class AActor* Actor, float NewHealth);
	void InstantiateFromLevelInstanceSaveActor();
	void LevelInstanceBeingDestroyed();
	void LevelInstanceContentChanged(const class AActor* InstigatorActor);
	void LevelInstanceContentCollectionChanged(const class AActor* InstigatorActor, TSoftObjectPtr<class UFortCreativeActorCollection> ContentCollection);
	void LevelInstanceNameChanged(const class FString& Name_0);
	void LevelInstanceSizeChanged(const class AActor* InstigatorActor);
	void OnMinigameStateChanged(class AFortMinigame* Minigame, EFortMinigameState MiniGameState);
	void OnRep_EditMode();
	void OnRep_InstanceLoaded();
	void OnRep_IsDisabled();
	void OnVolumeChanged();
	void RemoveActorWhenDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void RemoveActorWhenEndPlay(class AActor* Actor, const EEndPlayReason EndPlayReason);
	void SetEditMode(bool bInEditMode);
	void SetLevelInstanceActorGuid(const struct FGuid& InLevelInstanceActorGuid);
	void SetLevelInstanceContentCollection(TSoftObjectPtr<class UFortCreativeActorCollection> ContentCollection);
	void SetLevelInstanceName(const class FString& InName);
	void SetReadyForInstantiation(bool bReady);
	void SetWantsLevelLoaded(bool bInWantsLevelLoaded);

	class FString GetLevelInstanceName() const;
	bool IsDisabled() const;
	bool IsInEditMode() const;
	bool IsPreviewActor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelInstanceGameplayVolume">();
	}
	static class ALevelInstanceGameplayVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALevelInstanceGameplayVolume>();
	}
};

// Class CRDLevelInstanceRuntime.LevelInstanceItemListComponent
// 0x0000 (0x0160 - 0x0160)
class ULevelInstanceItemListComponent final : public UFortMinigameItemContainerComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelInstanceItemListComponent">();
	}
	static class ULevelInstanceItemListComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelInstanceItemListComponent>();
	}
};

}

