#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeQuickOptionsTab

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class CreativeQuickOptionsTab.FortCreativeQuickOptionsTab
// 0x01C8 (0x0740 - 0x0578)
class UFortCreativeQuickOptionsTab final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x30];                                     // 0x0578(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaMapScreenContainerTabInfo       MapScreenContainerTabInfo;                         // 0x05A8(0x0058)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FName                                   QuickOptionsTabNameId;                             // 0x0600(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0610(0x0120)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bIsDefaultActiveTab;                               // 0x0730(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_731[0xF];                                      // 0x0731(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCreativeQuickOptionsTab">();
	}
	static class UFortCreativeQuickOptionsTab* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCreativeQuickOptionsTab>();
	}
};

}

