#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeTests

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum CreativeTests.ECreativeFunctionalTest_StopFireReason
// NumValues: 0x0009
enum class ECreativeFunctionalTest_StopFireReason : uint8
{
	TestNoLongerValid                        = 0,
	PawnNoLongerValid                        = 1,
	NoInventoryOwner                         = 2,
	NoWeaponToEquip                          = 3,
	WrongWeaponEquipped                      = 4,
	FailedToStartFiring                      = 5,
	DueToTimeOut                             = 6,
	DueToAmmoSpent                           = 7,
	ECreativeFunctionalTest_MAX              = 8,
};

// ScriptStruct CreativeTests.ExpectedConsoleVariableForTest
// 0x0030 (0x0030 - 0x0000)
struct FExpectedConsoleVariableForTest final
{
public:
	class FString                                 ConsoleVariable;                                   // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ConsoleVariableValue;                              // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OldConsoleVariableValue;                           // 0x0020(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CreativeTests.CreativeFunctionalTest_ItemCountPair
// 0x0060 (0x0060 - 0x0000)
struct FCreativeFunctionalTest_ItemCountPair final
{
public:
	class UItemDefinitionBase*                    ItemDef;                                           // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedCount;                                     // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FoundCount;                                        // 0x000C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGuid, int32>                     ItemGuidToCount;                                   // 0x0010(0x0050)(Transient, NativeAccessSpecifierPublic)
};

// ScriptStruct CreativeTests.LevelSaveTestStruct
// 0x0038 (0x0038 - 0x0000)
struct FLevelSaveTestStruct final
{
public:
	TSoftObjectPtr<class UObject>                 Object;                                            // 0x0000(0x0030)(SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0030(0x0008)(ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CreativeTests.LevelSaveTestStructArray
// 0x0010 (0x0010 - 0x0000)
struct FLevelSaveTestStructArray final
{
public:
	TArray<struct FLevelSaveTestStruct>           Array;                                             // 0x0000(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};

}

