#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeEmporiumUI

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "UMG_classes.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CreativeEmporiumUI_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CommonInput_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Class CreativeEmporiumUI.EmporiumBrowserFilterEntry
// 0x0070 (0x1870 - 0x1800)
class UEmporiumBrowserFilterEntry final : public UCommonButtonBase
{
public:
	TMulticastInlineDelegate<void(bool bIsEnabled, class UObject* ListItemObject)> OnFilterEnabled;                                   // 0x1800(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsSelected, class UEmporiumBrowserFilterEntry* Entry)> OnFilterSelected;                                  // 0x1810(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UEmporiumBrowserFilterEntry* Entry)> OnFilterHovered;                                   // 0x1820(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* ListItemObject)> OnWidgetDestroyed;                                 // 0x1830(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UCommonTextBlock*                       TextBlock_FilterName;                              // 0x1840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFilterActive;                                     // 0x1848(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1849[0x7];                                     // 0x1849(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEmporiumBrowserTag*                    Tag;                                               // 0x1850(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   ButtonText;                                        // 0x1858(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1868[0x8];                                     // 0x1868(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetIsFilterActive(bool bInFilterActive);
	void UpdateButtonText();
	void UpdateCheckMarkState(bool bIsChecked);
	void UpdateItemCount(int32 ItemCount);

	bool IsFilterActive() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmporiumBrowserFilterEntry">();
	}
	static class UEmporiumBrowserFilterEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmporiumBrowserFilterEntry>();
	}
};

// Class CreativeEmporiumUI.EmporiumBrowserFiltersPanel
// 0x0318 (0x0758 - 0x0440)
class UEmporiumBrowserFiltersPanel final : public UCommonUserWidget
{
public:
	TMulticastInlineDelegate<void()>              OnFilterChanged;                                   // 0x0440(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnSortChanged;                                     // 0x0450(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnSortPanelToggled;                                // 0x0460(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsFocused)> OnFocusChanged;                                    // 0x0470(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName CategoryID)> OnCategoryActivated;                               // 0x0480(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName CategoryID)> OnCategoryFocused;                                 // 0x0490(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A0[0x18];                                     // 0x04A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnUpdateCategoryCounts;                            // 0x04B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C8[0x88];                                     // 0x04C8(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortEmporiumFilterCategoryHeader> FilterSectionHeaderWidgetClass;                    // 0x0550(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortEmporiumFilterCategoryHeader> FilterCategoryHeaderWidgetClass;                   // 0x0558(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortEmporiumFilterCategoryHeader> FilterHomeHeaderWidgetClass;                       // 0x0560(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UEmporiumBrowserFilterEntry> FilterEntryWidgetClass;                            // 0x0568(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortEmporiumSortEntry>         SortEntries;                                       // 0x0570(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortEmporiumFilterEntry>       FilterEntries;                                     // 0x0580(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortEmporiumPriceFilterEntry>  PriceFilterEntries;                                // 0x0590(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           LicenseFilterEntries;                              // 0x05A0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                   DefaultCategoryFilter;                             // 0x05B0(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortEmporiumItemTagFilterMode                DefaultTagFilterMode;                              // 0x05BC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5BD[0x53];                                     // 0x05BD(0x0053)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             ScrollBox_FilterScroll;                            // 0x0610(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEmporiumBrowserFilterEntry*            Button_All;                                        // 0x0618(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_SortAndFilter;                              // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_628[0x38];                                     // 0x0628(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UFortCreativeContentBrowserTabPanelBase> LastSelectedTab;                                   // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_668[0xD0];                                     // 0x0668(0x00D0)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CycleSectionsInputActionRow;                       // 0x0738(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_750[0x8];                                      // 0x0750(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ExcludeItemDetailTag(const class FName& TagID);
	struct FDataTableRowHandle GetClearSearchInputAction();
	struct FDataTableRowHandle GetFocusSearchInputAction();
	struct FSlateBrush GetIconForInputAction(bool* bOutFoundIcon, const struct FDataTableRowHandle& InInputActionRow);
	void HandleCategoryActivated(bool bIsExpanded, class UObject* ListItemObject);
	void HandleCategoryButtonClicked(const class FName CategoryID);
	void HandleCategoryButtonFocused(const class FName CategoryID);
	void HandleCategoryExpansion(class UObject* ListItemObject);
	void HandleCategoryWidgetDestroyed(class UObject* ListItemObject);
	void HandleFilterEnabled(bool bIsFilterEnabled, class UObject* ListItemObject);
	void HandleFilterSelected(bool bIsFilterEnabled, class UEmporiumBrowserFilterEntry* Entry);
	void HandleSearchTextChanged(const class FText& Text);
	void HandleShowAllEnabled(bool bShowAllItems, class UObject* ListItemObject);
	void HandleSortAndFilterClicked();
	void IncludeItemDetailTag(const class FName& TagID);
	class UWidget* NavigateToNextSection(bool bReverse);
	void OnClearSearchProgress(float Progress);
	void OnPopulateCategories(const TArray<class FName>& CategoryIDs);
	void OnSetPanelLayout(EFortEmporiumLayoutVersion LayoutVersion);
	void OnSetSearchFocused();
	void OnSetSearchText(const class FText& NewSearchText);
	void OnSetSearchVisible(bool bVisible);
	void OnUpdateActiveCategory(const class FName& CategoryID);
	void OnUpdateCategoryCountDisplay(const class FName& CategoryID, int32 NumItems, bool bHideIfEmpty);
	class UWidget* RefreshSideNavigationFocus(class FName* OutFocusCategory);
	void ResetSearch();
	void SetActiveCategory(class FName CategoryID, bool bAllowCategoryModal);
	void SetItemDetailTags(const TArray<class FName>& TagIDs);

	int32 GetFilterCount() const;
	class FName GetHomeSectionID() const;
	const TArray<class FName> GetIncludedTags() const;
	const TArray<class FName> GetItemDetailTags() const;
	int32 GetNumFilterSectionWidgets() const;
	bool IsInFocusPath() const;
	bool IsShowingCategoryModal() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmporiumBrowserFiltersPanel">();
	}
	static class UEmporiumBrowserFiltersPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmporiumBrowserFiltersPanel>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumFilterCategoryHeader
// 0x0038 (0x0450 - 0x0418)
class UFortEmporiumFilterCategoryHeader final : public UUserWidget
{
public:
	TMulticastInlineDelegate<void(bool bIsExpanded, class UObject* ListItemObject)> OnCategoryActivated;                               // 0x0418(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* ListItemObject)> OnWidgetDestroyed;                                 // 0x0428(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* ListItemObject)> OnExpandCategory;                                  // 0x0438(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UEmporiumBrowserTag*                    Tag;                                               // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ActivateCategory(bool bExpanded);
	void AddSubcategoryWidget(class UWidget* SubcategoryWidget);
	void ClearSubcategoryWidgets();
	void EnableCategoryExpansion(bool bShow);
	void ExpandCategory(bool bExpanded);
	void ExpandSection();
	void SetCategoryText(const class FText& NewButtonText);
	void SetCycleSectionIcon(const struct FSlateBrush& CycleSectionIcon);
	void SetSubcategoryCount(int32 NewCount);
	void ShowCategoryActive(bool bIsActive);
	void ShowCycleSectionPrompt(bool bShow);
	void ShowUpperSpacer(bool bShow);
	void UpdateCategoryCount(int32 NewCount, bool bHideIfEmpty);

	class UCommonButtonBase* GetCategoryButton() const;
	TArray<class UWidget*> GetSubcategoryWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumFilterCategoryHeader">();
	}
	static class UFortEmporiumFilterCategoryHeader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumFilterCategoryHeader>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumFiltersSubPanel
// 0x0048 (0x0460 - 0x0418)
class UFortEmporiumFiltersSubPanel final : public UUserWidget
{
public:
	TMulticastInlineDelegate<void(bool bIsEnabled, class UObject* ListItemObject)> OnFilterEnabled;                                   // 0x0418(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsEnabled, class UObject* ListItemObject)> OnShowAllEnabled;                                  // 0x0428(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UEmporiumBrowserFilterEntry> FilterEntryWidgetClass;                            // 0x0438(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEmporiumBrowserFilterEntry*            Button_All;                                        // 0x0440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEmporiumBrowserFilterEntry*            Button_LastSelected;                               // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumItemListTabPanel*          CachedItemTab;                                     // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_458[0x8];                                      // 0x0458(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearFilterWidgets();
	void HandleFilterEnabled(bool bIsFilterEnabled, class UObject* ListItemObject);
	void HandleFilterHovered(class UEmporiumBrowserFilterEntry* Entry);
	void HandleFilterSelected(bool bIsFilterEnabled, class UEmporiumBrowserFilterEntry* Entry);
	void HandleShowAllEnabled(bool bShowAllItems, class UObject* ListItemObject);
	void OnAddSubcategoryWidget(class UEmporiumBrowserFilterEntry* SubcategoryWidget);
	void OnFilterSelected(class UEmporiumBrowserFilterEntry* SubcategoryWidget);
	void OnUpdateFilterEntries(const TArray<class FName>& IncludedTags);
	void OnUpdateSubcategoryCount(const class FName& CategoryID, int32 Count, bool bShowOnEmpty);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumFiltersSubPanel">();
	}
	static class UFortEmporiumFiltersSubPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumFiltersSubPanel>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumHomeEntryObjectWrapper
// 0x0008 (0x0038 - 0x0030)
class UFortEmporiumHomeEntryObjectWrapper final : public UObject
{
public:
	class UFortEmporiumItemListTabPanel*          TabPanel;                                          // 0x0030(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumHomeEntryObjectWrapper">();
	}
	static class UFortEmporiumHomeEntryObjectWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumHomeEntryObjectWrapper>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumHomeListEntry
// 0x0238 (0x0650 - 0x0418)
class UFortEmporiumHomeListEntry final : public UUserWidget
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortEmporiumHomeListView*              ParentView;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_428[0x48];                                     // 0x0428(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxItemsToShow;                                    // 0x0470(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortEmporiumItemListTabPanel*          TabPanel;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_CategoryLabel;                                // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCreativeItemTileView*            HomeListView_ItemOptions;                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_490[0x1C0];                                    // 0x0490(0x01C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateOverflowDisplay(class UAthenaCreativeItemTileButton* OverflowTile, int32 OverflowCount);
	void UpdateWarningMessage(bool bShowMessage);

	EFortItemCardSize GetCardSizeForCategory() const;
	bool GetCollapseBorderPadFlagForCategory() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumHomeListEntry">();
	}
	static class UFortEmporiumHomeListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumHomeListEntry>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumHomeListView
// 0x0280 (0x1000 - 0x0D80)
class UFortEmporiumHomeListView final : public UCommonListView
{
public:
	uint8                                         Pad_D78[0xB8];                                     // 0x0D78(0x00B8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortEmporiumItemListTabPanel*>  TabPanelList;                                      // 0x0E30(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E40[0x1C0];                                    // 0x0E40(0x01C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UWidget* GetFocusWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumHomeListView">();
	}
	static class UFortEmporiumHomeListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumHomeListView>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumHomeTabPanel
// 0x0060 (0x0620 - 0x05C0)
class UFortEmporiumHomeTabPanel final : public UFortCreativeContentBrowserTabPanelBase
{
public:
	uint8                                         Pad_5C0[0x48];                                     // 0x05C0(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   FeaturedItemTag;                                   // 0x0608(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_614[0x4];                                      // 0x0614(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortEmporiumHomeListView*              FortEmporiumHomeListView_Options;                  // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnSetPanelLayout(EFortEmporiumLayoutVersion LayoutVersion);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumHomeTabPanel">();
	}
	static class UFortEmporiumHomeTabPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumHomeTabPanel>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumItem
// 0x0008 (0x00B0 - 0x00A8)
class UFortEmporiumItem final : public UFortItem
{
public:
	class UFortEmporiumItemDefinition*            ItemDefinition;                                    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumItem">();
	}
	static class UFortEmporiumItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumItem>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumItemDefinition
// 0x0108 (0x0540 - 0x0438)
class UFortEmporiumItemDefinition final : public UFortItemDefinition
{
public:
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UFortEmporiumItemDefinition* ItemDefinition)> OnItemThumbnailDownloaded;                         // 0x0440(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_450[0xF0];                                     // 0x0450(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const struct FFortEmporiumItemData GetEmporiumItemData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumItemDefinition">();
	}
	static class UFortEmporiumItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumItemDefinition>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumItemDetailsPanel
// 0x0070 (0x04B0 - 0x0440)
class UFortEmporiumItemDetailsPanel final : public UCommonUserWidget
{
public:
	uint8                                         Pad_440[0x30];                                     // 0x0440(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ItemDetailTagsInputRowHandle;                      // 0x0470(0x0018)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemDefinitionBase*                    CachedItemDefinition;                              // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonVisibilitySwitcher*              Switcher_Details;                                  // 0x0498(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortEmporiumItemInfo*                  ItemDetails;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaInventoryItemInfo*               LegacyItemDetails;                                 // 0x04A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleItemTagSelected(class FName TagID, bool bSelected);
	void HideAdditionalButtons();
	void HideExtendedDataPanel();
	bool IsShowingAdditionalButtons();
	void SetActiveItemDetailTags(const TArray<class FName>& ActiveTags);
	void SetItemDetails(const class UFortItem* FortItem, const bool bUseLargeThumbnail, const bool bAllowInteractiveTags);
	void SetItemToDetail(const class UFortItem* InItemToDetail, const bool bUseLargeThumbnail, const bool bAllowInteractiveTags);
	void SetSpecialItemTagVisibility(const class FName& SpecialItemTag);
	void ShowExtendedDataPanel();
	void SwitchItemDetailsPanel(bool bUseLegacy);
	void ToggleItemDetailsPanel();
	void UpdateItemDetailsDisplay(bool bShowItemDetails);

	TArray<class FName> BP_GetSpecialItemTags() const;
	bool HasLegacyItemDetailsPanel() const;
	bool IsShowingExtendedDataPanel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumItemDetailsPanel">();
	}
	static class UFortEmporiumItemDetailsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumItemDetailsPanel>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumItemInfo
// 0x0010 (0x0450 - 0x0440)
class UFortEmporiumItemInfo final : public UCommonUserWidget
{
public:
	TArray<class FName>                           HiddenTags;                                        // 0x0440(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void SetSelectItemTagsIcon(const struct FSlateBrush& SelectItemTagsIcon);
	void SetSelectItemTagsPrompt(const class FText& Prompt);
	void SetTagFocus();
	void ShowSelectItemTagsPrompt(bool bShowPrompt);
	void UpdateWithFortItem(const class UFortItem* Item, const bool bAllowInteractiveTags);

	bool HasFocusableTags() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumItemInfo">();
	}
	static class UFortEmporiumItemInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumItemInfo>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumCategoryEntry
// 0x0020 (0x0050 - 0x0030)
class UFortEmporiumCategoryEntry final : public UObject
{
public:
	class FString                                 Path;                                              // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Hash;                                              // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumCategoryEntry">();
	}
	static class UFortEmporiumCategoryEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumCategoryEntry>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumItemListMenu
// 0x0888 (0x0E00 - 0x0578)
class UFortEmporiumItemListMenu final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x30];                                     // 0x0578(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortCreativeItemListPanelData> PanelDataClass;                                    // 0x05A8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             ItemListCategorySource;                            // 0x05B0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortCreativeItemListPanelData*         ItemListPanelData;                                 // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortEmporiumItemListTabPanel> InventoryTabClass;                                 // 0x05C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortCreativeLevelManagementTabPanel> LevelManagementTabClass;                           // 0x05C8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortEmporiumHomeTabPanel>  HomeTabClass;                                      // 0x05D0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonButtonBase>          InventoryTabButton;                                // 0x05D8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class FText>                Map_CreativeBetaTagNames;                          // 0x05E0(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<ECommonInputType, struct FFortEmporiumKeyEdgeMappings> Map_ToggleFilterFocusKeys;                         // 0x0630(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<ECommonInputType, struct FFortEmporiumKeyEdgeMappings> Map_ToggleFilterSubPanelFocusKeys;                 // 0x0680(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<ECommonInputType, struct FFortEmporiumKeyEdgeMappings> Map_CycleTagFilterModeModifierKeys;                // 0x06D0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<ECommonInputType, struct FFortEmporiumKeyEdgeMappings> Map_ClearTagFiltersModifierKeys;                   // 0x0720(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<ECommonInputType, struct FFortEmporiumKeyEdgeMappings> Map_ToggleSidePanelDockingModifierKeys;            // 0x0770(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FKey                                   ToggleSidePanelDockingKey;                         // 0x07C0(0x0020)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FKey                                   ToggleSubPanelMode;                                // 0x07E0(0x0020)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    FocusSearchInputActionRow;                         // 0x0800(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_818[0x8];                                      // 0x0818(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ClearSearchInputActionRow;                         // 0x0820(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_838[0x8];                                      // 0x0838(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CycleSortInputActionRow;                           // 0x0840(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_858[0x8];                                      // 0x0858(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortEmporiumItemListTabPanel*          ChestTabPanel;                                     // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCreativeLevelManagementTabPanel*   LevelManagementTabPanel;                           // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumHomeTabPanel*              HomeTabPanel;                                      // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumItemListTabPanel*          FabTabPanel;                                       // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumItemListTabPanel*          SubItemsTabPanel;                                  // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   FabTabNameId;                                      // 0x0888(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_894[0xC];                                      // 0x0894(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x08A0(0x0120)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FAthenaMapScreenContainerTabInfo       MapScreenContainerTabInfo;                         // 0x09C0(0x0058)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bIsDefaultActiveTab;                               // 0x0A18(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAddItemToInventoryOnEquip;                        // 0x0A19(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLoadItemsOnInitialized;                           // 0x0A1A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A1B[0x1];                                      // 0x0A1B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastUsedSlot;                                      // 0x0A1C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A20[0x8];                                      // 0x0A20(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UFortCreativeContentBrowserTabPanelBase*> TabMap;                                            // 0x0A28(0x0050)(ExportObject, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A78[0x238];                                    // 0x0A78(0x0238)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortEmporiumItemDefinition*>    EmporiumItemDefinitionList;                        // 0x0CB0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_CC0[0x18];                                     // 0x0CC0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonVisibilitySwitcher*              Switcher_SidePanels;                               // 0x0CD8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*              Switcher_Categories;                               // 0x0CE0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                        Switcher_ItemTabWarnings;                          // 0x0CE8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_ChestEmpty;                                // 0x0CF0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_TabEmpty;                                  // 0x0CF8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_DownloadingFabCategories;                  // 0x0D00(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_FabCategoriesNotLoaded;                    // 0x0D08(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                        Switcher_CommandBar;                               // 0x0D10(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_ChestCommands;                             // 0x0D18(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_VendCommands;                              // 0x0D20(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCreativeMenuQuickbar*              MenuQuickbar_QuickBars;                            // 0x0D28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ResetChest;                                 // 0x0D30(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CreateChest;                                // 0x0D38(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_AddToQuickBar;                              // 0x0D40(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_OpenItem;                                   // 0x0D48(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PlaceNow;                                   // 0x0D50(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Equip;                                      // 0x0D58(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_AddToChest;                                 // 0x0D60(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Drop;                                       // 0x0D68(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CreateLlama;                                // 0x0D70(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_RemoveFromChest;                            // 0x0D78(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_SearchFilters;                             // 0x0D80(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonAnimatedSwitcher*                Switcher_LeftPanel;                                // 0x0D88(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEmporiumBrowserFiltersPanel*           FiltersPanel;                                      // 0x0D90(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumFiltersSubPanel*           FiltersSubPanel;                                   // 0x0D98(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumItemDetailsPanel*          SubTabItemDetailsPanel;                            // 0x0DA0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCustomizationPickerSortAndFilterBlade* Blade_SortAndFilter;                               // 0x0DA8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumItemDetailsPanel*          ItemDetailsSidePanel_DefaultSidePanel;             // 0x0DB0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*              Switcher_ProductPage;                              // 0x0DB8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_ItemBrowser;                               // 0x0DC0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumItemDetailsPanel*          ItemProductPagePanel;                              // 0x0DC8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                        Switcher_InventoryPermission;                      // 0x0DD0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_EmporiumPanel;                             // 0x0DD8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_InventoryNotAllowed;                       // 0x0DE0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_EditorDisconnected;                        // 0x0DE8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_InitializingInventory;                     // 0x0DF0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_DF8[0x8];                                      // 0x0DF8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AddSelectionToQuickBar();
	void CycleTagFilterMode();
	bool DropItem(const struct FFortItemEntry& SelectedItem);
	bool EquipItem(const struct FFortItemEntry& ItemEntry);
	bool EquipSelection();
	void FocusSidePanel(bool bIsRightPanel, bool bFocus);
	void HandleAddSelectionToMoveToolComplete();
	void HandleCategoryActivated(class FName CategoryID);
	void HandleCategoryButtonClicked(const class FName& CategoryID);
	void HandleCategoryFocused(class FName CategoryID);
	void HandleChestItemCountChanged(int32 Count);
	void HandleEquipItem(const struct FFortItemEntry& ItemEntry);
	void HandleFilterButtonClicked(class FName FilterNameId, class UCommonButtonBase* NewButton);
	void HandleFilterChanged();
	void HandleFilterPanelIsFocused(bool bIsFocused);
	void HandleGlobalSortPanelToggle();
	void HandleHomeItemClicked(class UFortEmporiumItemListTabPanel* ItemTab);
	void HandleItemClicked(const struct FFortItemEntry& ItemEntry);
	void HandleItemDoubleClicked(const struct FFortItemEntry& ItemEntry);
	void HandleItemTagSelected(const class FName& TagID, bool bSelected);
	void HandleItemThumbnailDownloaded(class UFortEmporiumItemDefinition* ItemDefinition);
	void HandleModalHitBlockerClicked();
	void HandleQuickbarPanelIsFocused(bool bIsFocused);
	void HandleQuickbarStateChanged(const EFortContentBrowserQuickbarState State);
	void HandleSelectionChanged(class UFortCreativeContentBrowserTabPanelBase* Tab);
	void HandleSortButtonClicked(class FName SortNameId, class UCommonButtonBase* NewButton);
	void HandleSortChanged();
	void HandleSubFilterEnabled(bool bIsFilterEnabled, class UObject* ListItemObject);
	void HandleSubFilterShowAllEnabled(bool bIsFilterEnabled, class UObject* ListItemObject);
	void HandleTabItemDetailClicked(const class FName& TagID);
	void HandleTabSelected(class FName TabId, bool bCaptureFocus);
	void HandleTabSortButtonClicked();
	void HandleUpdateCategoryCounts();
	void InitializeFabTab();
	void InitializeTabs();
	void LoadFabItems();
	void NativeOnBuiltInItemsLoaded();
	void NativeOnItemsLoaded();
	void NativeOnItemsRefreshed();
	void OnAnimateSidePanel(bool bIsRightPanel, bool bShow);
	void OnBuiltInItemsLoaded();
	void OnContentRatingFilterChanged();
	void OnCreativeQuickbarComponentLoaded();
	void OnExitSubTab();
	void OnFabCategoryListLoaded(bool bSuccess, const class FString& JSONString);
	void OnFabItemQueryComplete(bool bSuccess, const class FString& JSONString);
	void OnItemEquipped(const struct FFortItemEntry& EquippedItemEntry);
	void OnItemsLoaded();
	void OnQuickbarStateChanged(const EFortContentBrowserQuickbarState State);
	void OnSearchFiltersVisibilityChanged(bool bIsVisible);
	void OnSelectionOpened(const class UItemDefinitionBase* SelectedItemDefinition);
	void OnSetPanelLayout(EFortEmporiumLayoutVersion LayoutVersion);
	bool OnShouldAllowCommandBar(class UUserWidget* FocusPathWidget, bool* bAllowCommandBar);
	void OnShowCategoryModal(bool bShowModal);
	void OnShowGridBlocker(bool bShow);
	void OnSidePanelDockToggled();
	void OnSubPanelModeChanged();
	void OnTabAdded(class UFortCreativeContentBrowserTabPanelBase* Tab);
	void OnTabChanged();
	void OnUpdateCategoryLabel(const class FText& SectionLabel, const class FText& CategoryLabel);
	void OnUpdateCommandBarVisibility(bool bShowBar);
	void OnUpdateTagFilterButton(const EFortEmporiumItemTagFilterMode Mode);
	bool OpenSelection();
	bool PlaceSelectionInMoveTool();
	void RefreshTabWarningState();
	void SetActiveTab(class UFortCreativeContentBrowserTabPanelBase* Tab, bool bCaptureFocus);
	void SetIsItemCommandsEnabled(bool bInIsItemCommandEnabled);
	void SetSubTabOpened(class UItemDefinitionBase* ItemDefinition);
	void SpawnContainer(TSubclassOf<class AActor> SupplyDropClass);
	void SwitchItemDetailsPanel(bool bUseLegacy);
	void UpdateBackButtonText(bool bFilterFocus);
	void UpdateDetailsPanel();
	void UpdatePermissionsDisplay();

	bool CanAddToChest(const struct FFortItemEntry& SelectedItem) const;
	bool CanDropItem(const struct FFortItemEntry& SelectedItem) const;
	bool CanEquip(const struct FFortItemEntry& SelectedItem) const;
	struct FFortItemEntry GetCurrentSelection() const;
	class UFortCreativeContentBrowserTabPanelBase* GetCurrentTab() const;
	class FName GetLastSelectedTabName() const;
	class UItemDefinitionBase* GetSubTabSelectedItemDefinition() const;
	bool IsSidePanelOpen(bool bRightPanel) const;
	bool IsSubTabOpened() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumItemListMenu">();
	}
	static class UFortEmporiumItemListMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumItemListMenu>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumItemListTabPanel
// 0x0438 (0x09F8 - 0x05C0)
class UFortEmporiumItemListTabPanel final : public UFortCreativeContentBrowserTabPanelBase
{
public:
	uint8                                         Pad_5C0[0x8];                                      // 0x05C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 count)>   OnSourceItemCountChanged;                          // 0x05C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(struct FFortItemEntry& ItemClicked)> OnItemClickedDelegate;                             // 0x05D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(struct FFortItemEntry& ItemClicked)> OnItemDoubleClickedDelegate;                       // 0x05E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_5F8[0x30];                                     // 0x05F8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCreativeItemTileView*            CreativeTileView_ItemOptions;                      // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Sort;                                       // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortItemEntry                         CurrentItemEntry;                                  // 0x0638(0x01B8)(BlueprintVisible, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(int32 count)>   OnItemCountChanged;                                // 0x07F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TArray<struct FFortItemEntry>                 Items;                                             // 0x0800(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FFortItemEntry>                 SourceItems;                                       // 0x0810(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_820[0x1C0];                                    // 0x0820(0x01C0)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortEmporiumItemListMenu*              EmporiumItemListMenuParent;                        // 0x09E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9E8[0x10];                                     // 0x09E8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddItem(struct FFortItemEntry& ItemToAdd);
	void AddItemToSource(struct FFortItemEntry& ItemToAdd);
	void ClearAllItems();
	void ClearFilteredItems();
	void FocusCurrentSelection();
	void HandleItemDetailTagSelected(const class FName& TagID);
	bool IsEmpty();
	void ItemEquipped(const struct FFortItemEntry& Item);
	void OnSetPanelLayout(EFortEmporiumLayoutVersion LayoutVersion);
	void RemoveSelectedItem();
	void RestoreLastSelection();
	void SetActiveItemDetailTags(const TArray<class FName>& TagIDs);
	void ShowTopButtonBar(bool bShow);
	void UpdateSortButton(const class FText& SortType);
	void UpdateTabHeader();

	bool CanPlayerCreateInVolume() const;
	EFortItemCardSize GetCardSizeForCategory() const;
	bool GetCollapseBorderPadFlagForCategory() const;
	class UItemDefinitionBase* GetSubTabSelectedItemDefinition() const;
	bool IsSubTabOpened() const;
	bool ShowLegacyItemDetailsPanel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumItemListTabPanel">();
	}
	static class UFortEmporiumItemListTabPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumItemListTabPanel>();
	}
};

// Class CreativeEmporiumUI.EmporiumBrowserTag
// 0x0010 (0x0040 - 0x0030)
class UEmporiumBrowserTag final : public UObject
{
public:
	class FName                                   TagID;                                             // 0x0030(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmporiumBrowserTag">();
	}
	static class UEmporiumBrowserTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmporiumBrowserTag>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumUtilities
// 0x0000 (0x0030 - 0x0030)
class UFortEmporiumUtilities final : public UBlueprintFunctionLibrary
{
public:
	static bool BP_GetCategoryHierarchyEntry(const class FName& CategoryID, struct FFortEmporiumFilterCategory* OutFoundCategory);
	static const class FText GetCategoryDisplayName(const class FName& CategoryID);
	static TArray<class FName> GetCreativeTagIDs(const class UItemDefinitionBase* ItemDefinition);
	static class FText GetCreativeTagLabel(const class FName& TagID, bool* bOutIsBeta);
	static EFortEmporiumLayoutVersion GetLayoutVersion(const class UUserWidget* ContextWidget);
	static class FName GetShowAllButtonID();
