#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeEmporiumUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CreativeEmporiumUI_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CreativeEmporiumUI.EmporiumBrowserFilterEntry.SetIsFilterActive
// 0x0001 (0x0001 - 0x0000)
struct EmporiumBrowserFilterEntry_SetIsFilterActive final
{
public:
	bool                                          bInFilterActive;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFilterEntry.UpdateCheckMarkState
// 0x0001 (0x0001 - 0x0000)
struct EmporiumBrowserFilterEntry_UpdateCheckMarkState final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFilterEntry.UpdateItemCount
// 0x0004 (0x0004 - 0x0000)
struct EmporiumBrowserFilterEntry_UpdateItemCount final
{
public:
	int32                                         ItemCount;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFilterEntry.IsFilterActive
// 0x0001 (0x0001 - 0x0000)
struct EmporiumBrowserFilterEntry_IsFilterActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.ExcludeItemDetailTag
// 0x000C (0x000C - 0x0000)
struct EmporiumBrowserFiltersPanel_ExcludeItemDetailTag final
{
public:
	class FName                                   TagID;                                             // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.GetClearSearchInputAction
// 0x0018 (0x0018 - 0x0000)
struct EmporiumBrowserFiltersPanel_GetClearSearchInputAction final
{
public:
	struct FDataTableRowHandle                    ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.GetFocusSearchInputAction
// 0x0018 (0x0018 - 0x0000)
struct EmporiumBrowserFiltersPanel_GetFocusSearchInputAction final
{
public:
	struct FDataTableRowHandle                    ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.GetIconForInputAction
// 0x00F0 (0x00F0 - 0x0000)
struct EmporiumBrowserFiltersPanel_GetIconForInputAction final
{
public:
	bool                                          bOutFoundIcon;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    InInputActionRow;                                  // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ReturnValue;                                       // 0x0020(0x00D0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleCategoryActivated
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleCategoryActivated final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ListItemObject;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleCategoryButtonClicked
// 0x000C (0x000C - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleCategoryButtonClicked final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleCategoryButtonFocused
// 0x000C (0x000C - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleCategoryButtonFocused final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleCategoryExpansion
// 0x0008 (0x0008 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleCategoryExpansion final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleCategoryWidgetDestroyed
// 0x0008 (0x0008 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleCategoryWidgetDestroyed final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleFilterEnabled
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleFilterEnabled final
{
public:
	bool                                          bIsFilterEnabled;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ListItemObject;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleFilterSelected
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleFilterSelected final
{
public:
	bool                                          bIsFilterEnabled;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEmporiumBrowserFilterEntry*            Entry;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleSearchTextChanged
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleSearchTextChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.HandleShowAllEnabled
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_HandleShowAllEnabled final
{
public:
	bool                                          bShowAllItems;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ListItemObject;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.IncludeItemDetailTag
// 0x000C (0x000C - 0x0000)
struct EmporiumBrowserFiltersPanel_IncludeItemDetailTag final
{
public:
	class FName                                   TagID;                                             // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.NavigateToNextSection
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_NavigateToNextSection final
{
public:
	bool                                          bReverse;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.OnClearSearchProgress
// 0x0004 (0x0004 - 0x0000)
struct EmporiumBrowserFiltersPanel_OnClearSearchProgress final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.OnPopulateCategories
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_OnPopulateCategories final
{
public:
	TArray<class FName>                           CategoryIDs;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.OnSetPanelLayout
// 0x0001 (0x0001 - 0x0000)
struct EmporiumBrowserFiltersPanel_OnSetPanelLayout final
{
public:
	EFortEmporiumLayoutVersion                    LayoutVersion;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.OnSetSearchText
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_OnSetSearchText final
{
public:
	class FText                                   NewSearchText;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.OnSetSearchVisible
// 0x0001 (0x0001 - 0x0000)
struct EmporiumBrowserFiltersPanel_OnSetSearchVisible final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.OnUpdateActiveCategory
// 0x000C (0x000C - 0x0000)
struct EmporiumBrowserFiltersPanel_OnUpdateActiveCategory final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.OnUpdateCategoryCountDisplay
// 0x0014 (0x0014 - 0x0000)
struct EmporiumBrowserFiltersPanel_OnUpdateCategoryCountDisplay final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumItems;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideIfEmpty;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.RefreshSideNavigationFocus
// 0x0018 (0x0018 - 0x0000)
struct EmporiumBrowserFiltersPanel_RefreshSideNavigationFocus final
{
public:
	class FName                                   OutFocusCategory;                                  // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.SetActiveCategory
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_SetActiveCategory final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowCategoryModal;                               // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.SetItemDetailTags
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_SetItemDetailTags final
{
public:
	TArray<class FName>                           TagIDs;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.GetFilterCount
// 0x0004 (0x0004 - 0x0000)
struct EmporiumBrowserFiltersPanel_GetFilterCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.GetHomeSectionID
// 0x000C (0x000C - 0x0000)
struct EmporiumBrowserFiltersPanel_GetHomeSectionID final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.GetIncludedTags
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_GetIncludedTags final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.GetItemDetailTags
// 0x0010 (0x0010 - 0x0000)
struct EmporiumBrowserFiltersPanel_GetItemDetailTags final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.GetNumFilterSectionWidgets
// 0x0004 (0x0004 - 0x0000)
struct EmporiumBrowserFiltersPanel_GetNumFilterSectionWidgets final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.IsInFocusPath
// 0x0001 (0x0001 - 0x0000)
struct EmporiumBrowserFiltersPanel_IsInFocusPath final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.EmporiumBrowserFiltersPanel.IsShowingCategoryModal
// 0x0001 (0x0001 - 0x0000)
struct EmporiumBrowserFiltersPanel_IsShowingCategoryModal final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.ActivateCategory
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumFilterCategoryHeader_ActivateCategory final
{
public:
	bool                                          bExpanded;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.AddSubcategoryWidget
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumFilterCategoryHeader_AddSubcategoryWidget final
{
public:
	class UWidget*                                SubcategoryWidget;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.EnableCategoryExpansion
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumFilterCategoryHeader_EnableCategoryExpansion final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.ExpandCategory
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumFilterCategoryHeader_ExpandCategory final
{
public:
	bool                                          bExpanded;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.SetCategoryText
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumFilterCategoryHeader_SetCategoryText final
{
public:
	class FText                                   NewButtonText;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.SetCycleSectionIcon
// 0x00D0 (0x00D0 - 0x0000)
struct FortEmporiumFilterCategoryHeader_SetCycleSectionIcon final
{
public:
	struct FSlateBrush                            CycleSectionIcon;                                  // 0x0000(0x00D0)(Parm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.SetSubcategoryCount
// 0x0004 (0x0004 - 0x0000)
struct FortEmporiumFilterCategoryHeader_SetSubcategoryCount final
{
public:
	int32                                         NewCount;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.ShowCategoryActive
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumFilterCategoryHeader_ShowCategoryActive final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.ShowCycleSectionPrompt
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumFilterCategoryHeader_ShowCycleSectionPrompt final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.ShowUpperSpacer
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumFilterCategoryHeader_ShowUpperSpacer final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.UpdateCategoryCount
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumFilterCategoryHeader_UpdateCategoryCount final
{
public:
	int32                                         NewCount;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideIfEmpty;                                      // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.GetCategoryButton
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumFilterCategoryHeader_GetCategoryButton final
{
public:
	class UCommonButtonBase*                      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFilterCategoryHeader.GetSubcategoryWidgets
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumFilterCategoryHeader_GetSubcategoryWidgets final
{
public:
	TArray<class UWidget*>                        ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFiltersSubPanel.HandleFilterEnabled
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumFiltersSubPanel_HandleFilterEnabled final
{
public:
	bool                                          bIsFilterEnabled;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ListItemObject;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFiltersSubPanel.HandleFilterHovered
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumFiltersSubPanel_HandleFilterHovered final
{
public:
	class UEmporiumBrowserFilterEntry*            Entry;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFiltersSubPanel.HandleFilterSelected
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumFiltersSubPanel_HandleFilterSelected final
{
public:
	bool                                          bIsFilterEnabled;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEmporiumBrowserFilterEntry*            Entry;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFiltersSubPanel.HandleShowAllEnabled
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumFiltersSubPanel_HandleShowAllEnabled final
{
public:
	bool                                          bShowAllItems;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ListItemObject;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFiltersSubPanel.OnAddSubcategoryWidget
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumFiltersSubPanel_OnAddSubcategoryWidget final
{
public:
	class UEmporiumBrowserFilterEntry*            SubcategoryWidget;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFiltersSubPanel.OnFilterSelected
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumFiltersSubPanel_OnFilterSelected final
{
public:
	class UEmporiumBrowserFilterEntry*            SubcategoryWidget;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFiltersSubPanel.OnUpdateFilterEntries
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumFiltersSubPanel_OnUpdateFilterEntries final
{
public:
	TArray<class FName>                           IncludedTags;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumFiltersSubPanel.OnUpdateSubcategoryCount
// 0x0014 (0x0014 - 0x0000)
struct FortEmporiumFiltersSubPanel_OnUpdateSubcategoryCount final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowOnEmpty;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CreativeEmporiumUI.FortEmporiumHomeListEntry.UpdateOverflowDisplay
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumHomeListEntry_UpdateOverflowDisplay final
{
public:
	class UAthenaCreativeItemTileButton*          OverflowTile;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OverflowCount;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CreativeEmporiumUI.FortEmporiumHomeListEntry.UpdateWarningMessage
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumHomeListEntry_UpdateWarningMessage final
{
public:
	bool                                          bShowMessage;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumHomeListEntry.GetCardSizeForCategory
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumHomeListEntry_GetCardSizeForCategory final
{
public:
	EFortItemCardSize                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumHomeListEntry.GetCollapseBorderPadFlagForCategory
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumHomeListEntry_GetCollapseBorderPadFlagForCategory final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumHomeListView.GetFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumHomeListView_GetFocusWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumHomeTabPanel.OnSetPanelLayout
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumHomeTabPanel_OnSetPanelLayout final
{
public:
	EFortEmporiumLayoutVersion                    LayoutVersion;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemDefinition.GetEmporiumItemData
// 0x00E8 (0x00E8 - 0x0000)
struct FortEmporiumItemDefinition_GetEmporiumItemData final
{
public:
	struct FFortEmporiumItemData                  ReturnValue;                                       // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.HandleItemTagSelected
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemDetailsPanel_HandleItemTagSelected final
{
public:
	class FName                                   TagID;                                             // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelected;                                         // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.IsShowingAdditionalButtons
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemDetailsPanel_IsShowingAdditionalButtons final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.SetActiveItemDetailTags
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemDetailsPanel_SetActiveItemDetailTags final
{
public:
	TArray<class FName>                           ActiveTags;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.SetItemDetails
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemDetailsPanel_SetItemDetails final
{
public:
	const class UFortItem*                        FortItem;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLargeThumbnail;                                // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowInteractiveTags;                             // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.SetItemToDetail
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemDetailsPanel_SetItemToDetail final
{
public:
	const class UFortItem*                        InItemToDetail;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLargeThumbnail;                                // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowInteractiveTags;                             // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.SetSpecialItemTagVisibility
// 0x000C (0x000C - 0x0000)
struct FortEmporiumItemDetailsPanel_SetSpecialItemTagVisibility final
{
public:
	class FName                                   SpecialItemTag;                                    // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.SwitchItemDetailsPanel
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemDetailsPanel_SwitchItemDetailsPanel final
{
public:
	bool                                          bUseLegacy;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.UpdateItemDetailsDisplay
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemDetailsPanel_UpdateItemDetailsDisplay final
{
public:
	bool                                          bShowItemDetails;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.BP_GetSpecialItemTags
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemDetailsPanel_BP_GetSpecialItemTags final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.HasLegacyItemDetailsPanel
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemDetailsPanel_HasLegacyItemDetailsPanel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemDetailsPanel.IsShowingExtendedDataPanel
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemDetailsPanel_IsShowingExtendedDataPanel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemInfo.SetSelectItemTagsIcon
// 0x00D0 (0x00D0 - 0x0000)
struct FortEmporiumItemInfo_SetSelectItemTagsIcon final
{
public:
	struct FSlateBrush                            SelectItemTagsIcon;                                // 0x0000(0x00D0)(Parm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemInfo.SetSelectItemTagsPrompt
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemInfo_SetSelectItemTagsPrompt final
{
public:
	class FText                                   Prompt;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemInfo.ShowSelectItemTagsPrompt
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemInfo_ShowSelectItemTagsPrompt final
{
public:
	bool                                          bShowPrompt;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemInfo.UpdateWithFortItem
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemInfo_UpdateWithFortItem final
{
public:
	const class UFortItem*                        Item;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowInteractiveTags;                             // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemInfo.HasFocusableTags
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemInfo_HasFocusableTags final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.AddSelectionToQuickBar
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_AddSelectionToQuickBar final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.DropItem
// 0x01C0 (0x01C0 - 0x0000)
struct FortEmporiumItemListMenu_DropItem final
{
public:
	struct FFortItemEntry                         SelectedItem;                                      // 0x0000(0x01B8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x01B8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.EquipItem
// 0x01C0 (0x01C0 - 0x0000)
struct FortEmporiumItemListMenu_EquipItem final
{
public:
	struct FFortItemEntry                         ItemEntry;                                         // 0x0000(0x01B8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x01B8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.EquipSelection
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_EquipSelection final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.FocusSidePanel
// 0x0002 (0x0002 - 0x0000)
struct FortEmporiumItemListMenu_FocusSidePanel final
{
public:
	bool                                          bIsRightPanel;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFocus;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleCategoryActivated
// 0x000C (0x000C - 0x0000)
struct FortEmporiumItemListMenu_HandleCategoryActivated final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleCategoryButtonClicked
// 0x000C (0x000C - 0x0000)
struct FortEmporiumItemListMenu_HandleCategoryButtonClicked final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleCategoryFocused
// 0x000C (0x000C - 0x0000)
struct FortEmporiumItemListMenu_HandleCategoryFocused final
{
public:
	class FName                                   CategoryID;                                        // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleChestItemCountChanged
// 0x0004 (0x0004 - 0x0000)
struct FortEmporiumItemListMenu_HandleChestItemCountChanged final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleEquipItem
// 0x01B8 (0x01B8 - 0x0000)
struct FortEmporiumItemListMenu_HandleEquipItem final
{
public:
	struct FFortItemEntry                         ItemEntry;                                         // 0x0000(0x01B8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleFilterButtonClicked
// 0x0018 (0x0018 - 0x0000)
struct FortEmporiumItemListMenu_HandleFilterButtonClicked final
{
public:
	class FName                                   FilterNameId;                                      // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      NewButton;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleFilterPanelIsFocused
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_HandleFilterPanelIsFocused final
{
public:
	bool                                          bIsFocused;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleHomeItemClicked
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_HandleHomeItemClicked final
{
public:
	class UFortEmporiumItemListTabPanel*          ItemTab;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleItemClicked
// 0x01B8 (0x01B8 - 0x0000)
struct FortEmporiumItemListMenu_HandleItemClicked final
{
public:
	struct FFortItemEntry                         ItemEntry;                                         // 0x0000(0x01B8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleItemDoubleClicked
// 0x01B8 (0x01B8 - 0x0000)
struct FortEmporiumItemListMenu_HandleItemDoubleClicked final
{
public:
	struct FFortItemEntry                         ItemEntry;                                         // 0x0000(0x01B8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleItemTagSelected
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemListMenu_HandleItemTagSelected final
{
public:
	class FName                                   TagID;                                             // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelected;                                         // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleItemThumbnailDownloaded
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_HandleItemThumbnailDownloaded final
{
public:
	class UFortEmporiumItemDefinition*            ItemDefinition;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleQuickbarPanelIsFocused
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_HandleQuickbarPanelIsFocused final
{
public:
	bool                                          bIsFocused;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleQuickbarStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_HandleQuickbarStateChanged final
{
public:
	EFortContentBrowserQuickbarState              State;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleSelectionChanged
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_HandleSelectionChanged final
{
public:
	class UFortCreativeContentBrowserTabPanelBase* Tab;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleSortButtonClicked
// 0x0018 (0x0018 - 0x0000)
struct FortEmporiumItemListMenu_HandleSortButtonClicked final
{
public:
	class FName                                   SortNameId;                                        // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      NewButton;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleSubFilterEnabled
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemListMenu_HandleSubFilterEnabled final
{
public:
	bool                                          bIsFilterEnabled;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ListItemObject;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleSubFilterShowAllEnabled
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemListMenu_HandleSubFilterShowAllEnabled final
{
public:
	bool                                          bIsFilterEnabled;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ListItemObject;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleTabItemDetailClicked
// 0x000C (0x000C - 0x0000)
struct FortEmporiumItemListMenu_HandleTabItemDetailClicked final
{
public:
	class FName                                   TagID;                                             // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.HandleTabSelected
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemListMenu_HandleTabSelected final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCaptureFocus;                                     // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnAnimateSidePanel
// 0x0002 (0x0002 - 0x0000)
struct FortEmporiumItemListMenu_OnAnimateSidePanel final
{
public:
	bool                                          bIsRightPanel;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShow;                                             // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnFabCategoryListLoaded
// 0x0018 (0x0018 - 0x0000)
struct FortEmporiumItemListMenu_OnFabCategoryListLoaded final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 JSONString;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnFabItemQueryComplete
// 0x0018 (0x0018 - 0x0000)
struct FortEmporiumItemListMenu_OnFabItemQueryComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 JSONString;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnItemEquipped
// 0x01B8 (0x01B8 - 0x0000)
struct FortEmporiumItemListMenu_OnItemEquipped final
{
public:
	struct FFortItemEntry                         EquippedItemEntry;                                 // 0x0000(0x01B8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnQuickbarStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_OnQuickbarStateChanged final
{
public:
	EFortContentBrowserQuickbarState              State;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnSearchFiltersVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_OnSearchFiltersVisibilityChanged final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnSelectionOpened
// 0x0008 (0x0008 - 0x0000)
struct FortEmporiumItemListMenu_OnSelectionOpened final
{
public:
	const class UItemDefinitionBase*              SelectedItemDefinition;                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnSetPanelLayout
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_OnSetPanelLayout final
{
public:
	EFortEmporiumLayoutVersion                    LayoutVersion;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnShouldAllowCommandBar
// 0x0010 (0x0010 - 0x0000)
struct FortEmporiumItemListMenu_OnShouldAllowCommandBar final
{
public:
	class UUserWidget*                            FocusPathWidget;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowCommandBar;                                  // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CreativeEmporiumUI.FortEmporiumItemListMenu.OnShowCategoryModal
// 0x0001 (0x0001 - 0x0000)
struct FortEmporiumItemListMenu_OnShowCategoryModal final
{
public:
	bool                                          bShowModal;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

