#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeDataChannelTriggerRuntime

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "CreativeDataChannelTriggerRuntime_structs.hpp"
#include "ElectraDataChannelRuntime_classes.hpp"


namespace SDK
{

// Class CreativeDataChannelTriggerRuntime.CreativeDataChannelAnalytics
// 0x0000 (0x0030 - 0x0030)
class UCreativeDataChannelAnalytics final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeDataChannelAnalytics">();
	}
	static class UCreativeDataChannelAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeDataChannelAnalytics>();
	}
};

// Class CreativeDataChannelTriggerRuntime.CreativeDataChannelTarget
// 0x0068 (0x0500 - 0x0498)
class ACreativeDataChannelTarget final : public AElectraDataChannelTarget
{
public:
	uint8                                         Pad_498[0x8];                                      // 0x0498(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int8                                          VersionByte;                                       // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCreativeDataChannelEvents             Events;                                            // 0x04A8(0x0010)(BlueprintVisible, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCreativeDataChannelEvents& Events)> OnEventsRep;                                       // 0x04B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FCreativeDataChannelEvents             EventsCache;                                       // 0x04C8(0x0010)(NativeAccessSpecifierPublic)
	uint8                                         Pad_4D8[0x28];                                     // 0x04D8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FireEvent(class FName EventName);
	void OnRep_Events();
	void TestCreativeDataChannelTarget(const struct FCreativeDataChannelEvents& TestEvents);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeDataChannelTarget">();
	}
	static class ACreativeDataChannelTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreativeDataChannelTarget>();
	}
};

// Class CreativeDataChannelTriggerRuntime.CreativeDataChannelTargetFN
// 0x02B8 (0x0750 - 0x0498)
class ACreativeDataChannelTargetFN final : public AElectraDataChannelTarget
{
public:
	uint8                                         Pad_498[0x8];                                      // 0x0498(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VersionByte;                                       // 0x04A0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCInt                                VersionByteTracker;                                // 0x04A4(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCInt& EventNumber)> VersionByteEvent;                                  // 0x04A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 LeaderBoard;                                       // 0x04B8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         StormCircleSize;                                   // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCLargeInt                           StormCircleSizeTracker;                            // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCLargeInt& EventNumber)> StormCircleSizeEvent;                              // 0x04D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<float>                                 StormCircleLocation;                               // 0x04E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FCDCFloatArray                         StormCircleLocationTracker;                        // 0x04F8(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCFloatArray& EventMap)> StormCircleLocationEvent;                          // 0x0508(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 PlayerLocation;                                    // 0x0518(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCStringFloatArrayMap                PlayerLocationTracker;                             // 0x0528(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCStringFloatArrayMap& EventMap)> PlayerLocationEvent;                               // 0x0578(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 ArenaPointLeaderBoard;                             // 0x0588(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCStringStringMap                    ArenaPointLeaderBoardTracker;                      // 0x0598(0x00A0)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCStringStringMap& EventMap)> ArenaPointLeaderBoardEvent;                        // 0x0638(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 CashCupDataAllTimeEarners;                         // 0x0648(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCStringFloatMap                     CashCupDataAllTimeEanersTracker;                   // 0x0658(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCStringFloatMap& EventMap)> CashCupDataAllTimeEarnersEvent;                    // 0x06A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 MythicBossEliminatedPlayer;                        // 0x06B8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCString                             MythicBossEliminatedPlayerTracker;                 // 0x06C8(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCString& EventString)> MythicBossEliminatedPlayerEvent;                   // 0x06D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 MythicWeaponPlayer;                                // 0x06E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCString                             MythicWeaponPlayerTracker;                         // 0x06F8(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCString& EventString)> MythicWeaponPlayerEvent;                           // 0x0708(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 PlayerInfo;                                        // 0x0718(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCStringArray                        PlayerInfoTracker;                                 // 0x0728(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCStringArray& EventStringArray)> PlayerInfoEvent;                                   // 0x0740(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeDataChannelTargetFN">();
	}
	static class ACreativeDataChannelTargetFN* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreativeDataChannelTargetFN>();
	}
};

// Class CreativeDataChannelTriggerRuntime.CreativeDataChannelTargetRL
// 0x04C0 (0x0958 - 0x0498)
class ACreativeDataChannelTargetRL final : public AElectraDataChannelTarget
{
public:
	uint8                                         Pad_498[0x8];                                      // 0x0498(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VersionByte;                                       // 0x04A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCInt                                VersionByteTracker;                                // 0x04A4(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCInt& EventNumber)> VersionByteEvent;                                  // 0x04A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         ScoreTeam;                                         // 0x04B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCDCString                             ScoreTeamTracker;                                  // 0x04C0(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCString& EventString)> ScoreTeamEvent;                                    // 0x04D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 ScoreTotal;                                        // 0x04E0(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCStringIntMap                       ScoreTotalTracker;                                 // 0x04F0(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCStringIntMap& EventMap)> ScoreTotalEvent;                                   // 0x0540(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int64                                         ScoreboardTimeLeft;                                // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCLargeInt                           ScoreboardTimeLeftTracker;                         // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCLargeInt& EventNumber)> ScoreboardTimeLeftEvent;                           // 0x0560(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 ScoreboardBestOf;                                  // 0x0570(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCStringIntMap                       ScoreboardBestOfTracker;                           // 0x0580(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCStringIntMap& EventMap)> ScoreboardBestOfEvent;                             // 0x05D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         Overtime;                                          // 0x05E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCInt                                OvertimeTracker;                                   // 0x05E4(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCInt& EventNumber)> OvertimeEvent;                                     // 0x05E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 TeamNames;                                         // 0x05F8(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCStringArray                        TeamNamesTracker;                                  // 0x0608(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCStringArray& EventStringArray)> TeamNamesEvent;                                    // 0x0620(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 PlayerNames;                                       // 0x0630(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCStringArray                        PlayerNamesTracker;                                // 0x0640(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCStringArray& EventStringArray)> PlayerNamesEvent;                                  // 0x0658(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 PlayerBoost;                                       // 0x0668(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCStringIntMap                       PlayerBoostTracker;                                // 0x0678(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCStringIntMap& EventMap)> PlayerBoostEvent;                                  // 0x06C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 PlayerBoostCollected;                              // 0x06D8(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCStringStringMap                    PlayerBoostCollectedTracker;                       // 0x06E8(0x00A0)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCStringStringMap& EventMap)> PlayerBoostCollectedEvent;                         // 0x0788(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 PlayerCoords;                                      // 0x0798(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCStringFloatArrayMap                PlayerCoordsTracker;                               // 0x07A8(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCStringFloatArrayMap& EventMap)> PlayerCoordsEvent;                                 // 0x07F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 BallCoords;                                        // 0x0808(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCFloatArray                         BallCoordsTracker;                                 // 0x0818(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCFloatArray& EventMap)> BallCoordsEvent;                                   // 0x0828(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 MediaStart;                                        // 0x0838(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCStringStringMap                    MediaStartTracker;                                 // 0x0848(0x00A0)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCStringStringMap& EventMap)> MediaStartEvent;                                   // 0x08E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         MediaStop;                                         // 0x08F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCInt                                MediaStopTracker;                                  // 0x08FC(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCInt& EventNumber)> MediaStopEvent;                                    // 0x0900(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         SeriesState;                                       // 0x0910(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCInt                                SeriesStateTracker;                                // 0x0914(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCInt& EventNumber)> SeriesStateEvent;                                  // 0x0918(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         MatchState;                                        // 0x0928(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCInt                                MatchStateTracker;                                 // 0x092C(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCInt& EventNumber)> MatchStateEvent;                                   // 0x0930(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         FinaleState;                                       // 0x0940(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCDCInt                                FinaleStateTracker;                                // 0x0944(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FCDCInt& EventNumber)> FinaleStateEvent;                                  // 0x0948(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void OnRep_BallCoords();
	void OnRep_FinaleState();
	void OnRep_MatchState();
	void OnRep_MediaStart();
	void OnRep_MediaStop();
	void OnRep_Overtime();
	void OnRep_PlayerBoost();
	void OnRep_PlayerBoostCollected();
	void OnRep_PlayerCoords();
	void OnRep_PlayerNames();
	void OnRep_ScoreboardBestOf();
	void OnRep_ScoreboardTimeLeft();
	void OnRep_ScoreTeam();
	void OnRep_ScoreTotal();
	void OnRep_SeriesState();
	void OnRep_TeamNames();
	void OnRep_VersionByte();
	void ReportServerStateStreamError(const class FString& Error, const class FString& UID, const class FString& URL);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeDataChannelTargetRL">();
	}
	static class ACreativeDataChannelTargetRL* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreativeDataChannelTargetRL>();
	}
};

}

