#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeTests

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FunctionalTesting_classes.hpp"
#include "CreativeTests_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class CreativeTests.CreativeFunctionalTest
// 0x0108 (0x0670 - 0x0568)
class ACreativeFunctionalTest final : public AFunctionalTest
{
public:
	TMulticastInlineDelegate<void()>              OnTestConditionSatisfied;                          // 0x0568(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          ForceIgnoreErrorsAndWarnings;                      // 0x0578(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AGameModeBase>              RequiredGameMode;                                  // 0x0580(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortPlaylistAthena*                    RequiredPlaylist;                                  // 0x0588(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<TSubclassOf<class UFortControllerComponent_CreativeFunctionalTest>> RequiredControllerComponentClasses;                // 0x0590(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	TScriptInterface<class IFortSpatialGameplayInterface> SpatialGameplayActor;                              // 0x05E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DeviceSpawnLocation;                               // 0x05F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UWorld>                  DeviceMap;                                         // 0x05F8(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 PawnStartLocation;                                 // 0x0628(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldStartMinigame;                              // 0x0630(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldLevelStreamMap;                             // 0x0631(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_632[0x6];                                      // 0x0632(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FExpectedConsoleVariableForTest> ExpectedConsoleVariablesForTest;                   // 0x0638(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         TimeScale;                                         // 0x0648(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64C[0x4];                                      // 0x064C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CreatedDevices;                                    // 0x0650(0x0010)(Net, ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UFortLevelStreamComponent*              LevelStreamComponent;                              // 0x0660(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULevelRecordSpawner*                    ActiveRecordSpawner;                               // 0x0668(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	bool GetCreatedDevices(TArray<class AActor*>* OutCreatedDevices);
	bool GetCreatedDevicesOfClass(TSubclassOf<class AActor> DeviceClass, TArray<class AActor*>* OutCreatedDevices);
	void HandleConditionSatisfiedChange(class UCreativeFunctionalTestConditionComponentBase* Condition);
	void OnLevelRecordFinishSpawning(const TArray<class AActor*>& NewlySpawnedActors);
	void OnMinigameStateChanged(class AFortMinigame* Minigame, EFortMinigameState NewMinigameState);

	bool CheckIfAllConditionsSatisifed() const;
	class APlayerController* GetPlayerControllerForTest() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeFunctionalTest">();
	}
	static class ACreativeFunctionalTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreativeFunctionalTest>();
	}
};

// Class CreativeTests.CreativeFunctionalTestConditionComponentBase
// 0x0018 (0x00F0 - 0x00D8)
class UCreativeFunctionalTestConditionComponentBase : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(class UCreativeFunctionalTestConditionComponentBase* Condition)> OnConditionSatisfiedChange;                        // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bConditionSatisifed;                               // 0x00E8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CleanupAfterTest();
	void SetConditionSatisfied(bool bValue);
	void SetupForTest();

	bool ConditionHasBeenSatisfied() const;
	bool GetTestResult(class FString* TestMessage) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeFunctionalTestConditionComponentBase">();
	}
	static class UCreativeFunctionalTestConditionComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeFunctionalTestConditionComponentBase>();
	}
};

// Class CreativeTests.CreativeFunctionalTestConditionComponent_ReceiveOnChannel
// 0x0028 (0x0118 - 0x00F0)
class UCreativeFunctionalTestConditionComponent_ReceiveOnChannel final : public UCreativeFunctionalTestConditionComponentBase
{
public:
	struct FGameplayTagContainer                  ChannelIds;                                        // 0x00F0(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnReceiveOnChannel(class AController* Instigator);
	void SetChannelId(const struct FGameplayTagContainer& NewChannelIds);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeFunctionalTestConditionComponent_ReceiveOnChannel">();
	}
	static class UCreativeFunctionalTestConditionComponent_ReceiveOnChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeFunctionalTestConditionComponent_ReceiveOnChannel>();
	}
};

// Class CreativeTests.CreativeFunctionalTestConditionComponent_CheckInventory
// 0x0020 (0x0110 - 0x00F0)
class UCreativeFunctionalTestConditionComponent_CheckInventory final : public UCreativeFunctionalTestConditionComponentBase
{
public:
	TArray<struct FCreativeFunctionalTest_ItemCountPair> ExpectedInventory;                                 // 0x00F0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_100[0x10];                                     // 0x0100(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeFunctionalTestConditionComponent_CheckInventory">();
	}
	static class UCreativeFunctionalTestConditionComponent_CheckInventory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeFunctionalTestConditionComponent_CheckInventory>();
	}
};

// Class CreativeTests.FortControllerComponent_CreativeFunctionalTest
// 0x0008 (0x00E8 - 0x00E0)
class UFortControllerComponent_CreativeFunctionalTest : public UFortControllerComponent
{
public:
	class ACreativeFunctionalTest*                FunctionalTest;                                    // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetFunctionalTest(class ACreativeFunctionalTest* FunctionalTest_0);
	bool TryInteractUseForActor(class AActor* ActorToUse, class UFortControllerComponent_Interaction* InteractComponent);

	bool CanInteractWithActor(class AActor* ActorToUse, class UFortControllerComponent_Interaction* InteractComponent) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortControllerComponent_CreativeFunctionalTest">();
	}
	static class UFortControllerComponent_CreativeFunctionalTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerComponent_CreativeFunctionalTest>();
	}
};

// Class CreativeTests.FortControllerComponent_CreativeFunctionalTest_EquipAndFireWeapon
// 0x0038 (0x0120 - 0x00E8)
class UFortControllerComponent_CreativeFunctionalTest_EquipAndFireWeapon final : public UFortControllerComponent_CreativeFunctionalTest
{
public:
	uint8                                         Pad_E8[0x30];                                      // 0x00E8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWeaponItemDefinition*              ExpectedWeaponDef;                                 // 0x0118(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ClientStartPawnFireWeapon(const class UFortWeaponItemDefinition* ItemDefThatShouldBeEquipped, int32 MinAmmoToFire);
	void ClientStopFiring();
	void EquipPawnAndFireWeapon(const class UFortWeaponItemDefinition* ItemDefToEquip, TDelegate<void(ECreativeFunctionalTest_StopFireReason StopFireReason, class AFortPlayerPawn* PlayerPawnThatStoppedFiring)> StoppingFireDelegate, int32 ItemLevel, float TimeUntilStopFire, int32 MinBulletsToFire);
	void ServerPawnStartedFiringWeapon();
	void ServerSetStopFireReason(ECreativeFunctionalTest_StopFireReason StopFireReason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortControllerComponent_CreativeFunctionalTest_EquipAndFireWeapon">();
	}
	static class UFortControllerComponent_CreativeFunctionalTest_EquipAndFireWeapon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerComponent_CreativeFunctionalTest_EquipAndFireWeapon>();
	}
};

// Class CreativeTests.LevelSaveTestActor
// 0x0090 (0x04B0 - 0x0420)
class ALevelSaveTestActor final : public AActor
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  SavedActorGuid;                                    // 0x0428(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 SavedActorReference;                               // 0x0438(0x0008)(ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         ActorArray;                                        // 0x0440(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	struct FLevelSaveTestStruct                   SimpleStruct;                                      // 0x0450(0x0038)(SaveGame, NativeAccessSpecifierPublic)
	struct FLevelSaveTestStructArray              StructWithArray;                                   // 0x0488(0x0010)(SaveGame, NativeAccessSpecifierPublic)
	uint8                                         Pad_498[0x18];                                     // 0x0498(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelSaveTestActor">();
	}
	static class ALevelSaveTestActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALevelSaveTestActor>();
	}
};

// Class CreativeTests.LevelSaveTestInfoActor
// 0x0038 (0x0458 - 0x0420)
class ALevelSaveTestInfoActor final : public AActor
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  SavedActorGuid;                                    // 0x0428(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 SavedActorReference;                               // 0x0438(0x0008)(ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_440[0x18];                                     // 0x0440(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelSaveTestInfoActor">();
	}
	static class ALevelSaveTestInfoActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALevelSaveTestInfoActor>();
	}
};

// Class CreativeTests.LSRTestWithChildActorComponent
// 0x0068 (0x0488 - 0x0420)
class ALSRTestWithChildActorComponent final : public AActor
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  SavedActorGuid;                                    // 0x0428(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChildActorComponent*                   TestChildActorComponent;                           // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_440[0x48];                                     // 0x0440(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LSRTestWithChildActorComponent">();
	}
	static class ALSRTestWithChildActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALSRTestWithChildActorComponent>();
	}
};

}

