#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrewUI

#include "Basic.hpp"

#include "GameSubCatalog_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "ModelViewViewModel_classes.hpp"
#include "CrewUI_structs.hpp"


namespace SDK
{

// Class CrewUI.BattlePassCrewContentInterface
// 0x0000 (0x0030 - 0x0030)
class IBattlePassCrewContentInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassCrewContentInterface">();
	}
	static class IBattlePassCrewContentInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBattlePassCrewContentInterface>();
	}
};

// Class CrewUI.CrewScreenContentBlockingInterface
// 0x0000 (0x0030 - 0x0030)
class ICrewScreenContentBlockingInterface final : public IInterface
{
public:
	void BlockScreenContent(const bool bBlockScreen, const class FText& ContentBlockedText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrewScreenContentBlockingInterface">();
	}
	static class ICrewScreenContentBlockingInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICrewScreenContentBlockingInterface>();
	}
};

// Class CrewUI.FortProgressiveContentInterface
// 0x0000 (0x0030 - 0x0030)
class IFortProgressiveContentInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortProgressiveContentInterface">();
	}
	static class IFortProgressiveContentInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortProgressiveContentInterface>();
	}
};

// Class CrewUI.FortTemporaryItemsComponent
// 0x0010 (0x00E8 - 0x00D8)
class UFortTemporaryItemsComponent final : public UControllerComponent
{
public:
	class UFortTemporaryItemsManager*             TemporaryItemsManager;                             // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UFortMcpProfileAthena>   AthenaProfile;                                     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnAthenaProfileInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTemporaryItemsComponent">();
	}
	static class UFortTemporaryItemsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTemporaryItemsComponent>();
	}
};

// Class CrewUI.FortTemporaryItemsManager
// 0x0030 (0x0068 - 0x0038)
class UFortTemporaryItemsManager final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x30];                                      // 0x0038(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTemporaryItemsStateChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTemporaryItemsManager">();
	}
	static class UFortTemporaryItemsManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTemporaryItemsManager>();
	}
};

// Class CrewUI.FortTemporaryItemsRewardGroupVM
// 0x0020 (0x0090 - 0x0070)
class UFortTemporaryItemsRewardGroupVM final : public UMVVMViewModelBase
{
public:
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EAthenaCustomizationCategory                  Category;                                          // 0x0078(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortTemporaryItemsRewardVM*>    Rewards;                                           // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTemporaryItemsRewardGroupVM">();
	}
	static class UFortTemporaryItemsRewardGroupVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTemporaryItemsRewardGroupVM>();
	}
};

// Class CrewUI.FortTemporaryItemsRewardVM
// 0x0018 (0x0088 - 0x0070)
class UFortTemporaryItemsRewardVM final : public UMVVMViewModelBase
{
public:
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItemDefinition*             ItemDefinition;                                    // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsOwned;                                          // 0x0080(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTemporaryItemsRewardVM">();
	}
	static class UFortTemporaryItemsRewardVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTemporaryItemsRewardVM>();
	}
};

// Class CrewUI.FortTemporaryItemsRow
// 0x0020 (0x0438 - 0x0418)
class UFortTemporaryItemsRow final : public UUserWidget
{
public:
	uint8                                         Pad_418[0x20];                                     // 0x0418(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTileView(class UTileView* InTileView);

	class FText GetCategoryText(const EAthenaCustomizationCategory InCategory) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTemporaryItemsRow">();
	}
	static class UFortTemporaryItemsRow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTemporaryItemsRow>();
	}
};

// Class CrewUI.FortTemporaryItemsScreenItemInfo
// 0x0018 (0x0458 - 0x0440)
class UFortTemporaryItemsScreenItemInfo final : public UCommonUserWidget
{
public:
	class UAthenaRewardItemTypeRarityTag*         Widget_ItemTypeRarityTag;                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemName;                                     // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_Description;                              // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnDataSet(bool bValidItem, bool bIsSubscribed, bool IsOwned);
	void SetData(const class UFortSubscriptionVM* SubscriptionVM, const class UFortTemporaryItemsRewardVM* RewardVM);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTemporaryItemsScreenItemInfo">();
	}
	static class UFortTemporaryItemsScreenItemInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTemporaryItemsScreenItemInfo>();
	}
};

// Class CrewUI.FortTemporaryItemsTileButton
// 0x0010 (0x1810 - 0x1800)
class UFortTemporaryItemsTileButton final : public UCommonButtonBase
{
public:
	uint8                                         Pad_1800[0x8];                                     // 0x1800(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCosmeticItemCard*                  ItemCard;                                          // 0x1808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetupRewardItem(const class UFortAccountItemDefinition* ItemDef);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTemporaryItemsTileButton">();
	}
	static class UFortTemporaryItemsTileButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTemporaryItemsTileButton>();
	}
};

// Class CrewUI.FortTemporaryItemsVM
// 0x0020 (0x0098 - 0x0078)
class UFortTemporaryItemsVM final : public UFortPerUserViewModel
{
public:
	TArray<class UFortTemporaryItemsRewardGroupVM*> RewardGroups;                                      // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FDateTime                              ExpirationDate;                                    // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTemporaryItemsManager*             TemporaryItemsManager;                             // 0x0090(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTemporaryItemsVM">();
	}
	static class UFortTemporaryItemsVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTemporaryItemsVM>();
	}
};

// Class CrewUI.BattlePassCrewPurchaseButton
// 0x0020 (0x18C0 - 0x18A0)
class UBattlePassCrewPurchaseButton final : public UFortHoldableButton
{
public:
	EBattlePassPurchaseButtonCurrencyType         CurrencyType;                                      // 0x1898(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1899[0x7];                                     // 0x1899(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_Label;                                        // 0x18A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_SecondaryLabel;                               // 0x18A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_FinalCost;                                    // 0x18B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Container_SecondaryLabel;                          // 0x18B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnCurrencyUpdated();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassCrewPurchaseButton">();
	}
	static class UBattlePassCrewPurchaseButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassCrewPurchaseButton>();
	}
};

// Class CrewUI.BattlePassCrewPurchaseContainer
// 0x0080 (0x05F8 - 0x0578)
class UBattlePassCrewPurchaseContainer final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x20];                                     // 0x0578(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CrewUpsellTransitionDelayTime;                     // 0x0598(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_59C[0xC];                                      // 0x059C(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidgetSwitcher*       Switcher_ContentContainer;                         // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassPurchaseScreen*              BattlePassPurchaseScreen;                          // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                       Intro;                                             // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                       QuickIntro;                                        // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                       CrewBenefitsIntro;                                 // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCommonActivatableWidget>   CrewSubscriptionErrorModalClass;                   // 0x05D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D8[0x20];                                     // 0x05D8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnContentStateUpdated(EBattlePassCrewContentState InState, bool bInScreenOpened);
	void OnTriggerIntroAnimation(bool bCanClaimRewards);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassCrewPurchaseContainer">();
	}
	static class UBattlePassCrewPurchaseContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassCrewPurchaseContainer>();
	}
};

// Class CrewUI.BattlePassSeasonHeading
// 0x0008 (0x0448 - 0x0440)
class UBattlePassSeasonHeading final : public UCommonUserWidget
{
public:
	class UCommonRichTextBlock*                   Text_Season;                                       // 0x0440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassSeasonHeading">();
	}
	static class UBattlePassSeasonHeading* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassSeasonHeading>();
	}
};

// Class CrewUI.BattlePassPurchaseScreen
// 0x0138 (0x06F8 - 0x05C0)
class UBattlePassPurchaseScreen final : public UCMSBackgroundWidget
{
public:
	uint8                                         Pad_5C0[0x3C];                                     // 0x05C0(0x003C)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CrewTransitionDelayTime;                           // 0x05FC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_600[0x70];                                     // 0x0600(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonActivatableWidget>   PurchaseCompleteModal;                             // 0x0670(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ToCrew;                                     // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassCrewPurchaseButton*          Button_Purchase;                                   // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_MoreInfo;                                   // 0x0688(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_GiftBattlePass;                             // 0x0690(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassCrewPurchaseButton*          Button_ConfirmBase;                                // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassCrewPurchaseButton*          Button_ConfirmBundle;                              // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassSeasonHeading*               Heading_Primary;                                   // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassSeasonHeading*               Heading_Secondary;                                 // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_Disclaimer;                               // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Description;                                  // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonAnimatedSwitcher*                Switcher_PurchaseState;                            // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 SourceContextName;                                 // 0x06D0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6E0[0x18];                                     // 0x06E0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPurchaseConfirmed();
	void OnPurchaseStateChanged(EBattlePassPurchaseState InCurrentState);
	void OnSetNavButtonNotificationText(const class FText& NotificationText);
	void OnSetScreenInteractable(bool bInteractable);
	void OnShowNavButtonNotification(const bool bShowNotification);
	void RefreshFocus();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassPurchaseScreen">();
	}
	static class UBattlePassPurchaseScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassPurchaseScreen>();
	}
};

// Class CrewUI.CrewAsyncActions
// 0x0028 (0x0060 - 0x0038)
class UCrewAsyncActions final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(bool Success)>  OnOperationCompleted;                              // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UCrewAsyncActions* PurchaseSubscription(const class UUserWidget* ContextWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrewAsyncActions">();
	}
	static class UCrewAsyncActions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewAsyncActions>();
	}
};

// Class CrewUI.CrewMultiSubscriptionAlertModal
// 0x00D0 (0x0648 - 0x0578)
class UCrewMultiSubscriptionAlertModal final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicEntryBox*                       EntryBox_BulletPoints;                             // 0x0580(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_OpenHowToURL;                               // 0x0588(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_TextURL;                                    // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_DoNotRemind;                                // 0x0598(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Close;                                      // 0x05A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_TouchClose;                                 // 0x05A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FText>                           BulletPoints;                                      // 0x05B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TMap<EAppStore, class FText>                  AppStorePlatformMapping;                           // 0x05C0(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FString                                 HowToCancelURL;                                    // 0x0610(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_620[0x18];                                     // 0x0620(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PlatformTextStyle;                                 // 0x0638(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	void OnSetHowToCancelURL(const class FString& MoreInfoUrl);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrewMultiSubscriptionAlertModal">();
	}
	static class UCrewMultiSubscriptionAlertModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewMultiSubscriptionAlertModal>();
	}
};

// Class CrewUI.CrewPurchaseScreen
// 0x0168 (0x0728 - 0x05C0)
class UCrewPurchaseScreen final : public UCMSBackgroundWidget
{
public:
	uint8                                         Pad_5C0[0x68];                                     // 0x05C0(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bManagementModeEnabled;                            // 0x0628(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_629[0x7];                                      // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ContentPurchasedFocusWidget;                       // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   CancellationInfoModalClass;                        // 0x0638(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   LegalInfoModalClass;                               // 0x0668(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   ResolveIssueModalClass;                            // 0x0698(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   RejoinModalClass;                                  // 0x06C8(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   ContinueModalClass;                                // 0x06F8(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BeginProgress(const class FText& ProgressLabel);
	void EndProgress();
	void FireCrewAnalytic(const class FString& Interaction, const float HoldTime);
	void HandleCancellationClicked();
	void HandleContinueEngaged(const float HoldTime);
	void HandleInspectionScreenClosed();
	void HandlePurchaseEngaged(const float HoldTime);
	void HandleRejoinEngaged(const float HoldTime);
	void HandleResolvePaymentClicked();
	void HandleTermsClicked();
	void HandleToBattlePassClicked();
	void OnContainerTabVisibilityUpdated(const bool bTabsVisible, const float SpacingAdjustmentForTabs);
	void OnSetManagementModeEnabled(const bool bEnabled);
	void OnSetNavButtonNotificationText(const class FText& NotificationText);
	void OnShowNavButtonNotification(const bool bShowNotification);
	void RequestBattlePassMoreInfo();
	void RequestTabTileMoreInfo(const ESubscriptionContentTab SubscriptionContentTab);
	void ShowDefaultData();

	bool CanUseContinueMembershipCTA() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrewPurchaseScreen">();
	}
	static class UCrewPurchaseScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewPurchaseScreen>();
	}
};

// Class CrewUI.CrewSeasonLaunchScreen
// 0x00F8 (0x06B8 - 0x05C0)
class UCrewSeasonLaunchScreen final : public UCMSBackgroundWidget
{
public:
	uint8                                         Pad_5C0[0x38];                                     // 0x05C0(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   ResolveIssueModalClass;                            // 0x05F8(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassSeasonHeading*               Heading_SeasonInfo;                                // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Description;                                  // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Claim;                                      // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ResolveIssue;                               // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_GiftBattlePass;                             // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_Disclaimer;                               // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_658[0x60];                                     // 0x0658(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrewSeasonLaunchScreen">();
	}
	static class UCrewSeasonLaunchScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewSeasonLaunchScreen>();
	}
};

// Class CrewUI.CrewStandaloneSubscriptionContentContainer
// 0x0008 (0x0660 - 0x0658)
class UCrewStandaloneSubscriptionContentContainer final : public UFortStandaloneFrontend
{
public:
	class UCrewSubscriptionContentContainer*      Widget_CrewContentContainer;                       // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrewStandaloneSubscriptionContentContainer">();
	}
	static class UCrewStandaloneSubscriptionContentContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewStandaloneSubscriptionContentContainer>();
	}
};

// Class CrewUI.CrewSubscriptionContentContainer
// 0x00B0 (0x0628 - 0x0578)
class UCrewSubscriptionContentContainer final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x30];                                     // 0x0578(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCrewSubscriptionContentTabData> TabsData;                                          // 0x05A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    NextTabInputAction;                                // 0x05B8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    PreviousTabInputAction;                            // 0x05D0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_Tabs;                                     // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupBase*                 ButtonGroup_Tabs;                                  // 0x05F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActivatableWidgetSwitcher*       Switcher_Tabs;                                     // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Widget_TabsContainer;                              // 0x0600(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SpacingAdjustmentForTabs;                          // 0x0608(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPrimaryContentSetup                   ContentSetup;                                      // 0x060C(0x0003)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60F[0x19];                                     // 0x060F(0x0019)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTabSelected(int32 TabIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrewSubscriptionContentContainer">();
	}
	static class UCrewSubscriptionContentContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewSubscriptionContentContainer>();
	}
};

// Class CrewUI.CrewUIGameFeatureAction
// 0x01A0 (0x01D0 - 0x0030)
class UCrewUIGameFeatureAction final : public UFortUIGameFeatureAction
{
public:
	TSoftClassPtr<class UClass>                   BattlePassCrewContainerClass;                      // 0x0030(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   CrewContentContainerClass;                         // 0x0060(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   CrewStandaloneContentContainerClass;               // 0x0090(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   CrewPurchaseScreenClass;                           // 0x00C0(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   ProgressionScreenClass;                            // 0x00F0(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   TemporaryItemsScreenClass;                         // 0x0120(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   CrewPriceChangeAcknowledgeModalClass;              // 0x0150(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   MultiSubAlertModalClass;                           // 0x0180(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FFortProgressiveSet>            ProgressiveCosmeticSets;                           // 0x01B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C0[0x10];                                     // 0x01C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrewUIGameFeatureAction">();
	}
	static class UCrewUIGameFeatureAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewUIGameFeatureAction>();
	}
};

// Class CrewUI.FortProgressiveContentContainer
// 0x0050 (0x05C8 - 0x0578)
class UFortProgressiveContentContainer final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x38];                                     // 0x0578(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidgetSwitcher*       Switcher_PrimaryContent;                           // 0x05B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortProgressiveTableOfContentsScreen*  Widget_ProgressiveTableOfContentsScreen;           // 0x05B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortProgressiveItemScreen*             Widget_ProgressiveItemScreen;                      // 0x05C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortProgressiveContentContainer">();
	}
	static class UFortProgressiveContentContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortProgressiveContentContainer>();
	}
};

// Class CrewUI.FortProgressiveScreenBase
// 0x0058 (0x05D0 - 0x0578)
class UFortProgressiveScreenBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x58];                                     // 0x0578(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnContainerTabVisibilityUpdated(const bool bTabsVisible, const float SpacingAdjustmentForTabs);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortProgressiveScreenBase">();
	}
	static class UFortProgressiveScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortProgressiveScreenBase>();
	}
};

// Class CrewUI.FortProgressiveItemScreen
// 0x0030 (0x0600 - 0x05D0)
class UFortProgressiveItemScreen final : public UFortProgressiveScreenBase
{
public:
	TSoftClassPtr<class UClass>                   MoreInfoModalClass;                                // 0x05D0(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleBackClicked();
	void HandleMoreInfoClicked();
	void HandleSubscribeEngaged();
	void OnSubscriptionPurchaseComplete(bool bSuccess);
	void SendAnalyticsEvent(const class FString& Event, const class FString& FullfillmentId, int32 StageIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortProgressiveItemScreen">();
	}
	static class UFortProgressiveItemScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortProgressiveItemScreen>();
	}
};

// Class CrewUI.FortProgressiveTableOfContentsScreen
// 0x0030 (0x0600 - 0x05D0)
class UFortProgressiveTableOfContentsScreen final : public UFortProgressiveScreenBase
{
public:
	TSoftClassPtr<class UClass>                   MoreInfoModalClass;                                // 0x05D0(0x0030)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleBackClicked();
	void HandleInspectSetTile();
	void HandleMoreInfoClicked();
	void HandleSubscribeEngaged();
	void OnSubscriptionPurchaseComplete(bool bSuccess);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortProgressiveTableOfContentsScreen">();
	}
	static class UFortProgressiveTableOfContentsScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortProgressiveTableOfContentsScreen>();
	}
};

// Class CrewUI.FortTemporaryItemsScreen
// 0x00D8 (0x09B8 - 0x08E0)
class UFortTemporaryItemsScreen final : public UFortItemPreviewScreen
{
public:
	uint8                                         Pad_8E0[0x60];                                     // 0x08E0(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBox*                           VerticalBox_CategoryList;                          // 0x0940(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_948[0x18];                                     // 0x0948(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_Back;                                       // 0x0960(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_TouchBack;                                  // 0x0968(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_MoreInfo;                                   // 0x0970(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTemporaryItemsScreenItemInfo*      Widget_Description;                                // 0x0978(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   MoreInfoModalClass;                                // 0x0980(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9B0[0x8];                                      // 0x09B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnContainerTabVisibilityUpdated(const bool bTabsVisible, const float SpacingAdjustmentForTabs);
	class UFortSubscriptionVM* GetSubscriptionVM();
	void SetupRowEntry(class UFortTemporaryItemsRow* RewardRow);

	class FText GetRemainingDaysLabel(const class UFortTemporaryItemsVM* TemporaryItemsVM) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTemporaryItemsScreen">();
	}
	static class UFortTemporaryItemsScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTemporaryItemsScreen>();
	}
};

// Class CrewUI.CrewBenefitVM
// 0x0068 (0x00D8 - 0x0070)
class UCrewBenefitVM final : public UMVVMViewModelBase
{
public:
	class FText                                   TileLabel;                                         // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FString                                 TileImageURL;                                      // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   Title;                                             // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   Description;                                       // 0x00A0(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FString                                 BackgroundImageURL;                                // 0x00B0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UFortItemVM*>                    CrewPackItems;                                     // 0x00C0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	ECrewDetailsTag                               Tag;                                               // 0x00D0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECrewTileType                                 Type;                                              // 0x00D1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsOwned;                                          // 0x00D2(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasMoreInfo;                                      // 0x00D3(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FText GetTagText() const;
	bool IsMonthlySubscription() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrewBenefitVM">();
	}
	static class UCrewBenefitVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewBenefitVM>();
	}
};

// Class CrewUI.CrewItemShopDataVM
// 0x0028 (0x0098 - 0x0070)
class UCrewItemShopDataVM final : public UMVVMViewModelBase
{
public:
	class FText                                   HighlightText;                                     // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	EViolatorIntensity                            HighlightIntensity;                                // 0x0080(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TileImageURL;                                      // 0x0088(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrewItemShopDataVM">();
	}
	static class UCrewItemShopDataVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewItemShopDataVM>();
	}
};

// Class CrewUI.CrewCancellationInfoVM
// 0x0010 (0x0080 - 0x0070)
class UCrewCancellationInfoVM final : public UMVVMViewModelBase
{
public:
	TArray<class FText>                           BulletPoints;                                      // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrewCancellationInfoVM">();
	}
	static class UCrewCancellationInfoVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewCancellationInfoVM>();
	}
};

// Class CrewUI.CrewPlatformAndCountriesNotificationVM
// 0x0090 (0x0108 - 0x0078)
class UCrewPlatformAndCountriesNotificationVM final : public UFortPerUserViewModel
{
public:
	uint8                                         Pad_78[0x10];                                      // 0x0078(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Title;                                             // 0x0088(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   BodyText;                                          // 0x0098(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   CheckboxText;                                      // 0x00A8(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   ConfirmButtonText;                                 // 0x00B8(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   CancelSubscriptionButtonText;                      // 0x00C8(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   MoreInfoText;                                      // 0x00D8(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   MoreInfoUrl;                                       // 0x00E8(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCrewTableRow>                  TableRows;                                         // 0x00F8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void ProcessAcknowledgment(const bool Accepted);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrewPlatformAndCountriesNotificationVM">();
	}
	static class UCrewPlatformAndCountriesNotificationVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewPlatformAndCountriesNotificationVM>();
	}
};

// Class CrewUI.CrewSubscriptionModalInfoVM
// 0x0030 (0x00A0 - 0x0070)
class UCrewSubscriptionModalInfoVM final : public UMVVMViewModelBase
{
public:
	class FString                                 ModalId;                                           // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FText>                           Entries;                                           // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class FString                                 QrCodeImageUrl;                                    // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrewSubscriptionModalInfoVM">();
	}
	static class UCrewSubscriptionModalInfoVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewSubscriptionModalInfoVM>();
	}
};

// Class CrewUI.CrewProgressiveItemsVM
// 0x0028 (0x00A0 - 0x0078)
class UCrewProgressiveItemsVM final : public UFortPerUserViewModel
{
public:
	TArray<class UCrewProgressiveSetVM*>          AllSets;                                           // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UCrewProgressiveSetVM*>          VisibleSets;                                       // 0x0088(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                          bAllSetsComplete;                                  // 0x0098(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrewProgressiveItemsVM">();
	}
	static class UCrewProgressiveItemsVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewProgressiveItemsVM>();
	}
};

// Class CrewUI.CrewProgressiveRewardVM
// 0x0068 (0x00D8 - 0x0070)
class UCrewProgressiveRewardVM final : public UMVVMViewModelBase
{
public:
	class FText                                   Name_0;                                            // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UMaterialInterface>      TileMaterial;                                      // 0x0080(0x0030)(BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UFortItemVM*>                    Items;                                             // 0x00B0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FCosmeticVariantInfo>           PreviewVariants;                                   // 0x00C0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bAllowPreviewStyles;                               // 0x00D0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrewProgressiveRewardVM">();
	}
	static class UCrewProgressiveRewardVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewProgressiveRewardVM>();
	}
};

// Class CrewUI.CrewProgressiveSelectionVM
// 0x0040 (0x00B8 - 0x0078)
class UCrewProgressiveSelectionVM final : public UFortPerUserViewModel
{
public:
	class UCrewProgressiveRewardVM*               SelectedReward;                                    // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCrewProgressiveStageVM*                SelectedStage;                                     // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCrewProgressiveSetVM*                  SelectedSet;                                       // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemVM*                            PreviewItem;                                       // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FCosmeticVariantInfo>           PreviewVariants;                                   // 0x0098(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrewProgressiveSelectionVM">();
	}
	static class UCrewProgressiveSelectionVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewProgressiveSelectionVM>();
	}
};

// Class CrewUI.CrewProgressiveSetVM
// 0x0090 (0x0100 - 0x0070)
class UCrewProgressiveSetVM final : public UMVVMViewModelBase
{
public:
	class FString                                 FulfillmentId;                                     // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   Name_0;                                            // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UMaterialInterface>      TileMaterial;                                      // 0x0090(0x0030)(BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UCrewProgressiveStageVM*>        Stages;                                            // 0x00C0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FDateTime                              CutoffDate;                                        // 0x00D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDateTime                              AcquisitionCutoffDate;                             // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDateTime                              AcquireStartDate;                                  // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   AcquisitionCutoffDateText;                         // 0x00E8(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	int32                                         UnlockedStages;                                    // 0x00F8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EProgressiveSetProgress                       Progress;                                          // 0x00FC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetIsCompleted() const;
	const class UCrewProgressiveStageVM* GetNextStage() const;
	int32 GetStageCount() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrewProgressiveSetVM">();
	}
	static class UCrewProgressiveSetVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewProgressiveSetVM>();
	}
};

// Class CrewUI.CrewProgressiveStageVM
// 0x0030 (0x00A0 - 0x0070)
class UCrewProgressiveStageVM final : public UMVVMViewModelBase
{
public:
	TArray<class UCrewProgressiveRewardVM*>       Rewards;                                           // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class FText                                   UnlockCriteria;                                    // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	int32                                         StageIndex;                                        // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         RemainingMonths;                                   // 0x0094(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsOwned;                                          // 0x0098(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FText GetName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrewProgressiveStageVM">();
	}
	static class UCrewProgressiveStageVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewProgressiveStageVM>();
	}
};

// Class CrewUI.CrewSelectionVM
// 0x0010 (0x0088 - 0x0078)
