#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CryptoKeys

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CryptoKeys_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class CryptoKeys.CryptoKeysCommandlet
// 0x0000 (0x0088 - 0x0088)
class UCryptoKeysCommandlet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CryptoKeysCommandlet">();
	}
	static class UCryptoKeysCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCryptoKeysCommandlet>();
	}
};

// Class CryptoKeys.CryptoKeysSettings
// 0x0060 (0x0090 - 0x0030)
class UCryptoKeysSettings final : public UObject
{
public:
	class FString                                 EncryptionKey;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, Config, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCryptoEncryptionKey>           SecondaryEncryptionKeys;                           // 0x0040(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bEncryptPakIniFiles;                               // 0x0050(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEncryptPakIndex;                                  // 0x0051(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEncryptUAssetFiles;                               // 0x0052(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEncryptAllAssetFiles;                             // 0x0053(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SigningPublicExponent;                             // 0x0058(0x0010)(Edit, ZeroConstructor, Config, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SigningModulus;                                    // 0x0068(0x0010)(Edit, ZeroConstructor, Config, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SigningPrivateExponent;                            // 0x0078(0x0010)(Edit, ZeroConstructor, Config, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnablePakSigning;                                 // 0x0088(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CryptoKeysSettings">();
	}
	static class UCryptoKeysSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCryptoKeysSettings>();
	}
};

}

