#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CurveEditor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CurveEditor_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class CurveEditor.CurveEditorFilterBase
// 0x0000 (0x0030 - 0x0030)
class UCurveEditorFilterBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CurveEditorFilterBase">();
	}
	static class UCurveEditorFilterBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveEditorFilterBase>();
	}
};

// Class CurveEditor.CurveEditorBakeFilter
// 0x0030 (0x0060 - 0x0030)
class UCurveEditorBakeFilter final : public UCurveEditorFilterBase
{
public:
	float                                         BakeIntervalInSeconds;                             // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           BakeInterval;                                      // 0x0034(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCustomRangeOverride;                              // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CustomRangeMinInSeconds;                           // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CustomRangeMaxInSeconds;                           // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCurveEditorBakeFilterRange            CustomRange;                                       // 0x0044(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseSeconds;                                       // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x13];                                      // 0x004D(0x0013)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CurveEditorBakeFilter">();
	}
	static class UCurveEditorBakeFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveEditorBakeFilter>();
	}
};

// Class CurveEditor.CurveEditorCopyableCurveKeys
// 0x0060 (0x0090 - 0x0030)
class UCurveEditorCopyableCurveKeys final : public UObject
{
public:
	TArray<struct FKeyPosition>                   KeyPositions;                                      // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FKeyAttributes>                 KeyAttributes;                                     // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 ShortDisplayName;                                  // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LongDisplayName;                                   // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IntentionName;                                     // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LongIntentionName;                                 // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CurveEditorCopyableCurveKeys">();
	}
	static class UCurveEditorCopyableCurveKeys* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveEditorCopyableCurveKeys>();
	}
};

// Class CurveEditor.CurveEditorCopyBuffer
// 0x0020 (0x0050 - 0x0030)
class UCurveEditorCopyBuffer final : public UObject
{
public:
	TArray<class UCurveEditorCopyableCurveKeys*>  Curves;                                            // 0x0030(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	double                                        TimeOffset;                                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsolutePosition;                                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CurveEditorCopyBuffer">();
	}
	static class UCurveEditorCopyBuffer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveEditorCopyBuffer>();
	}
};

// Class CurveEditor.CurveEditorEulerFilter
// 0x0000 (0x0030 - 0x0030)
class UCurveEditorEulerFilter final : public UCurveEditorFilterBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CurveEditorEulerFilter">();
	}
	static class UCurveEditorEulerFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveEditorEulerFilter>();
	}
};

// Class CurveEditor.CurveEditorGaussianFilter
// 0x0008 (0x0038 - 0x0030)
class UCurveEditorGaussianFilter final : public UCurveEditorFilterBase
{
public:
	struct FGaussianParams                        GaussianParams;                                    // 0x0030(0x0004)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CurveEditorGaussianFilter">();
	}
	static class UCurveEditorGaussianFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveEditorGaussianFilter>();
	}
};

// Class CurveEditor.CurveEditorKeyProxy
// 0x0000 (0x0030 - 0x0030)
class ICurveEditorKeyProxy final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CurveEditorKeyProxy">();
	}
	static class ICurveEditorKeyProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICurveEditorKeyProxy>();
	}
};

// Class CurveEditor.CurveEditorReduceFilter
// 0x0010 (0x0040 - 0x0030)
class UCurveEditorReduceFilter final : public UCurveEditorFilterBase
{
public:
	float                                         Tolerance;                                         // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTryRemoveUserSetTangentKeys;                      // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameRate                             SampleRate;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CurveEditorReduceFilter">();
	}
	static class UCurveEditorReduceFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveEditorReduceFilter>();
	}
};

// Class CurveEditor.CurveEditorSettings
// 0x00A0 (0x00D0 - 0x0030)
class UCurveEditorSettings final : public UObject
{
public:
	bool                                          bAutoFrameCurveEditor;                             // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowBars;                                         // 0x0031(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FrameInputPadding;                                 // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         FrameOutputPadding;                                // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowBufferedCurves;                               // 0x003C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowCurveEditorCurveToolTips;                     // 0x003D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECurveEditorTangentVisibility                 TangentVisibility;                                 // 0x003E(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECurveEditorZoomPosition                      ZoomPosition;                                      // 0x003F(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECurveEditorSnapAxis                          SnapAxis;                                          // 0x0040(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSnapTimeToSelection;                              // 0x0041(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           SelectionColor;                                    // 0x0044(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCustomColorForChannel>         CustomColors;                                      // 0x0058(0x0010)(Edit, ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	struct FLinearColor                           ParentSpaceCustomColor;                            // 0x0068(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           WorldSpaceCustomColor;                             // 0x0078(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FCustomColorForSpaceSwitch>     ControlSpaceCustomColors;                          // 0x0088(0x0010)(Edit, ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	float                                         TreeViewWidth;                                     // 0x0098(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9C[0x34];                                      // 0x009C(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CurveEditorSettings">();
	}
	static class UCurveEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveEditorSettings>();
	}
};

// Class CurveEditor.CurveEditorSmartReduceFilter
// 0x0010 (0x0040 - 0x0030)
class UCurveEditorSmartReduceFilter final : public UCurveEditorFilterBase
{
public:
	struct FSmartReduceParams                     SmartReduceParams;                                 // 0x0030(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CurveEditorSmartReduceFilter">();
	}
	static class UCurveEditorSmartReduceFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveEditorSmartReduceFilter>();
	}
};

// Class CurveEditor.RichCurveKeyProxy
// 0x0038 (0x0068 - 0x0030)
class URichCurveKeyProxy final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRichCurveKey                          Value;                                             // 0x0038(0x001C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_54[0x14];                                      // 0x0054(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RichCurveKeyProxy">();
	}
	static class URichCurveKeyProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<URichCurveKeyProxy>();
	}
};

}

