#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizableObjectEditor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CustomizableObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "MutableRuntime_structs.hpp"


namespace SDK
{

// Enum CustomizableObjectEditor.ECustomizableObjectOptimizationLevel
// NumValues: 0x0004
enum class ECustomizableObjectOptimizationLevel : uint8
{
	None                                     = 0,
	Minimal                                  = 1,
	Maximum                                  = 2,
	ECustomizableObjectOptimizationLevel_MAX = 3,
};

// Enum CustomizableObjectEditor.ECustomizableObjectCompilationState
// NumValues: 0x0005
enum class ECustomizableObjectCompilationState : uint8
{
	None                                     = 0,
	InProgress                               = 1,
	Completed                                = 2,
	Failed                                   = 3,
	ECustomizableObjectCompilationState_MAX  = 4,
};

// Enum CustomizableObjectEditor.ECustomizableObjectTextureLayoutPackingStrategy
// NumValues: 0x0004
enum class ECustomizableObjectTextureLayoutPackingStrategy : uint8
{
	Resizable                                = 0,
	Fixed                                    = 1,
	Overlay                                  = 2,
	ECustomizableObjectTextureLayoutPackingStrategy_MAX = 3,
};

// Enum CustomizableObjectEditor.ECustomizableObjectLayoutAutomaticBlocksStrategy
// NumValues: 0x0004
enum class ECustomizableObjectLayoutAutomaticBlocksStrategy : uint8
{
	Rectangles                               = 0,
	UVIslands                                = 1,
	Ignore                                   = 2,
	ECustomizableObjectLayoutAutomaticBlocksStrategy_MAX = 3,
};

// Enum CustomizableObjectEditor.ECustomizableObjectLayoutAutomaticBlocksMergeStrategy
// NumValues: 0x0003
enum class ECustomizableObjectLayoutAutomaticBlocksMergeStrategy : uint8
{
	DontMerge                                = 0,
	MergeChildBlocks                         = 1,
	ECustomizableObjectLayoutAutomaticBlocksMergeStrategy_MAX = 2,
};

// Enum CustomizableObjectEditor.ECustomizableObjectLayoutBlockReductionMethod
// NumValues: 0x0003
enum class ECustomizableObjectLayoutBlockReductionMethod : uint8
{
	Halve                                    = 0,
	Unitary                                  = 1,
	ECustomizableObjectLayoutBlockReductionMethod_MAX = 2,
};

// Enum CustomizableObjectEditor.EColorArithmeticOperation
// NumValues: 0x0005
enum class EColorArithmeticOperation : uint8
{
	E_Add                                    = 0,
	E_Sub                                    = 1,
	E_Mul                                    = 2,
	E_Div                                    = 3,
	E_MAX                                    = 4,
};

// Enum CustomizableObjectEditor.ECustomizableObjectNodeComponentVariationType
// NumValues: 0x0003
enum class ECustomizableObjectNodeComponentVariationType : uint8
{
	Tag                                      = 0,
	State                                    = 1,
	ECustomizableObjectNodeComponentVariationType_MAX = 2,
};

// Enum CustomizableObjectEditor.EFloatArithmeticOperation
// NumValues: 0x0005
enum class EFloatArithmeticOperation : uint8
{
	E_Add                                    = 0,
	E_Sub                                    = 1,
	E_Mul                                    = 2,
	E_Div                                    = 3,
	E_MAX                                    = 4,
};

// Enum CustomizableObjectEditor.ENodePinMode
// NumValues: 0x0003
enum class ENodePinMode : uint32
{
	Mutable                                  = 0,
	Passthrough                              = 1,
	ENodePinMode_MAX                         = 2,
};

// Enum CustomizableObjectEditor.EPinMode
// NumValues: 0x0004
enum class EPinMode : uint32
{
	Default                                  = 0,
	Mutable                                  = 1,
	Passthrough                              = 2,
	EPinMode_MAX                             = 3,
};

// Enum CustomizableObjectEditor.EUVLayoutMode
// NumValues: 0x0004
enum class EUVLayoutMode : uint32
{
	FromMaterial                             = 0,
	Ignore                                   = 1,
	Index                                    = 2,
	EUVLayoutMode_MAX                        = 3,
};

// Enum CustomizableObjectEditor.ECustomizableObjectNodeMaterialVariationType
// NumValues: 0x0003
enum class ECustomizableObjectNodeMaterialVariationType : uint8
{
	Tag                                      = 0,
	State                                    = 1,
	ECustomizableObjectNodeMaterialVariationType_MAX = 2,
};

// Enum CustomizableObjectEditor.EShapeBindingMethod
// NumValues: 0x0004
enum class EShapeBindingMethod : uint32
{
	ClosestProject                           = 0,
	ClosestToSurface                         = 1,
	NormalProject                            = 2,
	EShapeBindingMethod_MAX                  = 3,
};

// Enum CustomizableObjectEditor.EMeshReshapeVertexColorChannelUsage
// NumValues: 0x0004
enum class EMeshReshapeVertexColorChannelUsage : uint32
{
	None                                     = 0,
	RigidClusterId                           = 1,
	MaskWeight                               = 2,
	EMeshReshapeVertexColorChannelUsage_MAX  = 3,
};

// Enum CustomizableObjectEditor.EBoneDeformSelectionMethod
// NumValues: 0x0005
enum class EBoneDeformSelectionMethod : uint8
{
	ONLY_SELECTED                            = 0,
	ALL_BUT_SELECTED                         = 1,
	DEFORM_REF_SKELETON                      = 2,
	DEFORM_NONE_REF_SKELETON                 = 3,
	EBoneDeformSelectionMethod_MAX           = 4,
};

// Enum CustomizableObjectEditor.ECustomizableObjectAutomaticLODStrategy
// NumValues: 0x0004
enum class ECustomizableObjectAutomaticLODStrategy : uint8
{
	Inherited                                = 0,
	Manual                                   = 1,
	AutomaticFromMesh                        = 2,
	ECustomizableObjectAutomaticLODStrategy_MAX = 3,
};

// Enum CustomizableObjectEditor.ECustomizableObjectSelectionOverride
// NumValues: 0x0004
enum class ECustomizableObjectSelectionOverride : uint8
{
	NoOverride                               = 0,
	Disable                                  = 1,
	Enable                                   = 2,
	ECustomizableObjectSelectionOverride_MAX = 3,
};

// Enum CustomizableObjectEditor.ETableTextureType
// NumValues: 0x0003
enum class ETableTextureType : uint8
{
	PASSTHROUGH_TEXTURE                      = 0,
	MUTABLE_TEXTURE                          = 1,
	ETableTextureType_MAX                    = 2,
};

// Enum CustomizableObjectEditor.ETableDataGatheringSource
// NumValues: 0x0003
enum class ETableDataGatheringSource : uint8
{
	ETDGM_DataTable                          = 0,
	ETDGM_AssetRegistry                      = 1,
	ETDGM_MAX                                = 2,
};

// Enum CustomizableObjectEditor.ECustomizableObjectTextureLayerEffect
// NumValues: 0x000B
enum class ECustomizableObjectTextureLayerEffect : uint8
{
	COTLE_MODULATE                           = 0,
	COTLE_MULTIPLY                           = 1,
	COTLE_SOFTLIGHT                          = 2,
	COTLE_HARDLIGHT                          = 3,
	COTLE_DODGE                              = 4,
	COTLE_BURN                               = 5,
	COTLE_SCREEN                             = 6,
	COTLE_OVERLAY                            = 7,
	COTLE_ALPHA_OVERLAY                      = 8,
	COTLE_NORMAL_COMBINE                     = 9,
	COTLE_MAX                                = 10,
};

// Enum CustomizableObjectEditor.ETextureProjectSamplingMethod
// NumValues: 0x0003
enum class ETextureProjectSamplingMethod : uint32
{
	Point                                    = 0,
	BiLinear                                 = 1,
	ETextureProjectSamplingMethod_MAX        = 2,
};

// Enum CustomizableObjectEditor.ETextureProjectMinFilterMethod
// NumValues: 0x0003
enum class ETextureProjectMinFilterMethod : uint32
{
	None                                     = 0,
	TotalAreaHeuristic                       = 1,
	ETextureProjectMinFilterMethod_MAX       = 2,
};

// Enum CustomizableObjectEditor.ETextureTransformAddressMode
// NumValues: 0x0004
enum class ETextureTransformAddressMode : uint32
{
	Wrap                                     = 0,
	ClampToEdge                              = 1,
	ClampToBlack                             = 2,
	ETextureTransformAddressMode_MAX         = 3,
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectNodeMaterialVector
// 0x0028 (0x0028 - 0x0000)
struct FCustomizableObjectNodeMaterialVector final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LayerIndex;                                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PinName;                                           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectMaterialVariation
// 0x0010 (0x0010 - 0x0000)
struct FCustomizableObjectMaterialVariation final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.PostEditChangePropertyDelegateParameters
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FPostEditChangePropertyDelegateParameters final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomizableObjectEditor.NewCustomizableObjectParameters
// 0x0038 (0x0038 - 0x0000)
struct FNewCustomizableObjectParameters final
{
public:
	class FString                                 PackagePath;                                       // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetName;                                         // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCustomizableObject*                    ParentObject;                                      // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParentGroupNode;                                   // 0x0028(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.ViewportLightData
// 0x00A0 (0x00A0 - 0x0000)
struct FViewportLightData final
{
public:
	bool                                          bIsSpotLight;                                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Intensity;                                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AttenuationRadius;                                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SourceRadius;                                      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SourceLength;                                      // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InnerConeAngle;                                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OuterConeAngle;                                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectNodeMaterialImage
// 0x0038 (0x0038 - 0x0000)
struct FCustomizableObjectNodeMaterialImage final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UVLayout;                                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ReferenceTexture;                                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LayerIndex;                                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PinName;                                           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectNodeMaterialScalar
// 0x0028 (0x0028 - 0x0000)
struct FCustomizableObjectNodeMaterialScalar final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LayerIndex;                                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PinName;                                           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectNodeEditMaterialImage
// 0x0010 (0x0010 - 0x0000)
struct FCustomizableObjectNodeEditMaterialImage final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectNodeExtendMaterialImage
// 0x0010 (0x0010 - 0x0000)
struct FCustomizableObjectNodeExtendMaterialImage final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectNodeSkeletalMeshMaterial
// 0x0070 (0x0070 - 0x0000)
struct FCustomizableObjectNodeSkeletalMeshMaterial final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEdGraphPin_Deprecated*                 MeshPin;                                           // 0x0010(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UEdGraphPin_Deprecated*>         LayoutPins;                                        // 0x0018(0x0010)(ZeroConstructor, Deprecated, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UEdGraphPin_Deprecated*>         ImagePins;                                         // 0x0028(0x0010)(ZeroConstructor, Deprecated, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FEdGraphPinReference                   MeshPinRef;                                        // 0x0038(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FEdGraphPinReference>           LayoutPinsRef;                                     // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FEdGraphPinReference>           ImagePinsRef;                                      // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectNodeSkeletalMeshLOD
// 0x0010 (0x0010 - 0x0000)
struct FCustomizableObjectNodeSkeletalMeshLOD final
{
public:
	TArray<struct FCustomizableObjectNodeSkeletalMeshMaterial> Materials;                                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectColorVariation
// 0x0010 (0x0010 - 0x0000)
struct FCustomizableObjectColorVariation final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectFloatVariation
// 0x0010 (0x0010 - 0x0000)
struct FCustomizableObjectFloatVariation final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectMeshVariation
// 0x0010 (0x0010 - 0x0000)
struct FCustomizableObjectMeshVariation final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectGameplayTagsFilter
// 0x0028 (0x0028 - 0x0000)
struct FCustomizableObjectGameplayTagsFilter final
{
public:
	struct FGameplayTagContainer                  GameplayTagsFilter;                                // 0x0000(0x0020)(Edit, NativeAccessSpecifierPublic)
	EGameplayContainerMatchType                   GameplayTagsFilterType;                            // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectLayoutBlock
// 0x0038 (0x0038 - 0x0000)
struct FCustomizableObjectLayoutBlock final
{
public:
	struct FIntPoint                              Min;                                               // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              Max;                                               // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Priority;                                          // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Id;                                                // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReduceBothAxes;                                   // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReduceByTwo;                                      // 0x0025(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Mask;                                              // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectNodeEnumValue
// 0x0160 (0x0160 - 0x0000)
struct FCustomizableObjectNodeEnumValue final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMutableParamUIMetadata                ParamUIMetadata;                                   // 0x0010(0x0150)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectNodeFloatDescription
// 0x0010 (0x0010 - 0x0000)
struct FCustomizableObjectNodeFloatDescription final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.GroupProjectorParameterImage
// 0x0018 (0x0018 - 0x0000)
struct FGroupProjectorParameterImage final
{
public:
	class FString                                 OptionName;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             OptionTexture;                                     // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.GroupProjectorParameterPose
// 0x0018 (0x0018 - 0x0000)
struct FGroupProjectorParameterPose final
{
public:
	class FString                                 PoseName;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPoseAsset*                             OptionPose;                                        // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.NodeMaterialParameterId
// 0x0014 (0x0014 - 0x0000)
struct FNodeMaterialParameterId final
{
public:
	struct FGuid                                  ParameterId;                                       // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LayerIndex;                                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.MeshReshapeColorUsage
// 0x0010 (0x0010 - 0x0000)
struct FMeshReshapeColorUsage final
{
public:
	EMeshReshapeVertexColorChannelUsage           R;                                                 // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMeshReshapeVertexColorChannelUsage           G;                                                 // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMeshReshapeVertexColorChannelUsage           B;                                                 // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMeshReshapeVertexColorChannelUsage           A;                                                 // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.MeshReshapeBoneReference
// 0x000C (0x000C - 0x0000)
struct FMeshReshapeBoneReference final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.BoneToRemove
// 0x0010 (0x0010 - 0x0000)
struct FBoneToRemove final
{
public:
	bool                                          bOnlyRemoveChildren;                               // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BoneName;                                          // 0x0004(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.LODReductionSettings
// 0x0010 (0x0010 - 0x0000)
struct FLODReductionSettings final
{
public:
	TArray<struct FBoneToRemove>                  BonesToRemove;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.ComponentSettings
// 0x0020 (0x0020 - 0x0000)
struct FComponentSettings final
{
public:
	class FString                                 ComponentName;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLODReductionSettings>          LODReductionSettings;                              // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectState
// 0x0348 (0x0348 - 0x0000)
struct FCustomizableObjectState final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         RuntimeParameters;                                 // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	ETextureCompressionStrategy                   TextureCompressionStrategy;                        // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableTextureStreaming;                          // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLiveUpdateMode;                                   // 0x0022(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReuseInstanceTextures;                            // 0x0023(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBuildOnlyFirstLOD;                                // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, int32>                    NumExtraLODsToBuildPerPlatform;                    // 0x0028(0x0050)(Edit, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            ForcedParameterValues;                             // 0x0078(0x0050)(Edit, NativeAccessSpecifierPublic)
	struct FMutableStateUIMetadata                UIMetadata;                                        // 0x00C8(0x0128)(Edit, NativeAccessSpecifierPublic)
	struct FMutableParamUIMetadata                StateUIMetadata;                                   // 0x01F0(0x0150)(Deprecated, NativeAccessSpecifierPrivate)
	bool                                          bDontCompressRuntimeTextures;                      // 0x0340(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomizableObjectEditor.RealTimeMorphSelectionOverride
// 0x0030 (0x0030 - 0x0000)
struct FRealTimeMorphSelectionOverride final
{
public:
	class FName                                   MorphName;                                         // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECustomizableObjectSelectionOverride          SelectionOverride;                                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SkeletalMeshesNames;                               // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<ECustomizableObjectSelectionOverride>  Override;                                          // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectNodeStaticMeshMaterial
// 0x0070 (0x0070 - 0x0000)
struct FCustomizableObjectNodeStaticMeshMaterial final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEdGraphPin_Deprecated*                 MeshPin;                                           // 0x0010(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEdGraphPin_Deprecated*                 LayoutPin;                                         // 0x0018(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UEdGraphPin_Deprecated*>         ImagePins;                                         // 0x0020(0x0010)(ZeroConstructor, Deprecated, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FEdGraphPinReference                   MeshPinRef;                                        // 0x0030(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FEdGraphPinReference                   LayoutPinRef;                                      // 0x0048(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FEdGraphPinReference>           ImagePinsRef;                                      // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectNodeStaticMeshLOD
// 0x0010 (0x0010 - 0x0000)
struct FCustomizableObjectNodeStaticMeshLOD final
{
public:
	TArray<struct FCustomizableObjectNodeStaticMeshMaterial> Materials;                                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.TableNodeColumnData
// 0x0030 (0x0030 - 0x0000)
struct FTableNodeColumnData final
{
public:
	class FString                                 AnimInstanceColumnName;                            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AnimSlotColumnName;                                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AnimTagColumnName;                                 // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectTextureLayer
// 0x0001 (0x0001 - 0x0000)
struct FCustomizableObjectTextureLayer final
{
public:
	ECustomizableObjectTextureLayerEffect         Effect;                                            // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectTextureVariation
// 0x0010 (0x0010 - 0x0000)
struct FCustomizableObjectTextureVariation final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectVariation
// 0x0010 (0x0010 - 0x0000)
struct FCustomizableObjectVariation final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectSchemaAction_NewNode
// 0x0008 (0x00F8 - 0x00F0)
struct FCustomizableObjectSchemaAction_NewNode final : public FEdGraphSchemaAction
{
public:
	class UEdGraphNode*                           NodeTemplate;                                      // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectSchemaAction_Paste
// 0x0000 (0x00F0 - 0x00F0)
struct FCustomizableObjectSchemaAction_Paste final : public FEdGraphSchemaAction
{
};

// ScriptStruct CustomizableObjectEditor.CustomizableObjectExtensionDataVariation
// 0x0010 (0x0010 - 0x0000)
struct FCustomizableObjectExtensionDataVariation final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

