#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomControlsRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum CustomControlsRuntime.EAimControls
// NumValues: 0x0005
enum class EAimControls : uint8
{
	Facing                                   = 0,
	CardinalMovement                         = 1,
	FullRangeMovement                        = 2,
	FullRangeManual                          = 3,
	EAimControls_MAX                         = 4,
};

// Enum CustomControlsRuntime.ESideScrollerJump
// NumValues: 0x0004
enum class ESideScrollerJump : uint8
{
	Disabled                                 = 0,
	Dedicated                                = 1,
	Movement                                 = 2,
	ESideScrollerJump_MAX                    = 3,
};

// Enum CustomControlsRuntime.ESideScrollerCrouch
// NumValues: 0x0004
enum class ESideScrollerCrouch : uint8
{
	Disabled                                 = 0,
	Dedicated                                = 1,
	Movement                                 = 2,
	ESideScrollerCrouch_MAX                  = 3,
};

// Enum CustomControlsRuntime.EPlaceFireMissed
// NumValues: 0x000A
enum class EPlaceFireMissed : uint8
{
	None                                     = 0,
	Left                                     = 1,
	Right                                    = 2,
	Up                                       = 3,
	Down                                     = 4,
	UpLeft                                   = 5,
	UpRight                                  = 6,
	DownLeft                                 = 7,
	DownRight                                = 8,
	EPlaceFireMissed_MAX                     = 9,
};

// Enum CustomControlsRuntime.ECustomControlsFacingMode
// NumValues: 0x0004
enum class ECustomControlsFacingMode : uint8
{
	Movement                                 = 0,
	TwinStick                                = 1,
	Fixed                                    = 2,
	ECustomControlsFacingMode_MAX            = 3,
};

// Enum CustomControlsRuntime.ECustomControlsTwinStickMouseAimMode
// NumValues: 0x0003
enum class ECustomControlsTwinStickMouseAimMode : uint8
{
	TargetCursor                             = 0,
	DialAiming                               = 1,
	ECustomControlsTwinStickMouseAimMode_MAX = 2,
};

// Enum CustomControlsRuntime.ECustomControlsAttackType
// NumValues: 0x0005
enum class ECustomControlsAttackType : uint8
{
	None                                     = 0,
	Ranged                                   = 1,
	Melee                                    = 2,
	Throw                                    = 3,
	ECustomControlsAttackType_MAX            = 4,
};

// Enum CustomControlsRuntime.ECustomControlsTargetingType
// NumValues: 0x0005
enum class ECustomControlsTargetingType : uint8
{
	None                                     = 0,
	Aiming                                   = 1,
	Windup                                   = 2,
	MeleeLockOn                              = 3,
	ECustomControlsTargetingType_MAX         = 4,
};

// Enum CustomControlsRuntime.ECustomControlsWeaponType
// NumValues: 0x0005
enum class ECustomControlsWeaponType : uint8
{
	None                                     = 0,
	Ranged                                   = 1,
	Melee                                    = 2,
	Other                                    = 3,
	ECustomControlsWeaponType_MAX            = 4,
};

// Enum CustomControlsRuntime.ETargetingPresetType
// NumValues: 0x0005
enum class ETargetingPresetType : uint8
{
	Ranged                                   = 0,
	Retention                                = 1,
	Aiming                                   = 2,
	Melee                                    = 3,
	ETargetingPresetType_MAX                 = 4,
};

// Enum CustomControlsRuntime.ECustomControlsLockOnMode
// NumValues: 0x0006
enum class ECustomControlsLockOnMode : uint8
{
	Never                                    = 0,
	Always                                   = 1,
	Shooting                                 = 2,
	Aiming                                   = 3,
	ShootingOrAiming                         = 4,
	ECustomControlsLockOnMode_MAX            = 5,
};

// ScriptStruct CustomControlsRuntime.InteractionPointOptions
// 0x0010 (0x0010 - 0x0000)
struct FInteractionPointOptions final
{
public:
	EInteractionOrigin                            InteractionOrigin;                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InteractDistance;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InteractHighlightDistance;                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InteractExtentRadius;                              // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomControlsRuntime.InputOptions_SideScroller
// 0x0006 (0x0006 - 0x0000)
struct FInputOptions_SideScroller final
{
public:
	bool                                          bConstraintMovement;                               // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShootingLocomotionLockDirection;                  // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAimingLocomotionLockDirection;                    // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAimControls                                  AimControls;                                       // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESideScrollerJump                             SideScrollerJump;                                  // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESideScrollerCrouch                           SideScrollerCrouch;                                // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomControlsRuntime.InputOptions_ThirdPerson
// 0x0001 (0x0001 - 0x0000)
struct FInputOptions_ThirdPerson final
{
public:
	bool                                          bAutoFire;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomControlsRuntime.CustomControlsState
// 0x0004 (0x0004 - 0x0000)
struct FCustomControlsState final
{
public:
	bool                                          bHasFocusTarget;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECustomControlsAttackType                     AttackType;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECustomControlsTargetingType                  TargetingType;                                     // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECustomControlsWeaponType                     WeaponType;                                        // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomControlsRuntime.CustomControlWeightingTargetingData
// 0x0024 (0x0024 - 0x0000)
struct FCustomControlWeightingTargetingData final
{
public:
	float                                         PlayerWeight;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CreatureWeight;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VehicleWeight;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DestructiblesWeight;                               // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleWeight;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAngleWeightScaling;                               // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceWeight;                                    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDistanceWeightScaling;                            // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RetainedTargetWeight;                              // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomControlsRuntime.CustomControlCommonTargetingData
// 0x0030 (0x0030 - 0x0000)
struct FCustomControlCommonTargetingData final
{
public:
	struct FCustomControlWeightingTargetingData   WeightingData;                                     // 0x0000(0x0024)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 DeviceTest;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomControlsRuntime.CustomControlStateDependentTargetingData
// 0x0014 (0x0014 - 0x0000)
struct FCustomControlStateDependentTargetingData final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAngleWhileMoving;                              // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AngleWhileMoving;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequireLineOfSight;                               // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomControlsRuntime.CustomControlTargetingData
// 0x0048 (0x0048 - 0x0000)
struct FCustomControlTargetingData final
{
public:
	struct FCustomControlCommonTargetingData      CommonTargetingData;                               // 0x0000(0x0030)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FCustomControlStateDependentTargetingData StateDependentTargetingData;                       // 0x0030(0x0014)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomControlsRuntime.FortMovementMode_CCSideScrollerCreationData
// 0x0038 (0x0048 - 0x0010)
struct FFortMovementMode_CCSideScrollerCreationData final : public FFortMovementMode_BaseExtCreationData
{
public:
	bool                                          bConstraintMovement;                               // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ForwardRotationYaw;                                // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DeviceForwardVector;                               // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedMultiplier;                                   // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedMultiplierWhenShooting;                       // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedMultiplierWhenAiming;                         // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECustomControlsLockOnMode                     LockOnMode;                                        // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldAffectNPC;                                  // 0x003D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NPCDistanceToFaceTarget;                           // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomControlsRuntime.FortMovementMode_CCThirdPersonCreationData
// 0x0028 (0x0038 - 0x0010)
struct FFortMovementMode_CCThirdPersonCreationData final : public FFortMovementMode_BaseExtCreationData
{
public:
	float                                         SpeedMultiplier;                                   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedMultiplierWhenShooting;                       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedMultiplierWhenAiming;                         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationRateMultiplier;                            // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationRateWhenShootingMultiplier;                // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationRateWhenAimingMultiplier;                  // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECustomControlsLockOnMode                     LockOnMode;                                        // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FixedFacingYaw;                                    // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TacticalSprintRotationRateYaw;                     // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkydivingRotationRatePitch;                        // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

