#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizableObjectEditor

#include "Basic.hpp"

#include "CustomizableObjectEditor_structs.hpp"
#include "CustomizableObject_structs.hpp"


namespace SDK::Params
{

// Function CustomizableObjectEditor.UpdateClassWrapper.DelegatedCallback
// 0x0008 (0x0008 - 0x0000)
struct UpdateClassWrapper_DelegatedCallback final
{
public:
	class UCustomizableObjectInstance*            Instance;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomizableObjectEditor.CustomizableObjectEditorFunctionLibrary.CompileCustomizableObjectSynchronously
// 0x0010 (0x0010 - 0x0000)
struct CustomizableObjectEditorFunctionLibrary_CompileCustomizableObjectSynchronously final
{
public:
	class UCustomizableObject*                    CustomizableObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECustomizableObjectOptimizationLevel          OptimizationLevel;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECustomizableObjectTextureCompression         TextureCompression;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGatherReferences;                                 // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECustomizableObjectCompilationState           ReturnValue;                                       // 0x000B(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CustomizableObjectEditor.CustomizableObjectEditorFunctionLibrary.NewCustomizableObject
// 0x0040 (0x0040 - 0x0000)
struct CustomizableObjectEditorFunctionLibrary_NewCustomizableObject final
{
public:
	struct FNewCustomizableObjectParameters       Parameters;                                        // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UCustomizableObject*                    ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomizableObjectEditor.UpdateClassWrapperClass.DelegatedCallback
// 0x0008 (0x0008 - 0x0000)
struct UpdateClassWrapperClass_DelegatedCallback final
{
public:
	class UCustomizableObjectInstance*            Instance;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomizableObjectEditor.CustomizableObjectNodeSwitchBase.EnumParameterPostEditChangeProperty
// 0x0010 (0x0010 - 0x0000)
struct CustomizableObjectNodeSwitchBase_EnumParameterPostEditChangeProperty final
{
public:
	struct FPostEditChangePropertyDelegateParameters Parameters;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CustomizableObjectEditor.CustomizableObjectNodeMaterial.MeshPostEditChangeProperty
// 0x0010 (0x0010 - 0x0000)
struct CustomizableObjectNodeMaterial_MeshPostEditChangeProperty final
{
public:
	struct FPostEditChangePropertyDelegateParameters Parameters;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function CustomizableObjectEditor.UpdateClassHelper.DelegatedCallback
// 0x0008 (0x0008 - 0x0000)
struct UpdateClassHelper_DelegatedCallback final
{
public:
	class UCustomizableObjectInstance*            Instance;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomizableObjectEditor.LiveInstance.DelegatedCallback
// 0x0008 (0x0008 - 0x0000)
struct LiveInstance_DelegatedCallback final
{
public:
	class UCustomizableObjectInstance*            Instance;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomizableObjectEditor.PerformanceReportHelper.DelegatedCallback
// 0x0008 (0x0008 - 0x0000)
struct PerformanceReportHelper_DelegatedCallback final
{
public:
	class UCustomizableObjectInstance*            Instance;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

