#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: damage_volume_device

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"
#include "effect_volume_device_classes.hpp"


namespace SDK
{

// VerseClass damage_volume_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class damage_volume_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass damage_volume_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class damage_volume_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<damage_volume_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass damage_volume_device.damage_volume_device
// 0x0050 (0x0120 - 0x00D0)
class Udamage_volume_device final : public Ueffect_volume_device
{
public:
	class UObject*                                __verse_0x4DE856BF_AgentEntersEvent;               // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x8B9DBCF4_AgentExitsEvent;                // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x3AE56902_UpdateSelectedClassFunction;    // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xAD065A9B_UpdateSelectedTeamFunction;     // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_int*       __verse_0x12749CF4_GetSelectedClassFunction;       // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_int*       __verse_0x05319583_GetSelectedTeamFunction;        // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_int*       __verse_0x245F21CA_SetDamageFunction;              // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_int*       __verse_0x88A4CA60_GetDamageFunction;              // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0xB2AEAE78_IsAgentInVolumeFunction;        // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	int64 _L_2fFortnite_2ecom_2fDevices_2fdamage__volume__device_N_RGetDamage(const struct damage_volume_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fDevices_2fdamage__volume__device_N_RGetSelectedClass(const struct damage_volume_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fDevices_2fdamage__volume__device_N_RGetSelectedTeam(const struct damage_volume_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fdamage__volume__device_N_RIsInVolume_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fdamage__volume__device_N_RSetDamage_L_Nint_R(int64 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fdamage__volume__device_N_RUpdateSelectedClass_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fdamage__volume__device_N_RUpdateSelectedTeam_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"damage_volume_device">();
	}
	static class Udamage_volume_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Udamage_volume_device>();
	}
};

}

