#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DanceVolume

#include "Basic.hpp"

#include "DanceVolume_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DanceVolume.DanceSynchronizerComponent
// 0x0038 (0x0110 - 0x00D8)
class UDanceSynchronizerComponent final : public UActorComponent
{
public:
	uint8                                         bShouldHalfOrDoubleTimeDances : 1;                 // 0x00D8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDanceBeatInfo                         BeatInfo;                                          // 0x00DC(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Net, NoDestructor, Protected, ExposeOnSpawn, NativeAccessSpecifierProtected)
	EDanceBeatSyncMode                            SyncMode;                                          // 0x00E4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Tempo;                                             // 0x00E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        OwnerPlayerPawn;                                   // 0x00F0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 OwnerMeshComponent;                                // 0x00F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 LeaderMeshComponent;                               // 0x0100(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float CalculateDanceMontagePlayRate(const float CurrentTempo, const class UAnimMontage* Montage, const struct FDanceBeatInfo& DanceBeatInfo);
	class AFortPlayerPawn* GetOwnerFortPlayerPawn();
	class USkeletalMeshComponent* GetOwnerSkeletalMeshComponent();
	bool IsTempoSyncEnabled();
	void OnRep_SyncMode();
	void SetBeatSyncMode(EDanceBeatSyncMode NewMode);
	void SetDanceBeatInfo(const struct FDanceBeatInfo& NewDanceBeatInfo);
	void SetTempo(float NewTempo);
	void StopOwnerEmoteAudio();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DanceSynchronizerComponent">();
	}
	static class UDanceSynchronizerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDanceSynchronizerComponent>();
	}
};

// Class DanceVolume.DanceVolumeLibrary
// 0x0000 (0x0030 - 0x0030)
class UDanceVolumeLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ForceStopMontage(const class AFortPawn* FortPawn);
	static class UFortItemDefinition* GetLastEmoteExecuted(class AController* Controller);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DanceVolumeLibrary">();
	}
	static class UDanceVolumeLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDanceVolumeLibrary>();
	}
};

}

