#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: dance_mannequin_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass dance_mannequin_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class dance_mannequin_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass dance_mannequin_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class dance_mannequin_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<dance_mannequin_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass dance_mannequin_device.dance_mannequin_device
// 0x0040 (0x0100 - 0x00C0)
class Udance_mannequin_device final : public UDevices_creative_device_base
{
public:
	class UDevices_device_function*               __verse_0x5BDC7A5C_EnableFunction;                 // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC9184E23_DisableFunction;                // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x6492A892_ActivateDefaultPresetFunction;  // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xBE2ACC6B_ActivatePreset2Function;        // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x2BFEBCFE_ActivatePreset3Function;        // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x08DD2EB6_ActivateSkinAndEmoteCaptureFunction; // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x3AE323B6_DeactivateSkinAndEmoteCaptureFunction; // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fdance__mannequin__device_N_RActivateDefaultPreset(const struct dance_mannequin_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fdance__mannequin__device_N_RActivatePreset2(const struct dance_mannequin_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fdance__mannequin__device_N_RActivatePreset3(const struct dance_mannequin_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fdance__mannequin__device_N_RActivateSkinAndEmoteCapture_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fdance__mannequin__device_N_RDeactivateSkinAndEmoteCapture(const struct dance_mannequin_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fdance__mannequin__device_N_RDisable(const struct dance_mannequin_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fdance__mannequin__device_N_REnable(const struct dance_mannequin_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"dance_mannequin_device">();
	}
	static class Udance_mannequin_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Udance_mannequin_device>();
	}
};

}

