#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataDrivenGameplayEventRouter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayEventRouter_structs.hpp"


namespace SDK
{

// Enum DataDrivenGameplayEventRouter.EGameplayEventNetPolicy
// NumValues: 0x0003
enum class EGameplayEventNetPolicy : uint8
{
	ServerOnly                               = 0,
	ClientOrServer                           = 1,
	EGameplayEventNetPolicy_MAX              = 2,
};

// ScriptStruct DataDrivenGameplayEventRouter.GameplayEventDefinition
// 0x0010 (0x0010 - 0x0000)
struct FGameplayEventDefinition final
{
public:
	class UScriptStruct*                          EventType;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsStateful;                                       // 0x0008(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameplayEventNetPolicy                       NetPolicy;                                         // 0x0009(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DataDrivenGameplayEventRouter.GameplayEventDescriptor
// 0x0018 (0x0018 - 0x0000)
struct FGameplayEventDescriptor final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptStruct*                          EventType;                                         // 0x0008(0x0008)(ZeroConstructor, Deprecated, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsStateful;                                       // 0x0010(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameplayEventNetPolicy                       NetPolicy;                                         // 0x0011(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DataDrivenGameplayEventRouter.GameplayEventSubscription
// 0x0088 (0x0088 - 0x0000)
struct FGameplayEventSubscription final
{
public:
	TSoftObjectPtr<class UObject>                 Object;                                            // 0x0000(0x0030)(Edit, SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMemberReference                       EventDescriptor;                                   // 0x0030(0x0038)(Edit, SaveGame, NativeAccessSpecifierPublic)
	struct FGameplayEventListenerHandle           EventHandle;                                       // 0x0068(0x001C)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DataDrivenGameplayEventRouter.GameplayEventHandlerFunction
// 0x0088 (0x0088 - 0x0000)
struct FGameplayEventHandlerFunction final
{
public:
	struct FMemberReference                       EventHandlerFunction;                              // 0x0000(0x0038)(Edit, NativeAccessSpecifierPublic)
	TMap<class FName, class FString>              EventHandlerFunctionDefaultValues;                 // 0x0038(0x0050)(NativeAccessSpecifierPublic)
};

// ScriptStruct DataDrivenGameplayEventRouter.GameplayEventHandlerFunctions
// 0x0198 (0x0198 - 0x0000)
struct FGameplayEventHandlerFunctions final
{
public:
	struct FGameplayEventHandlerFunction          OnEventReceived;                                   // 0x0000(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayEventHandlerFunction          OnStatefulEventApplied;                            // 0x0088(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayEventHandlerFunction          OnStatefulEventCleared;                            // 0x0110(0x0088)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct DataDrivenGameplayEventRouter.GameplayEventFunction
// 0x01B0 (0x01B0 - 0x0000)
struct FGameplayEventFunction final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventHandlerFunction          OnEventReceived;                                   // 0x0008(0x0088)(Deprecated, EditorOnly, NativeAccessSpecifierPublic)
	struct FGameplayEventHandlerFunction          OnStatefulEventApplied;                            // 0x0090(0x0088)(Deprecated, EditorOnly, NativeAccessSpecifierPublic)
	struct FGameplayEventHandlerFunction          OnStatefulEventCleared;                            // 0x0118(0x0088)(Deprecated, EditorOnly, NativeAccessSpecifierPublic)
	TArray<struct FGameplayEventSubscription>     EventSubscriptions;                                // 0x01A0(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, SaveGame, NativeAccessSpecifierPublic)
};

}

