#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataflowEngine

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "DataflowEngine_structs.hpp"


namespace SDK
{

// Class DataflowEngine.Dataflow
// 0x00A8 (0x0158 - 0x00B0)
class UDataflow final : public UEdGraph
{
public:
	uint8                                         Pad_B0[0x38];                                      // 0x00B0(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bActive;                                           // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        Targets;                                           // 0x00F0(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic)
	class UMaterial*                              Material;                                          // 0x0100(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataflowType                                 Type;                                              // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataflowPreviewCacheParams            PreviewCacheParams;                                // 0x010C(0x0010)(DuplicateTransient, EditorOnly, NoDestructor, AssetRegistrySearchable, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 PreviewCacheAsset;                                 // 0x0120(0x0030)(DuplicateTransient, EditorOnly, AssetRegistrySearchable, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     PreviewBlueprintClass;                             // 0x0150(0x0008)(ZeroConstructor, DuplicateTransient, EditorOnly, NoDestructor, AssetRegistrySearchable, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Dataflow">();
	}
	static class UDataflow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflow>();
	}
};

// Class DataflowEngine.DataflowBlueprintLibrary
// 0x0000 (0x0030 - 0x0030)
class UDataflowBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void EvaluateTerminalNodeByName(class UDataflow* Dataflow, class FName TerminalNodeName, class UObject* ResultAsset);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowBlueprintLibrary">();
	}
	static class UDataflowBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowBlueprintLibrary>();
	}
};

// Class DataflowEngine.DataflowContextObject
// 0x0020 (0x0050 - 0x0030)
class UDataflowContextObject : public UObject
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowContextObject">();
	}
	static class UDataflowContextObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowContextObject>();
	}
};

// Class DataflowEngine.DataflowContentOwner
// 0x0000 (0x0030 - 0x0030)
class IDataflowContentOwner final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowContentOwner">();
	}
	static class IDataflowContentOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDataflowContentOwner>();
	}
};

// Class DataflowEngine.DataflowBaseContent
// 0x0048 (0x0098 - 0x0050)
class UDataflowBaseContent : public UDataflowContextObject
{
public:
	class FString                                 DataflowTerminal;                                  // 0x0050(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataflow*                              DataflowGraph;                                     // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                TerminalAsset;                                     // 0x0068(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_70[0x18];                                      // 0x0070(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsConstructionDirty;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsSimulationDirty;                                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8A[0xE];                                       // 0x008A(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowBaseContent">();
	}
	static class UDataflowBaseContent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowBaseContent>();
	}
};

// Class DataflowEngine.DataflowSkeletalContent
// 0x0020 (0x00B8 - 0x0098)
class UDataflowSkeletalContent final : public UDataflowBaseContent
{
public:
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0098(0x0008)(Edit, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeleton*                              Skeleton;                                          // 0x00A0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimationAsset*                        AnimationAsset;                                    // 0x00A8(0x0008)(Edit, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowSkeletalContent">();
	}
	static class UDataflowSkeletalContent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowSkeletalContent>();
	}
};

// Class DataflowEngine.DataflowEdNode
// 0x0028 (0x00E8 - 0x00C0)
class UDataflowEdNode final : public UEdGraphNode
{
public:
	uint8                                         Pad_C0[0x20];                                      // 0x00C0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bRenderInAssetEditor;                              // 0x00E0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRenderWireframeInAssetEditor;                     // 0x00E1(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCanEnableRenderWireframe;                         // 0x00E2(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowEdNode">();
	}
	static class UDataflowEdNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowEdNode>();
	}
};

}

