#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataflowEditor

#include "Basic.hpp"

#include "UnrealEd_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "MeshModelingToolsExp_classes.hpp"
#include "ModelingComponents_classes.hpp"
#include "DataflowEngine_structs.hpp"
#include "InteractiveToolsFramework_classes.hpp"
#include "DataflowEditor_structs.hpp"
#include "BaseCharacterFXEditor_classes.hpp"
#include "GeometryFramework_classes.hpp"
#include "EditorFramework_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DataflowEditor.AssetDefinition_DataflowAsset
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_DataflowAsset final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_DataflowAsset">();
	}
	static class UAssetDefinition_DataflowAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_DataflowAsset>();
	}
};

// Class DataflowEditor.AssetDefinition_DataflowContext
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_DataflowContext final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_DataflowContext">();
	}
	static class UAssetDefinition_DataflowContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_DataflowContext>();
	}
};

// Class DataflowEditor.DataflowEditorToolBuilder
// 0x0000 (0x0030 - 0x0030)
class IDataflowEditorToolBuilder final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowEditorToolBuilder">();
	}
	static class IDataflowEditorToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDataflowEditorToolBuilder>();
	}
};

// Class DataflowEditor.DataflowWeightMapEraseBrushOpProps
// 0x0008 (0x00B8 - 0x00B0)
class UDataflowWeightMapEraseBrushOpProps final : public UMeshSculptBrushOpProps
{
public:
	double                                        AttributeValue;                                    // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowWeightMapEraseBrushOpProps">();
	}
	static class UDataflowWeightMapEraseBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowWeightMapEraseBrushOpProps>();
	}
};

// Class DataflowEditor.DataflowWeightMapPaintBrushOpProps
// 0x0010 (0x00C0 - 0x00B0)
class UDataflowWeightMapPaintBrushOpProps final : public UMeshSculptBrushOpProps
{
public:
	double                                        AttributeValue;                                    // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Strength;                                          // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowWeightMapPaintBrushOpProps">();
	}
	static class UDataflowWeightMapPaintBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowWeightMapPaintBrushOpProps>();
	}
};

// Class DataflowEditor.DataflowWeightMapSmoothBrushOpProps
// 0x0008 (0x00B8 - 0x00B0)
class UDataflowWeightMapSmoothBrushOpProps final : public UMeshSculptBrushOpProps
{
public:
	float                                         Strength;                                          // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowWeightMapSmoothBrushOpProps">();
	}
	static class UDataflowWeightMapSmoothBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowWeightMapSmoothBrushOpProps>();
	}
};

// Class DataflowEditor.DataflowSimulationSceneDescription
// 0x0040 (0x0070 - 0x0030)
class UDataflowSimulationSceneDescription final : public UObject
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     BlueprintClass;                                    // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChaosCacheCollection*                  CacheAsset;                                        // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataflowPreviewCacheParams            CacheParams;                                       // 0x0058(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowSimulationSceneDescription">();
	}
	static class UDataflowSimulationSceneDescription* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowSimulationSceneDescription>();
	}
};

// Class DataflowEditor.DataflowEditorWeightMapPaintToolBuilder
// 0x0010 (0x0048 - 0x0038)
class UDataflowEditorWeightMapPaintToolBuilder final : public UMeshSurfacePointMeshEditingToolBuilder
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowEditorWeightMapPaintToolBuilder">();
	}
	static class UDataflowEditorWeightMapPaintToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowEditorWeightMapPaintToolBuilder>();
	}
};

// Class DataflowEditor.DataflowEditorWeightMapPaintBrushFilterProperties
// 0x0038 (0x00E8 - 0x00B0)
class UDataflowEditorWeightMapPaintBrushFilterProperties final : public UInteractiveToolPropertySet
{
public:
	EDataflowEditorWeightMapPaintInteractionType  SubToolType;                                       // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataflowEditorWeightMapPaintBrushType        PrimaryBrushType;                                  // 0x00B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BrushSize;                                         // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        AttributeValue;                                    // 0x00B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Strength;                                          // 0x00C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        GradientHighValue;                                 // 0x00C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        GradientLowValue;                                  // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleThreshold;                                    // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUVSeams;                                          // 0x00DC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNormalSeams;                                      // 0x00DD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataflowEditorWeightMapPaintVisibilityType   VisibilityFilter;                                  // 0x00DE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DF[0x1];                                       // 0x00DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ValueAtBrush;                                      // 0x00E0(0x0008)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowEditorWeightMapPaintBrushFilterProperties">();
	}
	static class UDataflowEditorWeightMapPaintBrushFilterProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowEditorWeightMapPaintBrushFilterProperties>();
	}
};

// Class DataflowEditor.DataflowEditorMeshWeightMapPaintToolActions
// 0x0008 (0x00B8 - 0x00B0)
class UDataflowEditorMeshWeightMapPaintToolActions final : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearAll();
	void FloodFillCurrent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowEditorMeshWeightMapPaintToolActions">();
	}
	static class UDataflowEditorMeshWeightMapPaintToolActions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowEditorMeshWeightMapPaintToolActions>();
	}
};

// Class DataflowEditor.DataflowEditorUpdateWeightMapProperties
// 0x0010 (0x00C0 - 0x00B0)
class UDataflowEditorUpdateWeightMapProperties final : public UInteractiveToolPropertySet
{
public:
	class FString                                 Name_0;                                            // 0x00B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowEditorUpdateWeightMapProperties">();
	}
	static class UDataflowEditorUpdateWeightMapProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowEditorUpdateWeightMapProperties>();
	}
};

// Class DataflowEditor.DataflowEditorWeightMapPaintTool
// 0x0790 (0x1330 - 0x0BA0)
class UDataflowEditorWeightMapPaintTool final : public UMeshSculptToolBase
{
public:
	class UDataflowEditorWeightMapPaintBrushFilterProperties* FilterProperties;                                  // 0x0BA0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataflowWeightMapPaintBrushOpProps*    PaintBrushOpProperties;                            // 0x0BA8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataflowWeightMapSmoothBrushOpProps*   SmoothBrushOpProperties;                           // 0x0BB0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataflowWeightMapEraseBrushOpProps*    EraseBrushOpProperties;                            // 0x0BB8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataflowEditorMeshWeightMapPaintToolActions* ActionsProps;                                      // 0x0BC0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataflowEditorUpdateWeightMapProperties* UpdateWeightMapProperties;                         // 0x0BC8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BD0[0x8];                                      // 0x0BD0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UPolyLassoMarqueeMechanic*              PolyLassoMechanic;                                 // 0x0BD8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPolygonSelectionMechanic*              PolygonSelectionMechanic;                          // 0x0BE0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BE8[0x318];                                    // 0x0BE8(0x0318)(Fixing Size After Last Property [ Dumper-7 ])
	class AInternalToolFrameworkActor*            PreviewMeshActor;                                  // 0x0F00(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicMeshComponent*                  DynamicMeshComponent;                              // 0x0F08(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshElementsVisualizer*                MeshElementsDisplay;                               // 0x0F10(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataflowContextObject*                 DataflowEditorContextObject;                       // 0x0F18(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F20[0x410];                                    // 0x0F20(0x0410)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowEditorWeightMapPaintTool">();
	}
	static class UDataflowEditorWeightMapPaintTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowEditorWeightMapPaintTool>();
	}
};

// Class DataflowEditor.DataflowAssetFactory
// 0x0000 (0x0088 - 0x0088)
class UDataflowAssetFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowAssetFactory">();
	}
	static class UDataflowAssetFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowAssetFactory>();
	}
};

// Class DataflowEditor.DataflowComponentReadOnlyToolTarget
// 0x0020 (0x0060 - 0x0040)
class UDataflowComponentReadOnlyToolTarget : public UPrimitiveComponentToolTarget
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowComponentReadOnlyToolTarget">();
	}
	static class UDataflowComponentReadOnlyToolTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowComponentReadOnlyToolTarget>();
	}
};

// Class DataflowEditor.DataflowComponentToolTarget
// 0x0010 (0x0070 - 0x0060)
class UDataflowComponentToolTarget final : public UDataflowComponentReadOnlyToolTarget
{
public:
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowComponentToolTarget">();
	}
	static class UDataflowComponentToolTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowComponentToolTarget>();
	}
};

// Class DataflowEditor.DataflowComponentReadOnlyToolTargetFactory
// 0x0000 (0x0030 - 0x0030)
class UDataflowComponentReadOnlyToolTargetFactory final : public UToolTargetFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowComponentReadOnlyToolTargetFactory">();
	}
	static class UDataflowComponentReadOnlyToolTargetFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowComponentReadOnlyToolTargetFactory>();
	}
};

// Class DataflowEditor.DataflowComponentToolTargetFactory
// 0x0000 (0x0030 - 0x0030)
class UDataflowComponentToolTargetFactory final : public UToolTargetFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowComponentToolTargetFactory">();
	}
	static class UDataflowComponentToolTargetFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowComponentToolTargetFactory>();
	}
};

// Class DataflowEditor.DataflowEditor
// 0x0020 (0x0070 - 0x0050)
class UDataflowEditor final : public UBaseCharacterFXEditor
{
public:
	class UDataflowBaseContent*                   EditorContent;                                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UDataflowBaseContent*>           TerminalContents;                                  // 0x0058(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowEditor">();
	}
	static class UDataflowEditor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowEditor>();
	}
};

// Class DataflowEditor.DataflowEditorCollectionComponent
// 0x0020 (0x0950 - 0x0930)
class UDataflowEditorCollectionComponent final : public UDynamicMeshComponent
{
public:
	int32                                         MeshIndex;                                         // 0x0930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_934[0x4];                                      // 0x0934(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataflowEdNode*                        Node;                                              // 0x0938(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshWireframeComponent*                WireframeComponent;                                // 0x0940(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_948[0x8];                                      // 0x0948(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowEditorCollectionComponent">();
	}
	static class UDataflowEditorCollectionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowEditorCollectionComponent>();
	}
};

// Class DataflowEditor.DataflowEditorMode
// 0x00D0 (0x0220 - 0x0150)
class UDataflowEditorMode final : public UBaseCharacterFXEditorMode
{
public:
	uint8                                         Pad_150[0x90];                                     // 0x0150(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class UEditorInteractiveToolsContext*         ActiveToolsContext;                                // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1E8[0x38];                                     // 0x01E8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowEditorMode">();
	}
	static class UDataflowEditorMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowEditorMode>();
	}
};

// Class DataflowEditor.DataflowEditorUISubsystem
// 0x0000 (0x0038 - 0x0038)
class UDataflowEditorUISubsystem final : public UAssetEditorUISubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowEditorUISubsystem">();
	}
	static class UDataflowEditorUISubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowEditorUISubsystem>();
	}
};

// Class DataflowEditor.DataflowSchema
// 0x0000 (0x0030 - 0x0030)
class UDataflowSchema final : public UEdGraphSchema
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowSchema">();
	}
	static class UDataflowSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowSchema>();
	}
};

// Class DataflowEditor.DataflowReadOnlyToolTarget
// 0x0040 (0x0070 - 0x0030)
class UDataflowReadOnlyToolTarget : public UToolTarget
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataflow*                              Dataflow;                                          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                Asset;                                             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowReadOnlyToolTarget">();
	}
	static class UDataflowReadOnlyToolTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowReadOnlyToolTarget>();
	}
};

// Class DataflowEditor.DataflowToolTarget
// 0x0010 (0x0080 - 0x0070)
class UDataflowToolTarget final : public UDataflowReadOnlyToolTarget
{
public:
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowToolTarget">();
	}
	static class UDataflowToolTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowToolTarget>();
	}
};

// Class DataflowEditor.DataflowReadOnlyToolTargetFactory
// 0x0000 (0x0030 - 0x0030)
class UDataflowReadOnlyToolTargetFactory final : public UToolTargetFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowReadOnlyToolTargetFactory">();
	}
	static class UDataflowReadOnlyToolTargetFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowReadOnlyToolTargetFactory>();
	}
};

// Class DataflowEditor.DataflowToolTargetFactory
// 0x0000 (0x0030 - 0x0030)
class UDataflowToolTargetFactory final : public UToolTargetFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataflowToolTargetFactory">();
	}
	static class UDataflowToolTargetFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowToolTargetFactory>();
	}
};

}

