#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataValidation

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "EditorSubsystem_classes.hpp"


namespace SDK
{

// Class DataValidation.DataValidationSettings
// 0x0008 (0x0068 - 0x0060)
class UDataValidationSettings final : public UDeveloperSettings
{
public:
	uint8                                         bValidateOnSave : 1;                               // 0x0060(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bLoadAssetsWhenValidatingChangelists : 1;          // 0x0060(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataValidationSettings">();
	}
	static class UDataValidationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataValidationSettings>();
	}
};

// Class DataValidation.DataValidationChangelist
// 0x0060 (0x0090 - 0x0030)
class UDataValidationChangelist final : public UObject
{
public:
	uint8                                         Pad_30[0x60];                                      // 0x0030(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataValidationChangelist">();
	}
	static class UDataValidationChangelist* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataValidationChangelist>();
	}
};

// Class DataValidation.DataValidationCommandlet
// 0x0000 (0x0088 - 0x0088)
class UDataValidationCommandlet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DataValidationCommandlet">();
	}
	static class UDataValidationCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataValidationCommandlet>();
	}
};

// Class DataValidation.EditorValidatorBase
// 0x0048 (0x0078 - 0x0030)
class UEditorValidatorBase : public UObject
{
public:
	bool                                          bIsEnabled;                                        // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsConfigDisabled;                                 // 0x0031(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOnlyPrintCustomMessage;                           // 0x0032(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_33[0x35];                                      // 0x0033(0x0035)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CurrentObjectBeingValidated;                       // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AssetFails(const class UObject* InAsset, const class FText& InMessage);
	void AssetPasses(const class UObject* InAsset);
	void AssetWarning(const class UObject* InAsset, const class FText& InMessage);
	EDataValidationResult K2_ValidateLoadedAsset(class UObject* InAsset);

	EDataValidationResult GetValidationResult() const;
	bool K2_CanValidate(const EDataValidationUsecase InUsecase) const;
	bool K2_CanValidateAsset(class UObject* InAsset) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorValidatorBase">();
	}
	static class UEditorValidatorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorValidatorBase>();
	}
};

// Class DataValidation.DirtyFilesChangelistValidator
// 0x0000 (0x0078 - 0x0078)
class UDirtyFilesChangelistValidator final : public UEditorValidatorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DirtyFilesChangelistValidator">();
	}
	static class UDirtyFilesChangelistValidator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDirtyFilesChangelistValidator>();
	}
};

// Class DataValidation.EditorValidatorSubsystem
// 0x0080 (0x00B8 - 0x0038)
class UEditorValidatorSubsystem : public UEditorSubsystem
{
public:
	TArray<struct FDirectoryPath>                 ExcludedDirectories;                               // 0x0038(0x0010)(ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	bool                                          bValidateOnSave;                                   // 0x0048(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_49[0x17];                                      // 0x0049(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FTopLevelAssetPath, class UEditorValidatorBase*> Validators;                                        // 0x0060(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                          bAllowBlueprintValidators;                         // 0x00B0(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddValidator(class UEditorValidatorBase* InValidator);
	void RemoveValidator(class UEditorValidatorBase* InValidator);

	EDataValidationResult IsAssetValid(const struct FAssetData& AssetData, TArray<class FText>* ValidationErrors, TArray<class FText>* ValidationWarnings, const EDataValidationUsecase InValidationUsecase) const;
	EDataValidationResult IsObjectValid(class UObject* InObject, TArray<class FText>* ValidationErrors, TArray<class FText>* ValidationWarnings, const EDataValidationUsecase InValidationUsecase) const;
	int32 ValidateAssetsWithSettings(const TArray<struct FAssetData>& AssetDataList, const struct FValidateAssetsSettings& InSettings, struct FValidateAssetsResults* OutResults) const;
	EDataValidationResult ValidateChangelist(class UDataValidationChangelist* InChangelist, const struct FValidateAssetsSettings& InSettings, struct FValidateAssetsResults* OutResults) const;
	EDataValidationResult ValidateChangelists(const TArray<class UDataValidationChangelist*>& InChangelists, const struct FValidateAssetsSettings& InSettings, struct FValidateAssetsResults* OutResults) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorValidatorSubsystem">();
	}
	static class UEditorValidatorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorValidatorSubsystem>();
	}
};

// Class DataValidation.EditorValidator_Localization
// 0x0050 (0x00C8 - 0x0078)
class UEditorValidator_Localization final : public UEditorValidatorBase
{
public:
	uint8                                         Pad_78[0x50];                                      // 0x0078(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorValidator_Localization">();
	}
	static class UEditorValidator_Localization* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorValidator_Localization>();
	}
};

// Class DataValidation.PackageFileValidator
// 0x0008 (0x0080 - 0x0078)
class UPackageFileValidator final : public UEditorValidatorBase
{
public:
	bool                                          bValidatePayloadHashes;                            // 0x0078(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PackageFileValidator">();
	}
	static class UPackageFileValidator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPackageFileValidator>();
	}
};

// Class DataValidation.WorldPartitionChangelistValidator
// 0x0120 (0x0198 - 0x0078)
class UWorldPartitionChangelistValidator final : public UEditorValidatorBase
{
public:
	uint8                                         Pad_78[0x120];                                     // 0x0078(0x0120)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldPartitionChangelistValidator">();
	}
	static class UWorldPartitionChangelistValidator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldPartitionChangelistValidator>();
	}
};

}

