#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataDrivenGameplayEventBindingCache

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct DataDrivenGameplayEventBindingCache.GameplayEventCachedPropertyId
// 0x001C (0x001C - 0x0000)
struct FGameplayEventCachedPropertyId final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  PropertyGuid;                                      // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DataDrivenGameplayEventBindingCache.GameplayEventCachedBinding
// 0x0050 (0x0050 - 0x0000)
struct FGameplayEventCachedBinding final
{
public:
	TSoftObjectPtr<class UObject>                 Object;                                            // 0x0000(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEventCachedPropertyId         PropertyId;                                        // 0x0030(0x001C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DataDrivenGameplayEventBindingCache.GameplayEventCachedBindings
// 0x0030 (0x0030 - 0x0000)
struct FGameplayEventCachedBindings final
{
public:
	struct FGameplayEventCachedPropertyId         PropertyId;                                        // 0x0000(0x001C)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayEventCachedBinding>    EventBindings;                                     // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DataDrivenGameplayEventBindingCache.GameplayEventCachedPropertyBindings
// 0x0010 (0x0010 - 0x0000)
struct FGameplayEventCachedPropertyBindings final
{
public:
	TArray<struct FGameplayEventCachedBindings>   PropertyBindings;                                  // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

}

