#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataValidation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DataValidation_structs.hpp"


namespace SDK::Params
{

// Function DataValidation.EditorValidatorBase.AssetFails
// 0x0018 (0x0018 - 0x0000)
struct EditorValidatorBase_AssetFails final
{
public:
	const class UObject*                          InAsset;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   InMessage;                                         // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DataValidation.EditorValidatorBase.AssetPasses
// 0x0008 (0x0008 - 0x0000)
struct EditorValidatorBase_AssetPasses final
{
public:
	const class UObject*                          InAsset;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DataValidation.EditorValidatorBase.AssetWarning
// 0x0018 (0x0018 - 0x0000)
struct EditorValidatorBase_AssetWarning final
{
public:
	const class UObject*                          InAsset;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   InMessage;                                         // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DataValidation.EditorValidatorBase.K2_ValidateLoadedAsset
// 0x0010 (0x0010 - 0x0000)
struct EditorValidatorBase_K2_ValidateLoadedAsset final
{
public:
	class UObject*                                InAsset;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataValidationResult                         ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DataValidation.EditorValidatorBase.GetValidationResult
// 0x0001 (0x0001 - 0x0000)
struct EditorValidatorBase_GetValidationResult final
{
public:
	EDataValidationResult                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DataValidation.EditorValidatorBase.K2_CanValidate
// 0x0002 (0x0002 - 0x0000)
struct EditorValidatorBase_K2_CanValidate final
{
public:
	EDataValidationUsecase                        InUsecase;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DataValidation.EditorValidatorBase.K2_CanValidateAsset
// 0x0010 (0x0010 - 0x0000)
struct EditorValidatorBase_K2_CanValidateAsset final
{
public:
	class UObject*                                InAsset;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DataValidation.EditorValidatorSubsystem.AddValidator
// 0x0008 (0x0008 - 0x0000)
struct EditorValidatorSubsystem_AddValidator final
{
public:
	class UEditorValidatorBase*                   InValidator;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DataValidation.EditorValidatorSubsystem.RemoveValidator
// 0x0008 (0x0008 - 0x0000)
struct EditorValidatorSubsystem_RemoveValidator final
{
public:
	class UEditorValidatorBase*                   InValidator;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DataValidation.EditorValidatorSubsystem.IsAssetValid
// 0x00C0 (0x00C0 - 0x0000)
struct EditorValidatorSubsystem_IsAssetValid final
{
public:
	struct FAssetData                             AssetData;                                         // 0x0000(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FText>                           ValidationErrors;                                  // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FText>                           ValidationWarnings;                                // 0x00A8(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	EDataValidationUsecase                        InValidationUsecase;                               // 0x00B8(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataValidationResult                         ReturnValue;                                       // 0x00B9(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DataValidation.EditorValidatorSubsystem.IsObjectValid
// 0x0030 (0x0030 - 0x0000)
struct EditorValidatorSubsystem_IsObjectValid final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FText>                           ValidationErrors;                                  // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FText>                           ValidationWarnings;                                // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	EDataValidationUsecase                        InValidationUsecase;                               // 0x0028(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataValidationResult                         ReturnValue;                                       // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DataValidation.EditorValidatorSubsystem.ValidateAssetsWithSettings
// 0x00B8 (0x00B8 - 0x0000)
struct EditorValidatorSubsystem_ValidateAssetsWithSettings final
{
public:
	TArray<struct FAssetData>                     AssetDataList;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FValidateAssetsSettings                InSettings;                                        // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FValidateAssetsResults                 OutResults;                                        // 0x0040(0x0070)(Parm, OutParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x00B0(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DataValidation.EditorValidatorSubsystem.ValidateChangelist
// 0x00B0 (0x00B0 - 0x0000)
struct EditorValidatorSubsystem_ValidateChangelist final
{
public:
	class UDataValidationChangelist*              InChangelist;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FValidateAssetsSettings                InSettings;                                        // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FValidateAssetsResults                 OutResults;                                        // 0x0038(0x0070)(Parm, OutParm, NativeAccessSpecifierPublic)
	EDataValidationResult                         ReturnValue;                                       // 0x00A8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DataValidation.EditorValidatorSubsystem.ValidateChangelists
// 0x00B8 (0x00B8 - 0x0000)
struct EditorValidatorSubsystem_ValidateChangelists final
{
public:
	TArray<class UDataValidationChangelist*>      InChangelists;                                     // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FValidateAssetsSettings                InSettings;                                        // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FValidateAssetsResults                 OutResults;                                        // 0x0040(0x0070)(Parm, OutParm, NativeAccessSpecifierPublic)
	EDataValidationResult                         ReturnValue;                                       // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

