#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DaySequenceEditor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct DaySequenceEditor.DaySequencePropertyTrackSettings
// 0x0020 (0x0020 - 0x0000)
struct FDaySequencePropertyTrackSettings final
{
public:
	class FString                                 ComponentPath;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyPath;                                      // 0x0010(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DaySequenceEditor.DaySequenceTrackSettings
// 0x0068 (0x0068 - 0x0000)
struct FDaySequenceTrackSettings final
{
public:
	struct FSoftClassPath                         MatchingActorClass;                                // 0x0000(0x0028)(Edit, ZeroConstructor, Config, NoClear, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftClassPath>                 DefaultTracks;                                     // 0x0028(0x0010)(Edit, ZeroConstructor, Config, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FSoftClassPath>                 ExcludeDefaultTracks;                              // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FDaySequencePropertyTrackSettings> DefaultPropertyTracks;                             // 0x0048(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FDaySequencePropertyTrackSettings> ExcludeDefaultPropertyTracks;                      // 0x0058(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
};

}

