#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DaySequenceEditor

#include "Basic.hpp"

#include "UnrealEd_classes.hpp"
#include "DaySequence_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DaySequenceEditor_structs.hpp"


namespace SDK
{

// Class DaySequenceEditor.AssetDefinition_DaySequence
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_DaySequence final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_DaySequence">();
	}
	static class UAssetDefinition_DaySequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_DaySequence>();
	}
};

// Class DaySequenceEditor.AssetDefinition_DaySequenceCollectionAsset
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_DaySequenceCollectionAsset final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_DaySequenceCollectionAsset">();
	}
	static class UAssetDefinition_DaySequenceCollectionAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_DaySequenceCollectionAsset>();
	}
};

// Class DaySequenceEditor.DaySequenceCollectionAssetFactory
// 0x0000 (0x0088 - 0x0088)
class UDaySequenceCollectionAssetFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceCollectionAssetFactory">();
	}
	static class UDaySequenceCollectionAssetFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceCollectionAssetFactory>();
	}
};

// Class DaySequenceEditor.DaySequenceEditorMenuContext
// 0x0010 (0x0040 - 0x0030)
class UDaySequenceEditorMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceEditorMenuContext">();
	}
	static class UDaySequenceEditorMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceEditorMenuContext>();
	}
};

// Class DaySequenceEditor.EditableDaySequenceConditionSet
// 0x0068 (0x0098 - 0x0030)
class UEditableDaySequenceConditionSet final : public UObject
{
public:
	struct FDaySequenceConditionSet               ConditionSet;                                      // 0x0030(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_80[0x18];                                      // 0x0080(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditableDaySequenceConditionSet">();
	}
	static class UEditableDaySequenceConditionSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditableDaySequenceConditionSet>();
	}
};

// Class DaySequenceEditor.DaySequenceActorFactory
// 0x0000 (0x0090 - 0x0090)
class UDaySequenceActorFactory final : public UActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceActorFactory">();
	}
	static class UDaySequenceActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceActorFactory>();
	}
};

// Class DaySequenceEditor.DaySequenceEditorSettings
// 0x0018 (0x0048 - 0x0030)
class UDaySequenceEditorSettings final : public UObject
{
public:
	TArray<struct FDaySequenceTrackSettings>      TrackSettings;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bAutoBindToPIE;                                    // 0x0040(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoBindToSimulate;                               // 0x0041(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceEditorSettings">();
	}
	static class UDaySequenceEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceEditorSettings>();
	}
};

// Class DaySequenceEditor.DaySequenceFactoryNew
// 0x0000 (0x0088 - 0x0088)
class UDaySequenceFactoryNew final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceFactoryNew">();
	}
	static class UDaySequenceFactoryNew* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceFactoryNew>();
	}
};

}

