#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultGraphBurnIn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MovieRenderPipelineCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DefaultGraphBurnIn.DefaultGraphBurnIn_C
// 0x0038 (0x0450 - 0x0418)
class UDefaultGraphBurnIn_C final : public UMovieGraphBurnInWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             BottomCenter;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BottomLeft;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BottomRight;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TopLeft;                                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TopRight;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableTextBox*              UserJobComment;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DefaultGraphBurnIn(int32 EntryPoint);
	void UpdateBottomCenter(class UMovieGraphPipeline* GraphPipeline);
	void UpdateBottomLeftText(class UMovieGraphPipeline* GraphPipeline);
	void UpdateBottomRightText(class UMovieGraphPipeline* GraphPipeline);
	void UpdateForGraph(class UMovieGraphPipeline* InGraphPipeline, class UMovieGraphEvaluatedConfig* InEvaluatedConfig);
	void UpdateTopLeftText(class UMovieGraphPipeline* GraphPipeline);
	void UpdateTopRightText(class UMovieGraphPipeline* GraphPipeline);
	void UpdateUserCommentText(class UMovieGraphPipeline* GraphPipeline);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DefaultGraphBurnIn_C">();
	}
	static class UDefaultGraphBurnIn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultGraphBurnIn_C>();
	}
};

}

