#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultBurnIn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MovieRenderPipelineSettings_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DefaultBurnIn.DefaultBurnIn_C
// 0x0038 (0x0450 - 0x0418)
class UDefaultBurnIn_C final : public UMoviePipelineBurnInWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             BottomCenter;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BottomLeft;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BottomRight;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TopLeft;                                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TopRight;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableTextBox*              UserJobComment;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DefaultBurnIn(int32 EntryPoint);
	void OnOutputFrameStarted(class UMoviePipeline* ForPipeline);
	void UpdateBottomCenter(class UMoviePipeline* ForPipeline);
	void UpdateBottomLeftText(class UMoviePipeline* ForPipeline);
	void UpdateBottomRightText(class UMoviePipeline* ForPipeline);
	void UpdateTopLeftText(class UMoviePipeline* ForPipeline);
	void UpdateTopRightText(class UMoviePipeline* ForPipeline);
	void UpdateUserCommentText(class UMoviePipeline* For_Pipeline);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DefaultBurnIn_C">();
	}
	static class UDefaultBurnIn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultBurnIn_C>();
	}
};

}

