#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarAudio

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "DelMarAudio_structs.hpp"
#include "DelMarCore_structs.hpp"
#include "PlayspaceSystem_classes.hpp"


namespace SDK
{

// Class DelMarAudio.DelMarAudioCheatManager
// 0x0000 (0x0030 - 0x0030)
class UDelMarAudioCheatManager final : public UChildCheatManager
{
public:
	void DelMarPrintMusicTrackName();
	void DelMarSetMusicTrigger(class FName TriggerName);
	void DelMarSkipMusic();
	void DelMarStartMusic();
	void DelMarStopMusic();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarAudioCheatManager">();
	}
	static class UDelMarAudioCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarAudioCheatManager>();
	}
};

// Class DelMarAudio.DelMarAudioProximityComponentBase
// 0x0038 (0x0110 - 0x00D8)
class UDelMarAudioProximityComponentBase : public UActorComponent
{
public:
	TMulticastInlineDelegate<void()>              OnProximityStart;                                  // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnProximityStop;                                   // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bProximityActive;                                  // 0x00F8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0xF];                                       // 0x00F9(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	class UDelMarAudioProximitySubsystem*         Subsystem;                                         // 0x0108(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_StartProximity();
	void BP_StopProximity();
	void BP_Update(const class APlayerCameraManager* Camera, const class ADelMarVehicle* Vehicle);
	class UAudioComponent* CreateSoundAttached(class USoundBase* Sound, class USceneComponent* AttachComponent, class FName AttachPointName, float VolumeMultiplier, float PitchMultiplier, bool bStopWhenAttachedToDestroyed, bool bAutoDestroy);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarAudioProximityComponentBase">();
	}
	static class UDelMarAudioProximityComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarAudioProximityComponentBase>();
	}
};

// Class DelMarAudio.DelMarAudioProximityComponent
// 0x0020 (0x0130 - 0x0110)
class UDelMarAudioProximityComponent : public UDelMarAudioProximityComponentBase
{
public:
	class USoundBase*                             ProximitySound;                                    // 0x0110(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        ProximityComponent;                                // 0x0118(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ObjectScaleAttenuationModifier;                    // 0x0120(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutDuration;                                   // 0x0124(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetObjectScale() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarAudioProximityComponent">();
	}
	static class UDelMarAudioProximityComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarAudioProximityComponent>();
	}
};

// Class DelMarAudio.DelMarAudioPassbyComponent
// 0x0050 (0x0180 - 0x0130)
class UDelMarAudioPassbyComponent final : public UDelMarAudioProximityComponent
{
public:
	class USoundBase*                             PassbySound;                                       // 0x0130(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        PassbyComponent;                                   // 0x0138(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* Instigator, float PassbySpeed)> OnPassbyStart;                                     // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPassbyStop;                                      // 0x0150(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         MinRelativeSpeed;                                  // 0x0160(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinSpeedStopThresholdOffset;                       // 0x0164(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PassbyStartRadiusMax;                              // 0x0168(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PassbyStartRadiusMin;                              // 0x016C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinRelativeDirection;                              // 0x0170(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PassbyCooldown;                                    // 0x0174(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_StartPassby(class AActor* Instigator, const float PassbySpeed);
	void BP_StopPassby();
	void HandlePassbyFinished();

	bool IsPlayingPassby() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarAudioPassbyComponent">();
	}
	static class UDelMarAudioPassbyComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarAudioPassbyComponent>();
	}
};

// Class DelMarAudio.DelMarAudioProximitySubsystem
// 0x00A0 (0x00E8 - 0x0048)
class UDelMarAudioProximitySubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_48[0xA0];                                      // 0x0048(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarAudioProximitySubsystem">();
	}
	static class UDelMarAudioProximitySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarAudioProximitySubsystem>();
	}
};

// Class DelMarAudio.DelMarAudioStateMixerSubsystem
// 0x00B0 (0x00F8 - 0x0048)
class UDelMarAudioStateMixerSubsystem final : public UTickableWorldSubsystem
{
public:
	TArray<struct FDelMarStateMixCollection>      AvailableMixes;                                    // 0x0048(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FDelMarStateMix> ActiveMixes;                                       // 0x0058(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FDelMarStateMix> TemporaryMixes;                                    // 0x00A8(0x0050)(Protected, NativeAccessSpecifierProtected)

public:
	void AddMixes(const class FName GroupName, const TArray<struct FDelMarStateMix>& Mixes);
	void ClearMixState(const struct FGameplayTag& MixState, bool bDeactivateChildren);
	void RemoveMixes(const class FName GroupName);
	bool SetMixState(const struct FGameplayTag& MixState, bool bFallBackToNearestParent, bool bDeactivateChildren);

	const TMap<struct FGameplayTag, struct FDelMarStateMix> GetActiveMixes() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarAudioStateMixerSubsystem">();
	}
	static class UDelMarAudioStateMixerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarAudioStateMixerSubsystem>();
	}
};

// Class DelMarAudio.DelMarAudioStatePlayspaceComponent
// 0x0160 (0x0238 - 0x00D8)
class UDelMarAudioStatePlayspaceComponent final : public UPlayspaceComponent
{
public:
	uint8                                         Pad_D8[0xC0];                                      // 0x00D8(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MixGroupName;                                      // 0x0198(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDelMarStateMix>                Mixes;                                             // 0x01A8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         CloseVehicleDistanceThreshold;                     // 0x01B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloseVehiclesPackRacingThreshold;                  // 0x01BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundControlBus*                       UserMusicSettingBus;                               // 0x01C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundControlBusMix*                    UserMusicMix;                                      // 0x01C8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D0[0x18];                                     // 0x01D0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UDelMarAudioStateMixerSubsystem*        MixSubsystem;                                      // 0x01E8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarVehicleManager*                  VehicleManager;                                    // 0x01F0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F8[0x40];                                     // 0x01F8(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleVehicleBigAirStarted();
	void HandleVehicleBigAirStopped();
	void HandleVehicleDemolished(const struct FGameplayTag& CausedByTag);
	void HandleVehicleHitHazard();
	void HandleVehicleTurboStarted();
	void HandleVehicleTurboStopped();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarAudioStatePlayspaceComponent">();
	}
	static class UDelMarAudioStatePlayspaceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarAudioStatePlayspaceComponent>();
	}
};

// Class DelMarAudio.DelMarCrowdAudioManager
// 0x0018 (0x00F0 - 0x00D8)
class UDelMarCrowdAudioManager final : public UPlayspaceComponent
{
public:
	class UDelMarAudioStatePlayspaceComponent*    CachedStateComponent;                              // 0x00D8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           RaceModeTag;                                       // 0x00E0(0x000C)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnApproachingFinishLine();
	void BP_OnGameplayStateChanged(const struct FGameplayTag& NewStateTag);
	void BP_OnPlayerFinishedRace();
	void BP_OnRaceModeChanged(const struct FGameplayTag& NewRaceModeTag);
	void BP_OnRacerStateChanged(const struct FGameplayTag& NewStateTag);
	void BP_OnVehicleDemolished();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarCrowdAudioManager">();
	}
	static class UDelMarCrowdAudioManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarCrowdAudioManager>();
	}
};

// Class DelMarAudio.DelMarRaceMusicManager
// 0x00F8 (0x01D0 - 0x00D8)
class UDelMarRaceMusicManager final : public UPlayspaceComponent
{
public:
	struct FGameplayTag                           RaceModeTag;                                       // 0x00D8(0x000C)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             MusicPlayer;                                       // 0x00E8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                             MusicPlayer_LowSpec;                               // 0x00F0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           MusicEventSystemTag;                               // 0x00F8(0x000C)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FadeInDuration;                                    // 0x0104(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FadeOutDuration;                                   // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StartLineFadeOutDurtation;                         // 0x010C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                             PreRaceMusic;                                      // 0x0110(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                             PostRaceMusic;                                     // 0x0118(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAudioComponent*                        MainMusicComponent;                                // 0x0120(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAudioComponent*                        StartLineComponent;                                // 0x0128(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UDelMarRaceMusicPlaylist> DefaultPlaylist;                                   // 0x0130(0x0030)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarRaceMusicPlaylist*               Playlist;                                          // 0x0160(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FDelMarMusicTrack>              Songs;                                             // 0x0168(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	struct FDelMarMusicTrack                      PlayingSong;                                       // 0x0178(0x0020)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UDelMarAudioStatePlayspaceComponent*    CachedStateComponent;                              // 0x0198(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A0[0x30];                                     // 0x01A0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnCountdownTimeSet(const float TimeUntilRunStart);
	void BP_OnGameplayStateChanged(const struct FGameplayTag& NewStateTag);
	void BP_OnPlayerFinishedRace();
	void BP_OnRaceModeChanged(const struct FGameplayTag& NewModeTag);
	void BP_OnRacerStateChanged(const struct FGameplayTag& NewStateTag);
	void HandleSpectatorViewTargetChange(class AFortPlayerController* PlayerController, class AActor* OldViewTarget, class AActor* NewViewTarget);
	void SetAudioTrigger(const class FName InTrigger);
	void SetPlaylist(class UDelMarRaceMusicPlaylist* InPlaylist);
	void SetPostRaceMusic(class USoundBase* InPostRaceMusic);
	void SetPreRaceMusic(class USoundBase* InPreRaceMusic);
	void SkipTrack();
	void StartRaceMusic();
	void StartStartLineMusic(const float CountdownLength);
	void StopMusic();
	void TryGetFortClientSettings();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRaceMusicManager">();
	}
	static class UDelMarRaceMusicManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarRaceMusicManager>();
	}
};

// Class DelMarAudio.DelMarRaceMusicSettingsActor
// 0x0020 (0x0440 - 0x0420)
class ADelMarRaceMusicSettingsActor final : public AActor
{
public:
	class UDelMarRaceMusicPlaylist*               Playlist;                                          // 0x0420(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             PreRaceMusic;                                      // 0x0428(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             PostRaceMusic;                                     // 0x0430(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMusic;                                      // 0x0438(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableAudioAnalysis;                              // 0x0439(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43A[0x6];                                      // 0x043A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRaceMusicSettingsActor">();
	}
	static class ADelMarRaceMusicSettingsActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarRaceMusicSettingsActor>();
	}
};

// Class DelMarAudio.DelMarAudioVirtualizationSubsystem
// 0x0078 (0x00C0 - 0x0048)
class UDelMarAudioVirtualizationSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FDelmarAudioVirtualizationSettings> PlayerNumMap;                                      // 0x0058(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	int32                                         MaxNumPlayers;                                     // 0x00A8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxDistantPlayers;                                 // 0x00AC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DistantPlayerThreshold;                            // 0x00B0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDelMarVehicleManager*                  VehicleManager;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleRaceModeChanged(const struct FDelMarEvent_RaceModeSet& Event);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarAudioVirtualizationSubsystem">();
	}
	static class UDelMarAudioVirtualizationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarAudioVirtualizationSubsystem>();
	}
};

}

