#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarDiorama

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "DelMarDiorama_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "CinematicCamera_classes.hpp"
#include "DelMarCore_structs.hpp"


namespace SDK
{

// Class DelMarDiorama.DelMarCockpitActor
// 0x0010 (0x0430 - 0x0420)
class ADelMarCockpitActor final : public AActor
{
public:
	class USkeletalMeshComponent*                 CockpitMeshComponent;                              // 0x0420(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADelMarVehicle*                         BoundVehicle;                                      // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_OnBoundVehicleChanged(const class ADelMarVehicle* NewVehicle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarCockpitActor">();
	}
	static class ADelMarCockpitActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarCockpitActor>();
	}
};

// Class DelMarDiorama.DelMarDioramaActor
// 0x0158 (0x0578 - 0x0420)
class ADelMarDioramaActor final : public AActor
{
public:
	class USkeletalMeshComponent*                 VehicleInteriorMeshComponent;                      // 0x0420(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, struct FDelMarDriverSequenceDataList> CustomSequenceListTable;                           // 0x0428(0x0050)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_478[0x18];                                     // 0x0478(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ADelMarDriverMannequin>     DriverMannequinClass;                              // 0x0490(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class ALevelSequenceActor>        LevelSequenceActorClass;                           // 0x0498(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class ADelMarDriverCameraActor>   CineCameraClass;                                   // 0x04A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class ADelMarCockpitActor>        CockpitClass;                                      // 0x04A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarDioramaConfigData*               ConfigData;                                        // 0x04B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                DefaultCameraOffset;                               // 0x04B8(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               DefaultCameraRotation;                             // 0x04D0(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class ALevelSequenceActor*                    SequenceActor;                                     // 0x04E8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADelMarDriverCameraActor*               CameraActor;                                       // 0x04F0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADelMarDriverMannequin*                 DriverMannequin;                                   // 0x04F8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADelMarCockpitActor*                    CockpitActor;                                      // 0x0500(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerState*                           BoundPlayer;                                       // 0x0508(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarDriverSequenceData*              LastPlayedSequenceData;                            // 0x0510(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSet<class UDelMarDriverSequenceDataTable*>   BoundSequencesTables;                              // 0x0518(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_568[0x4];                                      // 0x0568(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DefaultCameraSocketIndex;                          // 0x056C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_570[0x8];                                      // 0x0570(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleSequenceFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDioramaActor">();
	}
	static class ADelMarDioramaActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarDioramaActor>();
	}
};

// Class DelMarDiorama.DelMarDioramaConfigData
// 0x0048 (0x0080 - 0x0038)
class UDelMarDioramaConfigData final : public UDataAsset
{
public:
	class FName                                   CameraActorTag;                                    // 0x0038(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DriverMannequinTag;                                // 0x0044(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CockpitActorTag;                                   // 0x0050(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CockpitCameraCutSockets;                           // 0x0060(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FName                                   CockpitCameraIdleSocket;                           // 0x0070(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDioramaConfigData">();
	}
	static class UDelMarDioramaConfigData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarDioramaConfigData>();
	}
};

// Class DelMarDiorama.DelMarDriverCameraActor
// 0x0010 (0x0C00 - 0x0BF0)
class ADelMarDriverCameraActor final : public ACineCameraActor
{
public:
	class USceneCaptureComponent2D*               CaptureComponent;                                  // 0x0BF0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BF8[0x8];                                      // 0x0BF8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDriverCameraActor">();
	}
	static class ADelMarDriverCameraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarDriverCameraActor>();
	}
};

// Class DelMarDiorama.DelMarDriverCheatManager
// 0x0000 (0x0030 - 0x0030)
class UDelMarDriverCheatManager final : public UChildCheatManager
{
public:
	void DelMarDioramaOpenChannel(bool bOpened);
	void DelMarDioramaSetDriverReaction(const class FString& ReactionTag);
	void DelMarDioramaSetEnabled(bool bEnabled);
	void DelMarDioramaSetLightingChannel(bool bMainChannel);
	void DelMarDioramaSetLocation(float X, float Y, float Z);
	void DelMarDioramaSetVisibleInSceneCaptureOnly(bool bOnly);
	void DelMarIntercomBroadcastEmote(const class FString& EmoteTag);
	void DelMarIntercomPlayInteraction(const class FString& InteractionTag);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDriverCheatManager">();
	}
	static class UDelMarDriverCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarDriverCheatManager>();
	}
};

// Class DelMarDiorama.DelMarDriverSequenceData
// 0x0010 (0x0048 - 0x0038)
class UDelMarDriverSequenceData final : public UDataAsset
{
public:
	class ULevelSequence*                         Sequence;                                          // 0x0038(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PriorityLevel;                                     // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0044(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTriggerReactiveWidget;                            // 0x0045(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCameraCut;                                        // 0x0046(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDriverSequenceData">();
	}
	static class UDelMarDriverSequenceData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarDriverSequenceData>();
	}
};

// Class DelMarDiorama.DelMarDriverSequenceDataTable
// 0x0050 (0x0088 - 0x0038)
class UDelMarDriverSequenceDataTable final : public UDataAsset
{
public:
	TMap<struct FGameplayTag, struct FDelMarDriverSequenceDataList> SequenceListTable;                                 // 0x0038(0x0050)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDriverSequenceDataTable">();
	}
	static class UDelMarDriverSequenceDataTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarDriverSequenceDataTable>();
	}
};

// Class DelMarDiorama.DelMarIntercomEvent
// 0x0018 (0x0048 - 0x0030)
class UDelMarIntercomEvent : public UObject
{
public:
	class AFortPlayerState*                       OwningPlayerState;                                 // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADelMarVehicle*                         OwningVehicle;                                     // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarIntercomComponent*               IntercomComponent;                                 // 0x0040(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarIntercomEvent">();
	}
	static class UDelMarIntercomEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarIntercomEvent>();
	}
};

// Class DelMarDiorama.DelMarIntercomEvent_TurboPassing
// 0x0010 (0x0058 - 0x0048)
class UDelMarIntercomEvent_TurboPassing final : public UDelMarIntercomEvent
{
public:
	TWeakObjectPtr<class AFortPlayerState>        PlayerAhead;                                       // 0x0048(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarPlayerRaceDataComponent*         RaceData;                                          // 0x0050(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarIntercomEvent_TurboPassing">();
	}
	static class UDelMarIntercomEvent_TurboPassing* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarIntercomEvent_TurboPassing>();
	}
};

// Class DelMarDiorama.DelMarDriverAnimInstance
// 0x0020 (0x0510 - 0x04F0)
class UDelMarDriverAnimInstance : public UFortBaseAnimInstance
{
public:
	class ADelMarVehicle*                         BoundVehicle;                                      // 0x04F0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDrifting;                                         // 0x04F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTurboing;                                         // 0x04F9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4FA[0x2];                                      // 0x04FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SteeringAngle;                                     // 0x04FC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SlipAngle;                                         // 0x0500(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StableSpeed;                                       // 0x0504(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DrivingSpeedThreshold;                             // 0x0508(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsDrivingSpeed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDriverAnimInstance">();
	}
	static class UDelMarDriverAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarDriverAnimInstance>();
	}
};

// Class DelMarDiorama.DelMarCockpitAnimInstance
// 0x0010 (0x0520 - 0x0510)
class UDelMarCockpitAnimInstance final : public UDelMarDriverAnimInstance
{
public:
	float                                         DefaultCameraShakeIntensity;                       // 0x0510(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DefaultTerrainAccMultiplier;                       // 0x0514(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DefaultTerrainMaxForwardSpeedPercentage;           // 0x0518(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CameraShakeIntensity;                              // 0x051C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarCockpitAnimInstance">();
	}
	static class UDelMarCockpitAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarCockpitAnimInstance>();
	}
};

// Class DelMarDiorama.DelMarDioramaControllerComponent
// 0x0128 (0x0200 - 0x00D8)
class UDelMarDioramaControllerComponent final : public UControllerComponent
{
public:
	struct FVector                                DioramaOffset;                                     // 0x00D8(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ADelMarDioramaActor>        DioramaClass;                                      // 0x00F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDelMarDriverSequenceDataTable*         CustomizedSequencesTable;                          // 0x00F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             DioramaInitialTransform;                           // 0x0100(0x0060)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UDelMarDriverChannel>       MainChannelClass;                                  // 0x0160(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarDriverChannel*                   MainChannel;                                       // 0x0168(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UDelMarDriverChannelBase>   PostRaceChannelClass;                              // 0x0170(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UDelMarDriverChannelBase*>       PostRaceChannels;                                  // 0x0178(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class APlayerState*                           CachedOwningPlayerState;                           // 0x0188(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerState*                           ViewTargetPlayer;                                  // 0x0190(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarVehicle>          ViewTargetVehicle;                                 // 0x0198(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class APlayerState*, class ADelMarDioramaActor*> PlayerDioramaTable;                                // 0x01A0(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	int32                                         NumPostRaceChannel;                                // 0x01F0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F4[0xC];                                      // 0x01F4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleViewTargetChanged(class AFortPlayerController* PC, class AActor* Old, class AActor* NewViewTarget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDioramaControllerComponent">();
	}
	static class UDelMarDioramaControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarDioramaControllerComponent>();
	}
};

// Class DelMarDiorama.DelMarDriverChannelBase
// 0x0060 (0x0090 - 0x0030)
class UDelMarDriverChannelBase : public UObject
{
public:
	class UTextureRenderTarget2D*                 ViewRenderTarget;                                  // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              RenderTargetDim;                                   // 0x0038(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x30];                                      // 0x0040(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UDelMarDriverSequenceDataTable*         SequencesTable;                                    // 0x0070(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerState*                           ViewPlayer;                                        // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADelMarDioramaActor*                    ViewDiorama;                                       // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMovieSceneSequencePlayer*              SequencePlayer;                                    // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleSequenceFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDriverChannelBase">();
	}
	static class UDelMarDriverChannelBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarDriverChannelBase>();
	}
};

// Class DelMarDiorama.DelMarDriverChannel
// 0x00D8 (0x0168 - 0x0090)
class UDelMarDriverChannel final : public UDelMarDriverChannelBase
{
public:
	class ADelMarVehicle*                         ViewVehicle;                                       // 0x0090(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FGameplayTag>                   QueueReactions;                                    // 0x0098(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FDelMarDriverSequenceDataList> SequenceListTableInstance;                         // 0x00A8(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, float>              ReactionCoolDownTimeStamp;                         // 0x00F8(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	float                                         LandingForceThreshold;                             // 0x0148(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SlowDownImpactSpeedThreshold;                      // 0x014C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HitWallImpactThreshold;                            // 0x0150(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HitWallImpactHardThreshold;                        // 0x0154(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DraftBonusPercentageThreshold;                     // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StartlineBoostPercentageEarnedThreshold;           // 0x015C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_160[0x8];                                      // 0x0160(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleDraftStateChanged(EDelmarDraftingState DraftState);
	void HandleDriftBoostActivated(float PercentageMaxBoostGained);
	void HandleHazardSpeedLost();
	void HandleSpeedChanged(float NewSpeed);
	void HandleStartlineBoostActivated(float PercentageSpeedEarned);
	void HandleTurboActivated();
	void HandleVehicleDemolished(const struct FGameplayTag& CausedByTag);
	void HandleVehicleHitWall(float ImpactMagnitude, const struct FVector& WorldLocation, float ForwardRotationDegrees);
	void HandleVehicleLanded(float LandingForce, bool bLandedKickflip);
	void HandleVehicleSpawned(bool bFirstCar, bool bPrevCarDemolished);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDriverChannel">();
	}
	static class UDelMarDriverChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarDriverChannel>();
	}
};

// Class DelMarDiorama.DelMarDriverMannequin
// 0x0000 (0x0870 - 0x0870)
class ADelMarDriverMannequin final : public AFortPlayerMannequin
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDriverMannequin">();
	}
	static class ADelMarDriverMannequin* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarDriverMannequin>();
	}
};

// Class DelMarDiorama.DelMarIntercomComponent
// 0x00C0 (0x0198 - 0x00D8)
class UDelMarIntercomComponent final : public UControllerComponent
{
public:
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UDelMarDriverChannel>       GuestChannelClass;                                 // 0x00F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarDriverChannel*                   GuestChannel;                                      // 0x00F8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AFortPlayerPawn>         ViewPlayerPawn;                                    // 0x0100(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarDioramaActor>     MainChannelDiorama;                                // 0x0108(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerState*                           ViewPlayerState;                                   // 0x0110(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarDioramaControllerComponent*      DioramaControllerComponent;                        // 0x0118(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class UDelMarIntercomEvent>> ServerEventClasses;                                // 0x0120(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UDelMarIntercomEvent*>           ServerEvents;                                      // 0x0130(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FDelMarInteractionTagData> InteractionTagTable;                               // 0x0140(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         EmoteBroadcastMaxDistanceSq;                       // 0x0190(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientReceiveEmote(const struct FGameplayTag& EmoteTag, class APlayerState* Instigator);
	void ClientReceiveInteraction(const struct FGameplayTag& InteractionTag, const class APlayerState* Instigator, const class APlayerState* Receiver);
	void HandleViewTargetChanged(class AFortPlayerController* InController, class AActor* OldViewTarget, class AActor* NewViewTarget);
	void ServerReceiveEmote(const struct FGameplayTag& EmoteTag);
	void ServerReceiveInteraction(const struct FGameplayTag& EmoteTag, const class APlayerState* Receiver);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarIntercomComponent">();
	}
	static class UDelMarIntercomComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarIntercomComponent>();
	}
};

}

