#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "DelMarCore_structs.hpp"
#include "VehicleCosmeticsAudioRuntime_classes.hpp"
#include "CosmeticsFrameworkLoadouts_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CommonInput_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "FortniteAI_classes.hpp"
#include "DelMarTrackRuntime_classes.hpp"
#include "EnhancedInput_classes.hpp"
#include "LinkId_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "VehicleCosmeticsRuntime_classes.hpp"
#include "GameFeatures_classes.hpp"
#include "AudioGameplay_classes.hpp"
#include "PlayspaceSystem_classes.hpp"


namespace SDK
{

// Class DelMarCore.DelMarPlayerStateComponent
// 0x0000 (0x00D8 - 0x00D8)
class UDelMarPlayerStateComponent : public UPlayerStateComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPlayerStateComponent">();
	}
	static class UDelMarPlayerStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPlayerStateComponent>();
	}
};

// Class DelMarCore.DelMarState
// 0x0018 (0x0048 - 0x0030)
class UDelMarState : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           StateTag;                                          // 0x0038(0x000C)(Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarState">();
	}
	static class UDelMarState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarState>();
	}
};

// Class DelMarCore.DelMarRacerState
// 0x0000 (0x0048 - 0x0048)
class UDelMarRacerState : public UDelMarState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRacerState">();
	}
	static class UDelMarRacerState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarRacerState>();
	}
};

// Class DelMarCore.DelMarRacerState_WithSpectatorTransitionBase
// 0x0000 (0x0048 - 0x0048)
class UDelMarRacerState_WithSpectatorTransitionBase : public UDelMarRacerState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRacerState_WithSpectatorTransitionBase">();
	}
	static class UDelMarRacerState_WithSpectatorTransitionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarRacerState_WithSpectatorTransitionBase>();
	}
};

// Class DelMarCore.DelMarChallengeRacerState_RunActive
// 0x0000 (0x0048 - 0x0048)
class UDelMarChallengeRacerState_RunActive final : public UDelMarRacerState_WithSpectatorTransitionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarChallengeRacerState_RunActive">();
	}
	static class UDelMarChallengeRacerState_RunActive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarChallengeRacerState_RunActive>();
	}
};

// Class DelMarCore.DelMarRaceManager
// 0x0220 (0x0640 - 0x0420)
class ADelMarRaceManager : public AActor
{
public:
	uint8                                         Pad_420[0x90];                                     // 0x0420(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnRaceFinished;                                    // 0x04B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceStarted;                                     // 0x04C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceCountdownStarted;                            // 0x04D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceReset;                                       // 0x04E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortPlayerState* PlayerState)> OnPlayerFinishedRace;                              // 0x04F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortPlayerState* PlayerState)> OnPlayerLapComplete;                               // 0x0500(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortPlayerState* PlayerState)> OnPlayerResetRun;                                  // 0x0510(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bRaceStarted;                                      // 0x0520(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRaceFinished;                                     // 0x0521(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_522[0x6];                                      // 0x0522(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerState*>               SpectatorPlayerStates;                             // 0x0528(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class AFortPlayerState*>               ActiveRacerPlayerStates;                           // 0x0538(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UDelMarRaceConfigComponent*             RaceConfig;                                        // 0x0548(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarRaceLevelConfig>  ActiveRaceLevelConfig;                             // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarTimeManagerComponent*            TimeManager;                                       // 0x0558(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarRespawnManagerComponent*         RespawnManager;                                    // 0x0560(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarCheckpointManagerComponent*      CheckpointManager;                                 // 0x0568(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarRubberbandingManagerComponent*   RubberbandingManager;                              // 0x0570(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarGameplayModifierComponent*       GameplayModifierComponent;                         // 0x0578(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarPositionalTrackerComponent*      PositionalTracker;                                 // 0x0580(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarEliminationRaceManagerComponent* EliminationManager;                                // 0x0588(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarGlobalInputDisabler*             InputDisablerComponent;                            // 0x0590(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarMatchEventSystemComponent*       MatchEventSystemComponent;                         // 0x0598(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSet<class AFortPlayerState*>                 ManagedPlayerStates;                               // 0x05A0(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSet<TWeakObjectPtr<class AFortPlayerState>>  InactivePlayerStates;                              // 0x05F0(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void FinalizeRegisteredPlayerInitialization(class AFortPlayerState* PlayerState);
	void FinishRace();
	void HandleRegisteredPlayerPawnSet(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);
	void NetMulticast_FinishRace(double RaceFinishedTime);
	void NetMulticast_ResetRace(bool bNextRound);
	void NetMulticast_ResetRun(const class AFortPlayerState* InPlayerState, bool bPlayerTriggered);
	void OnRep_ActiveRaceLevelConfig();
	void RegisterPlayerController(class AController* InController);
	void RegisterPlayerState(class AFortPlayerState* InPlayerState);
	void RequestCountdownForPlayer(class AFortPlayerState* PlayerState);
	void RequestStartRace(bool bSkipCountdown);
	void ResetRace(bool bIsRoundReset);
	void ResetRun(class AFortPlayerState* PlayerState, bool bPlayerTriggered);
	void SetActiveRaceLevelConfig(class ADelMarRaceLevelConfig* InRaceLevelConfig);
	void SetPlayerAsSpectator(class AFortPlayerState* PlayerState);
	void SetSpectatorAsPlayer(class AFortPlayerState* PlayerState);
	void UnregisterAllPlayers(bool bSetAsInactive);
	void UnregisterPlayerController(class AController* InController, bool bSetAsInactive);
	void UnregisterPlayerState(class AFortPlayerState* InPlayerState, bool bSetAsInactive);

	class ADelMarRaceLevelConfig* GetActiveRaceLevelConfig() const;
	TArray<class AFortPlayerState*> GetActiveRacers() const;
	EDelMarRaceMode GetCurrentRaceMode() const;
	EDelMarRaceSpawnMode GetCurrentSpawnMode() const;
	class UDelMarEliminationRaceManagerComponent* GetEliminationManagerComponent() const;
	class UDelMarGameplayModifierComponent* GetGameplayModifierComponent() const;
	TArray<class AFortPlayerState*> GetManagedPlayerStatesArray() const;
	int32 GetNumberOfLapsForRace() const;
	int32 GetNumInactiveRacers() const;
	class UDelMarPositionalTrackerComponent* GetPositionalTracker() const;
	class UDelMarRaceConfigComponent* GetRaceConfig() const;
	class UDelMarRespawnManagerComponent* GetRespawnManagerComponent() const;
	class UDelMarRubberbandingManagerComponent* GetRubberbandingManager() const;
	TArray<class AFortPlayerState*> GetSpectators() const;
	class UDelMarTimeManagerComponent* GetTimeManager() const;
	bool IsActiveRacer(const class AFortPlayerState* PlayerState) const;
	bool IsSpectator(const class AFortPlayerState* PlayerState) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRaceManager">();
	}
	static class ADelMarRaceManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarRaceManager>();
	}
};

// Class DelMarCore.DelMarChallengeRaceManager
// 0x0010 (0x0650 - 0x0640)
class ADelMarChallengeRaceManager final : public ADelMarRaceManager
{
public:
	bool                                          bIsOvertime;                                       // 0x0640(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_641[0x7];                                      // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           OvertimeTimer;                                     // 0x0648(0x0008)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void NetMulticast_StartOvertime(const double RaceFinishTimestamp);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarChallengeRaceManager">();
	}
	static class ADelMarChallengeRaceManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarChallengeRaceManager>();
	}
};

// Class DelMarCore.DelMarVehicleInteractionOverrideComponent
// 0x0000 (0x00E8 - 0x00E8)
class UDelMarVehicleInteractionOverrideComponent final : public UFortVehicleInteractionOverrideComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarVehicleInteractionOverrideComponent">();
	}
	static class UDelMarVehicleInteractionOverrideComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarVehicleInteractionOverrideComponent>();
	}
};

// Class DelMarCore.DelMarPlayerPreferencesComponent
// 0x0060 (0x0138 - 0x00D8)
class UDelMarPlayerPreferencesComponent final : public UDelMarPlayerStateComponent
{
public:
	TMulticastInlineDelegate<void(bool bUseToggle)> OnUseToggleOnExpandableHudWidgetChanged;           // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bUseToggle)> OnUseIconOnlyPlayerNameplatesChanged;              // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& Layout)> OnTouchControlsLayoutChanged;                      // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	EDelMarInvertSteerMethod                      InvertSteerMethod;                                 // 0x0108(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPitchInverted;                                    // 0x0109(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bVerticalKickflipInverted;                         // 0x010A(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAerialPitchActivationEnabled;                     // 0x010B(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseToggleOnExpandableHudWidget;                   // 0x010C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseIconOnlyPlayerNameplates;                      // 0x010D(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           TouchControlsLayout;                               // 0x0110(0x000C)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarVehicle>          CachedDelMarVehicle;                               // 0x011C(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortClientSettingsRecord> FortSettings;                                      // 0x0124(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_12C[0xC];                                      // 0x012C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleAerialPitchActivationSettingChanged();
	void HandleIconOnlyNameplatesSettingChanged();
	void HandleInvertSteerSettingChanged();
	void HandleLocalFortInputSettingsChanged();
	void HandleTouchControlsSettingsChanged();
	void HandleVerticalKickflipInvertedSettingChanged();
	void ServerSetInvertSteerMethod(EDelMarInvertSteerMethod InInvertSteerMethod);
	void ServerUpdateAerialPitchActivation(const bool bInAerialPitchActivationEnabled);
	void ServerUpdatePitchInverted(const bool bInPitchInverted);
	void ServerUpdateVerticalKickflipInverted(const bool bInVerticalKickflipInverted);
	void TryGetFortClientSettings();

	struct FGameplayTag GetTouchControlsLayout() const;
	bool GetUseIconOnlyPlayerNameplates() const;
	bool GetUseToggleOnExpandableHudWidget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPlayerPreferencesComponent">();
	}
	static class UDelMarPlayerPreferencesComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPlayerPreferencesComponent>();
	}
};

// Class DelMarCore.DelMarVehicleLoadoutSetup
// 0x0050 (0x0098 - 0x0048)
class UDelMarVehicleLoadoutSetup final : public UPrimaryDataAsset
{
public:
	struct FDelMarLoadout                         Loadout;                                           // 0x0048(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarVehicleLoadoutSetup">();
	}
	static class UDelMarVehicleLoadoutSetup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarVehicleLoadoutSetup>();
	}
};

// Class DelMarCore.GuidedZoneRequirement
// 0x0000 (0x0030 - 0x0030)
class UGuidedZoneRequirement : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuidedZoneRequirement">();
	}
	static class UGuidedZoneRequirement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuidedZoneRequirement>();
	}
};

// Class DelMarCore.GuidedZoneRequirement_Jump
// 0x0000 (0x0030 - 0x0030)
class UGuidedZoneRequirement_Jump : public UGuidedZoneRequirement
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuidedZoneRequirement_Jump">();
	}
	static class UGuidedZoneRequirement_Jump* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuidedZoneRequirement_Jump>();
	}
};

// Class DelMarCore.DelMarEvent_FinalFirstPlaceChanged
// 0x0010 (0x0040 - 0x0030)
class UDelMarEvent_FinalFirstPlaceChanged final : public UObject
{
public:
	TWeakObjectPtr<class AFortPlayerState>        NewFirstPlace;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AFortPlayerState>        PrevFirstPlace;                                    // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarEvent_FinalFirstPlaceChanged">();
	}
	static class UDelMarEvent_FinalFirstPlaceChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarEvent_FinalFirstPlaceChanged>();
	}
};

// Class DelMarCore.DelMarPlayerQuestDistanceTraveledComponent
// 0x0050 (0x0128 - 0x00D8)
class UDelMarPlayerQuestDistanceTraveledComponent final : public UDelMarPlayerStateComponent
{
public:
	TWeakObjectPtr<class ADelMarVehicle>          CachedVehicle;                                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AFortPlayerState>        CachedPlayerState;                                 // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarRaceManager>      CachedRaceManager;                                 // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                           DistanceTraveledTimer;                             // 0x00F0(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F8[0x28];                                      // 0x00F8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UDelMarObjectiveProcessor_DistanceTraveled> DistanceTravelledObjectiveProcessor;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleVehicleDemolished(const struct FGameplayTag& CausedByTag);
	void HandleVehicleTeleportExited();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPlayerQuestDistanceTraveledComponent">();
	}
	static class UDelMarPlayerQuestDistanceTraveledComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPlayerQuestDistanceTraveledComponent>();
	}
};

// Class DelMarCore.DelMarVehicleManager
// 0x0178 (0x01B0 - 0x0038)
class UDelMarVehicleManager final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x178];                                     // 0x0038(0x0178)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_GetAllVehicles(TArray<class ADelMarVehicle*>* OutVehicles);
	void BP_GetVehiclesInRange(const struct FVector& SourcePosition, const float Range, const bool bDo2DCheck, TArray<class ADelMarVehicle*>* OutVehicles);
	void HandlePawnEnteredVehicle(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* Pawn, int32 SeatIndex);
	void HandlePawnExitedVehicle(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* Pawn, int32 SeatIndex);
	void HandlePawnPlayerStateSet(class AFortPlayerPawn* Pawn);
	void HandleViewTargetChanged(class AFortPlayerController* InController, class AActor* OldViewTarget, class AActor* NewViewTarget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarVehicleManager">();
	}
	static class UDelMarVehicleManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarVehicleManager>();
	}
};

// Class DelMarCore.DelMarPhysMatAttribute
// 0x0000 (0x0030 - 0x0030)
class UDelMarPhysMatAttribute : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPhysMatAttribute">();
	}
	static class UDelMarPhysMatAttribute* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPhysMatAttribute>();
	}
};

// Class DelMarCore.DelMarPhysicsRateDevice
// 0x0050 (0x1240 - 0x11F0)
class ADelMarPhysicsRateDevice final : public AFortCreativeDeviceProp
{
public:
	uint8                                         Pad_11F0[0x50];                                    // 0x11F0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetPhysicsRate(EDelMarPhysicsRate PhysicsRate);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPhysicsRateDevice">();
	}
	static class ADelMarPhysicsRateDevice* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarPhysicsRateDevice>();
	}
};

// Class DelMarCore.DelMarPreRaceControllerComponent
// 0x0078 (0x0150 - 0x00D8)
class UDelMarPreRaceControllerComponent final : public UControllerComponent
{
public:
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           NavigateAction;                                    // 0x00F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputAction*                           ReadyUpAction;                                     // 0x00F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FViewTargetTransitionParams            ViewTargetTransitionParams;                        // 0x0100(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         NavigateInputDeadzone;                             // 0x0110(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UDelMarPlayerInputManagerComponent> InputManagerClass;                                 // 0x0118(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarPlayerInputManagerComponent> InputManager;                                      // 0x0120(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UEnhancedInputComponent> InputComponent;                                    // 0x0128(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarPositionalTrackerComponent> PositionTracker;                                   // 0x0130(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AFortPlayerState>        CurrentViewTarget;                                 // 0x0138(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CellDistThreshold;                                 // 0x0140(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxGridDim;                                        // 0x0144(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ServerSetViewTarget(class AFortPlayerState* PlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPreRaceControllerComponent">();
	}
	static class UDelMarPreRaceControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPreRaceControllerComponent>();
	}
};

// Class DelMarCore.DelMarPlayspace
// 0x0148 (0x0990 - 0x0848)
class ADelMarPlayspace final : public AFortPlayspace
{
public:
	uint8                                         Pad_848[0x48];                                     // 0x0848(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UFortPlaylistAthena>     MRSPlaylistData;                                   // 0x0890(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MRSLinkId;                                         // 0x0898(0x0010)(Net, ZeroConstructor, Transient, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A8[0x10];                                     // 0x08A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UDelMarGameStateMachine*                PrimaryStateMachine;                               // 0x08B8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldShowLoadingScreen;                          // 0x08C0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C1[0x7];                                      // 0x08C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EDelMarRaceMode, TSoftClassPtr<class UClass>> DefaultRaceLevelConfigs;                           // 0x08C8(0x0050)(Edit, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarRaceManager>      ActiveRaceManager;                                 // 0x0918(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortPlaylistAthena>     PlaylistData;                                      // 0x0920(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarLevelManagerComponent> LevelManager;                                      // 0x0928(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortLevelStreamComponent*              LevelStreamComponent;                              // 0x0930(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDelMarMapSet                          MapSet;                                            // 0x0938(0x0018)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  PlaylistDefinedMapTags;                            // 0x0950(0x0020)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_970[0x20];                                     // 0x0970(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_ActiveRaceManagerUpdated();
	void OnRep_MRSLinkId();
	void RequestNextMapFromMapSet();
	void ServerRequestLoadingLevel(const struct FGameplayTagContainer& DesiredMap);
	void ServerRequestLoadingLevelWithLinkCode(const struct FOnlineLinkId& DesiredMap);
	void ServerReturnToSetup(const struct FGameplayTagContainer& OptionalMapToForceLoad);
	void ServerReturnToSetupWithLinkCode(const struct FOnlineLinkId& OptionalMapToForceLoad);
	void SetLoadingScreenVisibiliy(bool bInShouldShowLoadingScreen);

	bool ShouldShowLoadingScreen() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPlayspace">();
	}
	static class ADelMarPlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarPlayspace>();
	}
};

// Class DelMarCore.DelMarCosmeticActor
// 0x0038 (0x0458 - 0x0420)
class ADelMarCosmeticActor : public AActor
{
public:
	class UDelMarCosmeticActorSpawnLogic*         SpawnLogic;                                        // 0x0420(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class ADelMarCosmeticActor>> CosmeticDependencies;                              // 0x0428(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TScriptInterface<class IDelMarVehicleInterface> Vehicle;                                           // 0x0438(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarVehicleConfigs*                  VehicleConfig;                                     // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarVehicleCosmeticComponent*        VehicleCosmeticComponent;                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ApplyCosmetic();
	void BP_OnAnyWheelsOnGroundChanged(const TScriptInterface<class IDelMarVehicleInterface>& VehicleRef, bool bValue);
	void BP_OnBonusSpeedActivated();
	void BP_OnBonusSpeedChanged(float BonusSpeed);
	void BP_OnBonusSpeedDeactivated();
	void BP_OnCosmeticApplied();
	void BP_OnDelMarAppliedTeleportRotation();
	void BP_OnDelMarTeleportEntered();
	void BP_OnDelMarTeleportExited();
	void BP_OnDelMarVehicleSpawned(bool bFirstVehicleForPlayer, bool bPrevVehicleDemolished);
	void BP_OnDraftStateChanged(EDelmarDraftingState CurrentState);
	void BP_OnDriftActivated();
	void BP_OnDriftBoostActivated();
	void BP_OnDriftBoostDeactivated();
	void BP_OnDriftControlChanged(bool bIsDriftingControlled);
	void BP_OnDriftDeactivated();
	void BP_OnDriftDurationChanged(float Duration);
	void BP_OnDriftKickActivated(float DriftDirection, EDelMarVehicleDriftState DriftState);
	void BP_OnDriftKickDeactivated();
	void BP_OnInvulnerabilityActivated();
	void BP_OnInvulnerabilityDeactivated();
	void BP_OnJumpActivated();
	void BP_OnJumpDeactivated();
	void BP_OnKickflipActivated(bool bLeftSide);
	void BP_OnKickflipActivationChargesChanged(int32 ActivationCharges);
	void BP_OnKickflipDeactivated();
	void BP_OnKickflipDistanceToSuctionSurfaceChanged(float Distance);
	void BP_OnKickflipDurationChanged(float Duration);
	void BP_OnKickflipSuctionActivated();
	void BP_OnKickflipSuctionDeactivated();
	void BP_OnReachedMaxDraftBonusSpeed();
	void BP_OnReattachmentActivated();
	void BP_OnReattachmentDeactivated();
	void BP_OnStartlineBoostActivated(float PercentageMaxBonusSpeedEarned);
	void BP_OnStartlineBoostDeactivated();
	void BP_OnStartlineBoostFailed();
	void BP_OnStrafeActivated(bool bLeftSide);
	void BP_OnStrafeCooldownChanged(float CooldownPercentage);
	void BP_OnStrafeDeactivated();
	void BP_OnStrafeDisabledChanged(bool bDisabled);
	void BP_OnStrafeUsabilityChanged(bool bCanActivate);
	void BP_OnTurboActivated();
	void BP_OnTurboBonusStateChanged(EDelMarTurboZoneState NewState);
	void BP_OnTurboDeactivated();
	void BP_OnUnderthrustActivated();
	void BP_OnUnderthrustDeactivated();
	void BP_OnVehicleDemolished(const struct FGameplayTag& CausedByTag);
	void BP_OnVehicleForwardStateChanged(EDelMarVehicleForwardState NewForwardState);
	void BP_OnVehicleLanded(float LandingForced, bool bLandedKickflip);
	void BP_OnVehicleStartedSkydiving();
	void BP_OnVehicleStoppedSkydiving();
	void BP_OnVehicleWheelsLeftGround();
	void BP_OnWheelsOnGroundChanged(const TScriptInterface<class IDelMarVehicleInterface>& VehicleRef, bool bValue);
	void BP_OnWorldBonusSpeedStackGained(const struct FGameplayTag& Source, int32 Stacks);
	void BP_OnWorldBonusSpeedStackLost(const struct FGameplayTag& Source, int32 Stacks);

	class USkeletalMeshComponent* GetBodyMeshComponent() const;
	bool IsLocallyViewed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarCosmeticActor">();
	}
	static class ADelMarCosmeticActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarCosmeticActor>();
	}
};

// Class DelMarCore.DelMarCheckpoint
// 0x01A0 (0x1390 - 0x11F0)
class alignas(0x10) ADelMarCheckpoint final : public AFortCreativeDeviceProp
{
public:
	TMulticastInlineDelegate<void(class ADelMarVehicle* Vehicle)> OnCheckpointTirggeredEvent;                        // 0x11F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         bIsFinishLine : 1;                                 // 0x1200(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, SaveGame, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIsStartingLine : 1;                               // 0x1200(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, SaveGame, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIsTimeTrialSectionEnd : 1;                        // 0x1200(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, SaveGame, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIsTeleportEnabled : 1;                            // 0x1200(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_1201[0x7];                                     // 0x1201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class ADelMarCheckpoint*>                NextCheckpoints;                                   // 0x1208(0x0050)(Edit, DisableEditOnTemplate, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	float                                         DynamicSpawnOffset;                                // 0x1258(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpawnDistanceBeforeOrAfterSplineLocation;          // 0x125C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BaseRadius;                                        // 0x1260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CheckpointId;                                      // 0x1264(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SplinePointIndex;                                  // 0x1268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_126C[0x4];                                     // 0x126C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADelMarPlayerStart*                     SpawnPoint;                                        // 0x1270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarTrackSnapToComponent*            SnapToComponent;                                   // 0x1278(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSet<class ADelMarCheckpoint*>                PreviousCheckpoints;                               // 0x1280(0x0050)(Edit, EditConst, AdvancedDisplay, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FCheckpointTrackDistance               NearestTrack;                                      // 0x12D0(0x0018)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCheckpointTrackDistance>       AssociatedTracks;                                  // 0x12E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         ComputedCheckpointIndex;                           // 0x12F8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_12FC[0x4];                                     // 0x12FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   ColliderVolume;                                    // 0x1300(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarCheckpointTheme*                 CheckpointTheme;                                   // 0x1308(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1310[0x70];                                    // 0x1310(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	class ADelMarCheckpoint*                      CheckpointToTeleportTo;                            // 0x1380(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1388[0x8];                                     // 0x1388(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_ActivateRift();
	void BP_DeactivateRift();
	void BP_FirstPlaceChanged(bool bValidPrevFirstPlace);
	void BP_LapFinished(int32 CompletedLap, int32 CurrentLap, int32 TotalLaps);
	void BP_RaceFinished();
	void BP_RaceReset();
	void ClientSetCheckpointActive(int32 CurrentLap, int32 TotalLaps);
	void ClientSetCheckpointInactive();
	void HandlePawnEnteredVehicle(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* Pawn, int32 SeatIndex);
	void OnTriggered(class ADelMarVehicle* InDelMarVehicle);
	void UpdateCheckpointMesh(EDelMarCheckpointMeshType MeshType);
	void UpdateCheckpointTheme(class UDelMarCheckpointTheme* Theme);

	EDelMarCheckpointMeshType GetCheckpointMeshType() const;
	const struct FCheckpointTrackDistance GetFurthestAheadTrackDistance() const;
	const struct FCheckpointTrackDistance GetFurthestBehindTrackDistance() const;
	const struct FCheckpointTrackDistance GetNearestTrackData() const;
	struct FTransform GetSpawnTransform() const;
	const struct FCheckpointTrackDistance GetTrackDistanceDataForTrack(const class ADelMarTrackBase* InTrack, const bool bEnsureAssociated) const;
	bool IsAssociatedWithTrack(const class ADelMarTrackBase* InTrack) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarCheckpoint">();
	}
	static class ADelMarCheckpoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarCheckpoint>();
	}
};

// Class DelMarCore.DelMarPlayerStart
// 0x0010 (0x04B0 - 0x04A0)
class ADelMarPlayerStart final : public AFortPlayerStart
{
public:
	int32                                         StartlinePriority;                                 // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IsClaimedZDistanceCheck;                           // 0x04A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarRaceManager>      DelMarRaceManager;                                 // 0x04A8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPlayerStart">();
	}
	static class ADelMarPlayerStart* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarPlayerStart>();
	}
};

// Class DelMarCore.DelMarLoadoutSave
// 0x0050 (0x0080 - 0x0030)
class UDelMarLoadoutSave final : public USaveGame
{
public:
	TMap<struct FGameplayTag, TSoftObjectPtr<class UDelMarCosmeticItemDefinition>> EquippedLoadout;                                   // 0x0030(0x0050)(Edit, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarLoadoutSave">();
	}
	static class UDelMarLoadoutSave* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarLoadoutSave>();
	}
};

// Class DelMarCore.DelMarPlayerRaceDataComponent
// 0x01B0 (0x0288 - 0x00D8)
class UDelMarPlayerRaceDataComponent : public UDelMarPlayerStateComponent
{
public:
	uint8                                         Pad_D8[0x30];                                      // 0x00D8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<int32>                                   VisitedCheckpoints;                                // 0x0108(0x0050)(Transient, NativeAccessSpecifierPublic)
	TSet<class ADelMarCheckpoint*>                VisitedCheckpoints_ParallelPath;                   // 0x0158(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	double                                        RunStartTime;                                      // 0x01A8(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RunFinishTime;                                     // 0x01B0(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        CheckpointStartTime;                               // 0x01B8(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        LapStartTime;                                      // 0x01C0(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceToFinishLine;                              // 0x01C8(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LapDistance;                                       // 0x01CC(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PrimaryTrackDistance;                              // 0x01D0(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LapsCompleted;                                     // 0x01D4(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasStartedFirstLap;                               // 0x01D8(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFinishedRace;                                     // 0x01D9(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Points;                                            // 0x01DC(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class APlayerState*>                   ViewingSpectators;                                 // 0x01E0(0x0010)(Net, ZeroConstructor, Transient, RepNotify, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class ADelMarCheckpoint*                      MostRecentlyVisitedCheckpoint;                     // 0x01F0(0x0008)(Net, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarCheckpointManagerComponent> CachedCheckpointManager;                           // 0x01F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarRaceManager>      CachedRaceManager;                                 // 0x0200(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarVehicle>          CachedDelMarVehicle;                               // 0x0208(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarPositionalTrackerComponent> CachedPositionalTracker;                           // 0x0210(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarTrackPositionComponent> CachedLapTracker;                                  // 0x0218(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSet<class ADelMarCheckpoint*>                CheckpointsVisitedThisLap;                         // 0x0220(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	int32                                         TimeTrialSectionIndex;                             // 0x0270(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CheckpointIndex;                                   // 0x0274(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarEvent_PlayerPointsChanged*       PointsUpdatedEvent;                                // 0x0278(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarEvent_PlayerFinishRace*          FinishRaceEvent;                                   // 0x0280(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	int32 GetNumViewingSpectator();
	TArray<class APlayerState*> GetViewingSpectators();
	void NetMulticast_CheckpointPassed_ParallelPath(const struct FDelMarEvent_CheckpointPassed_ParallelPath& CheckpointEvent);
	void NetMulticast_CheckpointPassedOutOfOrder_ParallelPath(const struct FDelMarEvent_CheckpointPassedOutOfOrder_ParallelPath& InCheckpointPassedOutOfOrderEvent);
	void NetMulticast_LapCompleted(const struct FDelMarEvent_LapComplete& InLapEvent);
	void NetMulticast_RaceCompleted(double RunTime, const bool bValidRun);
	void NetMulticast_SectionCompleted_ParallelPath(const struct FDelMarEvent_SectionComplete_ParallelPath& InSectionEvent);
	void NetMulticast_TeleportEntered(const struct FDelMarEvent_TeleportEnteredEvent& InCheckpointTeleportingEvent);
	void OnRep_Points();
	void OnRep_ViewingSpectators();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPlayerRaceDataComponent">();
	}
	static class UDelMarPlayerRaceDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPlayerRaceDataComponent>();
	}
};

// Class DelMarCore.DelMarGameplayModifier
// 0x0000 (0x0420 - 0x0420)
class ADelMarGameplayModifier : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarGameplayModifier">();
	}
	static class ADelMarGameplayModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarGameplayModifier>();
	}
};

// Class DelMarCore.DelMarGameplayModifier_FriendlyFire
// 0x0008 (0x0428 - 0x0420)
class ADelMarGameplayModifier_FriendlyFire final : public ADelMarGameplayModifier
{
public:
	EFriendlyFireType                             FriendlyFireType;                                  // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarGameplayModifier_FriendlyFire">();
	}
	static class ADelMarGameplayModifier_FriendlyFire* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarGameplayModifier_FriendlyFire>();
	}
};

// Class DelMarCore.DelMarEvent_PlayerPointsChanged
// 0x0008 (0x0038 - 0x0030)
class UDelMarEvent_PlayerPointsChanged final : public UObject
{
public:
	int32                                         PreviousPoints;                                    // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentPoints;                                     // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarEvent_PlayerPointsChanged">();
	}
	static class UDelMarEvent_PlayerPointsChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarEvent_PlayerPointsChanged>();
	}
};

// Class DelMarCore.GuidedZoneRequirement_DriftActive
// 0x0000 (0x0030 - 0x0030)
class UGuidedZoneRequirement_DriftActive final : public UGuidedZoneRequirement
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuidedZoneRequirement_DriftActive">();
	}
	static class UGuidedZoneRequirement_DriftActive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuidedZoneRequirement_DriftActive>();
	}
};

// Class DelMarCore.DelMarEvent_AttachmentChanged
// 0x0010 (0x0040 - 0x0030)
class UDelMarEvent_AttachmentChanged final : public UObject
{
public:
	TWeakObjectPtr<class AFortPlayerState>        PlayerAttachedTo;                                  // 0x0030(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AFortPlayerState>        PrevPlayerAttachedTo;                              // 0x0038(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarEvent_AttachmentChanged">();
	}
	static class UDelMarEvent_AttachmentChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarEvent_AttachmentChanged>();
	}
};

// Class DelMarCore.DelMarVehicle
// 0x1C10 (0x3F90 - 0x2380)
class ADelMarVehicle final : public AFortAthenaSKVehicle
{
public:
	uint8                                         Pad_2380[0x50];                                    // 0x2380(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortCameraMode>            DefaultCameraMode;                                 // 0x23D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UFortCameraMode>>    SeatIndexCameraModes;                              // 0x23D8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bLocalDriverHasReplicatedVehicle;                  // 0x23E8(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_23E9[0xF];                                     // 0x23E9(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortAthenaVehicleInputState           PendingDriverInputState;                           // 0x23F8(0x0040)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	ECommonInputType                              CurrentInputType;                                  // 0x2438(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2439[0x1F];                                    // 0x2439(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceToPack;                                    // 0x2458(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceFromTrackFinish;                           // 0x245C(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RaceStatusSpeedModifier;                           // 0x2460(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ATTR_bVehicleThrottleDisabled;                     // 0x2464(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
