#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarUI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DelMarUI_structs.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "DynamicUI_classes.hpp"
#include "InputCore_structs.hpp"
#include "ModelViewViewModel_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Slate_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DelMarCore_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "UIChart_classes.hpp"


namespace SDK
{

// Class DelMarUI.DelMarUserWidget
// 0x0078 (0x04B8 - 0x0440)
class UDelMarUserWidget : public UCommonUserWidget
{
public:
	uint8                                         Pad_440[0x58];                                     // 0x0440(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	EWidgetTransitionerInitialStatus              InitialTransitionStatus;                           // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESlateVisibility                              HiddenVisibility;                                  // 0x0499(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAlwaysReverseInterruptedAnimations;               // 0x049A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_49B[0x5];                                      // 0x049B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetTransitioner*                    WidgetTransitioner;                                // 0x04A0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       NormalTransitionIn;                                // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       NormalTransitionOut;                               // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_Hide(bool bSkipAnimation);
	void BP_Show(bool bSkipAnimation);
	class UUIStateChartManager* GetUIStateChartManager();
	void HandleWidgetTransitionerStatusChanged(class UWidgetTransitioner* InTransitioner, EWidgetTransitionerStatus InStatus);
	void SetDisplayEnabled(bool bEnabled, bool bSkipAnimation);

	class UWidgetTransitioner* GetWidgetTransitioner() const;
	bool IsDisplayEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarUserWidget">();
	}
	static class UDelMarUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarUserWidget>();
	}
};

// Class DelMarUI.DelMarCountdownTimerWidget
// 0x0040 (0x04F8 - 0x04B8)
class UDelMarCountdownTimerWidget final : public UDelMarUserWidget
{
public:
	class UTextBlock*                             TextBlock_RemainingTime;                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InitialCoundownTime;                               // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(double TimeSeconds)> OnCountdownTimeChanged;                            // 0x04C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCountdownTimeSet;                                // 0x04D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCountdownTimeEnded;                              // 0x04E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void SetInitialCountdownTime(double InTime);

	double GetTimeRemainingSeconds() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarCountdownTimerWidget">();
	}
	static class UDelMarCountdownTimerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarCountdownTimerWidget>();
	}
};

// Class DelMarUI.DelMarCreativeUIDirector
// 0x0020 (0x0470 - 0x0450)
class ADelMarCreativeUIDirector final : public ADynamicUIDirectorBase
{
public:
	class ADelMarVehicle*                         CachedDelMarVehicle;                               // 0x0450(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicUIScene*                        CreativeDelMarUI;                                  // 0x0458(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           VehicleInAirTag;                                   // 0x0460(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnVehicleAnyWheelsOnGroundChanged(const TScriptInterface<class IDelMarVehicleInterface>& VehicleRef, bool bAnyWheelsOnGround);
	void OnVehicleEnter();
	void OnVehicleExit();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarCreativeUIDirector">();
	}
	static class ADelMarCreativeUIDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarCreativeUIDirector>();
	}
};

// Class DelMarUI.DelMarDriverCameraWidget
// 0x0128 (0x05E0 - 0x04B8)
class UDelMarDriverCameraWidget final : public UDelMarUserWidget
{
public:
	class UWidgetAnimation*                       DefaultIntercomAnimation;                          // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetAnimation*                       ReactiveDriverCamera_Persistent;                   // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReactiveWidgetOutroDelay;                          // 0x04C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReactiveWidgetMaxActiveTime;                       // 0x04CC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, class FName>        MainChannelAnimationTagTable;                      // 0x04D0(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<int32, struct FDelMarReactiveWidgetAnimation> ReactiveAnimationTable;                            // 0x0520(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, class UWidgetAnimation*>    AnimationNameTable;                                // 0x0570(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UUMGSequencePlayer*                     IntercomSequencePlayer;                            // 0x05C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUMGSequencePlayer*                     ReactiveSequencePlayer;                            // 0x05C8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D0[0x10];                                     // 0x05D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class FName> GetAnimationNames() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDriverCameraWidget">();
	}
	static class UDelMarDriverCameraWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarDriverCameraWidget>();
	}
};

// Class DelMarUI.DelMarInputActionRichTextBlockDecorator
// 0x0130 (0x0160 - 0x0030)
class UDelMarInputActionRichTextBlockDecorator final : public URichTextBlockDecorator
{
public:
	class UInputAction*                           InputAction;                                       // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x0038(0x0010)(Transient, NativeAccessSpecifierPublic)
	struct FKey                                   Key;                                               // 0x0048(0x0020)(Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Icon;                                              // 0x0070(0x00D0)(Transient, NativeAccessSpecifierPublic)
	class URichTextBlock*                         OwnerWidget;                                       // 0x0140(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ULocalPlayer>            OwningLocalPlayer;                                 // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UCommonInputSubsystem>   CommonInputSubsystem;                              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UEnhancedInputLocalPlayerSubsystem> EnhancedInputSubsystem;                            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarInputActionRichTextBlockDecorator">();
	}
	static class UDelMarInputActionRichTextBlockDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarInputActionRichTextBlockDecorator>();
	}
};

// Class DelMarUI.DelMarListView
// 0x0010 (0x0D90 - 0x0D80)
class UDelMarListView final : public UCommonListView
{
public:
	uint8                                         Pad_D78[0x10];                                     // 0x0D78(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bTreatNavigationAsScrolling;                       // 0x0D88(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D89[0x7];                                      // 0x0D89(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarListView">();
	}
	static class UDelMarListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarListView>();
	}
};

// Class DelMarUI.DelMarListViewModel
// 0x0010 (0x0080 - 0x0070)
class UDelMarListViewModel : public UMVVMViewModelBase
{
public:
	TArray<class UMVVMViewModelBase*>             Elements;                                          // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	class UMVVMViewModelBase* GetElementAt(int32 InIndex) const;
	const TArray<class UMVVMViewModelBase*> GetElements() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarListViewModel">();
	}
	static class UDelMarListViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarListViewModel>();
	}
};

// Class DelMarUI.DelMarViewModelBase
// 0x0000 (0x0078 - 0x0078)
class UDelMarViewModelBase : public UFortPerUserViewModel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarViewModelBase">();
	}
	static class UDelMarViewModelBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarViewModelBase>();
	}
};

// Class DelMarUI.DelMarMatchEventViewModel
// 0x0010 (0x0088 - 0x0078)
class UDelMarMatchEventViewModel final : public UDelMarViewModelBase
{
public:
	TMulticastInlineDelegate<void(class AFortPlayerState* PlayerState, const struct FGameplayTag& EventTag, const class FString& Context)> OnMatchEventOccured;                               // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarMatchEventViewModel">();
	}
	static class UDelMarMatchEventViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarMatchEventViewModel>();
	}
};

// Class DelMarUI.DelMarPlayerIndicatorsContainer
// 0x0158 (0x0610 - 0x04B8)
class UDelMarPlayerIndicatorsContainer final : public UDelMarUserWidget
{
public:
	class UCanvasPanel*                           IndicatorCanvas;                                   // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UDelMarPlayerIndicatorWidget> IndicatorWidgetClass;                              // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                IndicatorOffset;                                   // 0x04C8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RearVerticalHintThreshold;                         // 0x04E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RearIndicatorMaxDistance;                          // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RearIndicatorMinDistance;                          // 0x04E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RearIndicatorRangeWidth;                           // 0x04EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RearIndicatorRangeDegree;                          // 0x04F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ForwardIndicatorMaxDistance;                       // 0x04F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAnchors                               IndicatorAnchors;                                  // 0x04F8(0x0020)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                              IndicatorAlignment;                                // 0x0518(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              RearIndicatorSize;                                 // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            RearDistanceScaleCurve;                            // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            RearDistanceOpacityCurve;                          // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            ForwardDistanceScaleCurve;                         // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            ForwardDistanceOpacityCurve;                       // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxRearIndicators;                                 // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxForwardIndicators;                              // 0x055C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarVehicleManager>   VehicleManager;                                    // 0x0560(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarVehicle>          ViewingVehicle;                                    // 0x0568(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AFortPlayerState>        ViewingPlayerState;                                // 0x0570(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FDelMarPlayerIndicatorData>     IndicatorsData;                                    // 0x0578(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<class AFortPlayerState*, class UDelMarPlayerIndicatorWidget*> IndicatorWidgets;                                  // 0x0588(0x0050)(ExportObject, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UDelMarPlayerIndicatorWidget*>   IndicatorPool;                                     // 0x05D8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarPositionalTrackerComponent> PositionalTrackerComponent;                        // 0x05E8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F0[0x20];                                     // 0x05F0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleIconOnlySettingChanged(bool bUseIconOnly);
	void HandleRacePlayersChanged(const TMap<int32, class UDelMarPlayerViewModel*>& RacePlayers);
	void HandleViewTargetChanged(class AFortPlayerController* InController, class AActor* OldViewTarget, class AActor* NewViewTarget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPlayerIndicatorsContainer">();
	}
	static class UDelMarPlayerIndicatorsContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPlayerIndicatorsContainer>();
	}
};

// Class DelMarUI.DelMarPlayerIndicatorWidget
// 0x0058 (0x0470 - 0x0418)
class UDelMarPlayerIndicatorWidget final : public UUserWidget
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBox*                               AvatarSizeBox;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         AvatarLazyImage;                                   // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                               PlayerNameSizeBox;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 UpArrowImage;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 DownArrowImage;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               BackgroundOverlay;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_450[0x4];                                      // 0x0450(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BehindAvatarSizeBoxWidth;                          // 0x0454(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AheadAvatarSizeBoxWidth;                           // 0x0458(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBehindAvatarImageIsExpanded;                      // 0x045C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAheadAvatarImageIsExpanded;                       // 0x045D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45E[0x2];                                      // 0x045E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BehindPlayerNameSizeBoxMaxWidth;                   // 0x0460(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AheadPlayerNameSizeBoxMaxWidth;                    // 0x0464(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BehindBackgroundOverlaySlotPadding;                // 0x0468(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AheadBackgroundOverlaySlotPadding;                 // 0x046C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void BP_HideIndicator();
	void BP_SetViewModel(class UDelMarPlayerViewModel* ViewModel);
	void BP_UpdateIndicator(float Scale, float Opacity, bool bRearIndicator, EDelMarRearAlertVerticalHint VerticalHint);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPlayerIndicatorWidget">();
	}
	static class UDelMarPlayerIndicatorWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPlayerIndicatorWidget>();
	}
};

// Class DelMarUI.DelMarExpandableHudWidget
// 0x00B8 (0x0570 - 0x04B8)
class UDelMarExpandableHudWidget : public UDelMarUserWidget
{
public:
	class UImage*                                 NavigateEntriesBindingImage;                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C0[0x18];                                     // 0x04C0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UDelMarUserWidget>          ExpandableHudWidgetEntryClass;                     // 0x04D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumDesignerPreviewEntries;                         // 0x04E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EntrySpacing;                                      // 0x04E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExpanded;                                         // 0x04E8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bNavigationEnabled;                                // 0x04E9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4EA[0x6];                                      // 0x04EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             NavigateEntriesGamepadTexture;                     // 0x04F0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                             NavigateEntriesPCTexture;                          // 0x04F8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarPlayerPreferencesComponent*      PlayerPreferences;                                 // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOverlay*                               EntryOverlay;                                      // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URetainerBox*                           EdgeFadeRetainerBox;                               // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                               ContentSizeBox;                                    // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnExpandToggled;                                   // 0x0520(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(bool bNavigationEnabled)> OnNavigationEnabledChanged;                        // 0x0530(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(bool bExpandable)> OnExpandableChanged;                               // 0x0540(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TArray<class UDelMarUserWidget*>              DisplayedHudWidgetEntries;                         // 0x0550(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_560[0x10];                                     // 0x0560(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_HandlePlayerPreferencesAdded(class UDelMarPlayerPreferencesComponent* InPlayerPreferences);
	void HandleToggleAction();
	void HandleToggleSettingChanged(bool bUseToggle);
	void SetTargetInterpTransformY(float InTargetInterpTransformY);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarExpandableHudWidget">();
	}
	static class UDelMarExpandableHudWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarExpandableHudWidget>();
	}
};

// Class DelMarUI.DelMarPositionalTrackerWidget
// 0x0020 (0x0590 - 0x0570)
class UDelMarPositionalTrackerWidget final : public UDelMarExpandableHudWidget
{
public:
	int32                                         MinPlayersToStart;                                 // 0x0570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_574[0x4];                                      // 0x0574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDelMarPlayerViewModel*>         DisplayedPlayers;                                  // 0x0578(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_588[0x8];                                      // 0x0588(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInputMethodChanged(ECommonInputType InputMethod);
	void UpdatePlayerPositions(const TArray<class UDelMarPlayerViewModel*>& InPlayers);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPositionalTrackerWidget">();
	}
	static class UDelMarPositionalTrackerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPositionalTrackerWidget>();
	}
};

// Class DelMarUI.DelMarScreenBase
// 0x0080 (0x05F8 - 0x0578)
class UDelMarScreenBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x58];                                     // 0x0578(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	EWidgetTransitionerInitialStatus              InitialTransitionStatus;                           // 0x05D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetTransitioner*                    WidgetTransitioner;                                // 0x05D8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bActivateOnShow;                                   // 0x05E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       NormalTransitionIn;                                // 0x05E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       NormalTransitionOut;                               // 0x05F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_Hide(bool bSkipAnimation);
	void BP_Show(bool bSkipAnimation);
	class UUIStateChartManager* GetUIStateChartManager();
	void HandleWidgetTransitionerStatusChanged(class UWidgetTransitioner* InTransitioner, EWidgetTransitionerStatus InStatus);
	void SetDisplayEnabled(bool bEnabled, bool bSkipAnimation);

	class UWidgetTransitioner* GetWidgetTransitioner() const;
	bool IsDisplayEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarScreenBase">();
	}
	static class UDelMarScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarScreenBase>();
	}
};

// Class DelMarUI.DelMarPostRaceLeaderboard
// 0x0020 (0x0618 - 0x05F8)
class UDelMarPostRaceLeaderboard final : public UDelMarScreenBase
{
public:
	struct FDataTableRowHandle                    FilterDataTableRow;                                // 0x05F8(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_610[0x8];                                      // 0x0610(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_UpdateLeaderboardFilter();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPostRaceLeaderboard">();
	}
	static class UDelMarPostRaceLeaderboard* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPostRaceLeaderboard>();
	}
};

// Class DelMarUI.DelMarPostRaceScreen
// 0x00C0 (0x06B8 - 0x05F8)
class UDelMarPostRaceScreen final : public UDelMarScreenBase
{
public:
	struct FDataTableRowHandle                    TabNavLeftDataTableRow;                            // 0x05F8(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    TabNavRightDataTableRow;                           // 0x0610(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    ReadyUpDataTableRow;                               // 0x0628(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    SpectateDataTableRow;                              // 0x0640(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    ResetRunDataTableRow;                              // 0x0658(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    ReturnToLobbyDataTableRow;                         // 0x0670(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class UCommonButtonGroupBase*                 ButtonGroup_PostMatchNavigation;                   // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ADelMarRaceManager>      CachedRaceManager;                                 // 0x0690(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_698[0x20];                                     // 0x0698(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnReadyUpChanged(bool bReady);
	void RequestCountdown();
	void ResetRun();
	void UpdateVote(EDelMarPostRaceVote NewVote);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPostRaceScreen">();
	}
	static class UDelMarPostRaceScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPostRaceScreen>();
	}
};

// Class DelMarUI.DelMarPostRaceVoteWidget
// 0x0000 (0x04B8 - 0x04B8)
class UDelMarPostRaceVoteWidget final : public UDelMarUserWidget
{
public:
	void BP_OnPostRaceVoteChanged(EDelMarPostRaceVote Vote);
	void UpdateVote(EDelMarPostRaceVote NewVote);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPostRaceVoteWidget">();
	}
	static class UDelMarPostRaceVoteWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPostRaceVoteWidget>();
	}
};

// Class DelMarUI.DelMarQuestScreenContainer
// 0x0018 (0x04D0 - 0x04B8)
class UDelMarQuestScreenContainer final : public UDelMarUserWidget
{
public:
	class FName                                   QuestTabID;                                        // 0x04B8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaMapScreenContainer*              AthenaScreenContainer;                             // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleAthenaScreenDeactivated();
	void HandleMapPanelExitButtonPressed();
	void HandleToggleQuestList();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarQuestScreenContainer">();
	}
	static class UDelMarQuestScreenContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarQuestScreenContainer>();
	}
};

// Class DelMarUI.DelMarRichTextInputSwitcher
// 0x00D8 (0x04F0 - 0x0418)
class UDelMarRichTextInputSwitcher final : public UUserWidget
{
public:
	bool                                          bUseFormattedText;                                 // 0x0418(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TextFormat;                                        // 0x0420(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<class FString, struct FDelMarKeyPair>    Args;                                              // 0x0430(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   TextKBM;                                           // 0x0480(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   TextGamepad;                                       // 0x0490(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   TextTouch;                                         // 0x04A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class UCommonRichTextBlock*                   Widget_RichText;                                   // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FormattedTextPreviewKBM;                           // 0x04B8(0x0010)(Edit, ZeroConstructor, EditConst, EditorOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FormattedTextPreviewGamepad;                       // 0x04C8(0x0010)(Edit, ZeroConstructor, EditConst, EditorOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FormattedTextPreviewTouch;                         // 0x04D8(0x0010)(Edit, ZeroConstructor, EditConst, EditorOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E8[0x8];                                      // 0x04E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetInputText(const class FText& InTextKBM, const class FText& InTextGamepad, const class FText& InTextTouch);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRichTextInputSwitcher">();
	}
	static class UDelMarRichTextInputSwitcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarRichTextInputSwitcher>();
	}
};

// Class DelMarUI.DelMarSelectionListViewModel
// 0x0020 (0x00A0 - 0x0080)
class UDelMarSelectionListViewModel final : public UDelMarListViewModel
{
public:
	int32                                         SelectedIndex;                                     // 0x0080(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_84[0x1C];                                      // 0x0084(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearSelection();
	void SelectNextElement(bool bAllowWrap);
	void SelectPreviousElement(bool bAllowWrap);
	void SetSelectedElement(class UMVVMViewModelBase* InSelectedElement);
	void SetSelectedIndex(int32 InIndex);

	int32 GetSelectedIndex() const;
	bool HasSelection() const;
	class UMVVMViewModelBase* SelectedElement() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarSelectionListViewModel">();
	}
	static class UDelMarSelectionListViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarSelectionListViewModel>();
	}
};

// Class DelMarUI.DelMarTouchWidgetBase
// 0x0028 (0x04E0 - 0x04B8)
class UDelMarTouchWidgetBase : public UDelMarUserWidget
{
public:
	TArray<struct FDelMarTouchInputDefinition>    InputActionsData;                                  // 0x04B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          bTrackInputPastBounds;                             // 0x04C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTrackInputFromEnter;                              // 0x04C9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsInjectingInput;                                 // 0x04CA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDelMarTouchInputTrackingState                CurrentInputTrackingState;                         // 0x04CB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECommonInputMode                              RequiredInputMode;                                 // 0x04CC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4CD[0x13];                                     // 0x04CD(0x0013)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static float GetMobileContentScaleFactor();
	static int32 GetPixelsPerInch();
	static float GetTouchJoystickInputValueMultiplier();
	static bool ShouldTouchJoystickIgnoreContentScaleFactor();

	void CancelInputTracking();
	void OnActiveInputModeChanged(ECommonInputMode NewInputMode);
	void OnInputInjectionEnded(const struct FPointerEvent& InGestureEvent, EDelMarInputInjectionState InInjectedState);
	void OnInputInjectionStarted(const struct FPointerEvent& InGestureEvent, EDelMarInputInjectionState InInjectedState);
	void OnTrackedInputEnded(const struct FPointerEvent& InGestureEvent, bool bCancelled);
	void OnTrackedInputStarted(const struct FPointerEvent& InGestureEvent);
	void OnTrackedInputUpdated(const struct FPointerEvent& InGestureEvent);

	struct FGeometry GetHitboxGeometry() const;
	bool IsGestureInsideHitbox(const struct FPointerEvent& InGestureEvent) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTouchWidgetBase">();
	}
	static class UDelMarTouchWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTouchWidgetBase>();
	}
};

// Class DelMarUI.DelMarTouchActionButton
// 0x0078 (0x0558 - 0x04E0)
class UDelMarTouchActionButton final : public UDelMarTouchWidgetBase
{
public:
	EDelMarTouchActionButtonState                 State;                                             // 0x04E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EDelMarTouchActionButtonState, struct FDelMarTouchActionButtonStateData> ButtonStateData;                                   // 0x04E8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                          bHighlightActive;                                  // 0x0538(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UDelMarTouchActionButton* Button, bool bHighlightActive)> OnHighlightChanged;                                // 0x0540(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsUpdatingState;                                  // 0x0550(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CanSetState(EDelMarTouchActionButtonState NewState);
	void SetBackgroundBrush(const struct FSlateBrush& Brush);
	bool SetButtonState(EDelMarTouchActionButtonState NewState);
	void SetHighlightActive(bool bValue);
	void SetIconBrush(const struct FSlateBrush& Brush);

	EDelMarTouchActionButtonState GetState() const;
	EDelMarTouchActionButtonState GetStateOnStopInputTracking(bool bInputCancelled) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTouchActionButton">();
	}
	static class UDelMarTouchActionButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTouchActionButton>();
	}
};

// Class DelMarUI.DelMarTouchRegion
// 0x0010 (0x04F0 - 0x04E0)
class UDelMarTouchRegion final : public UDelMarTouchWidgetBase
{
public:
	TArray<class UDelMarTouchActionButton*>       TouchActionButtons;                                // 0x04E0(0x0010)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	class UDelMarTouchActionButton* FindButtonByInputAction(class UInputAction* InputAction);
	void SetHighlightForInputAction(class UInputAction* InputAction);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTouchRegion">();
	}
	static class UDelMarTouchRegion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTouchRegion>();
	}
};

// Class DelMarUI.DelMarUICheatManager
// 0x0058 (0x0088 - 0x0030)
class UDelMarUICheatManager final : public UChildCheatManager
{
public:
	class UDynamicUIScene*                        DriverCameraHiddenScene;                           // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        PlayerIndicatorHiddenScene;                        // 0x0038(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        PointsDebugWidgetVisibleScene;                     // 0x0040(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        RubberbandingWidgetVisibleScene;                   // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        StaticVehicleMeterHiddenScene;                     // 0x0050(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        VehicleDebugVisibleScene;                          // 0x0058(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        VehicleHealthDebugVisibleScene;                    // 0x0060(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        CheckpointDebugWidgetScene;                        // 0x0068(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        MapNameDebugWidgetScene;                           // 0x0070(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        GameplayTrackList;                                 // 0x0078(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAttachedWidgetEnabled;                            // 0x0080(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DelMarAttachedWidgetSetEnabled(bool bEnabled);
	void DelMarCheckpointDebugWidgetSetVisible(bool bVisible);
	void DelMarCloseTrackList();
	void DelMarDismissDialog();
	void DelMarDriverCameraSetHidden(bool bHidden);
	void DelMarDriverCameraSetReactiveType(int32 Type);
	void DelMarMapNameDebugWidgetSetVisible(bool bVisible);
	void DelMarOpenTrackList();
	void DelMarPlayerIndicatorsVisible(bool bVisible);
	void DelMarPointsDebugWidgetSetVisible(bool bVisible);
	void DelMarRequestDialogByTag(const struct FGameplayTag& Tag);
	void DelMarRubberbandingWidgetSetVisible(bool bVisible);
	void DelMarSetHint(const class FText& HintText, float RemoveAfterDelay);
	void DelMarTouchHUD(const class FString& TouchHUDType);
	void DelMarUISetVisible(bool bVisible);
	void DelMarUseToggleForExpandableHudWidget(bool bUseToggle);
	void DelMarVehicleDebugWidgetSetVisible(bool bVisible);
	void DelMarVehicleHealthDebugWidgetSetVisible(bool bVisible);
	void OnAddedToCheatManagerNative();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarUICheatManager">();
	}
	static class UDelMarUICheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarUICheatManager>();
	}
};

// Class DelMarUI.UIAnimationController
// 0x0010 (0x0040 - 0x0030)
class UUIAnimationController : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FastForward();
	float GetDuration();
	void JumpToBeginning();
	void JumpToEnd();
	void PlayBackward();
	void PlayForward();
	void Rewind();
	void Stop();
	void SwitchPlayDirection();

	bool IsPlaying() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIAnimationController">();
	}
	static class UUIAnimationController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIAnimationController>();
	}
};

// Class DelMarUI.UITimelineAnimationController
// 0x0020 (0x0060 - 0x0040)
class UUITimelineAnimationController final : public UUIAnimationController
{
public:
	class UUserWidget*                            WidgetTarget;                                      // 0x0040(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       Animation;                                         // 0x0048(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUMGSequencePlayer*                     ActivePlayer;                                      // 0x0050(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UUITimelineAnimationController* CreateInstance(class UUserWidget* WidgetTarget_0, class UWidgetAnimation* Animation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UITimelineAnimationController">();
	}
	static class UUITimelineAnimationController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUITimelineAnimationController>();
	}
};

// Class DelMarUI.UIAnimationControllerEntry
// 0x0010 (0x0040 - 0x0030)
class UUIAnimationControllerEntry final : public UObject
{
public:
	class UUIAnimationController*                 AnimationController;                               // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInverted;                                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIAnimationControllerEntry">();
	}
	static class UUIAnimationControllerEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIAnimationControllerEntry>();
	}
};

// Class DelMarUI.WidgetTransitioner
// 0x00E0 (0x0110 - 0x0030)
class UWidgetTransitioner final : public UObject
{
public:
	TMulticastInlineDelegate<void(class UWidgetTransitioner* Transitioner, EWidgetTransitionerStatus Status)> OnTransitionerStatusChanged;                       // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UWidget*                                TargetWidget;                                      // 0x0040(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESlateVisibility                              HiddenVisibility;                                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESlateVisibility                              ShownVisibility;                                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EWidgetTransitionerStatus                     TransitionerStatus;                                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIAnimationControllerEntry*            NormalTransitionIn;                                // 0x0050(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUIAnimationControllerEntry*            NormalTransitionOut;                               // 0x0058(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
