#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarMatchmakingSettingsButton

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class DelMarMatchmakingSettingsButton.DelMarMatchmakingSettingsButton
// 0x00F8 (0x0128 - 0x0030)
class UDelMarMatchmakingSettingsButton final : public UMatchmakingSettingsButtonOverride
{
public:
	class FText                                   MatchmakingSettingsButtonPrimaryText;              // 0x0030(0x0010)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class FText                                   MatchmakingSettingsButtonInvalidSelectionText;     // 0x0040(0x0010)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class FText                                   MatchmakingSettingsButtonRankedText;               // 0x0050(0x0010)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   MatchmakingSettingsModificationModal;              // 0x0060(0x0030)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   TrackSelectScreen;                                 // 0x0090(0x0030)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   ProductLogoWidget;                                 // 0x00C0(0x0030)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   MatchFoundWidget;                                  // 0x00F0(0x0030)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UProductModeUserFacingData> ProductModeUserFacingDataClass;                    // 0x0120(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarMatchmakingSettingsButton">();
	}
	static class UDelMarMatchmakingSettingsButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarMatchmakingSettingsButton>();
	}
};

}

