#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarCharacterCosmetics

#include "Basic.hpp"

#include "DelMarCharacterCosmetics_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DelMarCharacterCosmetics.DelMarDriverCosmeticPlayerComponent
// 0x0040 (0x0118 - 0x00D8)
class UDelMarDriverCosmeticPlayerComponent final : public UPlayerStateComponent
{
public:
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SequenceBindingTags;                               // 0x00F0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FDelMarDriverCosmeticData              CosmeticData;                                      // 0x0100(0x0018)(Net, RepNotify, Protected, NativeAccessSpecifierProtected)

public:
	void HandleBotControllerLoadoutChanged(class ADelMarAIController* AIController, const struct FFortAthenaLoadout& Loadout);
	void HandlePlayerControllerLoadoutChanged(const struct FCosmeticLoadout& Loadout);
	void On_RepCosmeticData();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarDriverCosmeticPlayerComponent">();
	}
	static class UDelMarDriverCosmeticPlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarDriverCosmeticPlayerComponent>();
	}
};

// Class DelMarCharacterCosmetics.DelMarCharacterCosmeticsSettings
// 0x0018 (0x0060 - 0x0048)
class UDelMarCharacterCosmeticsSettings final : public UPrimaryDataAsset
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetId>                RandomCharacters;                                  // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarCharacterCosmeticsSettings">();
	}
	static class UDelMarCharacterCosmeticsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarCharacterCosmeticsSettings>();
	}
};

}

