#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarTether

#include "Basic.hpp"

#include "DelMarCore_classes.hpp"


namespace SDK
{

// Class DelMarTether.DelMarPlayerTetherComponent
// 0x0030 (0x0110 - 0x00E0)
class UDelMarPlayerTetherComponent final : public UDelMarPlayerAttachmentComponent
{
public:
	TArray<class UFortWeaponItemDefinition*>      WeaponsToGive;                                     // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                          bInfiniteAmmo;                                     // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SecondsBetweenRequests;                            // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarVehicle>          AttachedVehicle;                                   // 0x00F8(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortPawnComponent_TetheredMovement> TetheredMovementComp;                              // 0x0100(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleVehicleAppliedTeleportLocation();
	void OnRep_AttachedVehicle();
	void OnRep_TetheredMovementComp();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPlayerTetherComponent">();
	}
	static class UDelMarPlayerTetherComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPlayerTetherComponent>();
	}
};

}

