#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarCosmetics

#include "Basic.hpp"

#include "DelMarCore_structs.hpp"
#include "DelMarCore_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "DelMarCosmetics_structs.hpp"
#include "Engine_classes.hpp"
#include "CosmeticsFrameworkLoadouts_structs.hpp"
#include "AudioGameplayBehavior_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class DelMarCosmetics.DelMarPreviewVehicle
// 0x06C0 (0x29B0 - 0x22F0)
class ADelMarPreviewVehicle : public AFortAthenaVehicle
{
public:
	uint8                                         Pad_22F0[0x8];                                     // 0x22F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCosmeticLoadout                       PreviewLoadout;                                    // 0x22F8(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDelMarPreviewCustomization>    PreviewCustomizations;                             // 0x2308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Interp, Protected, NativeAccessSpecifierProtected)
	class UDelMarVehicleCosmeticComponent*        CosmeticComponent;                                 // 0x2318(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDelMarPreviewConfigs                  PreviewConfigs;                                    // 0x2320(0x0110)(Edit, BlueprintVisible, Interp, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2430[0x88];                                    // 0x2430(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 SpringTravelOffset;                                // 0x24B8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FDelMarBouncyChassisState              BouncyChassisConfig;                               // 0x24C8(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_24D4[0x4];                                     // 0x24D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(EDelMarVehicleForwardState NewForwardState)> OnVehicleForwardStateChanged;                      // 0x24D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_24E8[0x40];                                    // 0x24E8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(float ImpactMagnitude, const struct FVector& WorldLocation, float ForwardRotationDegrees)> OnDelMarVehicleHitWall;                            // 0x2528(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float Magnitude, const struct FVector& WorldLocation)> OnDelMarVehicleHitVehicle;                         // 0x2538(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float Magnitude, const struct FVector& WorldLocation)> OnDelMarVehicleHitByVehicle;                       // 0x2548(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2558[0x398];                                   // 0x2558(0x0398)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnHazardHit;                                       // 0x28F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnVehicleTeleportEntered;                          // 0x2900(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnVehicleTeleportExit;                             // 0x2910(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnVehicleAppliedTeleportRotation;                  // 0x2920(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(struct FDelMarEnvironmentVFX* EffectStruct)> OnEnvironmentEffectCueActivated;                   // 0x2930(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnEnvironmentEffectCueRemoved;                     // 0x2940(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2950[0x30];                                    // 0x2950(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bValue)>   OnHeadlightsChanged;                               // 0x2980(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2990[0x20];                                    // 0x2990(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyPreviewLoadout();
	void BroadcastVehicleDemolished(const struct FGameplayTag& DemolishCausedByTag);

	struct FDelMarBouncyChassisState GetBouncyChassisConfig() const;
	bool IsWheelOnGround(EDelMarVehicleWheelIndex WheelIndex) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPreviewVehicle">();
	}
	static class ADelMarPreviewVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarPreviewVehicle>();
	}
};

// Class DelMarCosmetics.DelMarGaragePreviewVehicle
// 0x0210 (0x2BC0 - 0x29B0)
class ADelMarGaragePreviewVehicle final : public ADelMarPreviewVehicle
{
public:
	TMulticastInlineDelegate<void(class UCameraComponent* Camera)> OnActiveCameraUpdatedDelegate;                     // 0x29B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsTransitioning)> OnRotationTransitionStateChanged;                  // 0x29C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class USceneComponent*                        PreviewPivotComponent;                             // 0x29D0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29D8[0x8];                                     // 0x29D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       ActiveCameraComponent;                             // 0x29E0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCameraComponent*                       DefaultZoomInCameraComponent;                      // 0x29E8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCameraComponent*                       DefaultZoomOutCameraComponent;                     // 0x29F0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29F8[0xA0];                                    // 0x29F8(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FRotator>    SlotPreviewRotations;                              // 0x2A98(0x0050)(Edit, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, struct FDelMarPreviewConfigs> SlotPreviewConfigs;                                // 0x2AE8(0x0050)(Edit, NativeAccessSpecifierPrivate)
	float                                         ZoomLevel;                                         // 0x2B38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B3C[0x4];                                     // 0x2B3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               UserRotationOffset;                                // 0x2B40(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           PreviewSlot;                                       // 0x2B58(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           PreviewVehicleTag;                                 // 0x2B64(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RotationTransitionTime;                            // 0x2B70(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B74[0x4C];                                    // 0x2B74(0x004C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void K2_OnActiveCameraUpdated();
	void PreviewItem(const class UDelMarCosmeticItemDefinition* Item);
	void PreviewLoadout(const struct FDelMarLoadout& Loadout);
	void ResetPreviewToCurrentLoadout();
	void SetPreviewSlot(const struct FGameplayTag& InSlot);
	void SetUserRotationOffset(const struct FRotator& InRotationOffset);
	void SetZoomLevel(float InZoomLevel);
	void UpdateActiveCamera();

	struct FRotator GetRotationOffset() const;
	bool IsRotationTransitioning() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarGaragePreviewVehicle">();
	}
	static class ADelMarGaragePreviewVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarGaragePreviewVehicle>();
	}
};

// Class DelMarCosmetics.DelMarParamOverrideCosmeticActor
// 0x0050 (0x04A8 - 0x0458)
class ADelMarParamOverrideCosmeticActor final : public ADelMarCosmeticActor
{
public:
	TMap<TSubclassOf<class ADelMarCosmeticActor>, struct FDelMarParameterOverrides> CosmeticActorsParamterOverrides;                   // 0x0458(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarParamOverrideCosmeticActor">();
	}
	static class ADelMarParamOverrideCosmeticActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarParamOverrideCosmeticActor>();
	}
};

// Class DelMarCosmetics.DelMarPreviewCameraComponent
// 0x0010 (0x0A90 - 0x0A80)
class UDelMarPreviewCameraComponent final : public UCameraComponent
{
public:
	struct FGameplayTag                           PreviewSlot;                                       // 0x0A78(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EDelMarPreviewCameraType                      PreviewType;                                       // 0x0A84(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A85[0xB];                                      // 0x0A85(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPreviewCameraComponent">();
	}
	static class UDelMarPreviewCameraComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarPreviewCameraComponent>();
	}
};

// Class DelMarCosmetics.DelMarPreviewPivot
// 0x0008 (0x0428 - 0x0420)
class ADelMarPreviewPivot final : public AActor
{
public:
	class USceneComponent*                        SceneComponent;                                    // 0x0420(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarPreviewPivot">();
	}
	static class ADelMarPreviewPivot* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarPreviewPivot>();
	}
};

// Class DelMarCosmetics.DelMarUnifiedVehicleCosmeticActor
// 0x0388 (0x07E0 - 0x0458)
class ADelMarUnifiedVehicleCosmeticActor final : public ADelMarCosmeticActor
{
public:
	TArray<class UNiagaraComponent*>              CachedSideBoosters;                                // 0x0458(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_468[0x4];                                      // 0x0468(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SideBoosterParam_Scale;                            // 0x046C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FDelMarVehicleBooster>          Boosters;                                          // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FDelMarVehicleUnderthrustVfxData       UnderthrustVfxData;                                // 0x0488(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4D0[0x50];                                     // 0x04D0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 BodySkeletalMeshComponent;                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAudioGameplayBehaviorInstance         KickflipAudioBehavior;                             // 0x0528(0x0010)(Edit, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FAudioGameplayBehaviorInstance         JumpAudioBehavior;                                 // 0x0538(0x0010)(Edit, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      JumpFX;                                            // 0x0548(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      SuperSonicFX;                                      // 0x0550(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     SuperSonicRadialBlurMaterial;                      // 0x0558(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               SuperSonicRadialBlurMID;                           // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SuperSonicBlurOffset;                              // 0x0568(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SuperSonicForwardSpeedMin;                         // 0x056C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SuperSonicForwardSpeedMax;                         // 0x0570(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   SuperSonicParam_Spawn;                             // 0x0574(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   RadialBlurParam_Offset;                            // 0x0580(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   RadialBlurParam_Transition;                        // 0x058C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_598[0x8];                                      // 0x0598(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAudioGameplayBehaviorInstance         DraftingAudioBehavior;                             // 0x05A0(0x0010)(Edit, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      DraftingFX;                                        // 0x05B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   DraftingParam_Spawn;                               // 0x05B8(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   DraftingParam_SpeedGain;                           // 0x05C4(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   DraftingParam_Amount;                              // 0x05D0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAudioGameplayBehaviorInstance         WorldBonusSpeedAudioBehavior;                      // 0x05E0(0x0010)(Edit, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class FName                                   WBSGroupEvent_OnBonusSpeedActivated;               // 0x05F0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   WBSGroupEvent_OnBonusSpeedDeactivated;             // 0x05FC(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   WBSGroupEvent_OnWorldBonusSpeedStackGained;        // 0x0608(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           DemolishTag_RaceFinished;                          // 0x0614(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAudioGameplayBehaviorInstance         RespawnAudioBehavior;                              // 0x0620(0x0010)(Edit, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FAudioGameplayBehaviorInstance         DespawnAudioBehavior;                              // 0x0630(0x0010)(Edit, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      TaillightTrailFX_Left;                             // 0x0640(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      TaillightTrailFX_Right;                            // 0x0648(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   TaillightTrailSocket_Left;                         // 0x0650(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   TaillightTrailSocket_Right;                        // 0x065C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TaillightTrail_MinForwardSpeed;                    // 0x0668(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      TeleportFx;                                        // 0x0670(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraSystem*                         TeleportEnterSystem;                               // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraSystem*                         TeleportExitSystem;                                // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      EnvironmentFx;                                     // 0x0688(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_690[0x20];                                     // 0x0690(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAudioGameplayBehaviorInstance         UnderthrustAudioBehavior;                          // 0x06B0(0x0010)(Edit, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FAudioGameplayBehaviorInstance         WheelsAudioBehavior;                               // 0x06C0(0x0010)(Edit, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class FName                                   FrontLeftWheelContactBone;                         // 0x06D0(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   FrontRightWheelContactBone;                        // 0x06DC(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   BackRightWheelContactBone;                         // 0x06E8(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   BackLeftWheelContactBone;                          // 0x06F4(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FDelMarVehicleCosmeticWheelInfo> WheelInfos;                                        // 0x0700(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_710[0xC8];                                     // 0x0710(0x00C8)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FxSideSpeedThreshold;                              // 0x07D8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FxForwardSpeedThreshold;                           // 0x07DC(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void AddBoosterActivationFlags(EDelMarVehicleBoosterFlags Flags_0, class FName Name_0);
	void HandleOnAppliedSystemFinished(class UNiagaraComponent* System);
	void HandleOnRemovedSystemFinished(class UNiagaraComponent* System);
	void InitializeUnderthrustVfxSockets();
	void OnBonusSpeedActivated();
	void OnBonusSpeedDeactivated();
	void OnDraftStateChanged(EDelmarDraftingState CurrentState);
	void OnDriftDeactivated();
	void OnDriftDurationChanged(float Duration);
	void OnDriftKickActivated(float DriftDirection, EDelMarVehicleDriftState DriftState);
	void OnDriftKickDeactivated();
	void OnEnvironmentEffectCueActivated(struct FDelMarEnvironmentVFX* Effect);
	void OnEnvironmentEffectCueRemoved();
	void OnJumpActivated();
	void OnKickflipActivated(bool bLeftSide);
	void OnKickflipDeactivated();
	void OnTeleportEntered();
	void OnTeleportExited();
	void OnUnderthrustActivated();
	void OnUnderthrustDeactivated();
	void OnVehicleDemolished(const struct FGameplayTag& CausedByTag);
	void OnVehicleLanded(float LandingForce, bool bLandedKickflip);
	void OnWorldBonusSpeedStackGained(const struct FGameplayTag& Source, int32 Stacks);
	void RemoveBoosterActivationFlags(class FName Name_0);

	TArray<class UNiagaraComponent*> GetBoosters(EDelMarVehicleBoosterFlags Flags_0) const;
	class FName GetWheelContactBoneName(EDelMarVehicleWheelIndex WheelIndex) const;
	bool ShouldTriggerFX() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarUnifiedVehicleCosmeticActor">();
	}
	static class ADelMarUnifiedVehicleCosmeticActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarUnifiedVehicleCosmeticActor>();
	}
};

// Class DelMarCosmetics.DelMarVehicleAnimInstance
// 0x0240 (0x0730 - 0x04F0)
class UDelMarVehicleAnimInstance final : public UFortBaseAnimInstance
{
public:
	struct FDelMarBouncyChassisState              BouncyChassis;                                     // 0x04F0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDelMarBouncyChassisSetup              BouncyChassisSetup;                                // 0x0500(0x0058)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         BouncyChassisBlendRate;                            // 0x0558(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VisualSteerAngleInterpRate;                        // 0x055C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WheelLerpSpeed;                                    // 0x0560(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SuspensionInterpRate;                              // 0x0564(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AirSpinAccel;                                      // 0x0568(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AirSpinBrake;                                      // 0x056C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AirSpinDecayRate;                                  // 0x0570(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDelMarVehicleAnimInfo                 VehicleInfo;                                       // 0x0574(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bThrottling;                                       // 0x057C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bReversing;                                        // 0x057D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAccelerating;                                     // 0x057E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBraking;                                          // 0x057F(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Throttle;                                          // 0x0580(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Steering;                                          // 0x0584(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SteeringAngle;                                     // 0x0588(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWheelsOnGround;                                   // 0x058C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ForwardSpeed;                                      // 0x0590(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDriftBoostActive;                                 // 0x0594(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUnderthrustActive;                                // 0x0595(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDriftActive;                                      // 0x0596(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bKickflipActive;                                   // 0x0597(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bJumpActive;                                       // 0x0598(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTurboActive;                                      // 0x0599(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59A[0x2];                                      // 0x059A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDelMarVehicleWheelAnimInfo            WheelInfoFR;                                       // 0x059C(0x001C)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDelMarVehicleWheelAnimInfo            WheelInfoFL;                                       // 0x05B8(0x001C)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDelMarVehicleWheelAnimInfo            WheelInfoBR;                                       // 0x05D4(0x001C)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDelMarVehicleWheelAnimInfo            WheelInfoBL;                                       // 0x05F0(0x001C)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_60C[0x124];                                    // 0x060C(0x0124)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarVehicleAnimInstance">();
	}
	static class UDelMarVehicleAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarVehicleAnimInstance>();
	}
};

// Class DelMarCosmetics.DelMarWheelAnimInstance
// 0x0030 (0x0520 - 0x04F0)
class UDelMarWheelAnimInstance final : public UFortBaseAnimInstance
{
public:
	uint8                                         Pad_4F0[0x1C];                                     // 0x04F0(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpinDegrees;                                       // 0x050C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarVehicleAnimInstance*             ParentAnimInstance;                                // 0x0510(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_518[0x8];                                      // 0x0518(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarWheelAnimInstance">();
	}
	static class UDelMarWheelAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarWheelAnimInstance>();
	}
};

// Class DelMarCosmetics.DelMarBodyCosmeticActor
// 0x00B8 (0x0510 - 0x0458)
class ADelMarBodyCosmeticActor final : public ADelMarCosmeticActor
{
public:
	class USkeletalMeshComponent*                 PreviewSkeletalMeshComponent;                      // 0x0458(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ADelMarWheelsCosmeticActor> PreviewWheelClass;                                 // 0x0460(0x0008)(Edit, ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreviewWheelFxContactPoints;                      // 0x0468(0x0001)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADelMarWheelsCosmeticActor*             PreviewWheelCosmeticActor;                         // 0x0470(0x0008)(ZeroConstructor, Transient, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDelMarVehicleWheelSetup>       FrontLeftWheelsBoneNames;                          // 0x0478(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDelMarVehicleWheelSetup>       FrontRightWheelsBoneNames;                         // 0x0488(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDelMarVehicleWheelSetup>       BackRightWheelsBoneNames;                          // 0x0498(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDelMarVehicleWheelSetup>       BackLeftWheelsBoneNames;                           // 0x04A8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDelMarVehicleBooster>          LeftBoostersInfo;                                  // 0x04B8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDelMarVehicleBooster>          RightBoostersInfo;                                 // 0x04C8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x04D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x04E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAnimInstance>              AnimInstanceClass;                                 // 0x04E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarVehicleBodySetup*                BodySetup;                                         // 0x04F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                WheelContactFxOffset;                              // 0x04F8(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	TSubclassOf<class UAnimInstance> GetAnimInstanceClass() const;
	TArray<struct FDelMarVehicleWheelSetup> GetBackLeftWheelsBoneNames() const;
	TArray<struct FDelMarVehicleWheelSetup> GetBackRightWheelsBoneNames() const;
	const class UDelMarVehicleBodySetup* GetBodySetup() const;
	class UNiagaraComponent* GetBoosterBySocketName(const class FName& SocketName) const;
	TArray<struct FDelMarVehicleWheelSetup> GetFrontLeftWheelsBoneNames() const;
	TArray<struct FDelMarVehicleWheelSetup> GetFrontRightWheelsBoneNames() const;
	TArray<struct FDelMarVehicleBooster> GetLeftBoostersInfo() const;
	class UPhysicsAsset* GetPhysicsAsset() const;
	TArray<struct FDelMarVehicleBooster> GetRightBoostersInfo() const;
	class USkeletalMesh* GetSkeletalMesh() const;
	struct FVector GetWheelCosmeticActorOffset() const;
	TArray<struct FDelMarVehicleWheelSetup> GetWheelSetups(EDelMarVehicleWheelIndex WheelIndex) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarBodyCosmeticActor">();
	}
	static class ADelMarBodyCosmeticActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarBodyCosmeticActor>();
	}
};

// Class DelMarCosmetics.DelMarBoosterCosmeticActor
// 0x0030 (0x0488 - 0x0458)
class ADelMarBoosterCosmeticActor final : public ADelMarCosmeticActor
{
public:
	class UNiagaraSystem*                         BoosterFx;                                         // 0x0458(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FDelMarVehicleBooster>          LeftBoosters;                                      // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDelMarVehicleBooster>          RightBoosters;                                     // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                 BodySkeletalMeshComponent;                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetAllBoostersEnabled(bool bSetFrontBoosters, bool bSetBackBoosters, bool bSetSideBoosters, bool bSetDownBoosters, bool bEnabled, bool bReset);
	void SetLeftBoostersEnabled(bool bSetFrontBoosters, bool bSetBackBoosters, bool bSetSideBoosters, bool bSetDownBoosters, bool bEnabled, bool bReset);
	void SetRightBoostersEnabled(bool bSetFrontBoosters, bool bSetBackBoosters, bool bSetSideBoosters, bool bSetDownBoosters, bool bEnabled, bool bReset);

	TArray<class UNiagaraComponent*> GetAllBoosters(bool bFrontBoosters, bool bBackBoosters, bool bSideBoosters, bool bDownBoosters) const;
	TArray<class UNiagaraComponent*> GetLeftBoosters(bool bFrontBoosters, bool bBackBoosters, bool bSideBoosters, bool bDownBoosters) const;
	TArray<class UNiagaraComponent*> GetRightBoosters(bool bFrontBoosters, bool bBackBoosters, bool bSideBoosters, bool bDownBoosters) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarBoosterCosmeticActor">();
	}
	static class ADelMarBoosterCosmeticActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarBoosterCosmeticActor>();
	}
};

// Class DelMarCosmetics.DelMarEngineAudioCosmeticActor
// 0x0048 (0x04A0 - 0x0458)
class ADelMarEngineAudioCosmeticActor final : public ADelMarCosmeticActor
{
public:
	struct FAudioGameplayBehaviorInstance         EngineAudio;                                       // 0x0458(0x0010)(Edit, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         NonLocalVelocityInterpSpeed;                       // 0x0468(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisabled;                                         // 0x046C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_46D[0x3];                                      // 0x046D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponentGroup*                   ComponentGroup;                                    // 0x0470(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAudioMotorModelComponent*              MotorModel;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_480[0x20];                                     // 0x0480(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UAudioComponentGroup* GetComponentGroup() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarEngineAudioCosmeticActor">();
	}
	static class ADelMarEngineAudioCosmeticActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarEngineAudioCosmeticActor>();
	}
};

// Class DelMarCosmetics.DelMarWheelContactFxCosmeticActor
// 0x0128 (0x0580 - 0x0458)
class ADelMarWheelContactFxCosmeticActor final : public ADelMarCosmeticActor
{
public:
	struct FAudioGameplayBehaviorInstance         WheelSounds;                                       // 0x0458(0x0010)(Edit, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         FxSideSpeedThreshold;                              // 0x0468(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FxForwardSpeedThreshold;                           // 0x046C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPhysicalMaterial*                      ContactMaterial;                                   // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_478[0x10];                                     // 0x0478(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDelMarVehicleCosmeticWheelInfo> WheelInfos;                                        // 0x0488(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class FName                                   FrontLeftWheelContactBone;                         // 0x0498(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   FrontRightWheelContactBone;                        // 0x04A4(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   BackRightWheelContactBone;                         // 0x04B0(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   BackLeftWheelContactBone;                          // 0x04BC(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C8[0xB8];                                     // 0x04C8(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_UpdateWheelContactFx(const struct FDelMarVehicleCosmeticWheelInfo& WheelInfo, bool bActive, float AbsForwardSpeed, float AbsSideSpeed);
	void HandleVehicleLanded(float LandingForce, bool bLandedKickflip);

	class UAudioGameplayBehavior* GetAudioBehavior() const;
	class FName GetWheelContactBoneName(EDelMarVehicleWheelIndex WheelIndex) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarWheelContactFxCosmeticActor">();
	}
	static class ADelMarWheelContactFxCosmeticActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarWheelContactFxCosmeticActor>();
	}
};

// Class DelMarCosmetics.DelMarCosmeticActorSpawnLogic_Wheel
// 0x0008 (0x0038 - 0x0030)
class UDelMarCosmeticActorSpawnLogic_Wheel final : public UDelMarCosmeticActorSpawnLogic
{
public:
	bool                                          bFrontWheel;                                       // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBackWheel;                                        // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDelMarWheelAttachPoint                       AttachPoint;                                       // 0x0032(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDelMarWheelMirrorType                        MirrorType;                                        // 0x0033(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyFxEligibleWheels;                             // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarCosmeticActorSpawnLogic_Wheel">();
	}
	static class UDelMarCosmeticActorSpawnLogic_Wheel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarCosmeticActorSpawnLogic_Wheel>();
	}
};

// Class DelMarCosmetics.DelMarWheelsCosmeticActor
// 0x0008 (0x0460 - 0x0458)
class ADelMarWheelsCosmeticActor : public ADelMarCosmeticActor
{
public:
	EDelMarVehicleWheelIndex                      WheelIndex;                                        // 0x0458(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	EDelMarWheelMirrorType GetMirrorType() const;
	bool IsBackWheel() const;
	bool IsFrontWheel() const;
	bool IsLeftWheel() const;
	bool IsMirrored() const;
	bool IsRightWheel() const;
	bool IsWheelOnGround() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarWheelsCosmeticActor">();
	}
	static class ADelMarWheelsCosmeticActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarWheelsCosmeticActor>();
	}
};

// Class DelMarCosmetics.DelMarWheelSKCosmeticActor
// 0x0008 (0x0468 - 0x0460)
class ADelMarWheelSKCosmeticActor final : public ADelMarWheelsCosmeticActor
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0460(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarWheelSKCosmeticActor">();
	}
	static class ADelMarWheelSKCosmeticActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarWheelSKCosmeticActor>();
	}
};

}

