#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarFrontend

#include "Basic.hpp"

#include "EpicMediaBasePlayer_structs.hpp"


namespace SDK::Params
{

// Function DelMarFrontend.DelMarFrontendExperienceFlow.HandleVideoTerminalError
// 0x0001 (0x0001 - 0x0000)
struct DelMarFrontendExperienceFlow_HandleVideoTerminalError final
{
public:
	EBaseMediaTerminalErrorReason                 Reason;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarFrontend.DelMarModeSetModificationModal.OnActivityViewModelInitialized
// 0x0008 (0x0008 - 0x0000)
struct DelMarModeSetModificationModal_OnActivityViewModelInitialized final
{
public:
	class UDelMarActivityVM*                      ViewModel;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarFrontend.DelMarModeSetPreviewModal.OnActivityViewModelInitialized
// 0x0008 (0x0008 - 0x0000)
struct DelMarModeSetPreviewModal_OnActivityViewModelInitialized final
{
public:
	class UDelMarActivityVM*                      ViewModel;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarFrontend.DelMarFrontendRuntimeOptions.GetDelMarFrontendRuntimeOptions
// 0x0008 (0x0008 - 0x0000)
struct DelMarFrontendRuntimeOptions_GetDelMarFrontendRuntimeOptions final
{
public:
	class UDelMarFrontendRuntimeOptions*          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarFrontend.DelMarFrontendRuntimeOptions.IsNewTrack
// 0x0018 (0x0018 - 0x0000)
struct DelMarFrontendRuntimeOptions_IsNewTrack final
{
public:
	class FString                                 LinkCode;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarFrontend.DelMarActivityVM.SetCurrentProductMode
// 0x0010 (0x0010 - 0x0000)
struct DelMarActivityVM_SetCurrentProductMode final
{
public:
	class FString                                 SelectedProductMode;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

