#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarTrackEditor

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "DelMarTrackEditor_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DelMarTrackEditor.DelMarTrackEditorSettings
// 0x0050 (0x00B0 - 0x0060)
class UDelMarTrackEditorSettings final : public UDeveloperSettings
{
public:
	TSoftClassPtr<class UClass>                   OobTubeClass;                                      // 0x0060(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TSoftClassPtr<class UClass>>           OobTubeCollectionProxyClasses;                     // 0x0090(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	class FName                                   OobTubeMaterialOpacityParamName;                   // 0x00A0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          EnableSplineTool;                                  // 0x00AC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          EnableSplineToolExtras;                            // 0x00AD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackEditorSettings">();
	}
	static class UDelMarTrackEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackEditorSettings>();
	}
};

// Class DelMarTrackEditor.DelMarTrackPaletteGeneratorData
// 0x0030 (0x0068 - 0x0038)
class UDelMarTrackPaletteGeneratorData final : public UDataAsset
{
public:
	class FString                                 PaletteName;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 VariableLengthMultipliers;                         // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FDelMarTrackPaletteGeneratorDataEntry> Data;                                              // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackPaletteGeneratorData">();
	}
	static class UDelMarTrackPaletteGeneratorData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackPaletteGeneratorData>();
	}
};

// Class DelMarTrackEditor.DelMarTrackPaletteGeneratorHelpers
// 0x0000 (0x0030 - 0x0030)
class UDelMarTrackPaletteGeneratorHelpers final : public UBlueprintFunctionLibrary
{
public:
	static bool DeleteNonGeneratedObjectsFromPath(const TArray<class UObject*>& InGeneratedObject, const class FString& Path);
	static TArray<struct FAssetData> GetNonGeneratedAssetToDelete(const TArray<struct FAssetData>& InGeneratedAssets, const class FString& Path);
	static class UObject* GetOrCreateBlueprintActor(const class FString& Path, TSubclassOf<class UObject> Class_0, class UBlueprint** OutBlueprint, bool* bSuccess);
	static class UObject* GetOrCreateDataAsset(const class FString& Path, TSubclassOf<class UDataAsset> Class_0, bool* bSuccess);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackPaletteGeneratorHelpers">();
	}
	static class UDelMarTrackPaletteGeneratorHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackPaletteGeneratorHelpers>();
	}
};

}

