#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeveloperToolSettings

#include "Basic.hpp"


namespace SDK
{

// Enum DeveloperToolSettings.ECookProgressDisplayMode
// NumValues: 0x000A
enum class ECookProgressDisplayMode : uint32
{
	Nothing                                  = 0,
	RemainingPackages                        = 1,
	PackageNames                             = 2,
	NamesAndRemainingPackages                = 3,
	Instigators                              = 4,
	InstigatorsAndCount                      = 5,
	InstigatorsAndNames                      = 6,
	InstigatorsAndNamesAndCount              = 7,
	Max                                      = 8,
	ECookProgressDisplayMode_MAX             = 9,
};

// Enum DeveloperToolSettings.EBlueprintComponentDataCookingMethod
// NumValues: 0x0004
enum class EBlueprintComponentDataCookingMethod : uint32
{
	Disabled                                 = 0,
	AllBlueprints                            = 1,
	EnabledBlueprintsOnly                    = 2,
	EBlueprintComponentDataCookingMethod_MAX = 3,
};

// Enum DeveloperToolSettings.EBlueprintPropertyGuidsCookingMethod
// NumValues: 0x0004
enum class EBlueprintPropertyGuidsCookingMethod : uint32
{
	Disabled                                 = 0,
	AllBlueprints                            = 1,
	EnabledBlueprintsOnly                    = 2,
	EBlueprintPropertyGuidsCookingMethod_MAX = 3,
};

// Enum DeveloperToolSettings.ETextureFormatASTCCompressor
// NumValues: 0x0004
enum class ETextureFormatASTCCompressor : uint32
{
	IntelISPC                                = 0,
	Arm                                      = 1,
	Max                                      = 2,
	ETextureFormatASTCCompressor_MAX         = 3,
};

// Enum DeveloperToolSettings.EProjectPackagingBuildConfigurations
// NumValues: 0x0006
enum class EProjectPackagingBuildConfigurations : uint8
{
	PPBC_Debug                               = 0,
	PPBC_DebugGame                           = 1,
	PPBC_Development                         = 2,
	PPBC_Test                                = 3,
	PPBC_Shipping                            = 4,
	PPBC_MAX                                 = 5,
};

// Enum DeveloperToolSettings.EProjectPackagingInternationalizationPresets
// NumValues: 0x0006
enum class EProjectPackagingInternationalizationPresets : uint8
{
	English                                  = 0,
	EFIGS                                    = 1,
	EFIGSCJK                                 = 2,
	CJK                                      = 3,
	All                                      = 4,
	EProjectPackagingInternationalizationPresets_MAX = 5,
};

// Enum DeveloperToolSettings.EProjectPackagingBuild
// NumValues: 0x0005
enum class EProjectPackagingBuild : uint32
{
	Always                                   = 0,
	Never                                    = 1,
	IfProjectHasCode                         = 2,
	IfEditorWasBuiltLocally                  = 3,
	EProjectPackagingBuild_MAX               = 4,
};

// Enum DeveloperToolSettings.EProjectPackagingBlueprintNativizationMethod
// NumValues: 0x0004
enum class EProjectPackagingBlueprintNativizationMethod : uint8
{
	Disabled                                 = 0,
	Inclusive                                = 1,
	Exclusive                                = 2,
	EProjectPackagingBlueprintNativizationMethod_MAX = 3,
};

// Enum DeveloperToolSettings.EAssetRegistryWritebackMethod
// NumValues: 0x0004
enum class EAssetRegistryWritebackMethod : uint8
{
	Disabled                                 = 0,
	OriginalFile                             = 1,
	AdjacentFile                             = 2,
	EAssetRegistryWritebackMethod_MAX        = 3,
};

// ScriptStruct DeveloperToolSettings.PakOrderFileSpec
// 0x0018 (0x0018 - 0x0000)
struct FPakOrderFileSpec final
{
public:
	class FString                                 Pattern;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DeveloperToolSettings.ProjectBuildSettings
// 0x0040 (0x0040 - 0x0000)
struct FProjectBuildSettings final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HelpText;                                          // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         SpecificPlatforms;                                 // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 BuildCookRunParams;                                // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

