#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DG_LinearBlendSkin_Morph_Cloth_RecomputeNormals

#include "Basic.hpp"

#include "OptimusCore_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// OptimusNode_ConstantValueGeneratorClass DG_LinearBlendSkin_Morph_Cloth_RecomputeNormals.OptimusNode_ConstantValue_FloatProperty
// 0x0008 (0x0130 - 0x0128)
class UOptimusNode_ConstantValue_FloatProperty final : public UOptimusNode_ConstantValue
{
public:
	float                                         Value;                                             // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Out;                                               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_ConstantValue_FloatProperty">();
	}
	static class UOptimusNode_ConstantValue_FloatProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_ConstantValue_FloatProperty>();
	}
};

// OptimusNode_ConstantValueGeneratorClass DG_LinearBlendSkin_Morph_Cloth_RecomputeNormals.OptimusNode_ConstantValue_FVector4
// 0x0048 (0x0170 - 0x0128)
class UOptimusNode_ConstantValue_FVector4 final : public UOptimusNode_ConstantValue
{
public:
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               Value;                                             // 0x0130(0x0020)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               Out;                                               // 0x0150(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_ConstantValue_FVector4">();
	}
	static class UOptimusNode_ConstantValue_FVector4* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_ConstantValue_FVector4>();
	}
};

}

