#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DiscoveryBrowserUI

#include "Basic.hpp"

#include "ModelViewViewModel_classes.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonUI_classes.hpp"
#include "DiscoveryBrowserUI_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Class DiscoveryBrowserUI.FortActivityBrowserRow
// 0x00F8 (0x0538 - 0x0440)
class UFortActivityBrowserRow : public UCommonUserWidget
{
public:
	uint8                                         Pad_440[0x18];                                     // 0x0440(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumVisibilityPercentageForRowActivation;       // 0x0458(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortDiscoverItemSelectorBase*          OverrideItemSelector;                              // 0x0460(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortDiscoverSurfaceViewModel*          SurfaceViewModel;                                  // 0x0468(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EActivityBrowserRowViewModelSource            PanelViewModelSource;                              // 0x0470(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_471[0xB7];                                     // 0x0471(0x00B7)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_CategoryName;                                 // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_530[0x8];                                      // 0x0530(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCategoryItemChanged(const bool bPlayAnimation);
	void OnCategoryTextChanged(const class FText& CategoryText, const class FText& CategorySubtitle);
	void OnOverrideItemSelectorSet(const class UFortDiscoverItemSelectorBase* ItemSelector);
	void OnRowIsActiveChanged(const bool bIsActive);
	void OnRowIsSelectedChanged(const bool bIsSelected);
	void OnRowMoveDown(const bool bMovingOffscreen);
	void OnRowMoveUp(const bool bMovingOffscreen);
	void OnRowPeekStateChanged(const bool bIsInPeekState);

	bool GetIsActive() const;
	bool GetIsInPeekState() const;
	bool GetIsSelected() const;
	int32 GetNumDisplayedSubRows() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserRow">();
	}
	static class UFortActivityBrowserRow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserRow>();
	}
};

// Class DiscoveryBrowserUI.FortDiscoverBrowserGridRow
// 0x0018 (0x0550 - 0x0538)
class UFortDiscoverBrowserGridRow final : public UFortActivityBrowserRow
{
public:
	uint8                                         Pad_538[0x8];                                      // 0x0538(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ItemIndexRepresented;                              // 0x0540(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSupportLessThanMaxVisibleSubRows;                 // 0x0548(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFortDiscoverProviderViewModel* GetPanelViewModel();
	bool GetSupportsLessThanMaxVisibleRows();
	void HandleActivitySelected(int32 Index_0, int32 IndexInRow);
	void NavigateWithinGrid(int32 Row);
	void SetFocusOffset(int32 FocusOffset, bool bSelectFromBelow);
	void SetMaxVisibleRows(int32 MaxRowsShown);
	void SetPanelViewModel(class UFortDiscoverProviderViewModel* ViewModel);
	void UpdateAnalyticsStates(bool bStopImpressions);

	int32 GetFirstVisibleSubRow() const;
	int32 GetNumberOfVisibleSubRows() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDiscoverBrowserGridRow">();
	}
	static class UFortDiscoverBrowserGridRow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDiscoverBrowserGridRow>();
	}
};

// Class DiscoveryBrowserUI.DiscoverSelectedActivityViewModel
// 0x0030 (0x00A0 - 0x0070)
class UDiscoverSelectedActivityViewModel final : public UMVVMViewModelBase
{
public:
	bool                                          bLoading;                                          // 0x0070(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasPartyData;                                     // 0x0071(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsLibrary;                                        // 0x0072(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsActiveInvite;                                   // 0x0073(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsPartyPrivate;                                   // 0x0074(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentPartySize;                                  // 0x0078(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RichPresenceText;                                  // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UFortActivityViewModel*                 ActivityVM;                                        // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DiscoverSelectedActivityViewModel">();
	}
	static class UDiscoverSelectedActivityViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDiscoverSelectedActivityViewModel>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserTileBase
// 0x0060 (0x1860 - 0x1800)
class UFortActivityBrowserTileBase : public UCommonButtonBase
{
public:
	uint8                                         Pad_1800[0x60];                                    // 0x1800(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserTileBase">();
	}
	static class UFortActivityBrowserTileBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserTileBase>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserLibraryTile
// 0x0050 (0x18B0 - 0x1860)
class UFortActivityBrowserLibraryTile final : public UFortActivityBrowserTileBase
{
public:
	uint8                                         Pad_1860[0x10];                                    // 0x1860(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSidebarOnboardTooltipWidget*       OnboardingTooltip;                                 // 0x1870(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1878[0x38];                                    // 0x1878(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserLibraryTile">();
	}
	static class UFortActivityBrowserLibraryTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserLibraryTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivityListItemWrapper
// 0x0010 (0x0040 - 0x0030)
class UFortActivityListItemWrapper final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityListItemWrapper">();
	}
	static class UFortActivityListItemWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityListItemWrapper>();
	}
};

// Class DiscoveryBrowserUI.FortDiscoverHomespace
// 0x0000 (0x0598 - 0x0598)
class UFortDiscoverHomespace final : public UScrollableActivatableWidget
{
public:
	void OnPeekPushPercentMobileCVarChanged(float PeekPushPercent);

	void SendHomespaceSubviewEvent(const class UWidget* SubWidget, const class FString& Text) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDiscoverHomespace">();
	}
	static class UFortDiscoverHomespace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDiscoverHomespace>();
	}
};

// Class DiscoveryBrowserUI.FortDiscoverPreviewManager
// 0x00C8 (0x00F8 - 0x0030)
class UFortDiscoverPreviewManager final : public UObject
{
public:
	uint8                                         Pad_30[0xC8];                                      // 0x0030(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDiscoverPreviewManager">();
	}
	static class UFortDiscoverPreviewManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDiscoverPreviewManager>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserColorSchemeAsset
// 0x0050 (0x0088 - 0x0038)
class UFortActivityBrowserColorSchemeAsset final : public UDataAsset
{
public:
	TMap<class UMaterialParameterCollection*, struct FColorSchemeParamaterValues> MaterialCollectionOverrides;                       // 0x0038(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserColorSchemeAsset">();
	}
	static class UFortActivityBrowserColorSchemeAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserColorSchemeAsset>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserListView
// 0x0260 (0x05E0 - 0x0380)
class UFortActivityBrowserListView final : public UListViewBase
{
public:
	uint8                                         Pad_380[0xE8];                                     // 0x0380(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DirectionalNavigationTimeThreshold;                // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortActivityBrowserRow>    DiscoverItemRowClass;                              // 0x0470(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivityBrowserRow>    HomebarItemRowClass;                               // 0x0478(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivityBrowserRow>    NonScrollingItemRowClass;                          // 0x0480(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, TSubclassOf<class UFortActivityBrowserRow>> RowTypes;                                          // 0x0488(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UFortDiscoverItemSelectorBase*          OverrideItemSelector;                              // 0x04D8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortDiscoverSurfaceViewModel*          SurfaceViewModel;                                  // 0x04E0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAllowNonFullGridRows;                             // 0x04E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseTinyOffsetWhenScrollingIntoView;               // 0x04E9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAllowInternalRowSelection;                        // 0x04EA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4EB[0xF5];                                     // 0x04EB(0x00F5)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleVisibleEntriesChanged();
	void NavigateToActivityInFirstRow(int32 ActivityItemIndex, bool bRequestNavigationToItem);
	bool NavigateToCategory(const class FName ActivityCategoryName, bool bAnimateScroll);
	void ScrollToTopOfSelectedCategory();
	void SetAllowInternalRowSelection(const bool bInAllowInternalRowSelection);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserListView">();
	}
	static class UFortActivityBrowserListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserListView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile
// 0x00D0 (0x1930 - 0x1860)
class UFortActivityBrowserPlayWithFriendsTile final : public UFortActivityBrowserTileBase
{
public:
	int32                                         MaxNamesToDisplay;                                 // 0x1860(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxPortraitsToDisplay;                             // 0x1864(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1868[0x10];                                    // 0x1868(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortJoinablePartyPortraitsDisplay*     PartyMembersAvatarsDisplay;                        // 0x1878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsActiveInvite;                                   // 0x1880(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1881[0x3];                                     // 0x1881(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentPartySize;                                  // 0x1884(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsPartyPrivate;                                   // 0x1888(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1889[0x7];                                     // 0x1889(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameActivity*                      CachedGameActivity;                                // 0x1890(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1898[0x10];                                    // 0x1898(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class USocialUser>             CachedTargetSocialUser;                            // 0x18A8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                   CurrentCTAButtonText;                              // 0x18B0(0x0010)(Transient, NativeAccessSpecifierPrivate)
	class FText                                   JoinPartyText;                                     // 0x18C0(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                   RequestToJoinText;                                 // 0x18D0(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    JoinFriendInputAction_Touch;                       // 0x18E0(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_18F8[0x38];                                    // 0x18F8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_PartyInformationUpdated(bool bInIsTileSelected);
	class FText GetCTAButtonText();
	void HandleCTAButtonClicked();
	void OnGameActivityChanged(class UFortGameActivity* GameActivity);
	void OnTextureBeginLoading();
	void OnTextureLoadingComplete(const class UTexture* ThumbnailTexture);
	void OnTileActiveChanged(const bool bIsTileActive);
	void OnUpdateColumnSize(int32 NewColumnSize);
	void OpenSidebar();
	void UpdateCTAButtonInfo(const class FText& InteractionText, const bool bInteractionFound);
	void UpdateCTAButtonInteraction(const bool bIsInteractionEnabled);
	void UpdateIslandThumbnail(const class UTexture* ThumbnailTexture);
	void UpdateLastInteraction(const class FText& LastInteraction);
	void UpdateOtherPlayersSubText(const class FText& OtherPlayersSubText);
	void UpdatePartyMemberNames(const class FText& Names);
	void UpdateRichPresence(const class FText& RichPresence);
	void UpdateSingleFriendName(const class FText& SingleFriendName);

	const int32 GetMaxPartySize() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserPlayWithFriendsTile">();
	}
	static class UFortActivityBrowserPlayWithFriendsTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserPlayWithFriendsTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserRowList
// 0x0020 (0x0558 - 0x0538)
class UFortActivityBrowserRowList final : public UFortActivityBrowserRow
{
public:
	class UFortActivityListView*                  ListView_Activities;                               // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PageLeft;                                   // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PageRight;                                  // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_550[0x8];                                      // 0x0550(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnQueryStatusChanged(bool bIsActive);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserRowList">();
	}
	static class UFortActivityBrowserRowList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserRowList>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserView
// 0x00D8 (0x06A0 - 0x05C8)
class UFortActivityBrowserView : public UFortActivityView
{
public:
	bool                                          bShowCustomMatchmakingModalButton;                 // 0x05C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowSpectateMatchModalButton;                     // 0x05C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowMobileGameDetailsButton;                      // 0x05CA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowMobileAcceptButton;                           // 0x05CB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowBackToTopButton;                              // 0x05CC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5CD[0x3];                                      // 0x05CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DiscoverySurfaceName;                              // 0x05D0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5DC[0xC4];                                     // 0x05DC(0x00C4)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSurfaceDataDirty();

	EFortInvalidActivityReason GetInvalidActivityReason() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserView">();
	}
	static class UFortActivityBrowserView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserRowView
// 0x01E0 (0x0880 - 0x06A0)
class UFortActivityBrowserRowView : public UFortActivityBrowserView
{
public:
	uint8                                         Pad_6A0[0x8];                                      // 0x06A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MouseWheelScrollTimeThreshold;                     // 0x06A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6AC[0x4];                                      // 0x06AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActivityBrowserListView*           BrowserList_Activities;                            // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6B8[0x68];                                     // 0x06B8(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TabNameId;                                         // 0x0720(0x000C)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_72C[0x4];                                      // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0730(0x0120)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPrivate)
	class UFortSwipePanel*                        SwipePanel_Navigation;                             // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FName>                           ActivityProviderFilter;                            // 0x0858(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	EActivityBrowserFilterType                    ActivityProviderFilterType;                        // 0x0868(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_869[0x17];                                     // 0x0869(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleVerticalSwipe(const int32 Direction);
	void OnActivityUpdated();
	void OnListViewScrolled(float ItemOffset, float DistanceRemaining);
	void OnQueryActivitiesFinished();
	void OnRowChanged(const int32 NewCategoryIndex);
	void SetActivityProviderFilter(const TArray<class FName>& PanelNames, EActivityBrowserFilterType FilterType);
	void SetSurfaceViewModel(class UFortDiscoverSurfaceViewModel* SurfaceViewModel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserRowView">();
	}
	static class UFortActivityBrowserRowView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserRowView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserTile
// 0x0060 (0x18C0 - 0x1860)
class UFortActivityBrowserTile final : public UFortActivityBrowserTileBase
{
public:
	class UFortActivityTileDetailsDisplay*        Display_TileDetails;                               // 0x1860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1868[0x58];                                    // 0x1868(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleActivitySelected();
	void HandleDisplayTileDetailsHoldTriggered(class UCommonButtonBase* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserTile">();
	}
	static class UFortActivityBrowserTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivityPlayerBrowserView
// 0x0170 (0x0810 - 0x06A0)
class UFortActivityPlayerBrowserView : public UFortActivityBrowserView
{
public:
	uint8                                         Pad_6A0[0x8];                                      // 0x06A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameActivityProvider*              ActivityProvider;                                  // 0x06A8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortActivityTileView*                  TileView_PlayerActivities;                         // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   TabNameId;                                         // 0x06B8(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C4[0xC];                                      // 0x06C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x06D0(0x0120)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	EFortCreativeDiscoveryPlayHistoryType         PlayHistoryProviderType;                           // 0x07F0(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7F1[0x1F];                                     // 0x07F1(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnTileViewUpdated();
	void OnPlayViewIntro();
	void OnQueryActivitiesComplete();
	void OnQueryActivitiesStarted();
	void PlayViewIntro();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityPlayerBrowserView">();
	}
	static class UFortActivityPlayerBrowserView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityPlayerBrowserView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityCategoryPageView
// 0x0040 (0x0850 - 0x0810)
class UFortActivityCategoryPageView : public UFortActivityPlayerBrowserView
{
public:
	uint8                                         Pad_810[0x8];                                      // 0x0810(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonRichTextBlock*                   Text_CategoryTitle;                                // 0x0818(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_BackToTop;                                  // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0828(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_MobileAccept;                               // 0x0838(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_MobileShowGameDetails;                      // 0x0840(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_848[0x8];                                      // 0x0848(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityCategoryPageView">();
	}
	static class UFortActivityCategoryPageView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCategoryPageView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityTileViewTileBase
// 0x0090 (0x1890 - 0x1800)
class UFortActivityTileViewTileBase : public UCommonButtonBase
{
public:
	uint8                                         Pad_1800[0x90];                                    // 0x1800(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityTileViewTileBase">();
	}
	static class UFortActivityTileViewTileBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityTileViewTileBase>();
	}
};

// Class DiscoveryBrowserUI.FortActivityCategoryTile
// 0x0010 (0x18A0 - 0x1890)
class UFortActivityCategoryTile final : public UFortActivityTileViewTileBase
{
public:
	class UCommonTextBlock*                       Text_CategoryTitle;                                // 0x1890(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1898[0x8];                                     // 0x1898(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTileActiveSet(const bool bIsTileActive);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityCategoryTile">();
	}
	static class UFortActivityCategoryTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCategoryTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivityCategoryTilePanel
// 0x0070 (0x04B0 - 0x0440)
class UFortActivityCategoryTilePanel final : public UCommonUserWidget
{
public:
	class UFortActivityTileView*                  TileView_Categories;                               // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         TileViewQueryThreshold;                            // 0x0450(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCreativeDiscoveryActivityProvider* CachedActivityProvider;                            // 0x0458(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_460[0x50];                                     // 0x0460(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityCategoryTilePanel">();
	}
	static class UFortActivityCategoryTilePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCategoryTilePanel>();
	}
};

// Class DiscoveryBrowserUI.FortActivityCategoryView
// 0x0160 (0x0800 - 0x06A0)
class UFortActivityCategoryView final : public UFortActivityBrowserView
{
public:
	uint8                                         Pad_6A0[0x8];                                      // 0x06A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TabNameId;                                         // 0x06A8(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6B4[0xC];                                      // 0x06B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x06C0(0x0120)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UFortActivityCategoryTilePanel*         TilePanel_Featured;                                // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityCategoryTilePanel*         TilePanel_All;                                     // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityCategoryTilePanel*         CurrentSelectedPanel;                              // 0x07F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7F8[0x8];                                      // 0x07F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFortActivityCategoryTilePanel* NavigateFromPanel(EUINavigation Direction, class UFortActivityCategoryTilePanel* NavigatingPanel);
	void OnCategoryTilePanelSelected(const class UFortActivityCategoryTilePanel* SelectedPanel);
	void OnSurfaceDataReady();

	const class UFortActivityCategoryTilePanel* GetCurrentSelectedPanel() const;
	class UFortActivityCategoryTilePanel* GetTopMostVisiblePanel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityCategoryView">();
	}
	static class UFortActivityCategoryView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCategoryView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityCreatorPageView
// 0x0140 (0x0990 - 0x0850)
class UFortActivityCreatorPageView final : public UFortActivityCategoryPageView
{
public:
	uint8                                         Pad_850[0xE8];                                     // 0x0850(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AmountOfCreatorLinkEntriesQueried;                 // 0x0938(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ProcessedCreatorLinkEntries;                       // 0x093C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         AmountOfEntriesQueried;                            // 0x0940(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_944[0x4C];                                     // 0x0944(0x004C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCreatorActivitiesQueryFinished();
	void OnNoContentFoundForCreator();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityCreatorPageView">();
	}
	static class UFortActivityCreatorPageView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCreatorPageView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityDiscoverView
// 0x00A0 (0x0920 - 0x0880)
class UFortActivityDiscoverView final : public UFortActivityBrowserRowView
{
public:
	bool                                          bPlayDetailsAnimationOnScreenOpen;                 // 0x0880(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_881[0x3];                                      // 0x0881(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DetailsDisplayUpdateDelay;                         // 0x0884(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivatableMovieWidget> MovieWidgetClass;                                  // 0x0888(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityDetailsDisplay*            DetailsDisplay_SelectedActivity;                   // 0x0890(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityDetailsDisplay*            DetailsDisplay_PromotedActivity;                   // 0x0898(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                           Panel_VideoSlot;                                   // 0x08A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                           Panel_PromotedVideoSlot;                           // 0x08A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivatableMovieWidget*            ActivityMovieWidget;                               // 0x08B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivatableMovieWidget*            PromotedActivityMovieWidget;                       // 0x08B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C0[0x48];                                     // 0x08C0(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       BoundKeyArtOutroAnimation;                         // 0x0908(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_910[0x10];                                     // 0x0910(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CheckUpdateDetailsDelay();
	void HandleMovieWidgetMediaPreEndEvent();
	void HandleMovieWidgetMediaStarted();
	void OnMoviePlayingChanged(const bool bIsPlaying);
	void OnMoviePreEndEvent();
	void OnPlayKeyArtIntro();
	void OnPlayKeyArtOutro();
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);
	void OnUpdateDetailsDisplay();

	const class UTexture* GetCurrentTexture() const;
	class UWidgetAnimation* GetKeyArtOutroAnimation() const;
	class UFortActivatableMovieWidget* GetMovieWidget() const;
	class UFortActivatableMovieWidget* GetPromotedMovieWidget() const;
	bool IsImageLoading() const;
	bool IsInOutroState() const;
	bool IsShowingPromotedContent() const;
	bool IsShowingSeasonalContent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityDiscoverView">();
	}
	static class UFortActivityDiscoverView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityDiscoverView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityDiscoverViewV2
// 0x01B0 (0x0A30 - 0x0880)
class UFortActivityDiscoverViewV2 final : public UFortActivityBrowserRowView
{
public:
	TMulticastInlineDelegate<void()>              OnActivityRequested;                               // 0x0880(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortDiscoverPreviewManager*            DiscoverPreviewManager;                            // 0x0890(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_898[0x28];                                     // 0x0898(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UDiscoverSelectedActivityViewModel*     SelectedActivityVM;                                // 0x08C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   SoftCustomMatchmakingModalClass;                   // 0x08C8(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   SoftSpectateMatchModalClass;                       // 0x08F8(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_928[0x8];                                      // 0x0928(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    BackToTopInputAction;                              // 0x0930(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_948[0x8];                                      // 0x0948(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CustomKeyInputAction;                              // 0x0950(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_968[0x8];                                      // 0x0968(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ShowSpectateMatchModalInputAction;                 // 0x0970(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_988[0x8];                                      // 0x0988(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    JoinAsSpectatorInputAction;                        // 0x0990(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9A8[0x8];                                      // 0x09A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    JoinAsPlayerInputAction;                           // 0x09B0(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9C8[0x8];                                      // 0x09C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    SelectActivityInputAction_Touch;                   // 0x09D0(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9E8[0x48];                                     // 0x09E8(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DeactivationTransitionCompleted();
	void FireDiscoverExitedAnalyticEvent();
	void HandlePlaytimeStateChanged(EPlaytimeState NewState);
	void StartDiscoverAnalyticSession();
	void UpdateMiscActionBindingVisibility(bool bVisible);

	bool IsShowingPromotedContent() const;
	bool IsShowingSeasonalContent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityDiscoverViewV2">();
	}
	static class UFortActivityDiscoverViewV2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityDiscoverViewV2>();
	}
};

// Class DiscoveryBrowserUI.FortActivityListView
// 0x01A8 (0x0528 - 0x0380)
class UFortActivityListView final : public UListViewBase
{
public:
	uint8                                         Pad_380[0xE8];                                     // 0x0380(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DirectionalNavigationTimeThreshold;                // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOrientation                                  Orientation;                                       // 0x046C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_46D[0x3];                                      // 0x046D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EntrySpacing;                                      // 0x0470(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCircularNavigationEnabled;                        // 0x0474(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_475[0x3];                                      // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EActivityBrowserTileStyle, TSubclassOf<class UFortActivityBrowserTileBase>> TileTypes;                                         // 0x0478(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C8[0x60];                                     // 0x04C8(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddTileType(EActivityBrowserTileStyle Style, TSubclassOf<class UFortActivityBrowserTileBase> WidgetClass);
	bool GetHasViewAllButton();
	bool GetHorizontalScrollingEnabled();
	int32 GetMaxRows();

	int32 GetInViewCount() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityListView">();
	}
	static class UFortActivityListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityListView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityLobbyTile
// 0x0070 (0x18C0 - 0x1850)
class UFortActivityLobbyTile final : public UCommonButtonLegacy
{
public:
	class UCommonTextBlock*                       Text_ActivityName;                                 // 0x1850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityBrowserTag*                ActivityBrowserTag_EpicOriginal;                   // 0x1858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivityModeSetSelectionModalBase> ActivityModeSetSelectionModalClass;                // 0x1860(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortGameActivityProvider*              ActivityProvider;                                  // 0x1868(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1870[0x50];                                    // 0x1870(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDetailsUpdated();
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);
	void ShowMatchmakingSettingsModal();

	class FText GetChildActivityDisplayName() const;
	bool IsActivityEpicCreated() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityLobbyTile">();
	}
	static class UFortActivityLobbyTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityLobbyTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivityModeSetSelectionModal
// 0x0068 (0x05F8 - 0x0590)
class UFortActivityModeSetSelectionModal final : public UFortActivityModeSetSelectionModalBase
{
public:
	class UCommonTextBlock*                       Text_ActivityName;                                 // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_598[0x28];                                     // 0x0598(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_Back;                                       // 0x05C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_BackBoard;                                  // 0x05C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityModeSetSelection*          List_SubModeList;                                  // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivitySquadFillButton*           Button_ActivitySquadFill;                          // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityPrivacyButton*             Button_ActivityPrivacy;                            // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityHabaneroButton*            Button_Activity_Habanero;                          // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5F0[0x8];                                      // 0x05F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnActivityChanged(const class UFortGameActivity* GameActivity, const class FString& StartingSelectedMnemonic);
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);
	void OnSubModeSelected();
	void OnSubModeSelectionChanged();
	void SaveSelectionAndClose();
	void SetHabaneroValues(bool bHabaneroEnabled, bool bHabaneroExists);
	void SetIsRankedSwitchAvailable(const bool bIsRankedSwitchAvailable);

	bool IsCreativeModeSetActivity() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityModeSetSelectionModal">();
	}
	static class UFortActivityModeSetSelectionModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityModeSetSelectionModal>();
	}
};

// Class DiscoveryBrowserUI.FortActivityPlayerBrowserTile
// 0x0060 (0x18F0 - 0x1890)
class UFortActivityPlayerBrowserTile final : public UFortActivityTileViewTileBase
{
public:
	class UFortActivityTileDetailsDisplay*        Display_TileDetails;                               // 0x1890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_LastPlayedDate;                               // 0x1898(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_18A0[0x50];                                    // 0x18A0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleActivitySelected();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityPlayerBrowserTile">();
	}
	static class UFortActivityPlayerBrowserTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityPlayerBrowserTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivitySelector
// 0x01B8 (0x01F0 - 0x0038)
class UFortActivitySelector final : public UFortLocalPlayerSubsystem
{
public:
	uint8                                         Pad_38[0x100];                                     // 0x0038(0x0100)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnShowActivityDetailsOnCreatorPageDelegate;        // 0x0138(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_148[0x10];                                     // 0x0148(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UFortActivityBrowserColorSchemeAsset*> ColorSchemes;                                      // 0x0158(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A8[0x48];                                     // 0x01A8(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ConfirmSelectedActivity();
	void HandleShowActivityDetails();
	void OnEnableColorScheme(const bool bIsColorSchemeActive);
	void OnSwapColorScheme(const bool bInIsUsingAlternateColorScheme);
	void OpenCreatorPage();
	void ToggleFavorite();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivitySelector">();
	}
	static class UFortActivitySelector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivitySelector>();
	}
};

// Class DiscoveryBrowserUI.FortActivityTileDetailsDisplay
// 0x01A0 (0x1AB0 - 0x1910)
class UFortActivityTileDetailsDisplay final : public UUIKitHoldableModularButton
{
public:
	TMulticastInlineDelegate<void()>              OnActivitySelectedDelegate;                        // 0x1908(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnActivityUnSelectedDelegate;                      // 0x1918(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	bool                                          bShowDetailsButton;                                // 0x1928(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
