#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Documentation

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct Documentation.DocumentationUrl
// 0x0020 (0x0020 - 0x0000)
struct FDocumentationUrl final
{
public:
	class FString                                 Link;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BaseUrlId;                                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Documentation.DocumentationRedirect
// 0x0030 (0x0030 - 0x0000)
struct FDocumentationRedirect final
{
public:
	class FString                                 From;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDocumentationUrl                      ToUrl;                                             // 0x0010(0x0020)(NativeAccessSpecifierPublic)
};

// ScriptStruct Documentation.DocumentationBaseUrl
// 0x0020 (0x0020 - 0x0000)
struct FDocumentationBaseUrl final
{
public:
	class FString                                 Id;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Url;                                               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

