#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DryBoxRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "DryBoxRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class DryBoxRuntime.NyxGlassWeaponComponent_Swinging
// 0x0FE0 (0x1878 - 0x0898)
class UNyxGlassWeaponComponent_Swinging final : public UFortWeaponComponent_Swinging
{
public:
	struct FScalableFloat                         SwingTargetRaycastDist;                            // 0x0898(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         AttackTargetRaycastDist;                           // 0x08D0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         CameraDistScale;                                   // 0x0908(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TargetingSphereRadius;                             // 0x0940(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxAttachPointActorBoundsSize;                     // 0x0978(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxAttachPointActorExtent;                         // 0x09B0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinAttachPointDistFromCamera;                      // 0x09E8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinAttachPointAngleInRad;                          // 0x0A20(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxSecondAttachPointDotProd;                       // 0x0A58(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	ECollisionChannel                             RayTraceTargetingCollisionChannel;                 // 0x0A90(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECollisionChannel                             SphereOverlapTargetingCollisionChannel;            // 0x0A91(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A92[0x6];                                      // 0x0A92(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class AActor>>             DisallowedActorClasses;                            // 0x0A98(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class AActor>>             DirectRaycastDisallowedActorClasses;               // 0x0AA8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<EFortBuildingType>                     AllowedBuildingTypes;                              // 0x0AB8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SwingingAutoDetachDist;                            // 0x0AC8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         AttackStartSlashDist;                              // 0x0B00(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxAcceleration;                                   // 0x0B38(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         GasOrthogonalPowerWhileAttacking;                  // 0x0B70(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         GasOrthogonalPowerWhileSwinging;                   // 0x0BA8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         GasReelInPowerSwinging;                            // 0x0BE0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         GasReelInPowerAttacking;                           // 0x0C18(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         bShouldInterpolateCurGasToGoal;                    // 0x0C50(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         GasForceInterpSpeed;                               // 0x0C88(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         bShouldAccelerateWhileAttached;                    // 0x0CC0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         UnattachedDeaccelerationMultiplier;                // 0x0CF8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         AttachedDeaccelerationMultiplier;                  // 0x0D30(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeAttachedBeforeSpeedStartsIncreasing;           // 0x0D68(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeAttachedForMaxSpeed;                           // 0x0DA0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinAttachedSpeedMultiplier;                        // 0x0DD8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxAttachedSpeedMultiplier;                        // 0x0E10(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinUnattachedSpeedMultiplier;                      // 0x0E48(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxSpeedMultiplier;                                // 0x0E80(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxSpeedDecreaseFromUpwardAngle;                   // 0x0EB8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            SpeedBasedOnHeightCurve;                           // 0x0EF0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         BaseSwingSpeed;                                    // 0x0EF8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         InitialAccelerationStartSpeed;                     // 0x0F30(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         InitialAccelerationTime;                           // 0x0F68(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            InitialAccelerationCurve;                          // 0x0FA0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SpeedSoftCapDrag;                                  // 0x0FA8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SpeedHardCapFailsafe;                              // 0x0FE0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxHoverTime;                                      // 0x1018(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         FullHoverRechargeTime;                             // 0x1050(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DesiredHoverZSpeed;                                // 0x1088(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         HoverZMultiplier;                                  // 0x10C0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         HoverTimeWhileUnequipped;                          // 0x10F8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         HoverZMultiplierWhileUnequipped;                   // 0x1130(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SpeedSoftCapDragWhenHovering;                      // 0x1168(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxHoverSpeed;                                     // 0x11A0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         OldAttackDistanceXRange;                           // 0x11D8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         OldAttackDistanceYRange;                           // 0x1210(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         NewAttackDistanceXRange;                           // 0x1248(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         NewAttackDistanceYRange;                           // 0x1280(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            AttackAccelerationCurve;                           // 0x12B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ReelInForceAttackMinDist;                          // 0x12C0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ReelInForceAttackMaxDist;                          // 0x12F8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ReelInForceAttackMinMult;                          // 0x1330(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ReelInForceAttackMaxMult;                          // 0x1368(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         AttackStartSpeed;                                  // 0x13A0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         AttackMaxSpeed;                                    // 0x13D8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SpeedSoftCapDragWhenAttacking;                     // 0x1410(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SlashLockDistance;                                 // 0x1448(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinSlashDistToTarget;                              // 0x1480(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SlashSpeed;                                        // 0x14B8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SlashLockTime;                                     // 0x14F0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SlashLeapBackTime;                                 // 0x1528(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SlashLeapBackHeightModifier;                       // 0x1560(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SlashLeapBackSpeed;                                // 0x1598(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           OverrideSwingingControlParamsTag_Swinging;         // 0x15D0(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           OverrideSwingingControlParamsTag_Hovering;         // 0x15DC(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           OverrideSwingingControlParamsTag_Attacking;        // 0x15E8(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           OverrideSwingingControlParamsTag_LeapingBack;      // 0x15F4(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LeapingBack_OverrideTimer;                         // 0x1600(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FName                                   ActorHasPreferredSwingMeshTag;                     // 0x1638(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ComponentIsPreferredSwingMeshTag;                  // 0x1644(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUsingDirectRaycast;                               // 0x1650(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1651[0x7];                                     // 0x1651(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNyxGlassTargetingData                 CurTargetingData;                                  // 0x1658(0x0048)(BlueprintVisible, Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_16A0[0x1D8];                                   // 0x16A0(0x01D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EndSwingingSession();
	bool IsAttacking();
	void Multicast_SetTargetingDataOnRemoteClients(const struct FNyxGlassTargetingData& NewData);
	void OnAttached();
	void OnAttackStart();
	void OnBPWeaponFired();
	void OnDetached();
	void OnNyxGlassStateChanged(const ENyxGlassState OldState, const ENyxGlassState NewState);
	void OnServerTargetingDataReceived();
	void OnTargetingComplete(const struct FNyxGlassTargetingData& TargetingData);
	void OnWeaponFired();
	void OnWeaponUnequip(class AFortWeapon* Weapon);
	void Server_SetTargetingData(const struct FNyxGlassTargetingData& NewData);
	bool ShouldUpdateTargeting();
	void UpdateRopeVFX();

	float CalcInitialAccelerationAlpha() const;
	ENyxGlassSlashSubstate GetNyxGlassSlashSubstate() const;
	ENyxGlassState GetNyxGlassState() const;
	void OnVelocityCalculated(const struct FNyxGlassVelocityMetadata& VelocityMetadata) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NyxGlassWeaponComponent_Swinging">();
	}
	static class UNyxGlassWeaponComponent_Swinging* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNyxGlassWeaponComponent_Swinging>();
	}
};

// Class DryBoxRuntime.NyxGlassFuelAttributeSet
// 0x0088 (0x00C0 - 0x0038)
class UNyxGlassFuelAttributeSet final : public UFortAttributeSet
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayAttributeData             MaxFuel;                                           // 0x0048(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, NativeAccessSpecifierPrivate)
	struct FFortGameplayAttributeData             Fuel;                                              // 0x0070(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPrivate)
	struct FFortGameplayAttributeData             LocalFuel;                                         // 0x0098(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPrivate)

public:
	void OnRep_Fuel(const struct FFortGameplayAttributeData& OldValue);
	void OnRep_LocalFuel(const struct FFortGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NyxGlassFuelAttributeSet">();
	}
	static class UNyxGlassFuelAttributeSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNyxGlassFuelAttributeSet>();
	}
};

// Class DryBoxRuntime.NyxGlassSwingingMovementControls
// 0x0000 (0x0040 - 0x0040)
class UNyxGlassSwingingMovementControls final : public UFortMovementControls
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NyxGlassSwingingMovementControls">();
	}
	static class UNyxGlassSwingingMovementControls* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNyxGlassSwingingMovementControls>();
	}
};

}

