#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicBacchusHUD

#include "Basic.hpp"

#include "DynamicUI_structs.hpp"
#include "DynamicUI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK
{

// Class DynamicBacchusHUD.DynamicBacchusHUDDirector
// 0x0258 (0x06A8 - 0x0450)
class ADynamicBacchusHUDDirector final : public ADynamicUIDirectorBase
{
public:
	struct FDynamicUIAllowed                      TouchControlRegionAllowed;                         // 0x0450(0x00B0)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UDynamicUIExcludeInputType*             HUDSwitchExcludeConditions;                        // 0x0500(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortMobileHUDWidgetRegistry*           BaseHUDWidgetRegistry;                             // 0x0508(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicUIScene*                        WatermarkScene;                                    // 0x0510(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, class UDynamicUIMobileScene*> ScenesPool;                                        // 0x0518(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UFortMobileHUDWidgetRegistry*           HUDWidgetRegistry;                                 // 0x0568(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_570[0xB8];                                     // 0x0570(0x00B8)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CurrentContextTags;                                // 0x0628(0x0020)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FFortMobileHUDLayoutProfile            LayoutProfile;                                     // 0x0648(0x0038)(Transient, Protected, NativeAccessSpecifierProtected)
	class FText                                   ForcedPresetName;                                  // 0x0680(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ForcedProfile;                                     // 0x0690(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ForcedProfileContainer;                            // 0x069C(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicBacchusHUDDirector">();
	}
	static class ADynamicBacchusHUDDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADynamicBacchusHUDDirector>();
	}
};

// Class DynamicBacchusHUD.DynamicUIMobileScene
// 0x00B8 (0x01D0 - 0x0118)
class UDynamicUIMobileScene final : public UDynamicUIScene
{
public:
	uint8                                         Pad_118[0xB8];                                     // 0x0118(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicUIMobileScene">();
	}
	static class UDynamicUIMobileScene* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicUIMobileScene>();
	}
};

}

