#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicAthenaHUD

#include "Basic.hpp"


namespace SDK::Params
{

// Function DynamicAthenaHUD.DynamicAthenaHUDDirector.HandleCreativeQuickbarEquippedChanged
// 0x0001 (0x0001 - 0x0000)
struct DynamicAthenaHUDDirector_HandleCreativeQuickbarEquippedChanged final
{
public:
	bool                                          bIsQuickbarEquipped;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DynamicAthenaHUD.DynamicAthenaHUDDirector.HandleInGameLoadScreenChanged
// 0x0020 (0x0020 - 0x0000)
struct DynamicAthenaHUDDirector_HandleInGameLoadScreenChanged final
{
public:
	class AFortPlayerControllerAthena*            PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableLoadScreen;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HUDReasonText;                                     // 0x0010(0x0010)(Parm, NativeAccessSpecifierPublic)
};

}

