#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicRollTablesRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "DataRegistry_structs.hpp"


namespace SDK
{

// Class DynamicRollTablesRuntime.FortControllerComponent_DynamicRollPlayerComponent
// 0x0108 (0x01E8 - 0x00E0)
class UFortControllerComponent_DynamicRollPlayerComponent : public UFortControllerComponent
{
public:
	TSubclassOf<class UFortGamestateComponent_DynamicRollTableManager> AssociatedManagerClass;                            // 0x00E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         Enabled;                                           // 0x00E8(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UFortGamestateComponent_DynamicRollTableManager* TableManager;                                      // 0x0120(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_128[0x64];                                     // 0x0128(0x0064)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRandomStream                          SeededRNG;                                         // 0x018C(0x0008)(ZeroConstructor, Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_194[0x54];                                     // 0x0194(0x0054)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<struct FFortDynamicRollResult> AuthorityRollChoices(const int32 NumChoices, const TArray<class UFortItemDefinition*>& IgnoreItems);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortControllerComponent_DynamicRollPlayerComponent">();
	}
	static class UFortControllerComponent_DynamicRollPlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerComponent_DynamicRollPlayerComponent>();
	}
};

// Class DynamicRollTablesRuntime.FortGamestateComponent_DynamicRollTableManager
// 0x0258 (0x0330 - 0x00D8)
class UFortGamestateComponent_DynamicRollTableManager : public UFortGameStateComponent
{
public:
	uint8                                         Pad_D8[0x30];                                      // 0x00D8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataRegistryType                      DataRegistryType_BaseWeights;                      // 0x0108(0x000C)(ZeroConstructor, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataRegistryType                      DataRegistryType_WeightModifiers;                  // 0x0114(0x000C)(ZeroConstructor, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         Enabled;                                           // 0x0120(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_158[0x1D8];                                    // 0x0158(0x01D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandlePlaylistDataReady(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGamestateComponent_DynamicRollTableManager">();
	}
	static class UFortGamestateComponent_DynamicRollTableManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGamestateComponent_DynamicRollTableManager>();
	}
};

}

