#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicAthenaHUD

#include "Basic.hpp"

#include "DynamicUI_classes.hpp"


namespace SDK
{

// Class DynamicAthenaHUD.DynamicAthenaHUDDirector
// 0x0050 (0x04A0 - 0x0450)
class ADynamicAthenaHUDDirector final : public ADynamicUIDirectorBase
{
public:
	class UDynamicUIScene*                        VehicleHUDScene;                                   // 0x0450(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        CreativeQuickbarScene;                             // 0x0458(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        PlayerMessagesScene;                               // 0x0460(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        TournamentScene;                                   // 0x0468(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        ArenaTournamentScene;                              // 0x0470(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        BuildWatermarkScene;                               // 0x0478(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        LoadingMessageScene;                               // 0x0480(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        LocalPlayerInfoScene;                              // 0x0488(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UDynamicUIScene*>                AddedScenes;                                       // 0x0490(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void HandleCreativeQuickbarEquippedChanged(bool bIsQuickbarEquipped);
	void HandleEnterVehicle();
	void HandleExitVehicle();
	void HandleHUDElementVisibilityRefreshed();
	void HandleInGameLoadScreenChanged(class AFortPlayerControllerAthena* PlayerController, bool bEnableLoadScreen, const class FText& HUDReasonText);
	void HandleNpcHired();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicAthenaHUDDirector">();
	}
	static class ADynamicAthenaHUDDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADynamicAthenaHUDDirector>();
	}
};

}

