#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EditorInteractiveToolsFramework

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "EditorInteractiveToolsFramework_structs.hpp"
#include "InteractiveToolsFramework_classes.hpp"
#include "EditorSubsystem_classes.hpp"


namespace SDK
{

// Class EditorInteractiveToolsFramework.EditorGizmoStateTarget
// 0x0040 (0x0070 - 0x0030)
class UEditorGizmoStateTarget final : public UObject
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IToolContextTransactionProvider> TransactionManager;                                // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorGizmoStateTarget">();
	}
	static class UEditorGizmoStateTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorGizmoStateTarget>();
	}
};

// Class EditorInteractiveToolsFramework.EditorInteractiveGizmoConditionalBuilder
// 0x0000 (0x0030 - 0x0030)
class IEditorInteractiveGizmoConditionalBuilder final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorInteractiveGizmoConditionalBuilder">();
	}
	static class IEditorInteractiveGizmoConditionalBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<IEditorInteractiveGizmoConditionalBuilder>();
	}
};

// Class EditorInteractiveToolsFramework.EditorInteractiveGizmoManager
// 0x0080 (0x0148 - 0x00C8)
class UEditorInteractiveGizmoManager final : public UInteractiveGizmoManager
{
public:
	class UEditorInteractiveGizmoRegistry*        Registry;                                          // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FActiveEditorGizmo>             ActiveEditorGizmos;                                // 0x00D0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UInteractiveGizmoBuilder*, class UInteractiveGizmo*> CachedGizmoMap;                                    // 0x00E8(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_138[0x10];                                     // 0x0138(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorInteractiveGizmoManager">();
	}
	static class UEditorInteractiveGizmoManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorInteractiveGizmoManager>();
	}
};

// Class EditorInteractiveToolsFramework.EditorGizmoRegistryCategoryEntry
// 0x0020 (0x0050 - 0x0030)
class UEditorGizmoRegistryCategoryEntry : public UObject
{
public:
	TArray<class UInteractiveGizmoBuilder*>       GizmoTypes;                                        // 0x0030(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class FString                                 CategoryName;                                      // 0x0040(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorGizmoRegistryCategoryEntry">();
	}
	static class UEditorGizmoRegistryCategoryEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorGizmoRegistryCategoryEntry>();
	}
};

// Class EditorInteractiveToolsFramework.EditorGizmoRegistryCategoryEntry_ConditionalSelection
// 0x0000 (0x0050 - 0x0050)
class UEditorGizmoRegistryCategoryEntry_ConditionalSelection : public UEditorGizmoRegistryCategoryEntry
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorGizmoRegistryCategoryEntry_ConditionalSelection">();
	}
	static class UEditorGizmoRegistryCategoryEntry_ConditionalSelection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorGizmoRegistryCategoryEntry_ConditionalSelection>();
	}
};

// Class EditorInteractiveToolsFramework.EditorGizmoRegistryCategoryEntry_Primary
// 0x0000 (0x0050 - 0x0050)
class UEditorGizmoRegistryCategoryEntry_Primary final : public UEditorGizmoRegistryCategoryEntry_ConditionalSelection
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorGizmoRegistryCategoryEntry_Primary">();
	}
	static class UEditorGizmoRegistryCategoryEntry_Primary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorGizmoRegistryCategoryEntry_Primary>();
	}
};

// Class EditorInteractiveToolsFramework.EditorGizmoRegistryCategoryEntry_Accessory
// 0x0000 (0x0050 - 0x0050)
class UEditorGizmoRegistryCategoryEntry_Accessory final : public UEditorGizmoRegistryCategoryEntry_ConditionalSelection
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorGizmoRegistryCategoryEntry_Accessory">();
	}
	static class UEditorGizmoRegistryCategoryEntry_Accessory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorGizmoRegistryCategoryEntry_Accessory>();
	}
};

// Class EditorInteractiveToolsFramework.EditorInteractiveGizmoRegistry
// 0x0050 (0x0080 - 0x0030)
class UEditorInteractiveGizmoRegistry final : public UObject
{
public:
	TMap<EEditorGizmoCategory, class UEditorGizmoRegistryCategoryEntry*> GizmoCategoryMap;                                  // 0x0030(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorInteractiveGizmoRegistry">();
	}
	static class UEditorInteractiveGizmoRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorInteractiveGizmoRegistry>();
	}
};

// Class EditorInteractiveToolsFramework.EditorInteractiveGizmoSelectionBuilder
// 0x0000 (0x0030 - 0x0030)
class IEditorInteractiveGizmoSelectionBuilder final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorInteractiveGizmoSelectionBuilder">();
	}
	static class IEditorInteractiveGizmoSelectionBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<IEditorInteractiveGizmoSelectionBuilder>();
	}
};

// Class EditorInteractiveToolsFramework.EditorInteractiveGizmoSubsystem
// 0x0040 (0x0078 - 0x0038)
class UEditorInteractiveGizmoSubsystem final : public UEditorSubsystem
{
public:
	class UInteractiveGizmoBuilder*               TransformGizmoBuilder;                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEditorInteractiveGizmoRegistry*        Registry;                                          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x30];                                      // 0x0048(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorInteractiveGizmoSubsystem">();
	}
	static class UEditorInteractiveGizmoSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorInteractiveGizmoSubsystem>();
	}
};

// Class EditorInteractiveToolsFramework.TransformGizmo
// 0x05C0 (0x0600 - 0x0040)
class UTransformGizmo : public UInteractiveGizmo
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UTransformProxy*                        ActiveTarget;                                      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGizmoElementHitMultiTarget*            HitTarget;                                         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMultiButtonClickDragBehavior*          MultiIndirectClickDragBehavior;                    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class ITransformGizmoSource> TransformGizmoSource;                              // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGizmoElementGroup*                     GizmoElementRoot;                                  // 0x0078(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGizmoViewContext*                      GizmoViewContext;                                  // 0x0080(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisible;                                          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInInteraction;                                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSnapToWorldGrid;                                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGridSizeIsExplicit;                               // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ExplicitGridSize;                                  // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotationGridSizeIsExplicit;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ExplicitRotationGridSize;                          // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSnapToWorldRotGrid;                               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x37];                                      // 0x00C9(0x0037)(Fixing Size After Last Property [ Dumper-7 ])
	class UGizmoElementArrow*                     TranslateXAxisElement;                             // 0x0100(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementArrow*                     TranslateYAxisElement;                             // 0x0108(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementArrow*                     TranslateZAxisElement;                             // 0x0110(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementRectangle*                 TranslateScreenSpaceElement;                       // 0x0118(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementRectangle*                 TranslatePlanarXYElement;                          // 0x0120(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementRectangle*                 TranslatePlanarYZElement;                          // 0x0128(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementRectangle*                 TranslatePlanarXZElement;                          // 0x0130(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementTorus*                     RotateXAxisElement;                                // 0x0138(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementTorus*                     RotateYAxisElement;                                // 0x0140(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementTorus*                     RotateZAxisElement;                                // 0x0148(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementCircle*                    RotateOuterCircleElement;                          // 0x0150(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementCircle*                    RotateArcballElement;                              // 0x0158(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementCircle*                    RotateScreenSpaceElement;                          // 0x0160(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementArrow*                     ScaleXAxisElement;                                 // 0x0168(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementArrow*                     ScaleYAxisElement;                                 // 0x0170(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementArrow*                     ScaleZAxisElement;                                 // 0x0178(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementRectangle*                 ScalePlanarXYElement;                              // 0x0180(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementRectangle*                 ScalePlanarYZElement;                              // 0x0188(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementRectangle*                 ScalePlanarXZElement;                              // 0x0190(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoElementBox*                       ScaleUniformElement;                               // 0x0198(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGizmoConstantFrameAxisSource*          CameraAxisSource;                                  // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TScriptInterface<class IGizmoStateTarget>     StateTarget;                                       // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B8[0x90];                                     // 0x01B8(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     TransparentVertexColorMaterial;                    // 0x0248(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     GridMaterial;                                      // 0x0250(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               AxisMaterialX;                                     // 0x0258(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               AxisMaterialY;                                     // 0x0260(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               AxisMaterialZ;                                     // 0x0268(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               CurrentAxisMaterial;                               // 0x0270(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               GreyMaterial;                                      // 0x0278(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               WhiteMaterial;                                     // 0x0280(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               OpaquePlaneMaterialXY;                             // 0x0288(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_290[0x70];                                     // 0x0290(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ScaleMultiplier;                                   // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CurrentTransform;                                  // 0x0310(0x0060)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGizmoTransformMode                           CurrentMode;                                       // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAxisList                                     CurrentAxisToDraw;                                 // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_372[0x2];                                      // 0x0372(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	ETransformGizmoPartIdentifier                 LastHitPart;                                       // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_378[0x10];                                     // 0x0378(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EAxisList                                     InteractionAxisList;                               // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InteractionAxisOrigin;                             // 0x0390(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                InteractionAxisDirection;                          // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         InteractionAxisStartParam;                         // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         InteractionAxisCurrParam;                          // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                InteractionPlanarOrigin;                           // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                InteractionPlanarNormal;                           // 0x03E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                NormalToRemove;                                    // 0x03F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                InteractionPlanarAxisX;                            // 0x0410(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                InteractionPlanarAxisY;                            // 0x0428(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                InteractionPlanarStartPoint;                       // 0x0440(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                InteractionPlanarCurrPoint;                        // 0x0458(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         InteractionStartAngle;                             // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         InteractionCurrAngle;                              // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              InteractionScreenAxisDirection;                    // 0x0478(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              NormalProjectionToRemove;                          // 0x0488(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              InteractionScreenStartPos;                         // 0x0498(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              InteractionScreenEndPos;                           // 0x04A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              InteractionScreenCurrPos;                          // 0x04B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                InteractionArcBallStartPoint;                      // 0x04C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                InteractionArcBallCurrPoint;                       // 0x04E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4F8[0x8];                                      // 0x04F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  StartRotation;                                     // 0x0500(0x0020)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_520[0x20];                                     // 0x0520(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIndirectManipulation;                             // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDeferDrag;                                        // 0x0541(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_542[0x4E];                                     // 0x0542(0x004E)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCtrlMiddleDoesY;                                  // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAxisRotateMode                               DefaultRotateMode;                                 // 0x0591(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_592[0x6E];                                     // 0x0592(0x006E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TransformGizmo">();
	}
	static class UTransformGizmo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTransformGizmo>();
	}
};

// Class EditorInteractiveToolsFramework.EditorTransformGizmo
// 0x0000 (0x0600 - 0x0600)
class UEditorTransformGizmo final : public UTransformGizmo
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorTransformGizmo">();
	}
	static class UEditorTransformGizmo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorTransformGizmo>();
	}
};

// Class EditorInteractiveToolsFramework.EditorTransformGizmoBuilder
// 0x0050 (0x0080 - 0x0030)
class UEditorTransformGizmoBuilder final : public UInteractiveGizmoBuilder
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorTransformGizmoBuilder">();
	}
	static class UEditorTransformGizmoBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorTransformGizmoBuilder>();
	}
};

// Class EditorInteractiveToolsFramework.EditorTransformGizmoSource
// 0x0010 (0x0040 - 0x0030)
class UEditorTransformGizmoSource final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorTransformGizmoSource">();
	}
	static class UEditorTransformGizmoSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorTransformGizmoSource>();
	}
};

// Class EditorInteractiveToolsFramework.EditorTransformProxy
// 0x0010 (0x01C0 - 0x01B0)
class UEditorTransformProxy final : public UTransformProxy
{
public:
	uint8                                         Pad_1B0[0x10];                                     // 0x01B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorTransformProxy">();
	}
	static class UEditorTransformProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorTransformProxy>();
	}
};

// Class EditorInteractiveToolsFramework.EditorInteractiveToolsContext
// 0x00F0 (0x0430 - 0x0340)
class UEditorInteractiveToolsContext : public UInteractiveToolsContext
{
public:
	uint8                                         Pad_340[0x48];                                     // 0x0340(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     StandardVertexColorMaterial;                       // 0x0388(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_390[0xA0];                                     // 0x0390(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorInteractiveToolsContext">();
	}
	static class UEditorInteractiveToolsContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorInteractiveToolsContext>();
	}
};

// Class EditorInteractiveToolsFramework.ModeManagerInteractiveToolsContext
// 0x0140 (0x0570 - 0x0430)
class UModeManagerInteractiveToolsContext : public UEditorInteractiveToolsContext
{
public:
	uint8                                         Pad_430[0x128];                                    // 0x0430(0x0128)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEdModeInteractiveToolsContext*> EdModeToolsContexts;                               // 0x0558(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_568[0x8];                                      // 0x0568(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModeManagerInteractiveToolsContext">();
	}
	static class UModeManagerInteractiveToolsContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModeManagerInteractiveToolsContext>();
	}
};

// Class EditorInteractiveToolsFramework.EdModeInteractiveToolsContext
// 0x0010 (0x0440 - 0x0430)
class UEdModeInteractiveToolsContext final : public UEditorInteractiveToolsContext
{
public:
	class UModeManagerInteractiveToolsContext*    ParentModeManagerToolsContext;                     // 0x0430(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EdModeInteractiveToolsContext">();
	}
	static class UEdModeInteractiveToolsContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEdModeInteractiveToolsContext>();
	}
};

// Class EditorInteractiveToolsFramework.GizmoEdModeInterface
// 0x0000 (0x0030 - 0x0030)
class IGizmoEdModeInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GizmoEdModeInterface">();
	}
	static class IGizmoEdModeInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGizmoEdModeInterface>();
	}
};

// Class EditorInteractiveToolsFramework.ToolStackContext
// 0x0080 (0x00B0 - 0x0030)
class UToolStackContext final : public UObject
{
public:
	TWeakObjectPtr<class UEdMode>                 EdMode;                                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FInteractiveToolStack> ToolStacks;                                        // 0x0040(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_90[0x20];                                      // 0x0090(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolStackContext">();
	}
	static class UToolStackContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolStackContext>();
	}
};

// Class EditorInteractiveToolsFramework.TransformGizmoSource
// 0x0000 (0x0030 - 0x0030)
class ITransformGizmoSource final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TransformGizmoSource">();
	}
	static class ITransformGizmoSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<ITransformGizmoSource>();
	}
};

// Class EditorInteractiveToolsFramework.WidgetToolsContext
// 0x0000 (0x0570 - 0x0570)
class UWidgetToolsContext final : public UModeManagerInteractiveToolsContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetToolsContext">();
	}
	static class UWidgetToolsContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetToolsContext>();
	}
};

// Class EditorInteractiveToolsFramework.MultiButtonClickDragBehavior
// 0x0190 (0x02D0 - 0x0140)
class UMultiButtonClickDragBehavior final : public UClickDragInputBehavior
{
public:
	uint8                                         Pad_140[0x190];                                    // 0x0140(0x0190)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MultiButtonClickDragBehavior">();
	}
	static class UMultiButtonClickDragBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiButtonClickDragBehavior>();
	}
};

// Class EditorInteractiveToolsFramework.EditorTransformGizmoContextObject
// 0x0048 (0x0078 - 0x0030)
class UEditorTransformGizmoContextObject final : public UObject
{
public:
	uint8                                         Pad_30[0x48];                                      // 0x0030(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorTransformGizmoContextObject">();
	}
	static class UEditorTransformGizmoContextObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorTransformGizmoContextObject>();
	}
};

}

