#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EditorConfig

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "EditorSubsystem_classes.hpp"
#include "EditorConfig_structs.hpp"


namespace SDK
{

// Class EditorConfig.EditorConfigBase
// 0x0000 (0x0030 - 0x0030)
class UEditorConfigBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorConfigBase">();
	}
	static class UEditorConfigBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorConfigBase>();
	}
};

// Class EditorConfig.EditorConfigSubsystem
// 0x00A0 (0x00D8 - 0x0038)
class UEditorConfigSubsystem final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0xA0];                                      // 0x0038(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorConfigSubsystem">();
	}
	static class UEditorConfigSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorConfigSubsystem>();
	}
};

// Class EditorConfig.EditorConfigTestObject
// 0x0040 (0x0070 - 0x0030)
class UEditorConfigTestObject final : public UObject
{
public:
	class UObject*                                Object;                                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FEditorConfigTestSimpleStruct          Struct;                                            // 0x0038(0x0030)(NativeAccessSpecifierPublic)
	int32                                         Number;                                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorConfigTestObject">();
	}
	static class UEditorConfigTestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorConfigTestObject>();
	}
};

// Class EditorConfig.EditorMetadataOverrides
// 0x0060 (0x0098 - 0x0038)
class UEditorMetadataOverrides final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0x60];                                      // 0x0038(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorMetadataOverrides">();
	}
	static class UEditorMetadataOverrides* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorMetadataOverrides>();
	}
};

}

