#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EditorWidgets

#include "Basic.hpp"

#include "ToolWidgets_structs.hpp"


namespace SDK
{

// ScriptStruct EditorWidgets.CustomTextFilterState
// 0x0038 (0x0038 - 0x0000)
struct FCustomTextFilterState final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsActive;                                         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomTextFilterData                  FilterData;                                        // 0x0008(0x0030)(NativeAccessSpecifierPublic)
};

// ScriptStruct EditorWidgets.FilterBarSettings
// 0x00B8 (0x00B8 - 0x0000)
struct FFilterBarSettings final
{
public:
	TMap<class FString, bool>                     CustomFilters;                                     // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FString, bool>                     TypeFilters;                                       // 0x0050(0x0050)(NativeAccessSpecifierPublic)
	TArray<struct FCustomTextFilterState>         CustomTextFilters;                                 // 0x00A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsLayoutSaved;                                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFilterBarLayout                              FilterBarLayout;                                   // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

