#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ElectraCSAudioSettings

#include "Basic.hpp"

#include "ElectraCSAudioSettings_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AudioExtensions_structs.hpp"


namespace SDK
{

// Class ElectraCSAudioSettings.ElectraCloudStreamingAudioSettings
// 0x0078 (0x00A8 - 0x0030)
class UElectraCloudStreamingAudioSettings final : public UObject
{
public:
	TMap<struct FGuid, struct FSoundWaveCloudStreamingPlatformProjectSettings> PlatformSettings;                                  // 0x0030(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	class FString                                 AuthorizationTokenDev;                             // 0x0080(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AuthorizationTokenProd;                            // 0x0090(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EElectraCloudStreamingEnvironmentType         DeploymentEnvironment;                             // 0x00A0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ElectraCloudStreamingAudioSettings">();
	}
	static class UElectraCloudStreamingAudioSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UElectraCloudStreamingAudioSettings>();
	}
};

}

