#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: emote_controller_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass emote_controller_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class emote_controller_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass emote_controller_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class emote_controller_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<emote_controller_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass emote_controller_device.emote_controller_device
// 0x0030 (0x00F0 - 0x00C0)
class Uemote_controller_device final : public UDevices_creative_device_base
{
public:
	class UDevices_device_function*               __verse_0x5BDC7A5C_EnableFunction;                 // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC9184E23_DisableFunction;                // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xE172E429_EnableAgentEffectsFunction;     // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xDACF61EF_DisableAgentEffectsFunction;    // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x31397AAF_GrantEmoteItemFunction;         // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x2D52B457_GrantEmoteItemAllFunction;      // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2femote__controller__device_N_RDisable(const struct emote_controller_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2femote__controller__device_N_RDisableAgentEffects(const struct emote_controller_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2femote__controller__device_N_REnable(const struct emote_controller_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2femote__controller__device_N_REnableAgentEffects(const struct emote_controller_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2femote__controller__device_N_RGrantEmoteItem_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2femote__controller__device_N_RGrantEmoteItemAll(const struct emote_controller_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"emote_controller_device">();
	}
	static class Uemote_controller_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uemote_controller_device>();
	}
};

}

