#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmporiumRuntime

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class EmporiumRuntime.EmporiumAssetsPaths
// 0x0570 (0x05A0 - 0x0030)
class UEmporiumAssetsPaths final : public UObject
{
public:
	TSoftObjectPtr<class UMaterialInstanceConstant> MR_MI_Opaque;                                      // 0x0030(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> MR_MI_Opaque_Clearcoat;                            // 0x0060(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> MR_MI_Opaque_Sheen;                                // 0x0090(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> MR_MI_Opaque_Unlit;                                // 0x00C0(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> MR_MI_Translucent;                                 // 0x00F0(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> MR_MI_Translucent_Clearcoat;                       // 0x0120(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> MR_MI_Transmission;                                // 0x0150(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> MR_MI_Opaque_TS;                                   // 0x0180(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> MR_MI_Opaque_Clearcoat_TS;                         // 0x01B0(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> MR_MI_Opaque_Sheen_TS;                             // 0x01E0(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> MR_MI_Opaque_Unlit_TS;                             // 0x0210(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> MR_MI_Translucent_TS;                              // 0x0240(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> MR_MI_Translucent_Clearcoat_TS;                    // 0x0270(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> MR_MI_Transmission_TS;                             // 0x02A0(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> SG_MI_Opaque;                                      // 0x02D0(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> SG_MI_Opaque_Clearcoat;                            // 0x0300(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> SG_MI_Opaque_Sheen;                                // 0x0330(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> SG_MI_Translucent;                                 // 0x0360(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> SG_MI_Translucent_Clearcoat;                       // 0x0390(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> SG_MI_Transmission;                                // 0x03C0(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> SG_MI_Opaque_TS;                                   // 0x03F0(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> SG_MI_Opaque_Clearcoat_TS;                         // 0x0420(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> SG_MI_Opaque_Sheen_TS;                             // 0x0450(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> SG_MI_Translucent_TS;                              // 0x0480(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> SG_MI_Translucent_Clearcoat_TS;                    // 0x04B0(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> SG_MI_Transmission_TS;                             // 0x04E0(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> SG_MI_Foliage_TS;                                  // 0x0510(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> MR_MI_Foliage_TS;                                  // 0x0540(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>             PlaceholderSphere;                                 // 0x0570(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmporiumAssetsPaths">();
	}
	static class UEmporiumAssetsPaths* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmporiumAssetsPaths>();
	}
};

}

