#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Emporium

#include "Basic.hpp"


namespace SDK::Params
{

// Function Emporium.EmporiumJavascriptApi.AddSourceToProject
// 0x0020 (0x0020 - 0x0000)
struct EmporiumJavascriptApi_AddSourceToProject final
{
public:
	class FString                                 Url;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetMetadataJson;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Emporium.EmporiumJavascriptApi.AddVersePathToProject
// 0x0020 (0x0020 - 0x0000)
struct EmporiumJavascriptApi_AddVersePathToProject final
{
public:
	class FString                                 VersePath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetMetadataJson;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Emporium.EmporiumJavascriptApi.AnalyticsOpen3dViewer
// 0x0030 (0x0030 - 0x0000)
struct EmporiumJavascriptApi_AnalyticsOpen3dViewer final
{
public:
	class FString                                 AssetNamespace;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetId;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OfferId;                                           // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Emporium.EmporiumJavascriptApi.AnalyticsPdpPageView
// 0x0040 (0x0040 - 0x0000)
struct EmporiumJavascriptApi_AnalyticsPdpPageView final
{
public:
	class FString                                 AssetNamespace;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetId;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OfferId;                                           // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PointOfOrigin;                                     // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Emporium.EmporiumJavascriptApi.AnalyticsSearchQueried
// 0x0060 (0x0060 - 0x0000)
struct EmporiumJavascriptApi_AnalyticsSearchQueried final
{
public:
	class FString                                 SearchText;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Categories;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Tags;                                              // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filters;                                           // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SortValue;                                         // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SearchResults;                                     // 0x0050(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Emporium.EmporiumJavascriptApi.CopyToClipboard
// 0x0010 (0x0010 - 0x0000)
struct EmporiumJavascriptApi_CopyToClipboard final
{
public:
	class FString                                 Content;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Emporium.EmporiumJavascriptApi.DragStart
// 0x0020 (0x0020 - 0x0000)
struct EmporiumJavascriptApi_DragStart final
{
public:
	class FString                                 VersePath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetMetadataJson;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Emporium.EmporiumJavascriptApi.GetApiVersion
// 0x0004 (0x0004 - 0x0000)
struct EmporiumJavascriptApi_GetApiVersion final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Emporium.EmporiumJavascriptApi.GetAuthToken
// 0x0010 (0x0010 - 0x0000)
struct EmporiumJavascriptApi_GetAuthToken final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Emporium.EmporiumJavascriptApi.GetProjectVersePaths
// 0x0010 (0x0010 - 0x0000)
struct EmporiumJavascriptApi_GetProjectVersePaths final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function Emporium.EmporiumJavascriptApi.LocalDownload
// 0x0020 (0x0020 - 0x0000)
struct EmporiumJavascriptApi_LocalDownload final
{
public:
	class FString                                 Url;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetMetadataJson;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Emporium.EmporiumJavascriptApi.LogDisplay
// 0x0010 (0x0010 - 0x0000)
struct EmporiumJavascriptApi_LogDisplay final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Emporium.EmporiumJavascriptApi.LogError
// 0x0010 (0x0010 - 0x0000)
struct EmporiumJavascriptApi_LogError final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Emporium.EmporiumJavascriptApi.LogVerbose
// 0x0010 (0x0010 - 0x0000)
struct EmporiumJavascriptApi_LogVerbose final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Emporium.EmporiumJavascriptApi.LogWarning
// 0x0010 (0x0010 - 0x0000)
struct EmporiumJavascriptApi_LogWarning final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Emporium.EmporiumJavascriptApi.OpenURLInBrowser
// 0x0018 (0x0018 - 0x0000)
struct EmporiumJavascriptApi_OpenURLInBrowser final
{
public:
	class FString                                 Url;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Emporium.EmporiumJavascriptApi.SendAnalyticsEvent
// 0x0020 (0x0020 - 0x0000)
struct EmporiumJavascriptApi_SendAnalyticsEvent final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetMetadataJson;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

