#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntityEditor

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "TypedElementFramework_classes.hpp"


namespace SDK
{

// Class EntityEditor.EntityPlacementFactory
// 0x0008 (0x0038 - 0x0030)
class UEntityPlacementFactory : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityPlacementFactory">();
	}
	static class UEntityPlacementFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityPlacementFactory>();
	}
};

// Class EntityEditor.BlueprintPrefabEntityPlacementFactory
// 0x0000 (0x0038 - 0x0038)
class UBlueprintPrefabEntityPlacementFactory final : public UEntityPlacementFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintPrefabEntityPlacementFactory">();
	}
	static class UBlueprintPrefabEntityPlacementFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintPrefabEntityPlacementFactory>();
	}
};

// Class EntityEditor.VersePrefabEntityPlacementFactory
// 0x0000 (0x0038 - 0x0038)
class UVersePrefabEntityPlacementFactory final : public UEntityPlacementFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VersePrefabEntityPlacementFactory">();
	}
	static class UVersePrefabEntityPlacementFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVersePrefabEntityPlacementFactory>();
	}
};

// Class EntityEditor.BasicShapeEntityPlacementFactory
// 0x0000 (0x0038 - 0x0038)
class UBasicShapeEntityPlacementFactory final : public UEntityPlacementFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BasicShapeEntityPlacementFactory">();
	}
	static class UBasicShapeEntityPlacementFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasicShapeEntityPlacementFactory>();
	}
};

// Class EntityEditor.EntitySyncQueries
// 0x0000 (0x0030 - 0x0030)
class UEntitySyncQueries final : public UTypedElementDataStorageFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntitySyncQueries">();
	}
	static class UEntitySyncQueries* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntitySyncQueries>();
	}
};

// Class EntityEditor.EntityElementEditorSelectionInterface
// 0x0008 (0x0038 - 0x0030)
class UEntityElementEditorSelectionInterface final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityElementEditorSelectionInterface">();
	}
	static class UEntityElementEditorSelectionInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityElementEditorSelectionInterface>();
	}
};

// Class EntityEditor.EntityElementWorldInterface
// 0x0008 (0x0038 - 0x0030)
class UEntityElementWorldInterface final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityElementWorldInterface">();
	}
	static class UEntityElementWorldInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityElementWorldInterface>();
	}
};

// Class EntityEditor.EntityElementDetailsInterface
// 0x0008 (0x0038 - 0x0030)
class UEntityElementDetailsInterface final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityElementDetailsInterface">();
	}
	static class UEntityElementDetailsInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityElementDetailsInterface>();
	}
};

// Class EntityEditor.EntityElementObjectInterface
// 0x0008 (0x0038 - 0x0030)
class UEntityElementObjectInterface final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityElementObjectInterface">();
	}
	static class UEntityElementObjectInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityElementObjectInterface>();
	}
};

// Class EntityEditor.PropertyStateChangeTEDSFactory
// 0x0010 (0x0040 - 0x0030)
class UPropertyStateChangeTEDSFactory final : public UTypedElementDataStorageFactory
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropertyStateChangeTEDSFactory">();
	}
	static class UPropertyStateChangeTEDSFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyStateChangeTEDSFactory>();
	}
};

// Class EntityEditor.TEDSTypedElementEntityBridge
// 0x0018 (0x0048 - 0x0030)
class UTEDSTypedElementEntityBridge final : public UTypedElementDataStorageFactory
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TEDSTypedElementEntityBridge">();
	}
	static class UTEDSTypedElementEntityBridge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTEDSTypedElementEntityBridge>();
	}
};

// Class EntityEditor.TypedElementPrefabWidgetFactory
// 0x0000 (0x0030 - 0x0030)
class UTypedElementPrefabWidgetFactory final : public UTypedElementDataStorageFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementPrefabWidgetFactory">();
	}
	static class UTypedElementPrefabWidgetFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementPrefabWidgetFactory>();
	}
};

// Class EntityEditor.TypedElementSCCWidgetFactory
// 0x0000 (0x0030 - 0x0030)
class UTypedElementSCCWidgetFactory final : public UTypedElementDataStorageFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementSCCWidgetFactory">();
	}
	static class UTypedElementSCCWidgetFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementSCCWidgetFactory>();
	}
};

// Class EntityEditor.VerseClassTypeRegistryGameFeatureObserver
// 0x0010 (0x0040 - 0x0030)
class UVerseClassTypeRegistryGameFeatureObserver final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClassTypeRegistryGameFeatureObserver">();
	}
	static class UVerseClassTypeRegistryGameFeatureObserver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseClassTypeRegistryGameFeatureObserver>();
	}
};

}

