#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Entity_0

#include "Basic.hpp"

#include "Verse_structs.hpp"


namespace SDK
{

// VerseStruct Entity.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct Entity_0::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct Entity.tuple_Laccessor_Mtick__events_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Laccessor_Mtick__events_R final
{
public:
	EVerse_accessor                               __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Utick_events*                           __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct Entity.tuple_Lentity_Mtuple_L_R_Mtuple_L_R_R
// 0x0010 (0x0010 - 0x0000)
struct Entity_0::Ftuple_Lentity_Mtuple_L_R_Mtuple_L_R_R final
{
public:
	class Uentity*                                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct Entity_0::Ftuple_L_R                   __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct Entity_0::Ftuple_L_R                   __verse_0x932BF92E_Elem2;                          // 0x0009(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

