#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntityInteract_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Entity_0_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass EntityInteract.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class EntityInteract_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass EntityInteract.$SolarisSignatureFunctionOuter", true>();
	}
	static class EntityInteract_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<EntityInteract_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass EntityInteract.interact_component
// 0x00F0 (0x0140 - 0x0050)
class Uinteract_component final : public Ucomponent
{
public:
	uint8                                         Pad_50[0x38];                                      // 0x0050(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         __verse_0x5CDFC2A5_Enabled : 1;                    // 0x0088(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Net, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_89[0x1F];                                      // 0x0089(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x0FAFAE20_InteractFinishedEvent;          // 0x00A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x920806F4_InteractStartedEvent;           // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x16F21755_InteractSucceededEvent;         // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x6CE95EA5_InteractCanceledEvent;          // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x2291718D_SharedCooldownTriggeredEvent;   // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x04EE018A_PerAgentCooldownTriggeredEvent; // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xB08CBB9F_SharedCooldownExpiredEvent;     // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x35C7A010_PerAgentCooldownExpiredEvent;   // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        __verse_0xAB115356_InteractDistance;               // 0x00E8(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<int64>                              __verse_0x6E7592B5_MaxSimultaneousInteractors;     // 0x00F0(0x0010)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	double                                        __verse_0xB35A5564_InteractDuration;               // 0x0100(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xEBED7E06_SharedCooldownDuration;         // 0x0108(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xE1C55893_PerAgentCooldownDuration;       // 0x0110(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<int64>                              __verse_0xC8EBFB4A_MaxSuccessfulInteractions;      // 0x0118(0x0010)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerse_message*                         __verse_0x1BB43167_DefaultInteractText;            // 0x0128(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerse_message*                         __verse_0xCB99AA89_DefaultCannotInteractText;      // 0x0130(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerse_message*                         __verse_0x89CA7586_DefaultCoolDownText;            // 0x0138(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct EntityInteract_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RCancel_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RCanInteract_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetCannotInteractText(const struct EntityInteract_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetCoolDownText(const struct EntityInteract_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TArray<class USimulation_agent*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetInteractingAgents(const struct EntityInteract_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetInteractText(const struct EntityInteract_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<int64> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetMaxSuccessfulInteractions(const struct EntityInteract_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetRemainingCooldownDurationAffectingAgent_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	TOptional<double> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetRemainingInteractDuration_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetRemainingPerAgentCooldownDuration_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetRemainingSharedCooldownDuration(const struct EntityInteract_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	int64 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetSuccessfulIteractionCount(const struct EntityInteract_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RIsAgentInteracting_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_ROnRep__Enabled(const struct EntityInteract_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RResetSuccessfulIteractionCount(const struct EntityInteract_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetCannotInteractText_L_Nmessage_R(class UVerse_message* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetCoolDownText_L_Nmessage_R(class UVerse_message* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetInteractText_L_Nmessage_R(class UVerse_message* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetMaxSuccessfulInteractions_L_N_Qint_R(TOptional<int64> __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetRemainingInteractDuration_L_Nagent_M_Nfloat_R(const struct EntityInteract_0::Ftuple_Lagent_Mfloat_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetRemainingPerAgentCooldownDuration_L_N_Kagent_M_Nfloat_R(const struct Ftuple_L_Kagent_Mfloat_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetRemainingSharedCooldownDuration_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RStart_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSucceed_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(const struct EntityInteract_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(const struct EntityInteract_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(const struct EntityInteract_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"interact_component">();
	}
	static class Uinteract_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uinteract_component>();
	}
};

}

