#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntityPrefabEditor

#include "Basic.hpp"

#include "UnrealEd_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class EntityPrefabEditor.AssetDefinition_EntityPrefab
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_EntityPrefab final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_EntityPrefab">();
	}
	static class UAssetDefinition_EntityPrefab* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_EntityPrefab>();
	}
};

// Class EntityPrefabEditor.EntityPrefabEditorMenuContext
// 0x0020 (0x0050 - 0x0030)
class UEntityPrefabEditorMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityPrefabEditorMenuContext">();
	}
	static class UEntityPrefabEditorMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityPrefabEditorMenuContext>();
	}
};

// Class EntityPrefabEditor.EntityPrefabThumbnailRenderer
// 0x0050 (0x0088 - 0x0038)
class UEntityPrefabThumbnailRenderer final : public UDefaultSizedThumbnailRenderer
{
public:
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityPrefabThumbnailRenderer">();
	}
	static class UEntityPrefabThumbnailRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityPrefabThumbnailRenderer>();
	}
};

// Class EntityPrefabEditor.TedsSelectionEdMode
// 0x0000 (0x0150 - 0x0150)
class UTedsSelectionEdMode final : public UBaseLegacyWidgetEdMode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TedsSelectionEdMode">();
	}
	static class UTedsSelectionEdMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTedsSelectionEdMode>();
	}
};

// Class EntityPrefabEditor.EntityPrefabEditor
// 0x0008 (0x0048 - 0x0040)
class UEntityPrefabEditor final : public UAssetEditor
{
public:
	class UObject*                                ObjectToEdit;                                      // 0x0040(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityPrefabEditor">();
	}
	static class UEntityPrefabEditor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityPrefabEditor>();
	}
};

// Class EntityPrefabEditor.EntityPrefabEditorSettings
// 0x0008 (0x0038 - 0x0030)
class UEntityPrefabEditorSettings final : public UObject
{
public:
	bool                                          bShowGridByDefault;                                // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityPrefabEditorSettings">();
	}
	static class UEntityPrefabEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityPrefabEditorSettings>();
	}
};

// Class EntityPrefabEditor.EntityPrefabFactory
// 0x0000 (0x0088 - 0x0088)
class UEntityPrefabFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityPrefabFactory">();
	}
	static class UEntityPrefabFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityPrefabFactory>();
	}
};

}

