#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntityEditor

#include "Basic.hpp"

#include "TypedElementFramework_structs.hpp"
#include "TedsOutliner_structs.hpp"


namespace SDK
{

// Enum EntityEditor.ECorePrefabType
// NumValues: 0x0003
enum class ECorePrefabType : uint8
{
	Blueprint                                = 0,
	Verse                                    = 1,
	ECorePrefabType_MAX                      = 2,
};

// ScriptStruct EntityEditor.EntityTag
// 0x0000 (0x0001 - 0x0001)
struct FEntityTag final : public FTypedElementDataStorageTag
{
};

// ScriptStruct EntityEditor.IsMangledNameLabelTag
// 0x0000 (0x0001 - 0x0001)
struct FIsMangledNameLabelTag final : public FTypedElementDataStorageTag
{
};

// ScriptStruct EntityEditor.PrefabColumn
// 0x0010 (0x0010 - 0x0000)
struct FPrefabColumn final : public FTypedElementDataStorageColumn
{
public:
	TSubclassOf<class UObject>                    Prefab;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECorePrefabType                               Type;                                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct EntityEditor.PropertyState_PropertyPathColumn
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FPropertyState_PropertyPathColumn final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct EntityEditor.PropertyState_ObjectColumn
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FPropertyState_ObjectColumn final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct EntityEditor.PropertyState_ChangeId
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FPropertyState_ChangeId final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct EntityEditor.PropertyState_PropertyState
// 0x0002 (0x0002 - 0x0000)
struct FPropertyState_PropertyState final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x2];                                        // 0x0000(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct EntityEditor.PropertyState_ObjectState
// 0x0002 (0x0002 - 0x0000)
struct FPropertyState_ObjectState final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x2];                                        // 0x0000(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct EntityEditor.TypedElementPrefabWidgetTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementPrefabWidgetTag final : public FTypedElementDataStorageTag
{
};

// ScriptStruct EntityEditor.TypedElementPrefabWidgetConstructor
// 0x0000 (0x0030 - 0x0030)
struct FTypedElementPrefabWidgetConstructor final : public FTypedElementTypeInfoWidgetConstructor
{
};

// ScriptStruct EntityEditor.TypedElementSCCWidgetConstructor
// 0x0000 (0x0028 - 0x0028)
struct FTypedElementSCCWidgetConstructor final : public FTypedElementWidgetConstructor
{
};

// ScriptStruct EntityEditor.TypedElementSCCHeaderConstructor
// 0x0000 (0x0028 - 0x0028)
struct FTypedElementSCCHeaderConstructor final : public FTypedElementWidgetConstructor
{
};

// ScriptStruct EntityEditor.TypedElementSCCWidgetTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementSCCWidgetTag final : public FTypedElementDataStorageTag
{
};

}

