#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntityLevel

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class EntityLevel.EntityLevel
// 0x0110 (0x0530 - 0x0420)
class AEntityLevel final : public AActor
{
public:
	uint8                                         Pad_420[0x40];                                     // 0x0420(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        Entities;                                          // 0x0460(0x0010)(ExportObject, ZeroConstructor, Deprecated, EditorOnly, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UObject*                                LevelEntity;                                       // 0x0470(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_478[0x8];                                      // 0x0478(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    SavedEntityClass;                                  // 0x0480(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UObject>                    SavedEntityComponentClass;                         // 0x0488(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_490[0xA0];                                     // 0x0490(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityLevel">();
	}
	static class AEntityLevel* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEntityLevel>();
	}
};

// Class EntityLevel.EntitySceneComponent
// 0x0010 (0x0580 - 0x0570)
class UEntitySceneComponent final : public UPrimitiveComponent
{
public:
	class AEntityLevel*                           EntityLevel;                                       // 0x0570(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIgnoreAttachmentUponPaste;                        // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntitySceneComponent">();
	}
	static class UEntitySceneComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntitySceneComponent>();
	}
};

// Class EntityLevel.EntityProxyActor
// 0x0040 (0x0460 - 0x0420)
class AEntityProxyActor final : public AActor
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Entity;                                            // 0x0428(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_430[0x8];                                      // 0x0430(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AEntityLevel*                           EntityLevel;                                       // 0x0438(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                TransformComponent;                                // 0x0440(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_448[0x10];                                     // 0x0448(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                DuplicatedEntity;                                  // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityProxyActor">();
	}
	static class AEntityProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEntityProxyActor>();
	}
};

// Class EntityLevel.EntityProxyActorComponent
// 0x0010 (0x00E8 - 0x00D8)
class UEntityProxyActorComponent final : public UActorComponent
{
public:
	class UObject*                                Entity;                                            // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                EntityComponent;                                   // 0x00E0(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityProxyActorComponent">();
	}
	static class UEntityProxyActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityProxyActorComponent>();
	}
};

}

