#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntityCore

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "EntityCore_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class EntityCore.EntityComponent
// 0x0040 (0x0070 - 0x0030)
class UEntityComponent : public UObject
{
public:
	uint8                                         Pad_30[0x40];                                      // 0x0030(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityComponent">();
	}
	static class UEntityComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityComponent>();
	}
};

// Class EntityCore.EntityDataBackedComponent
// 0x0008 (0x0078 - 0x0070)
class UEntityDataBackedComponent : public UEntityComponent
{
public:
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityDataBackedComponent">();
	}
	static class UEntityDataBackedComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityDataBackedComponent>();
	}
};

// Class EntityCore.EntityPositionComponent
// 0x0000 (0x0078 - 0x0078)
class UEntityPositionComponent : public UEntityDataBackedComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityPositionComponent">();
	}
	static class UEntityPositionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityPositionComponent>();
	}
};

// Class EntityCore.EntityRotationComponent
// 0x0000 (0x0078 - 0x0078)
class UEntityRotationComponent : public UEntityDataBackedComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityRotationComponent">();
	}
	static class UEntityRotationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityRotationComponent>();
	}
};

// Class EntityCore.EntityScaleComponent
// 0x0000 (0x0078 - 0x0078)
class UEntityScaleComponent : public UEntityDataBackedComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityScaleComponent">();
	}
	static class UEntityScaleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityScaleComponent>();
	}
};

// Class EntityCore.EntityCoreDataBackedRelativePositionComponent
// 0x0000 (0x0078 - 0x0078)
class UEntityCoreDataBackedRelativePositionComponent final : public UEntityDataBackedComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityCoreDataBackedRelativePositionComponent">();
	}
	static class UEntityCoreDataBackedRelativePositionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityCoreDataBackedRelativePositionComponent>();
	}
};

// Class EntityCore.Entity
// 0x0010 (0x0040 - 0x0030)
class UEntity final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevel*                                 Level;                                             // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Entity">();
	}
	static class UEntity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntity>();
	}
};

// Class EntityCore.EntityCoreSubsystem
// 0x0140 (0x0178 - 0x0038)
class UEntityCoreSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x20];                                      // 0x0038(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<uint32, struct FEntityComponentContainer> ComponentMap;                                      // 0x0058(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x58];                                      // 0x00A8(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEntityComponent*>               ComponentArray;                                    // 0x0100(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<uint32, class UEntity*>                  Entities;                                          // 0x0110(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_160[0x18];                                     // 0x0160(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityCoreSubsystem">();
	}
	static class UEntityCoreSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityCoreSubsystem>();
	}
};

// Class EntityCore.EntityEnableableComponent
// 0x0028 (0x0098 - 0x0070)
class UEntityEnableableComponent : public UEntityComponent
{
public:
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         IsEnabled : 1;                                     // 0x0078(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         LastIsEnabled : 1;                                 // 0x0078(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_79[0x1F];                                      // 0x0079(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_Enabled();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityEnableableComponent">();
	}
	static class UEntityEnableableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityEnableableComponent>();
	}
};

// Class EntityCore.EntityTickableComponent
// 0x0038 (0x00D0 - 0x0098)
class UEntityTickableComponent : public UEntityEnableableComponent
{
public:
	uint8                                         Pad_98[0x38];                                      // 0x0098(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityTickableComponent">();
	}
	static class UEntityTickableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityTickableComponent>();
	}
};

// Class EntityCore.EntityScriptComponent
// 0x0000 (0x00D0 - 0x00D0)
class UEntityScriptComponent : public UEntityTickableComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityScriptComponent">();
	}
	static class UEntityScriptComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityScriptComponent>();
	}
};

}

