#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntityInteract

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "LocalizableMessage_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class EntityInteract.EntityInteractLibrary
// 0x0000 (0x0030 - 0x0030)
class UEntityInteractLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class AActor* EntityInteractGetActor(const class UObject* WorldContextObject, const struct FHitResult& HitResult);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityInteractLibrary">();
	}
	static class UEntityInteractLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityInteractLibrary>();
	}
};

// Class EntityInteract.EntityInteractProxyActor
// 0x01B0 (0x05D0 - 0x0420)
class AEntityInteractProxyActor final : public AActor
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLocalizableMessage                    InteractMessage;                                   // 0x0428(0x0030)(Net, RepNotify, NativeAccessSpecifierPrivate)
	struct FLocalizableMessage                    CannotInteractMessage;                             // 0x0458(0x0030)(Net, RepNotify, NativeAccessSpecifierPrivate)
	struct FLocalizableMessage                    CoolDownMessage;                                   // 0x0488(0x0030)(Net, RepNotify, NativeAccessSpecifierPrivate)
	class FText                                   InteractText;                                      // 0x04B8(0x0010)(NativeAccessSpecifierPrivate)
	class FText                                   CannotInteractText;                                // 0x04C8(0x0010)(NativeAccessSpecifierPrivate)
	class FText                                   CoolDownText;                                      // 0x04D8(0x0010)(NativeAccessSpecifierPrivate)
	struct FTimerHandle                           CoolDownTimerHandle;                               // 0x04E8(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class AController*, class UFortControllerComponent_Interaction*> PerControllerOverriddenInteractDurationPlayerComponents; // 0x04F0(0x0050)(ExportObject, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class AController*, class UFortControllerComponent_Interaction*> PerControllerCooldownTimerHandlePlayerComponents;  // 0x0540(0x0050)(ExportObject, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class AController*>                    InteractingControllers;                            // 0x0590(0x0010)(Net, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A0[0x10];                                     // 0x05A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ForwardInteractOffset;                             // 0x05B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RightInteractOffset;                               // 0x05B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int64                                         TrackedSuccessfulInteractsNum;                     // 0x05B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInteractEnabled;                                  // 0x05C0(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C1[0x7];                                      // 0x05C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SelectedCorrespondingActor;                        // 0x05C8(0x0008)(ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void NetMultiCastBeginCooldownTimer(const float CoolDownTime);
	void OnRep_CannotInteractMessage();
	void OnRep_CoolDownMessage();
	void OnRep_InteractMessage();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityInteractProxyActor">();
	}
	static class AEntityInteractProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEntityInteractProxyActor>();
	}
};

// Class EntityInteract.FortAthenaMutator_EntityInteract
// 0x0000 (0x04D0 - 0x04D0)
class AFortAthenaMutator_EntityInteract final : public AFortAthenaMutator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_EntityInteract">();
	}
	static class AFortAthenaMutator_EntityInteract* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_EntityInteract>();
	}
};

}

