#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntityInteract_0

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "EntityInteract_0_structs.hpp"


namespace SDK::Params
{

// Function EntityInteract.interact_component.$InitCDO
// 0x0BC8 (0x0BC8 - 0x0000)
struct interact_component__InitCDO final
{
public:
	uint8                                         _ExprResult_0 : 1;                                 // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerseEngine_subscribable_event*        _ExprResult_1;                                     // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_2;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_3;                                     // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_4;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_5;                                     // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_6;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_7;                                     // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_8;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_9;                                     // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_10;                               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_11;                                    // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_12;                               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_13;                                    // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_14;                               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_15;                                    // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_16;                               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_17;                                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<int64>                              _ExprResult_18;                                    // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x00A0(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_19 : 1;                                // 0x00A2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_20;                               // 0x00A3(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_21;                                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_22;                                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_23;                                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<int64>                              _ExprResult_24;                                    // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x00D0(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_25 : 1;                                // 0x00D2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_26;                               // 0x00D3(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerse_message*                         _ExprResultStack_27;                               // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_28;                                        // 0x00E0(0x0018)(HasGetValueTypeHash)
	struct EntityInteract_0::Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R _ExprResult_29;                                    // 0x00F8(0x0070)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_30;                                    // 0x0168(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_31;                                    // 0x0178(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ExprResult_32;                                    // 0x0188(0x0050)(ContainsInstancedReference)
	TMap<EVerseFalse, EVerseFalse>                __verse_0xC87067A2_Map_5;                          // 0x01D8(0x0050)(ContainsInstancedReference)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ForResult_33;                                     // 0x0228(0x0050)(ContainsInstancedReference)
	int64                                         _ForIndex_34;                                      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x589418B4_Key_7;                          // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x31A8F10C_Value_7;                        // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_35 : 1;                                // 0x0282(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_282_1 : 7;                                  // 0x0282(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_36 : 1;                                // 0x0283(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerse_message*                         _ExprResultStack_37;                               // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_38;                                        // 0x0290(0x0018)(HasGetValueTypeHash)
	struct EntityInteract_0::Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R _ExprResult_39;                                    // 0x02A8(0x0070)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_40;                                    // 0x0318(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_41;                                    // 0x0328(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ExprResult_42;                                    // 0x0338(0x0050)(ContainsInstancedReference)
	TMap<EVerseFalse, EVerseFalse>                __verse_0xC87067A2_Map_10;                         // 0x0388(0x0050)(ContainsInstancedReference)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ForResult_43;                                     // 0x03D8(0x0050)(ContainsInstancedReference)
	int64                                         _ForIndex_44;                                      // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x589418B4_Key_12;                         // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x31A8F10C_Value_12;                       // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_45 : 1;                                // 0x0432(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_432_1 : 7;                                  // 0x0432(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_46 : 1;                                // 0x0433(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerse_message*                         _ExprResultStack_47;                               // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_48;                                        // 0x0440(0x0018)(HasGetValueTypeHash)
	struct EntityInteract_0::Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R _ExprResult_49;                                    // 0x0458(0x0070)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_50;                                    // 0x04C8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_51;                                    // 0x04D8(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ExprResult_52;                                    // 0x04E8(0x0050)(ContainsInstancedReference)
	TMap<EVerseFalse, EVerseFalse>                __verse_0xC87067A2_Map_15;                         // 0x0538(0x0050)(ContainsInstancedReference)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ForResult_53;                                     // 0x0588(0x0050)(ContainsInstancedReference)
	int64                                         _ForIndex_54;                                      // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x589418B4_Key_17;                         // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x31A8F10C_Value_17;                       // 0x05E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_55 : 1;                                // 0x05E2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_5E2_1 : 7;                                  // 0x05E2(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_56 : 1;                                // 0x05E3(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_5E3_1 : 7;                                  // 0x05E3(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_57 : 1;                                // 0x05E4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_5E5[0x3];                                      // 0x05E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerseEngine_subscribable_event*        _ExprResult_58;                                    // 0x05E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_59;                               // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_60;                                    // 0x05F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_61;                               // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_62;                                    // 0x0608(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_63;                               // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_64;                                    // 0x0618(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_65;                               // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_66;                                    // 0x0628(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_67;                               // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_68;                                    // 0x0638(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_69;                               // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_70;                                    // 0x0648(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_71;                               // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_72;                                    // 0x0658(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_73;                               // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_74;                                    // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<int64>                              _ExprResult_75;                                    // 0x0670(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__20;                            // 0x0680(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_76 : 1;                                // 0x0682(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_77;                               // 0x0683(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_685[0x3];                                      // 0x0685(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_78;                                    // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_79;                                    // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_80;                                    // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<int64>                              _ExprResult_81;                                    // 0x06A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__22;                            // 0x06B0(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_82 : 1;                                // 0x06B2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_83;                               // 0x06B3(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B5[0x3];                                      // 0x06B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerse_message*                         _ExprResultStack_84;                               // 0x06B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_85;                                        // 0x06C0(0x0018)(HasGetValueTypeHash)
	struct EntityInteract_0::Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R _ExprResult_86;                                    // 0x06D8(0x0070)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_87;                                    // 0x0748(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_88;                                    // 0x0758(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ExprResult_89;                                    // 0x0768(0x0050)(ContainsInstancedReference)
	TMap<EVerseFalse, EVerseFalse>                __verse_0xC87067A2_Map_24;                         // 0x07B8(0x0050)(ContainsInstancedReference)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ForResult_90;                                     // 0x0808(0x0050)(ContainsInstancedReference)
	int64                                         _ForIndex_91;                                      // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x589418B4_Key_26;                         // 0x0860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x31A8F10C_Value_26;                       // 0x0861(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_92 : 1;                                // 0x0862(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_862_1 : 7;                                  // 0x0862(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_93 : 1;                                // 0x0863(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_864[0x4];                                      // 0x0864(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerse_message*                         _ExprResultStack_94;                               // 0x0868(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_95;                                        // 0x0870(0x0018)(HasGetValueTypeHash)
	struct EntityInteract_0::Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R _ExprResult_96;                                    // 0x0888(0x0070)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_97;                                    // 0x08F8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_98;                                    // 0x0908(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ExprResult_99;                                    // 0x0918(0x0050)(ContainsInstancedReference)
	TMap<EVerseFalse, EVerseFalse>                __verse_0xC87067A2_Map_29;                         // 0x0968(0x0050)(ContainsInstancedReference)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ForResult_100;                                    // 0x09B8(0x0050)(ContainsInstancedReference)
	int64                                         _ForIndex_101;                                     // 0x0A08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x589418B4_Key_31;                         // 0x0A10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x31A8F10C_Value_31;                       // 0x0A11(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_102 : 1;                               // 0x0A12(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_A12_1 : 7;                                  // 0x0A12(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_103 : 1;                               // 0x0A13(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_A14[0x4];                                      // 0x0A14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerse_message*                         _ExprResultStack_104;                              // 0x0A18(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_105;                                       // 0x0A20(0x0018)(HasGetValueTypeHash)
	struct EntityInteract_0::Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R _ExprResult_106;                                   // 0x0A38(0x0070)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_107;                                   // 0x0AA8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_108;                                   // 0x0AB8(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ExprResult_109;                                   // 0x0AC8(0x0050)(ContainsInstancedReference)
	TMap<EVerseFalse, EVerseFalse>                __verse_0xC87067A2_Map_34;                         // 0x0B18(0x0050)(ContainsInstancedReference)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ForResult_110;                                    // 0x0B68(0x0050)(ContainsInstancedReference)
	int64                                         _ForIndex_111;                                     // 0x0BB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x589418B4_Key_36;                         // 0x0BC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x31A8F10C_Value_36;                       // 0x0BC1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_112 : 1;                               // 0x0BC2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_BC2_1 : 7;                                  // 0x0BC2(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_113 : 1;                               // 0x0BC3(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient final
{
public:
	struct EntityInteract_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RCancel_L_Nagent_R
// 0x0010 (0x0010 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RCancel_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RCanInteract_L_Nagent_R
// 0x0010 (0x0010 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RCanInteract_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetCannotInteractText
// 0x0018 (0x0018 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetCannotInteractText final
{
public:
	struct EntityInteract_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetCoolDownText
// 0x0018 (0x0018 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetCoolDownText final
{
public:
	struct EntityInteract_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetInteractingAgents
// 0x0018 (0x0018 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetInteractingAgents final
{
public:
	struct EntityInteract_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_agent*>              RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetInteractText
// 0x0018 (0x0018 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetInteractText final
{
public:
	struct EntityInteract_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetMaxSuccessfulInteractions
// 0x0018 (0x0018 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetMaxSuccessfulInteractions final
{
public:
	struct EntityInteract_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<int64>                              RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetRemainingCooldownDurationAffectingAgent_L_Nagent_R
// 0x0010 (0x0010 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetRemainingCooldownDurationAffectingAgent_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetRemainingInteractDuration_L_Nagent_R
// 0x0018 (0x0018 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetRemainingInteractDuration_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<double>                             RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetRemainingPerAgentCooldownDuration_L_Nagent_R
// 0x0010 (0x0010 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetRemainingPerAgentCooldownDuration_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetRemainingSharedCooldownDuration
// 0x0010 (0x0010 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetRemainingSharedCooldownDuration final
{
public:
	struct EntityInteract_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetSuccessfulIteractionCount
// 0x0010 (0x0010 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetSuccessfulIteractionCount final
{
public:
	struct EntityInteract_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RIsAgentInteracting_L_Nagent_R
// 0x0010 (0x0010 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RIsAgentInteracting_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_ROnRep__Enabled
// 0x0001 (0x0001 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_ROnRep__Enabled final
{
public:
	struct EntityInteract_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RResetSuccessfulIteractionCount
// 0x0001 (0x0001 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RResetSuccessfulIteractionCount final
{
public:
	struct EntityInteract_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetCannotInteractText_L_Nmessage_R
// 0x0008 (0x0008 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetCannotInteractText_L_Nmessage_R final
{
public:
	class UVerse_message*                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetCoolDownText_L_Nmessage_R
// 0x0008 (0x0008 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetCoolDownText_L_Nmessage_R final
{
public:
	class UVerse_message*                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetInteractText_L_Nmessage_R
// 0x0008 (0x0008 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetInteractText_L_Nmessage_R final
{
public:
	class UVerse_message*                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetMaxSuccessfulInteractions_L_N_Qint_R
// 0x0010 (0x0010 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetMaxSuccessfulInteractions_L_N_Qint_R final
{
public:
	TOptional<int64>                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetRemainingInteractDuration_L_Nagent_M_Nfloat_R
// 0x0018 (0x0018 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetRemainingInteractDuration_L_Nagent_M_Nfloat_R final
{
public:
	struct EntityInteract_0::Ftuple_Lagent_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetRemainingPerAgentCooldownDuration_L_N_Kagent_M_Nfloat_R
// 0x0018 (0x0018 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetRemainingPerAgentCooldownDuration_L_N_Kagent_M_Nfloat_R final
{
public:
	struct Ftuple_L_Kagent_Mfloat_R               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetRemainingSharedCooldownDuration_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetRemainingSharedCooldownDuration_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RStart_L_Nagent_R
// 0x0010 (0x0010 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RStart_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSucceed_L_Nagent_R
// 0x0010 (0x0010 - 0x0000)
struct interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSucceed_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable
// 0x0001 (0x0001 - 0x0000)
struct interact_component__L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable final
{
public:
	struct EntityInteract_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable
// 0x0001 (0x0001 - 0x0000)
struct interact_component__L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable final
{
public:
	struct EntityInteract_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled
// 0x0003 (0x0003 - 0x0000)
struct interact_component__L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled final
{
public:
	struct EntityInteract_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

