#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicHardSurfaceQCRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function EpicHardSurfaceQCRuntime.EpicHardSurfaceQCRuntimeFunctions.SaveIndexToJson
// 0x00F8 (0x00F8 - 0x0000)
struct EpicHardSurfaceQCRuntimeFunctions_SaveIndexToJson final
{
public:
	class FString                                 WeaponName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WeaponIconSmall;                                   // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         WeaponSkeletalMeshes;                              // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         WeaponAnimSequencesEquip;                          // 0x0030(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         WeaponAnimSequencesReload;                         // 0x0040(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         WeaponAnimSequencesFire;                           // 0x0050(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         WeaponAnimSequencesFireDownSights;                 // 0x0060(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 CharacterName;                                     // 0x0070(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CharacterIconSmall;                                // 0x0080(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         CharacterSkeletalMeshes;                           // 0x0090(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         CharacterAnimSequencesEquip;                       // 0x00A0(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         CharacterAnimSequencesReload;                      // 0x00B0(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         CharacterAnimSequencesFire;                        // 0x00C0(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         CharacterAnimSequencesFireDownSights;              // 0x00D0(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 Path;                                              // 0x00E0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

