#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicGameplayStatsRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum EpicGameplayStatsRuntime.EEpicLeaderboardDataType
// NumValues: 0x0003
enum class EEpicLeaderboardDataType : uint8
{
	Integer                                  = 0,
	Double                                   = 1,
	EEpicLeaderboardDataType_MAX             = 2,
};

// Enum EpicGameplayStatsRuntime.EEpicLeaderboardTimeWindow
// NumValues: 0x0005
enum class EEpicLeaderboardTimeWindow : uint8
{
	Daily                                    = 0,
	Weekly                                   = 1,
	Monthly                                  = 2,
	AllTime                                  = 3,
	EEpicLeaderboardTimeWindow_MAX           = 4,
};

// Enum EpicGameplayStatsRuntime.EEpicLeaderboardUpdateFunction
// NumValues: 0x0005
enum class EEpicLeaderboardUpdateFunction : uint8
{
	Min                                      = 0,
	Max                                      = 1,
	Sum                                      = 2,
	MostRecent                               = 3,
	EEpicLeaderboardUpdateFunction_MAX       = 4,
};

// ScriptStruct EpicGameplayStatsRuntime.TagTableManagerHelper
// 0x0001 (0x0001 - 0x0000)
struct FTagTableManagerHelper final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct EpicGameplayStatsRuntime.GameplayStatMetadataTableRow
// 0x0060 (0x0068 - 0x0008)
struct FGameplayStatMetadataTableRow final : public FTableRowBase
{
public:
	class FString                                 BackendName;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<EEpicLeaderboardTimeWindow>            Windows;                                           // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	EEpicLeaderboardUpdateFunction                Metric;                                            // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEpicLeaderboardDataType                      DataType;                                          // 0x0039(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPublish;                                          // 0x003A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WeeklyRefreshInterval;                             // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExportToBackEnd;                                  // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowInFrontEnd;                                   // 0x0041(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DeveloperComment;                                  // 0x0048(0x0010)(Edit, ZeroConstructor, EditorOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           PreviewTag;                                        // 0x0058(0x000C)(Edit, Transient, EditConst, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagCreationWidgetHelper       NewGameplayStat;                                   // 0x0064(0x0001)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FTagTableManagerHelper                 TableManagerHelper;                                // 0x0065(0x0001)(Edit, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct EpicGameplayStatsRuntime.GameplayStatTag
// 0x000C (0x0018 - 0x000C)
struct FGameplayStatTag final : public FGameplayTag
{
public:
	struct FGameplayTag                           Tag;                                               // 0x000C(0x000C)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct EpicGameplayStatsRuntime.ManagedGameplayTagDataTableItem
// 0x0018 (0x0018 - 0x0000)
struct FManagedGameplayTagDataTableItem final
{
public:
	struct FGameplayTag                           RootTag;                                           // 0x0000(0x000C)(Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             DataTable;                                         // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

