#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicGamesEngine

#include "Basic.hpp"

#include "EpicGamesEngine_structs.hpp"
#include "EntityActor_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class EpicGamesEngine.VerseUEInputComponentBase
// 0x0388 (0x0498 - 0x0110)
class UVerseUEInputComponentBase : public UEntityActorPlayerComponent
{
public:
	class UInputComponent*                        InputComponent;                                    // 0x0110(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVerseActionMappingArray               ReplicatedActionMappingArray;                      // 0x0118(0x0128)(Net, NativeAccessSpecifierPrivate)
	struct FVerseAxisMappingArray                 ReplicatedAxisMappingArray;                        // 0x0240(0x0128)(Net, NativeAccessSpecifierPrivate)
	struct FVerseInputBindingArray                ReplicatedInputBindingArray;                       // 0x0368(0x0128)(Net, NativeAccessSpecifierPrivate)
	uint8                                         Pad_490[0x8];                                      // 0x0490(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ServerTriggerAction(const class FName& ActionName, EInputEvent InputEvent);
	void ServerTriggerAxis(const class FName& AxisName, float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseUEInputComponentBase">();
	}
	static class UVerseUEInputComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseUEInputComponentBase>();
	}
};

}

