#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicGamesAssets

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class EpicGamesAssets.PlayedSoundReplication
// 0x0040 (0x0460 - 0x0420)
class APlayedSoundReplication final : public AActor
{
public:
	double                                        StartTime;                                         // 0x0420(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPlaySound2D;                                      // 0x0428(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerseAssetPtr*                         SoundAsset;                                        // 0x0430(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAudioComponent*                        AudioComponent;                                    // 0x0438(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundAttenuation*                      SoundAttenuation;                                  // 0x0440(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_448[0x18];                                     // 0x0448(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_SoundAsset();
	void OnSystemFinished(class UAudioComponent* FinishedComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayedSoundReplication">();
	}
	static class APlayedSoundReplication* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayedSoundReplication>();
	}
};

// Class EpicGamesAssets.SpawnedParticleSystemReplication
// 0x0038 (0x0458 - 0x0420)
class ASpawnedParticleSystemReplication final : public AActor
{
public:
	double                                        StartTime;                                         // 0x0420(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVerseAssetPtr*                         VFXAsset;                                          // 0x0428(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UNiagaraComponent*                      VFXComponent;                                      // 0x0430(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_438[0x20];                                     // 0x0438(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_StartTime();
	void OnRep_VFXAsset();
	void OnSystemFinished(class UNiagaraComponent* FinishedComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpawnedParticleSystemReplication">();
	}
	static class ASpawnedParticleSystemReplication* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpawnedParticleSystemReplication>();
	}
};

}

