#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicGamesEngine

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function EpicGamesEngine.VerseUEInputComponentBase.ServerTriggerAction
// 0x0010 (0x0010 - 0x0000)
struct VerseUEInputComponentBase_ServerTriggerAction final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function EpicGamesEngine.VerseUEInputComponentBase.ServerTriggerAxis
// 0x0010 (0x0010 - 0x0000)
struct VerseUEInputComponentBase_ServerTriggerAxis final
{
public:
	class FName                                   AxisName;                                          // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

