#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EsportsCameraClient

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class EsportsCameraClient.EsportsCameraClient
// 0x0040 (0x0460 - 0x0420)
class AEsportsCameraClient final : public AActor
{
public:
	uint8                                         Pad_420[0x10];                                     // 0x0420(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AWebCamReader*                          WebCamReader;                                      // 0x0430(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AWebCamViewer*                          WebCamViewer;                                      // 0x0438(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AM3U8MovieViewer*                       M3U8MovieViewer;                                   // 0x0440(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_448[0x18];                                     // 0x0448(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool HasDynamicMaterial();
	bool IsPlatformEnabled();
	bool IsPlayingWebMovie();
	void SetDynamicMaterial(class UMaterialInstanceDynamic* MaterialInstanceDynamic);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EsportsCameraClient">();
	}
	static class AEsportsCameraClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEsportsCameraClient>();
	}
};

// Class EsportsCameraClient.EsportsCameraStatusBase
// 0x0000 (0x0440 - 0x0440)
class UEsportsCameraStatusBase final : public UCommonUserWidget
{
public:
	void FollowedPlayerChanged(class AEsportsCameraClient* InEsportsCameraClient);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EsportsCameraStatusBase">();
	}
	static class UEsportsCameraStatusBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEsportsCameraStatusBase>();
	}
};

// Class EsportsCameraClient.WebCamBase
// 0x0048 (0x0468 - 0x0420)
class AWebCamBase : public AActor
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             DynamicTexture;                                    // 0x0428(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               MaterialInstanceDynamic;                           // 0x0430(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 DynamicColors;                                     // 0x0438(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_448[0x20];                                     // 0x0448(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WebCamBase">();
	}
	static class AWebCamBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWebCamBase>();
	}
};

// Class EsportsCameraClient.M3U8MovieViewer
// 0x0040 (0x04A8 - 0x0468)
class AM3U8MovieViewer final : public AWebCamBase
{
public:
	uint8                                         Pad_468[0x28];                                     // 0x0468(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AudioComponent;                                    // 0x0490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMySoundWave*                           MySoundWave;                                       // 0x0498(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A0[0x8];                                      // 0x04A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"M3U8MovieViewer">();
	}
	static class AM3U8MovieViewer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AM3U8MovieViewer>();
	}
};

// Class EsportsCameraClient.MySoundWave
// 0x0010 (0x07F0 - 0x07E0)
class UMySoundWave final : public USoundWaveProcedural
{
public:
	uint8                                         Pad_7E0[0x10];                                     // 0x07E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MySoundWave">();
	}
	static class UMySoundWave* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMySoundWave>();
	}
};

// Class EsportsCameraClient.WebCamReader
// 0x0000 (0x0468 - 0x0468)
class AWebCamReader final : public AWebCamBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WebCamReader">();
	}
	static class AWebCamReader* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWebCamReader>();
	}
};

// Class EsportsCameraClient.WebCamViewer
// 0x0008 (0x0470 - 0x0468)
class AWebCamViewer final : public AWebCamBase
{
public:
	uint8                                         Pad_468[0x8];                                      // 0x0468(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WebCamViewer">();
	}
	static class AWebCamViewer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWebCamViewer>();
	}
};

}

