#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExecutionTestSuite_0

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "ExecutionTestSuite_0_structs.hpp"


namespace SDK::Params
{

// Function ExecutionTestSuite.ExecutionTestSuite_test_phases.$InitCDO
// 0x0070 (0x0070 - 0x0000)
struct ExecutionTestSuite_test_phases__InitCDO final
{
public:
	TOptional<class Uexecution_subscribable*, true> _ExprResult_0;                                     // 0x0000(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0008(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x000A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_2;                                // 0x000B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Uexecution_subscribable*, true> _ExprResult_3;                                     // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0018(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x001A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_5;                                // 0x001B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Uexecution_subscribable*, true> _ExprResult_6;                                     // 0x0020(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__5;                             // 0x0028(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_7 : 1;                                 // 0x002A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_8;                                // 0x002B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ExprResult_9;                                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class Uexecution_subscribable*, true> _ExprResult_10;                                    // 0x0038(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__7;                             // 0x0040(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_11 : 1;                                // 0x0042(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_12;                               // 0x0043(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Uexecution_subscribable*, true> _ExprResult_13;                                    // 0x0048(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__9;                             // 0x0050(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_14 : 1;                                // 0x0052(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_15;                               // 0x0053(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Uexecution_subscribable*, true> _ExprResult_16;                                    // 0x0058(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__11;                            // 0x0060(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_17 : 1;                                // 0x0062(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_18;                               // 0x0063(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ExprResult_19;                                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user.$InitCDO
// 0x0070 (0x0070 - 0x0000)
struct ExecutionTestSuite_test_phase_user__InitCDO final
{
public:
	int64                                         _ExprResult_0;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_1;                                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResult_2;                                     // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0018(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_3 : 1;                                 // 0x001A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_4;                                // 0x001B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class Uexecution_subscription*                _ExprResult_5;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_6;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResult_7;                                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResult_8;                                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_9;                                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResult_10;                                    // 0x0048(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0050(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_11 : 1;                                // 0x0052(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_12;                               // 0x0053(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class Uexecution_subscription*                _ExprResult_13;                                    // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_14;                               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResult_15;                                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user._L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RCancel
// 0x0098 (0x0098 - 0x0000)
struct ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RCancel final
{
public:
	struct ExecutionTestSuite_0::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Uexecution_subscription*                __verse_0x7E090ADF_Connected_1;                    // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_0;                                // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_1;                                // 0x0018(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class Uexecution_subscription*                __verse_0x00000000__2;                             // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_L_R       _ExprResult_4;                                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Uexecution_subscription*                __verse_0x7E090ADF_Connected_3;                    // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_5;                                // 0x0058(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_6;                                // 0x0060(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class Uexecution_subscription*                __verse_0x00000000__4;                             // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_7;                          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x0078(0x0018)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_L_R       _ExprResult_9;                                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user._L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RCountNext
// 0x0001 (0x0001 - 0x0000)
struct ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RCountNext final
{
public:
	struct ExecutionTestSuite_0::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user._L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RInit_L_Nexecution__subscribable_R
// 0x0138 (0x0138 - 0x0000)
struct ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RInit_L_Nexecution__subscribable_R final
{
public:
	class Uexecution_subscribable*                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Uexecution_subscription*                __verse_0x7E090ADF_Connected_3;                    // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_0;                                // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_1;                                // 0x0018(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class Uexecution_subscription*                __verse_0x00000000__4;                             // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_L_R       _ExprResult_4;                                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_5;                                // 0x0050(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> VerseClassVarProxySetterRHS_6;                     // 0x0058(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResult_7;                                     // 0x0060(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class Uexecution_subscription*                _ExprResult_8;                                     // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _FallibleType_9;                                   // 0x0070(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                _ExprResult_10;                                    // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Uexecution_subscribable*                __verse_0x00000000__5;                             // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x0088(0x0018)(HasGetValueTypeHash)
	class Uexecution_subscription*                __verse_0x7E090ADF_Connected_8;                    // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_12;                               // 0x00A8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_13;                               // 0x00B0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class Uexecution_subscription*                __verse_0x00000000__9;                             // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_14;                         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_15;                                        // 0x00C8(0x0018)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_L_R       _ExprResult_16;                                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_17;                               // 0x00E8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> VerseClassVarProxySetterRHS_18;                    // 0x00F0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResult_19;                                    // 0x00F8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class Uexecution_subscription*                _ExprResult_20;                                    // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _FallibleType_21;                                  // 0x0108(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                _ExprResult_22;                                    // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Uexecution_subscribable*                __verse_0x00000000__10;                            // 0x0118(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_23;                                        // 0x0120(0x0018)(HasGetValueTypeHash)
};

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user._L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecute
// 0x0048 (0x0048 - 0x0000)
struct ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecute final
{
public:
	struct ExecutionTestSuite_0::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0018)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_L_R       _ExprResult_2;                                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0028(0x0018)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_L_R       _ExprResult_5;                                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user._L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecute2
// 0x0038 (0x0038 - 0x0000)
struct ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecute2 final
{
public:
	struct ExecutionTestSuite_0::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ExprResultStack_0;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         VerseClassVarProxySetterRHS_1;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResultStack_2;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResultStack_3;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         VerseClassVarProxySetterRHS_4;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResultStack_5;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user._L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecuteWithTime0_L_Nany_R_Nvoid
// 0x0060 (0x0060 - 0x0000)
struct ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecuteWithTime0_L_Nany_R_Nvoid final
{
public:
	FVerseDynamicProperty_                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	double                                        _ExprResult_2;                                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
	double                                        _ExprResult_5;                                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user._L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecuteWithTime_L_Nfloat_R
// 0x0088 (0x0088 - 0x0000)
struct ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecuteWithTime_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0010(0x0018)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_L_R       _ExprResult_2;                                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResultStack_3;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VerseClassVarProxySetterRHS_4;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_5;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_6;                          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0050(0x0018)(HasGetValueTypeHash)
	struct ExecutionTestSuite_0::Ftuple_L_R       _ExprResult_8;                                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResultStack_9;                                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VerseClassVarProxySetterRHS_10;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_11;                               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user._L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROrderAfter_L_Ntest__phase__user_R
// 0x00B8 (0x00B8 - 0x0000)
struct ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROrderAfter_L_Ntest__phase__user_R final
{
public:
	class UExecutionTestSuite_test_phase_user*    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Uexecution_subscription*                __verse_0xCF28E5A8_C_1;                            // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_0;                                // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_1;                                // 0x0018(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class Uexecution_subscription*                __verse_0xC2BD6D73_AfterC_1;                       // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_2;                                // 0x0028(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_3;                                // 0x0030(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class Uexecution_subscription*                __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_4;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	class Uexecution_subscription*                __verse_0xCF28E5A8_C_3;                            // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_6;                                // 0x0068(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_7;                                // 0x0070(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class Uexecution_subscription*                __verse_0xC2BD6D73_AfterC_3;                       // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_8;                                // 0x0080(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_9;                                // 0x0088(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class Uexecution_subscription*                __verse_0x00000000__4;                             // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_10;                         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x00A0(0x0018)(HasGetValueTypeHash)
};

// Function ExecutionTestSuite.ExecutionTestSuite_test_phase_user._L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROrderBefore_L_Ntest__phase__user_R
// 0x00B8 (0x00B8 - 0x0000)
struct ExecutionTestSuite_test_phase_user__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROrderBefore_L_Ntest__phase__user_R final
{
public:
	class UExecutionTestSuite_test_phase_user*    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Uexecution_subscription*                __verse_0xCF28E5A8_C_1;                            // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_0;                                // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_1;                                // 0x0018(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class Uexecution_subscription*                __verse_0x36F41A1B_BeforeC_1;                      // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_2;                                // 0x0028(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_3;                                // 0x0030(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class Uexecution_subscription*                __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_4;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	class Uexecution_subscription*                __verse_0xCF28E5A8_C_3;                            // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_6;                                // 0x0068(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_7;                                // 0x0070(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class Uexecution_subscription*                __verse_0x36F41A1B_BeforeC_3;                      // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_8;                                // 0x0080(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uexecution_subscription*, true> _ExprResultStack_9;                                // 0x0088(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class Uexecution_subscription*                __verse_0x00000000__4;                             // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_10;                         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x00A0(0x0018)(HasGetValueTypeHash)
};

}

