#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FabricRuntime

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "FabricMetasoundDataTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FabricRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "HarmonixDsp_structs.hpp"
#include "HarmonixMidi_structs.hpp"
#include "MetasoundEngine_structs.hpp"
#include "FMCoreRuntime_structs.hpp"
#include "HarmonixMetasound_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "TargetingSystem_structs.hpp"
#include "GameFeatures_classes.hpp"


namespace SDK
{

// Class FabricRuntime.FabricMetaSoundTreeNode
// 0x0020 (0x0050 - 0x0030)
class UFabricMetaSoundTreeNode final : public UObject
{
public:
	EFabricMetaSoundPinDirection                  PinDirection;                                      // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFabricMetaSoundPatchWrapper*           AssociatedPatchWrapper;                            // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UFabricMetaSoundTreeNode*>       Children;                                          // 0x0040(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	void ConnectToChildNodes();
	TArray<class UFabricMetaSoundTreeNode*> GetValidChildren();
	void Reset();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricMetaSoundTreeNode">();
	}
	static class UFabricMetaSoundTreeNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricMetaSoundTreeNode>();
	}
};

// Class FabricRuntime.FabricAnimatableButtonInterface
// 0x0000 (0x0030 - 0x0030)
class IFabricAnimatableButtonInterface final : public IInterface
{
public:
	void PlayCloseAnimation();
	void PlayOpenAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricAnimatableButtonInterface">();
	}
	static class IFabricAnimatableButtonInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricAnimatableButtonInterface>();
	}
};

// Class FabricRuntime.FabricAudioBridgeComponent
// 0x0048 (0x0120 - 0x00D8)
class UFabricAudioBridgeComponent final : public UActorComponent
{
public:
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFabricMetaSoundAudioPatchWrapper> FabricAudioPatchWrapperClass;                      // 0x00F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFabricMetaSoundAudioPatchWrapper*      FabricAudioPatchWrapperInstance;                   // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFabricMetaSoundManagerComponent> FabricMetasoundManager;                            // 0x0100(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_108[0x18];                                     // 0x0108(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRemoveSyncedAudioTimerElapsed();
	void SetAudioStartTime(const struct FMusicTimestamp& StartTime);
	void SetFabricMetasoundManager(class UFabricMetaSoundManagerComponent* InFabricMetasoundManager);
	void SyncAudioToMetaSound(class USoundWave* InAudio, float AudioStartTime, float InitialVolume, bool bLoopAudio);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricAudioBridgeComponent">();
	}
	static class UFabricAudioBridgeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricAudioBridgeComponent>();
	}
};

// Class FabricRuntime.FabricProgressorManager
// 0x0040 (0x0118 - 0x00D8)
class UFabricProgressorManager final : public UActorComponent
{
public:
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnGlobalProgressionChanged;                        // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bHasActiveGlobalProgression;                       // 0x00F0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GlobalPresetNumber;                                // 0x00F4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFabricProgressionPreset               GlobalProgression;                                 // 0x00F8(0x0020)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	bool IsProgressionGlobal(const struct FFabricProgressionPreset& InProgression);
	void SetGlobalProgression(const struct FFabricProgressionPreset& InProgression, int32 InPresetNumber);

	int32 GetGlobalPresetNumber() const;
	const struct FFabricProgressionPreset GetGlobalProgression() const;
	bool HasActiveGlobalProgression() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricProgressorManager">();
	}
	static class UFabricProgressorManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricProgressorManager>();
	}
};

// Class FabricRuntime.FabricButtonBase
// 0x00A8 (0x04C8 - 0x0420)
class AFabricButtonBase final : public AActor
{
public:
	uint8                                         Pad_420[0x18];                                     // 0x0420(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class APlayerController* InteractingController, bool IsToggle)> ToggleStateChanged;                                // 0x0438(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	double                                        OpenTimeSeconds;                                   // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        CloseTimeSeconds;                                  // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasToggle;                                        // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EButtonPressMethod                            ClickMethod;                                       // 0x0459(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_45A[0x6];                                      // 0x045A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      InteractingController;                             // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ButtonId;                                          // 0x0468(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   ButtonLabel;                                       // 0x0478(0x0010)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class FText                                   ButtonDescription;                                 // 0x0488(0x0010)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x0498(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          bEnabled;                                          // 0x04B8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHovered;                                          // 0x04B9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPressed;                                          // 0x04BA(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECheckBoxState                                ToggleState;                                       // 0x04BB(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFabricInteractableViewModel*           WidgetViewModel;                                   // 0x04C0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UTimelineComponent* GetCloseTimeline();
	class UTimelineComponent* GetOpenTimeline();
	void HandleButtonClicked();
	void HandleButtonDoubleClicked();
	void HandleButtonHovered();
	void HandleButtonPressed();
	void HandleButtonReleased();
	void HandleButtonUnhovered();
	bool IsEnabled();
	bool IsHovered();
	bool IsPressed();
	bool IsToggledOn();
	void OnButtonClicked();
	void OnButtonDoubleClicked();
	void OnButtonPressed();
	void OnButtonReleased();
	void OnDisabled();
	void OnEnabled();
	void OnHovered();
	void OnToggleStateChanged(bool bIsToggled);
	void OnUnhovered();
	void SetEnabled(bool bNewEnabled);
	void SetToggleState(bool bNewToggleState, bool bBroadcast, bool bForce);
	void SetWidgetViewModel(class UFabricInteractableViewModel* ViewModel);
	void SwapToggle();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricButtonBase">();
	}
	static class AFabricButtonBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFabricButtonBase>();
	}
};

// Class FabricRuntime.FabricButtonComponentBase
// 0x00C0 (0x0760 - 0x06A0)
class UFabricButtonComponentBase final : public UStaticMeshComponent
{
public:
	uint8                                         Pad_6A0[0x10];                                     // 0x06A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class APlayerController* InteractingController, bool IsToggle)> ToggleStateChanged;                                // 0x06B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	double                                        OpenTimeSeconds;                                   // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        CloseTimeSeconds;                                  // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasToggle;                                        // 0x06D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EButtonPressMethod                            ClickMethod;                                       // 0x06D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6D2[0x6];                                      // 0x06D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      InteractingController;                             // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ButtonId;                                          // 0x06E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   ButtonLabel;                                       // 0x06F0(0x0010)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class FText                                   ButtonDescription;                                 // 0x0700(0x0010)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x0710(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          bUseScreenGrid;                                    // 0x0730(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_731[0x7];                                      // 0x0731(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ScreenGridPosition;                                // 0x0738(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnabled;                                          // 0x0748(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHovered;                                          // 0x0749(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPressed;                                          // 0x074A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECheckBoxState                                ToggleState;                                       // 0x074B(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_74C[0x4];                                      // 0x074C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFabricInteractableViewModel*           WidgetViewModel;                                   // 0x0750(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_758[0x8];                                      // 0x0758(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ConstructButton();
	class UTimelineComponent* GetCloseTimeline();
	class UTimelineComponent* GetOpenTimeline();
	void HandleButtonClicked();
	void HandleButtonDoubleClicked();
	void HandleButtonHovered();
	void HandleButtonPressed();
	void HandleButtonReleased();
	void HandleButtonUnhovered();
	bool IsEnabled();
	bool IsHovered();
	bool IsPressed();
	bool IsToggledOn();
	void OnButtonClicked();
	void OnButtonDoubleClicked();
	void OnButtonPressed();
	void OnButtonReleased();
	void OnDisabled();
	void OnEnabled();
	void OnHovered();
	void OnToggleStateChanged(bool bIsToggled);
	void OnUnhovered();
	void SetEnabled(bool bNewEnabled);
	void SetToggleState(bool bNewToggleState, bool bBroadcast, bool bForce);
	void SetWidgetViewModel(class UFabricInteractableViewModel* ViewModel);
	void SwapToggle();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricButtonComponentBase">();
	}
	static class UFabricButtonComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricButtonComponentBase>();
	}
};

// Class FabricRuntime.FabricDevice
// 0x0000 (0x0030 - 0x0030)
class IFabricDevice final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricDevice">();
	}
	static class IFabricDevice* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricDevice>();
	}
};

// Class FabricRuntime.FabricMetaSoundPatchOwner
// 0x0000 (0x0030 - 0x0030)
class IFabricMetaSoundPatchOwner final : public IInterface
{
public:
	class UFabricMetaSoundPatchWrapper* GetMetaSoundPatchWrapper();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricMetaSoundPatchOwner">();
	}
	static class IFabricMetaSoundPatchOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricMetaSoundPatchOwner>();
	}
};

// Class FabricRuntime.FabricSequencerSustainComponent
// 0x0080 (0x0AA0 - 0x0A20)
class UFabricSequencerSustainComponent final : public UInstancedStaticMeshComponent
{
public:
	TMap<struct FIntVector2, int32>               StepToInstanceMapping;                             // 0x0A20(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	int32                                         PICDStartBeat;                                     // 0x0A70(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PICDEndBeat;                                       // 0x0A74(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PICDLoopBeat;                                      // 0x0A78(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CPDDeviceEnabled;                                  // 0x0A7C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GridSquareExtents;                                 // 0x0A80(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SustainInstanceYLocation;                          // 0x0A84(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SustainInstanceYScale;                             // 0x0A88(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SustainInstanceZScale;                             // 0x0A8C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFabricStepSequencerComponent> StepSequencer;                                     // 0x0A90(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UFabricStepSequencerGridComponent> StepSequencerGrid;                                 // 0x0A98(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void AddSustainInstance(int32 StepIndex, int32 TrackIndex);
	float CalculateSustainLength(float NumStepsCoveredBySustain);
	void ConstructSustains();
	void FindAndDeleteInstance(int32 StepIndex, int32 TrackIndex);
	void FindHeadNoteAndUpdateInstance(int32 StepIndex, int32 TrackIndex);
	void InitializeSustainComponent(class UFabricStepSequencerComponent* InStepSequencer, class UFabricStepSequencerGridComponent* InStepSequencerGrid);
	void OnFullTableChanged();
	void OnNumStepsChanged(int32 NumSteps);
	void OnNumTracksChanged(int32 NumTracks);
	void OnPageChanged(int32 CurrentPage);
	void OnStepChanged(const struct FFabricSequencerStepChangedInfo& StepInfo);
	void SetEndBeat(int32 InstanceIndex, float EndBeatValue);
	void SetLoopBeat(int32 InstanceIndex, float LoopBeatValue);
	void SetStartBeat(int32 InstanceIndex, float StartBeatValue);
	void UpdateDeviceEnabledOnSustain(bool bEnabled);
	void UpdatePipsOnGridChanged();
	void UpdateSustainInstance(int32 StepIndex, int32 TrackIndex, int32 PageIndex, bool bEnabled, bool bContinuous, bool bStepChanged);
	void UpdateSustainMaterial(int32 InstanceIndex, int32 HeadNoteStepIndex, int32 TrackIndex);
	void UpdateVisibilityOfInstances();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricSequencerSustainComponent">();
	}
	static class UFabricSequencerSustainComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricSequencerSustainComponent>();
	}
};

// Class FabricRuntime.FabricAudioGenerator
// 0x0000 (0x0030 - 0x0030)
class IFabricAudioGenerator final : public IInterface
{
public:
	struct FSourceEffectChainEntry GetAudioAnalyzer();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricAudioGenerator">();
	}
	static class IFabricAudioGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricAudioGenerator>();
	}
};

// Class FabricRuntime.FabricAudioModifier
// 0x0000 (0x0030 - 0x0030)
class IFabricAudioModifier final : public IInterface
{
public:
	TArray<struct FSourceEffectChainEntry> GetSourceEffectChainEntries();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricAudioModifier">();
	}
	static class IFabricAudioModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricAudioModifier>();
	}
};

// Class FabricRuntime.FabricModulatorSource
// 0x0000 (0x0030 - 0x0030)
class IFabricModulatorSource final : public IInterface
{
public:
	void GetModulators(class UFabricModulatable* Modulatable);

	class UPlaylistUserOptionBase* GetUserOption(const class FString& Property) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricModulatorSource">();
	}
	static class IFabricModulatorSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricModulatorSource>();
	}
};

// Class FabricRuntime.FabricAudioReceiver
// 0x0000 (0x0030 - 0x0030)
class IFabricAudioReceiver final : public IInterface
{
public:
	class USoundSourceBus* GetSoundSourceBus();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricAudioReceiver">();
	}
	static class IFabricAudioReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricAudioReceiver>();
	}
};

// Class FabricRuntime.FabricFloatGenerator
// 0x0000 (0x0030 - 0x0030)
class IFabricFloatGenerator final : public IInterface
{
public:
	class UFabricFloatProviderBase* GetFloatProvider();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricFloatGenerator">();
	}
	static class IFabricFloatGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricFloatGenerator>();
	}
};

// Class FabricRuntime.FabricStepSequencerGridComponent
// 0x0110 (0x0380 - 0x0270)
class UFabricStepSequencerGridComponent final : public USceneComponent
{
public:
	uint8                                         Pad_270[0x10];                                     // 0x0270(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              GridExtents;                                       // 0x0280(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              GridSpacing;                                       // 0x0290(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SingleTrackNumItemsPerRow;                         // 0x02A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              EditorPreviewGridSize;                             // 0x02A8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFabricStepSequencerGridSquareComponent> GridSquareClassPtr;                                // 0x02B8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   GridSquareClass;                                   // 0x02C0(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESequencerType                                SequencerType;                                     // 0x02F0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ActiveTrack;                                       // 0x02F4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFabricStepSequencerComponent*          StepSequencer;                                     // 0x02F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FTrackRow>                      GridRows;                                          // 0x0300(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_310[0x60];                                     // 0x0310(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxTrackIndexToLoadSquares;                        // 0x0370(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_374[0xC];                                      // 0x0374(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetGridSquareXPosition(const int32 NumSteps, const int32 StepIndex);
	float GetGridSquareYPosition(const int32 NumRows, const int32 RowIndex);
	bool IsBypassed();
	void NotifyInteractionFocusTargetExternallyChanged(class APlayerController* PlayerController, int32 SourceRowIndex, int32 SourceColumnIndex, int32 FocusRowIndex, int32 FocusColumnIndex, bool bIsFocused);
	void OnBeatOffsetChanged(float BeatOffset);
	void OnBeatScaleChanged(float BeatScale);
	void OnCurrentPageChanged(int32 NewPage);
	void OnFullTableChanged();
	void OnNoteStyleChanged(EFabricNoteStyle Style);
	void OnNumStepsChanged(int32 NumSteps);
	void OnNumTracksChanged(int32 NumTracks);
	void OnQuarterNotesLengthChanged(float QuarterNotesLength);
	void OnRep_MaxTrackIndexToLoadSquares();
	void OnStepChanged(const struct FFabricSequencerStepChangedInfo& StepInfo);
	void SetActiveTrackIndex(int32 ActiveTrackIndex);
	void SetBypassed(bool bBypassed);
	void SetGridVisible(bool bInGridVisible, bool bForceRefresh);

	struct FVector GetGridSquareExtents(const int32 RowIndex, const int32 ColumnIndex) const;
	struct FVector2D GetGridSquareSize(const int32 NumSteps, const int32 NumRows) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricStepSequencerGridComponent">();
	}
	static class UFabricStepSequencerGridComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricStepSequencerGridComponent>();
	}
};

// Class FabricRuntime.FabricFloatReceiver
// 0x0000 (0x0030 - 0x0030)
class IFabricFloatReceiver final : public IInterface
{
public:
	void SetFloatProviders(const TArray<class UFabricFloatProviderBase*>& FloatProvider);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricFloatReceiver">();
	}
	static class IFabricFloatReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricFloatReceiver>();
	}
};

// Class FabricRuntime.FabricTextureGenerator
// 0x0000 (0x0030 - 0x0030)
class IFabricTextureGenerator final : public IInterface
{
public:
	class UFabricTextureProviderBase* GetTextureProvider();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricTextureGenerator">();
	}
	static class IFabricTextureGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricTextureGenerator>();
	}
};

// Class FabricRuntime.FabricTextureModifier
// 0x0000 (0x0030 - 0x0030)
class IFabricTextureModifier final : public IInterface
{
public:
	class UFabricTextureModifierBase* GetTextureModifier();

	bool IsShowingTexturePreview() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricTextureModifier">();
	}
	static class IFabricTextureModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricTextureModifier>();
	}
};

// Class FabricRuntime.FabricTextureReceiver
// 0x0000 (0x0030 - 0x0030)
class IFabricTextureReceiver final : public IInterface
{
public:
	void OnTexturesChanged(const TArray<struct FFabricTextureProviderTexture>& Texture);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricTextureReceiver">();
	}
	static class IFabricTextureReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricTextureReceiver>();
	}
};

// Class FabricRuntime.FabricTextureProviderBase
// 0x0038 (0x0068 - 0x0030)
class UFabricTextureProviderBase final : public UObject
{
public:
	TMulticastInlineDelegate<void(struct FFabricTextureProviderTexture& Texture)> OnTextureChanged;                                  // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FFabricTextureProviderTexture          SourceTexture;                                     // 0x0040(0x0018)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         CurrentCableFloatValue;                            // 0x0058(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentCableFloatDirection;                        // 0x005C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimeElapsedSinceLastCableFloatDirty;               // 0x0060(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCurrentCableFloatDirty;                           // 0x0064(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetSourceTexture(const struct FFabricTextureProviderTexture& InTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricTextureProviderBase">();
	}
	static class UFabricTextureProviderBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricTextureProviderBase>();
	}
};

// Class FabricRuntime.FabricMeshGenerator
// 0x0000 (0x0030 - 0x0030)
class IFabricMeshGenerator final : public IInterface
{
public:
	class UFabricMeshProviderBase* GetMeshProvider();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricMeshGenerator">();
	}
	static class IFabricMeshGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricMeshGenerator>();
	}
};

// Class FabricRuntime.FabricMeshModifier
// 0x0000 (0x0030 - 0x0030)
class IFabricMeshModifier final : public IInterface
{
public:
	void OnMeshesChanged(const TArray<struct FFabricMeshInstanceReference>& InstanceMeshReferences, bool bInstancesChanged);

	class UFabricMeshModifierBase* GetMeshModifier() const;
	bool IsShowingMeshPreview() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricMeshModifier">();
	}
	static class IFabricMeshModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricMeshModifier>();
	}
};

// Class FabricRuntime.FabricModulatable
// 0x0300 (0x0330 - 0x0030)
class UFabricModulatable : public UObject
{
public:
	uint8                                         Pad_30[0x4];                                       // 0x0030(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  ModulatedActor;                                    // 0x0034(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ModulatorParams;                                   // 0x0040(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TSet<class FName>                             NonModulatedParamsWithCallbacks;                   // 0x0050(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<class FString, TWeakObjectPtr<class UObject>> Modulators;                                        // 0x00A0(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class FName, class FName>                LastBroadcastedValues;                             // 0x00F0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class UObject>>         ModulatorSources;                                  // 0x0140(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_150[0x1E0];                                    // 0x0150(0x01E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAnyOptionUpdated();
	void OnModulatedPropertyChanged(const class FString& Value, class UObject* ModulatorObject);
	void OnModulatorFloatProviderConnectionChanged(bool bConnected, class UObject* ModulatorObject);
	void OnOptionsLoaded();

	class AActor* GetModulatedActor() const;
	bool GetModulatedBool(const class FString& Param, const struct FMidiSongPos& SongPos, bool* OutBool) const;
	bool GetModulatedEnum(const class FString& Param, const struct FMidiSongPos& SongPos, uint8* OutEnum) const;
	bool GetModulatedFloat(const class FString& Param, const struct FMidiSongPos& SongPos, float* OutFloat) const;
	bool GetModulatedInt(const class FString& Param, const struct FMidiSongPos& SongPos, int32* OutInt) const;
	bool GetModulatedString(const class FString& Param, const struct FMidiSongPos& SongPos, class FString* OutString) const;
	bool IsParamModulated(const class FString& Param) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricModulatable">();
	}
	static class UFabricModulatable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricModulatable>();
	}
};

// Class FabricRuntime.FabricStepSequencerModulatable
// 0x0088 (0x03B8 - 0x0330)
class UFabricStepSequencerModulatable final : public UFabricModulatable
{
public:
	uint8                                         Pad_330[0x80];                                     // 0x0330(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsChromatic;                                      // 0x03B0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bModulationValueChanged;                           // 0x03B1(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3B2[0x6];                                      // 0x03B2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricStepSequencerModulatable">();
	}
	static class UFabricStepSequencerModulatable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricStepSequencerModulatable>();
	}
};

// Class FabricRuntime.FabricMeshReceiver
// 0x0000 (0x0030 - 0x0030)
class IFabricMeshReceiver final : public IInterface
{
public:
	void OnMeshInstanceReferencesChanged(const TArray<struct FFabricMeshInstanceReference>& MeshInstanceReferences, bool bMeshChanged, bool bInstancesChanged);
	void OnMeshInstancesChanged(const TArray<struct FTransform>& Meshes);
	void OnMeshReferenceChanged(const struct FFabricMeshProviderMeshReference& ReferenceMesh);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricMeshReceiver">();
	}
	static class IFabricMeshReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricMeshReceiver>();
	}
};

// Class FabricRuntime.FabricModulationNode
// 0x0020 (0x0050 - 0x0030)
class UFabricModulationNode final : public UObject
{
public:
	TArray<class UFabricFloatProviderBase*>       FloatProviders;                                    // 0x0030(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricModulationNode">();
	}
	static class UFabricModulationNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricModulationNode>();
	}
};

// Class FabricRuntime.FabricFloatProviderBase
// 0x0058 (0x0388 - 0x0330)
class UFabricFloatProviderBase : public UFabricModulatable
{
public:
	uint8                                         Pad_330[0x8];                                      // 0x0330(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(float Float, class UFabricFloatProviderBase* FloatProvider)> OnFloatChanged;                                    // 0x0338(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bEnabled, class UFabricFloatProviderBase* FloatProvider)> OnFloatProviderEnabledChanged;                     // 0x0348(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         CurrentFloat;                                      // 0x0358(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UMusicClockComponent>    MusicClock;                                        // 0x035C(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFabricMetaSoundModulatorPatchWrapper*  AssociatedPatchWrapper;                            // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 EnabledParam;                                      // 0x0370(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAlwaysModulates;                                  // 0x0380(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBindBlueprintOnFloatChanged;                      // 0x0381(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsEnabled;                                        // 0x0382(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bModulatorValueChanged;                            // 0x0383(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceiveTick(float DeltaSeconds);
	void SetAssociatedPatchWrapper(class UFabricMetaSoundModulatorPatchWrapper* PatchWrapper);
	void SetMusicClock(class UMusicClockComponent* NewMusicClock);
	void SetProviderEnabled(bool bInIsEnabled);

	class UFabricMetaSoundModulatorPatchWrapper* GetAssociatedPatchWrapper() const;
	float GetCurrentFloat() const;
	struct FMidiSongPos GetCurrentSongPos() const;
	struct FMidiSongPos GetCurrentSongPosWithOffset(float OffsetSeconds) const;
	float GetFloatAtSongPos(const struct FMidiSongPos& SongPos) const;
	EFabricFloatProviderType GetFloatProviderType() const;
	bool GetProviderEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricFloatProviderBase">();
	}
	static class UFabricFloatProviderBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricFloatProviderBase>();
	}
};

// Class FabricRuntime.FabricFloatProviderWave
// 0x0150 (0x04D8 - 0x0388)
class UFabricFloatProviderWave final : public UFabricFloatProviderBase
{
public:
	class FString                                 WaveShapeParam;                                    // 0x0388(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 FreeHzParam;                                       // 0x0398(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 MinParam;                                          // 0x03A8(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 MaxParam;                                          // 0x03B8(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 BeatDurationParam;                                 // 0x03C8(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 BeatOffsetParam;                                   // 0x03D8(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ShapeParam;                                        // 0x03E8(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 StyleParam;                                        // 0x03F8(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PhaseCPDIndex;                                     // 0x0408(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ValueCPDIndex;                                     // 0x040C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_410[0x78];                                     // 0x0410(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<TWeakObjectPtr<class UStaticMeshComponent>> PreviewDisplayMeshes;                              // 0x0488(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void AddPreviewDisplayMesh(class UStaticMeshComponent* Mesh);
	void ClearPreviewDisplayMeshes();
	TArray<class UStaticMeshComponent*> GetPreviewDisplayMeshes();
	void RemovePreviewDisplayMesh(class UStaticMeshComponent* Mesh);
	void SetFreePhase(float InFreePhase);
	void SetRandomSeedByGuid(const struct FGuid& InRandomGuid);

	float GetCurrentFreePhase() const;
	float GetCurrentPhase() const;
	int32 GetRandomSeed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricFloatProviderWave">();
	}
	static class UFabricFloatProviderWave* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricFloatProviderWave>();
	}
};

// Class FabricRuntime.FabricFloatProviderStep
// 0x0078 (0x0400 - 0x0388)
class UFabricFloatProviderStep final : public UFabricFloatProviderBase
{
public:
	class FString                                 StepRateParam;                                     // 0x0388(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ActiveStepsParam;                                  // 0x0398(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 StepParamBase;                                     // 0x03A8(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxSteps;                                          // 0x03B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFabricStepGenerator                   RuntimeGenerator;                                  // 0x03C0(0x0020)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnFloatProviderStepInitialized;                    // 0x03E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F0[0x10];                                     // 0x03F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetStepLengthBeats() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricFloatProviderStep">();
	}
	static class UFabricFloatProviderStep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricFloatProviderStep>();
	}
};

// Class FabricRuntime.FabricFloatProviderValueSetter
// 0x0080 (0x0408 - 0x0388)
class UFabricFloatProviderValueSetter final : public UFabricFloatProviderBase
{
public:
	class FString                                 ValueParam;                                        // 0x0388(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 TransitionTimingParam;                             // 0x0398(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A8[0x60];                                     // 0x03A8(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float BroadcastCurrentValue(float OverriddenBeat);

	float CalculateTransitionTiming() const;
	bool CanUsePredictiveBeatBroadcasting() const;
	float GetUpdateBeat() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricFloatProviderValueSetter">();
	}
	static class UFabricFloatProviderValueSetter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricFloatProviderValueSetter>();
	}
};

// Class FabricRuntime.FabricHoldable
// 0x0000 (0x0030 - 0x0030)
class IFabricHoldable final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricHoldable">();
	}
	static class IFabricHoldable* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricHoldable>();
	}
};

// Class FabricRuntime.FabricIndicatorComponent
// 0x0088 (0x0160 - 0x00D8)
class UFabricIndicatorComponent final : public UGameFrameworkComponent
{
public:
	TMulticastInlineDelegate<void(bool bNewEnabledState)> OnEnabledStateChanged;                             // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonUserWidget>          FabricTooltipWidgetType;                           // 0x00E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TargetsChangedTag;                                 // 0x00F0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  HUDTagsToHide;                                     // 0x0100(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UFortInputMappingContext*               IndicatorShowingInputContext;                      // 0x0120(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         IndicatorShowingPriority;                          // 0x0128(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           ShowMoreAction;                                    // 0x0130(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_138[0x28];                                     // 0x0138(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleTooltipsEnabledChanged();
	void OnIndicatorWidgetVisibilityChanged(const ESlateVisibility NewVisibility);
	void OnShowMoreActionTriggered(const struct FInputActionInstance& Instance);
	void SetIndicatorEnabled(bool bEnabled, bool bAllowWriteToSettings);
	void TryGetFortClientSettings();

	bool IsIndicatorEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricIndicatorComponent">();
	}
	static class UFabricIndicatorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricIndicatorComponent>();
	}
};

// Class FabricRuntime.FabricInteractableControllerComponent
// 0x00D0 (0x01A8 - 0x00D8)
class UFabricInteractableControllerComponent final : public UActorComponent
{
public:
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnNoInteractablesHit;                              // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AFortPlayerController*                  PlayerController;                                  // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortGadgetItemDefinition> FabricInteractionToolItemDefSoftPtr;               // 0x00F8(0x0030)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortGadgetItemDefinition> OverriddenFabricInteractionToolItemDefSoftPtr;     // 0x0128(0x0030)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortGadgetItemDefinition*              FabricInteractionToolItemDef;                      // 0x0158(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EnsurePlayerHasInteractionToolRetryDelay;          // 0x0160(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_164[0x14];                                     // 0x0164(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   SoftFabricDeviceBaseClass;                         // 0x0178(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ClientReceiveDoesIslandContainFabricDevices(const bool bIslandContainsFabricDevices);
	void EnsurePlayerHasInteractionTool();
	void GiveBackInteractionTool();
	void OnCreativeModeEnabledChangedDelegate(bool bCreativeEnabled);
	void ServerGivePlayerFabricInteractionTool();
	void ServerRequestDoesIslandContainFabricDevices();

	bool CanGiveBackInteractionTool() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricInteractableControllerComponent">();
	}
	static class UFabricInteractableControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricInteractableControllerComponent>();
	}
};

// Class FabricRuntime.FabricInteractable
// 0x0000 (0x0030 - 0x0030)
class IFabricInteractable final : public IInterface
{
public:
	bool CanInteractWithHoldable(const TScriptInterface<class IFabricHoldable>& Holdable);
	void EndInteraction(class APlayerController* PlayerController, bool bWasDragAndDropInteraction);
	EFabricContinuousInteractionDirection GetContinuousInteractableDirection();
	float GetContinuousInteractableValueNormalized();
	struct FVector GetInteractableComponentLocation(class USceneComponent* Interactable);
	struct FVector GetInteractableForwardVector(class USceneComponent* Interactable);
	EFabricInteractableType GetInteractableType();
	class UAudioComponent* GetInteractionSFX();
	class UObject* GetLinkedInteractable();
	bool IsFocusDependentOnInteractionContext(class APlayerController* Controller);
	bool IsValidToInteractWith(class APlayerController* Controller);
	void OnInteractionFocusTargetChanged(class APlayerController* Controller, class UObject* FocusTarget, bool bIsFocused);
	void SetFocused(bool bIsFocused);
	void SetHitComponent(class USceneComponent* HitComponent);
	void SetInteractable(bool bInteractable);
	bool ShouldPassInteractionToComponent(class AFabricInteractionTool* InteractionTool);
	void StartInteraction(class APlayerController* Controller);
	void StartSpecialInteraction(class APlayerController* Controller);

	bool DoesInteractionRequireHoldable() const;
	void GetInteractableDescription(class FText* OutDescription) const;
	void GetInteractableName(class FText* OutName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricInteractable">();
	}
	static class IFabricInteractable* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFabricInteractable>();
	}
};

// Class FabricRuntime.FabricInteractablePlayspaceComponent
// 0x0068 (0x0140 - 0x00D8)
class UFabricInteractablePlayspaceComponent final : public UPlayspaceComponent
{
public:
	uint8                                         Pad_D8[0x68];                                      // 0x00D8(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDownloadOnDemandCompleteIndividualClient(const struct FEventMessageTag& Channel, const struct FClientFinishedDownloadOnDemand& Context);
	void OnPlayspaceUserAdded(const struct FPlayspaceUser& PlayspaceUser);
	void SetFabricDeviceExistsInPlayspace();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricInteractablePlayspaceComponent">();
	}
	static class UFabricInteractablePlayspaceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricInteractablePlayspaceComponent>();
	}
};

// Class FabricRuntime.FabricInteractionTool
// 0x0200 (0x2260 - 0x2060)
class AFabricInteractionTool final : public AFortWeaponRanged
{
public:
	TMulticastInlineDelegate<void(EFabricInteractionToolStates NewState, class AFortCreativeDeviceProp* Device)> OnInteractionStateChanged;                         // 0x2060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortCreativeDeviceProp* Device)> OnCablesGrabbed;                                   // 0x2070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
