#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FabricLevelSequencer

#include "Basic.hpp"

#include "HarmonixMetasound_structs.hpp"
#include "FabricLevelSequencer_structs.hpp"
#include "HarmonixMidi_structs.hpp"
#include "FabricRuntime_structs.hpp"


namespace SDK::Params
{

// Function FabricLevelSequencer.FabricSongSyncComponent.AddLevelSequence
// 0x0030 (0x0030 - 0x0000)
struct FabricSongSyncComponent_AddLevelSequence final
{
public:
	TSoftObjectPtr<class ULevelSequence>          LevelSequenceAsset;                                // 0x0000(0x0030)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.AddLinkedSongSync
// 0x0008 (0x0008 - 0x0000)
struct FabricSongSyncComponent_AddLinkedSongSync final
{
public:
	class UFabricSongSyncComponent*               FollowerSongSync;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.LocalStopSongSync
// 0x0008 (0x0008 - 0x0000)
struct FabricSongSyncComponent_LocalStopSongSync final
{
public:
	class UFabricSongSyncComponent*               InAuthoritySongSync;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.OnClockAuthorityChanged
// 0x0018 (0x0018 - 0x0000)
struct FabricSongSyncComponent_OnClockAuthorityChanged final
{
public:
	EFabricMetasoundClock                         ClockType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         OldAuthority;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABuildingActor*                         NewAuthority;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.OnDiscontinuity
// 0x0088 (0x0088 - 0x0000)
struct FabricSongSyncComponent_OnDiscontinuity final
{
public:
	EMusicTimeDiscontinuityType                   DiscontinuityType;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMidiSongPos                           PreviousPos;                                       // 0x0008(0x0040)(Parm, NativeAccessSpecifierPublic)
	struct FMidiSongPos                           NewPos;                                            // 0x0048(0x0040)(Parm, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.OnLevelSequenceLooped
// 0x0008 (0x0008 - 0x0000)
struct FabricSongSyncComponent_OnLevelSequenceLooped final
{
public:
	struct FMusicTimestamp                        NewStartTimestamp;                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.OnMidiLooped
// 0x0008 (0x0008 - 0x0000)
struct FabricSongSyncComponent_OnMidiLooped final
{
public:
	struct FMusicTimestamp                        NewStartTimestamp;                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.OnTimelineSyncSeek
// 0x0080 (0x0080 - 0x0000)
struct FabricSongSyncComponent_OnTimelineSyncSeek final
{
public:
	struct FMidiSongPos                           ClientPos;                                         // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMidiSongPos                           ServerPos;                                         // 0x0040(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.ServerPlaySongSync
// 0x0008 (0x0008 - 0x0000)
struct FabricSongSyncComponent_ServerPlaySongSync final
{
public:
	struct FMusicTimestamp                        StartingTimestamp;                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.SetControllingTempoInGroup
// 0x0001 (0x0001 - 0x0000)
struct FabricSongSyncComponent_SetControllingTempoInGroup final
{
public:
	bool                                          bInControllingTempoInGroup;                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.SetFabricMetaSoundManager
// 0x0008 (0x0008 - 0x0000)
struct FabricSongSyncComponent_SetFabricMetaSoundManager final
{
public:
	class UFabricMetaSoundManagerComponent*       InFabricMetaSoundManager;                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.SetFabricMIDIPlayerPatchWrapper
// 0x0008 (0x0008 - 0x0000)
struct FabricSongSyncComponent_SetFabricMIDIPlayerPatchWrapper final
{
public:
	class UFabricMIDIPlayerPatchWrapper*          PatchWrapper;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.SetFabricTimelineSync
// 0x0008 (0x0008 - 0x0000)
struct FabricSongSyncComponent_SetFabricTimelineSync final
{
public:
	class UFabricTimelineSyncComponent*           InFabricTimelineSync;                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.SetLooping
// 0x0001 (0x0001 - 0x0000)
struct FabricSongSyncComponent_SetLooping final
{
public:
	bool                                          bInLooping;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.SetMidiFile
// 0x0008 (0x0008 - 0x0000)
struct FabricSongSyncComponent_SetMidiFile final
{
public:
	class UMidiFile*                              InMidiFile;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.SetPlaybackType
// 0x0001 (0x0001 - 0x0000)
struct FabricSongSyncComponent_SetPlaybackType final
{
public:
	EFabricSongSyncPlaybackType                   InPlaybackType;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.SetStartSeekToTimeSeconds
// 0x0004 (0x0004 - 0x0000)
struct FabricSongSyncComponent_SetStartSeekToTimeSeconds final
{
public:
	float                                         InStartSeekToTimeSeconds;                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.SetTimingType
// 0x0001 (0x0001 - 0x0000)
struct FabricSongSyncComponent_SetTimingType final
{
public:
	EFabricSongSyncTimingType                     InTimingType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.GetCurrentTimestamp
// 0x0008 (0x0008 - 0x0000)
struct FabricSongSyncComponent_GetCurrentTimestamp final
{
public:
	struct FMusicTimestamp                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.IsControllingTempo
// 0x0001 (0x0001 - 0x0000)
struct FabricSongSyncComponent_IsControllingTempo final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct FabricSongSyncComponent_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricLevelSequencer.FabricSongSyncComponent.MidiFileHasAnyTempoData
// 0x0010 (0x0010 - 0x0000)
struct FabricSongSyncComponent_MidiFileHasAnyTempoData final
{
public:
	class UMidiFile*                              InMidiFile;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

