#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FabricUI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FabricUI.FabricWidget.GetFabricViewModel
// 0x0008 (0x0008 - 0x0000)
struct FabricWidget_GetFabricViewModel final
{
public:
	class UFabricInteractableViewModel*           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricUI.FabricPlaybackTimeWidget.GetNamedSlotRightWidgetChild
// 0x0008 (0x0008 - 0x0000)
struct FabricPlaybackTimeWidget_GetNamedSlotRightWidgetChild final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricUI.FabricPlaybackTimeWidget.GetFormattedTimeFromSeconds
// 0x0018 (0x0018 - 0x0000)
struct FabricPlaybackTimeWidget_GetFormattedTimeFromSeconds final
{
public:
	float                                         Seconds;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FabricUI.FabricScreenWidget.AttachFabricWidget
// 0x0020 (0x0020 - 0x0000)
struct FabricScreenWidget_AttachFabricWidget final
{
public:
	TSubclassOf<class UFabricWidget>              FabricWidgetClass;                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              GridPosition;                                      // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFabricWidget*                          ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricUI.FabricScreenWidget.FindWidgetOfClass
// 0x0010 (0x0010 - 0x0000)
struct FabricScreenWidget_FindWidgetOfClass final
{
public:
	TSubclassOf<class UFabricWidget>              FabricWidgetClass;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFabricWidget*                          ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricUI.FabricScreenWidget.SetScreenGridDimensions
// 0x0010 (0x0010 - 0x0000)
struct FabricScreenWidget_SetScreenGridDimensions final
{
public:
	struct FVector2D                              InNewDimensions;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricUI.FabricWidgetComponent.SetShouldSuscribeToSignificanceSubsystem
// 0x0001 (0x0001 - 0x0000)
struct FabricWidgetComponent_SetShouldSuscribeToSignificanceSubsystem final
{
public:
	bool                                          ShouldSuscribe;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricUI.FabricWidgetComponent.GetTickMode
// 0x0001 (0x0001 - 0x0000)
struct FabricWidgetComponent_GetTickMode final
{
public:
	ETickMode                                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricUI.FabricWidgetTickControlSubsystem.RegisterFabricWidgetComponent
// 0x0008 (0x0008 - 0x0000)
struct FabricWidgetTickControlSubsystem_RegisterFabricWidgetComponent final
{
public:
	class UFabricWidgetComponent*                 WidgetComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FabricUI.FabricWidgetTickControlSubsystem.UnregisterFabricWidgetComponent
// 0x0008 (0x0008 - 0x0000)
struct FabricWidgetTickControlSubsystem_UnregisterFabricWidgetComponent final
{
public:
	class UFabricWidgetComponent*                 WidgetComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

