#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FabricLevelSequencer

#include "Basic.hpp"

#include "HarmonixMidi_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Enum FabricLevelSequencer.EFabricSongSyncTimingType
// NumValues: 0x0004
enum class EFabricSongSyncTimingType : uint8
{
	Immediate                                = 0,
	NextBeat                                 = 1,
	NextBar                                  = 2,
	EFabricSongSyncTimingType_MAX            = 3,
};

// Enum FabricLevelSequencer.EFabricSongSyncPlaybackType
// NumValues: 0x0004
enum class EFabricSongSyncPlaybackType : uint8
{
	ControlsTempo                            = 0,
	FromCurrentTime                          = 1,
	FromStart                                = 2,
	EFabricSongSyncPlaybackType_MAX          = 3,
};

// Enum FabricLevelSequencer.EFabricSongSyncClockState
// NumValues: 0x0004
enum class EFabricSongSyncClockState : uint8
{
	Playing                                  = 0,
	WillRestartInitiator                     = 1,
	WillRestartFollower                      = 2,
	EFabricSongSyncClockState_MAX            = 3,
};

// ScriptStruct FabricLevelSequencer.SongSyncPlaybackRequest
// 0x000C (0x000C - 0x0000)
struct FSongSyncPlaybackRequest final
{
public:
	struct FMusicTimestamp                        StartingTimestamp;                                 // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlay;                                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FabricLevelSequencer.SongSyncSequenceActor
// 0x0010 (0x0010 - 0x0000)
struct FSongSyncSequenceActor final
{
public:
	class ALevelSequenceActor*                    LevelSequenceActor;                                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitialized;                                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FabricLevelSequencer.LinkedSequence
// 0x0030 (0x0030 - 0x0000)
struct FLinkedSequence final
{
public:
	TSoftObjectPtr<class ULevelSequence>          LevelSequence;                                     // 0x0000(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FabricLevelSequencer.LinkedSongSync
// 0x0030 (0x0030 - 0x0000)
struct FLinkedSongSync final
{
public:
	TSoftObjectPtr<class AActor>                  LinkedSongSync;                                    // 0x0000(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FabricLevelSequencer.LinkedSongSyncList
// 0x0010 (0x0010 - 0x0000)
struct FLinkedSongSyncList final
{
public:
	TArray<struct FLinkedSongSync>                LinkedSongSyncs;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};

// ScriptStruct FabricLevelSequencer.UserOptionDefinitionLinkedSequenceMetaData
// 0x0000 (0x0008 - 0x0008)
struct FUserOptionDefinitionLinkedSequenceMetaData final : public FUserOptionDefinitionMetaData
{
};

// ScriptStruct FabricLevelSequencer.UserOptionDefinitionLinkedSongSyncListMetaData
// 0x0010 (0x0018 - 0x0008)
struct FUserOptionDefinitionLinkedSongSyncListMetaData final : public FUserOptionDefinitionMetaData
{
public:
	struct FLinkedSongSyncList                    DefaultValue;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

}

