#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FabricTooltipUI

#include "Basic.hpp"

#include "ModelViewViewModel_classes.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class FabricTooltipUI.FabricTooltipViewModel
// 0x0020 (0x0090 - 0x0070)
class UFabricTooltipViewModel final : public UMVVMViewModelBase
{
public:
	class FText                                   Name_0;                                            // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   Description;                                       // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricTooltipViewModel">();
	}
	static class UFabricTooltipViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricTooltipViewModel>();
	}
};

// Class FabricTooltipUI.FabricTooltipWidget
// 0x0060 (0x0590 - 0x0530)
class UFabricTooltipWidget final : public UFortActorIndicatorWidget
{
public:
	bool                                          bUseShortDescription;                              // 0x0530(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseShortDescriptionWithTouch;                     // 0x0531(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_532[0x2];                                      // 0x0532(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShortDescriptionHeight;                            // 0x0534(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ShowMoreThreshold;                                 // 0x0538(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ShowMoreText;                                      // 0x0540(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   ShowLessText;                                      // 0x0550(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UAthenaMarkerPointer*                   MarkerPointer;                                     // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_Description;                                  // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                               SizeBox_Description;                               // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           Panel_ShowMorePrompt;                              // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_ShowMorePrompt;                               // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowingFullDescription;                           // 0x0588(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InitTooltip(class AActor* TargetedActor, class UPrimitiveComponent* TargetedComponent);
	void SetShowMore(bool bShowingMore);
	void ToggleShowMore();
	void UpdateShowMore();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricTooltipWidget">();
	}
	static class UFabricTooltipWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricTooltipWidget>();
	}
};

}

