#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Face_PostProcess_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Face_PostProcess_AnimBP.Face_PostProcess_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0237 (0x0238 - 0x0001)
struct Face_PostProcess_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_13;                                 // 0x0004(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_14;                                 // 0x0010(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_15;                               // 0x0020(0x0028)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0048(0x00C0)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0108(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0120(0x0038)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig_1;                        // 0x0158(0x0038)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;                     // 0x0190(0x0038)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;                          // 0x01C8(0x0038)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RigLogic;                            // 0x0200(0x0038)()
};

// ScriptStruct Face_PostProcess_AnimBP.Face_PostProcess_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0000 (0x0001 - 0x0001)
struct FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
};

}

