#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FixedSwingingCodeRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class FixedSwingingCodeRuntime.FixedSwingingCheatManager
// 0x0000 (0x0030 - 0x0030)
class UFixedSwingingCheatManager final : public UChildCheatManager
{
public:
	void SpawnFixedSwingingProp();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FixedSwingingCheatManager">();
	}
	static class UFixedSwingingCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFixedSwingingCheatManager>();
	}
};

// Class FixedSwingingCodeRuntime.FixedSwingingComponent
// 0x00E0 (0x01C0 - 0x00E0)
class UFixedSwingingComponent final : public UFortPawnComponent
{
public:
	struct FGameplayTag                           MovementModeExtensionTag;                          // 0x00E0(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortMovementMode_BaseExtLogic> SwingingMovementModeExtension;                     // 0x00F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinimumHorizontalDistanceToSwingTarget;            // 0x00F8(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaximumAngleDeflectionToSwing;                     // 0x0130(0x0038)(Edit, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   CHEAT_FixedSwingingPropClass;                      // 0x0168(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class AFixedSwingingProp>         CHEAT_CachedFixedSwingingPropClass;                // 0x0198(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A0[0x20];                                     // 0x01A0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOwnerJumpInput(bool bPressed);
	void OnHideSwingPrompt();
	void OnShowSwingPrompt();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FixedSwingingComponent">();
	}
	static class UFixedSwingingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFixedSwingingComponent>();
	}
};

// Class FixedSwingingCodeRuntime.FixedSwingingProp
// 0x0008 (0x11D0 - 0x11C8)
class AFixedSwingingProp final : public ABuildingProp
{
public:
	bool                                          bIsOccupied;                                       // 0x11C8(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11C9[0x7];                                     // 0x11C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FixedSwingingProp">();
	}
	static class AFixedSwingingProp* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFixedSwingingProp>();
	}
};

// Class FixedSwingingCodeRuntime.FixedSwingingRegionComponent
// 0x0020 (0x0610 - 0x05F0)
class UFixedSwingingRegionComponent final : public UBoxComponent
{
public:
	struct FVector                                LocalSwingDirection;                               // 0x05F0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_608[0x8];                                      // 0x0608(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FixedSwingingRegionComponent">();
	}
	static class UFixedSwingingRegionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFixedSwingingRegionComponent>();
	}
};

// Class FixedSwingingCodeRuntime.FortMovementMode_FixedSwingingRuntimeData
// 0x0058 (0x00A0 - 0x0048)
class UFortMovementMode_FixedSwingingRuntimeData final : public UFortMovementMode_BaseExtRuntimeData
{
public:
	uint8                                         Pad_48[0x58];                                      // 0x0048(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_FixedSwingingRuntimeData">();
	}
	static class UFortMovementMode_FixedSwingingRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_FixedSwingingRuntimeData>();
	}
};

// Class FixedSwingingCodeRuntime.FortMovementMode_ExtLogicFixedSwinging
// 0x01F8 (0x0340 - 0x0148)
class UFortMovementMode_ExtLogicFixedSwinging final : public UFortMovementMode_BaseExtLogic
{
public:
	TSubclassOf<class UFortPlayerAnimInstance_FixedSwinging> SwingingAnimationLayer;                            // 0x0148(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         AttachPointWarpSpeed;                              // 0x0150(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         GravitationalAcceleration;                         // 0x0188(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FRuntimeFloatCurve                     SpeedCurve;                                        // 0x01C0(0x0088)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ExitAngleThreshold;                                // 0x0248(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ExitLaunchSpeed;                                   // 0x0280(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ExitLaunchAngle;                                   // 0x02B8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         RotationInterpSpeed;                               // 0x02F0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_328[0x18];                                     // 0x0328(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOwnerJumpInput(bool bPressed);
	void HandleOwnerTeleported(class AFortPawn* TeleportedOwner);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ExtLogicFixedSwinging">();
	}
	static class UFortMovementMode_ExtLogicFixedSwinging* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ExtLogicFixedSwinging>();
	}
};

// Class FixedSwingingCodeRuntime.FortPlayerAnimInstance_FixedSwinging
// 0x0010 (0x0510 - 0x0500)
class UFortPlayerAnimInstance_FixedSwinging final : public UFortBaseLayerAnimInstance
{
public:
	float                                         SwingPitch;                                        // 0x0500(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_504[0xC];                                      // 0x0504(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAnimInstance_FixedSwinging">();
	}
	static class UFortPlayerAnimInstance_FixedSwinging* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAnimInstance_FixedSwinging>();
	}
};

}

