#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FMJamSystemRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function FMJamSystemRuntime.JamControllerComponent.CanSuppressJamControls
// 0x0001 (0x0001 - 0x0000)
struct JamControllerComponent_CanSuppressJamControls final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamSystemRuntime.JamControllerComponent.GetControllerOfClass
// 0x0018 (0x0018 - 0x0000)
struct JamControllerComponent_GetControllerOfClass final
{
public:
	TSubclassOf<class AController>                ControllerType;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchChildTypes;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamSystemRuntime.JamControllerComponent_LoopOptions.OnFirstPawnSet
// 0x0010 (0x0010 - 0x0000)
struct JamControllerComponent_LoopOptions_OnFirstPawnSet final
{
public:
	class APawn*                                  OldPawn;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamSystemRuntime.JamControllerComponent_LoopOptions.OnJamBlockingTagChanged
// 0x0010 (0x0010 - 0x0000)
struct JamControllerComponent_LoopOptions_OnJamBlockingTagChanged final
{
public:
	struct FGameplayTag                           UpdatedTag;                                        // 0x0000(0x000C)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TagCount;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamSystemRuntime.JamControllerComponent_LoopOptions.OnPawnSetAfterBlockingTag
// 0x0010 (0x0010 - 0x0000)
struct JamControllerComponent_LoopOptions_OnPawnSetAfterBlockingTag final
{
public:
	class APawn*                                  OldPawn;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamSystemRuntime.JamControllerComponent_LoopOptions.ShouldAddJamCategoriesBeforeLocker
// 0x0001 (0x0001 - 0x0000)
struct JamControllerComponent_LoopOptions_ShouldAddJamCategoriesBeforeLocker final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamSystemRuntime.JamControllerComponent_LoopPreloader.OnPawnSet
// 0x0018 (0x0018 - 0x0000)
struct JamControllerComponent_LoopPreloader_OnPawnSet final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  OldPawn;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamSystemRuntime.JamControllerComponent_LoopPreloader.OnSongCatalogRetrieved
// 0x0001 (0x0001 - 0x0000)
struct JamControllerComponent_LoopPreloader_OnSongCatalogRetrieved final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamSystemRuntime.JamOnOffSwitchComponent.ShouldApplyJamOnSplitscreenLogic
// 0x0018 (0x0018 - 0x0000)
struct JamOnOffSwitchComponent_ShouldApplyJamOnSplitscreenLogic final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      ReferenceController;                               // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamSystemRuntime.JamOnOffSwitchComponent.OnPlayerStatePawnSet
// 0x0018 (0x0018 - 0x0000)
struct JamOnOffSwitchComponent_OnPlayerStatePawnSet final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  OldPawn;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamSystemRuntime.JamPlayerPawnComponent.GetPawnOfClass
// 0x0018 (0x0018 - 0x0000)
struct JamPlayerPawnComponent_GetPawnOfClass final
{
public:
	TSubclassOf<class APawn>                      PawnType;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchChildTypes;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamSystemRuntime.JamSystemEmoteBPFL.GetEmoteActionBinding
// 0x0048 (0x0048 - 0x0000)
struct JamSystemEmoteBPFL_GetEmoteActionBinding final
{
public:
	class FString                                 EmoteTemplateID;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FEmoteActionBinding                    OutCreatedEmote;                                   // 0x0010(0x0038)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function FMJamSystemRuntime.JamSystemEmoteBPFL.IsJamDebugDisplayEnabled
// 0x0001 (0x0001 - 0x0000)
struct JamSystemEmoteBPFL_IsJamDebugDisplayEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

