#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FNAnimUtilitiesEditor

#include "Basic.hpp"

#include "FNAnimUtilitiesEditor_structs.hpp"


namespace SDK::Params
{

// Function FNAnimUtilitiesEditor.AnimBlueprintNativizationEditorLibrary.CreateInterfaceSourceFile
// 0x0020 (0x0020 - 0x0000)
struct AnimBlueprintNativizationEditorLibrary_CreateInterfaceSourceFile final
{
public:
	class FString                                 InterfaceNameWithoutPrefix;                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InterfaceSaveDirectory;                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FNAnimUtilitiesEditor.AnimBlueprintNativizationEditorLibrary.DeleteVariablesWithNoReferences
// 0x0018 (0x0018 - 0x0000)
struct AnimBlueprintNativizationEditorLibrary_DeleteVariablesWithNoReferences final
{
public:
	class FString                                 Suffix;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlueprint*                             Blueprint;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FNAnimUtilitiesEditor.AnimBlueprintNativizationEditorLibrary.FindAndReplaceVariableReferences
// 0x0018 (0x0018 - 0x0000)
struct AnimBlueprintNativizationEditorLibrary_FindAndReplaceVariableReferences final
{
public:
	class FString                                 Suffix;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlueprint*                             Blueprint;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FNAnimUtilitiesEditor.AnimBlueprintNativizationEditorLibrary.GetCurrentBP
// 0x0018 (0x0018 - 0x0000)
struct AnimBlueprintNativizationEditorLibrary_GetCurrentBP final
{
public:
	class UAnimBlueprint*                         CurrentAnimBP;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 CurrentChooserData;                                // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlueprint*                             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FNAnimUtilitiesEditor.AnimBlueprintNativizationEditorLibrary.GetPluginNameForAssetPath
// 0x0020 (0x0020 - 0x0000)
struct AnimBlueprintNativizationEditorLibrary_GetPluginNameForAssetPath final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FNAnimUtilitiesEditor.AnimBlueprintNativizationEditorLibrary.GetSuggestedInterfaceName
// 0x0020 (0x0020 - 0x0000)
struct AnimBlueprintNativizationEditorLibrary_GetSuggestedInterfaceName final
{
public:
	class FString                                 BlueprintDisplayName;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FNAnimUtilitiesEditor.AnimBlueprintNativizationEditorLibrary.GetSuggestedNativeClassName
// 0x0028 (0x0028 - 0x0000)
struct AnimBlueprintNativizationEditorLibrary_GetSuggestedNativeClassName final
{
public:
	class FString                                 BlueprintDisplayName;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ParentClass;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FNAnimUtilitiesEditor.AnimBlueprintNativizationEditorLibrary.GetSuggestedNativePaths
// 0x0070 (0x0070 - 0x0000)
struct AnimBlueprintNativizationEditorLibrary_GetSuggestedNativePaths final
{
public:
	class FString                                 BlueprintPathString;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrentModuleName;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParentClassStringWithoutPrefix;                    // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HeaderSaveDirectory;                               // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CppSaveDirectory;                                  // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InterfaceSaveDirectory;                            // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SuggestedNewRuntimeModuleName;                     // 0x0060(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FNAnimUtilitiesEditor.AnimBlueprintNativizationEditorLibrary.GetSuperClass
// 0x0010 (0x0010 - 0x0000)
struct AnimBlueprintNativizationEditorLibrary_GetSuperClass final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FNAnimUtilitiesEditor.AnimBlueprintNativizationEditorLibrary.NativizationSetup
// 0x00C0 (0x00C0 - 0x0000)
struct AnimBlueprintNativizationEditorLibrary_NativizationSetup final
{
public:
	class FString                                 ClassNameWithoutPrefix;                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlueprint*                             Blueprint;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParentClassNameWithoutPrefix;                      // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HeaderSaveDirectory;                               // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CppSaveDirectory;                                  // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateNewRuntimeModule;                           // 0x0048(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NewRuntimeModuleName;                              // 0x0050(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPauseAfterSourceFilesCreated;                     // 0x0060(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                DuplicatedBlueprint;                               // 0x0068(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimBlueprintNativizationSetupContext InputContext;                                      // 0x0070(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimBlueprintNativizationSetupContext ReturnValue;                                       // 0x0098(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FNAnimUtilitiesEditor.AnimBlueprintNativizationEditorLibrary.ResetNativizationSetup
// 0x0050 (0x0050 - 0x0000)
struct AnimBlueprintNativizationEditorLibrary_ResetNativizationSetup final
{
public:
	struct FAnimBlueprintNativizationSetupContext Context;                                           // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimBlueprintNativizationSetupContext ReturnValue;                                       // 0x0028(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

}

