#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FNE_ConversationRuntime_0

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "FNE_ConversationRuntime_0_structs.hpp"


namespace SDK::Params
{

// Function FNE_ConversationRuntime.FNECon_conversation_component.$InitCDO
// 0x00A0 (0x00A0 - 0x0000)
struct FNECon_conversation_component__InitCDO final
{
public:
	uint8                                         _ExprResult_0 : 1;                                 // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_0_1 : 7;                                    // 0x0000(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_1 : 1;                                 // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_1_1 : 7;                                    // 0x0001(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_2 : 1;                                 // 0x0002(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_3;                                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFNECon_conversation_database*          _ExprResult_5;                                     // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_6;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResult_7;                                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_8;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_9;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_10;                                    // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_11;                               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_12 : 1;                                // 0x0050(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_50_1 : 7;                                   // 0x0050(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_13 : 1;                                // 0x0051(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_51_1 : 7;                                   // 0x0051(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_14 : 1;                                // 0x0052(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_15;                                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_16 : 1;                                // 0x0060(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFNECon_conversation_database*          _ExprResult_17;                                    // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_18;                               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResult_19;                                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_20;                                    // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_21;                               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_22;                                    // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_23;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function FNE_ConversationRuntime.FNECon_conversation_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct FNECon_conversation_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient final
{
public:
	struct FNE_ConversationRuntime_0::Ftuple_L_R  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function FNE_ConversationRuntime.FNECon_conversation_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fFNECon_2fconversation__component_N_REndAllConversations
// 0x0001 (0x0001 - 0x0000)
struct FNECon_conversation_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fFNECon_2fconversation__component_N_REndAllConversations final
{
public:
	struct FNE_ConversationRuntime_0::Ftuple_L_R  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function FNE_ConversationRuntime.FNECon_conversation_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fFNECon_2fconversation__component_N_REndConversation_L_Nagent_R
// 0x0008 (0x0008 - 0x0000)
struct FNECon_conversation_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fFNECon_2fconversation__component_N_REndConversation_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function FNE_ConversationRuntime.FNECon_conversation_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fFNECon_2fconversation__component_N_RGetSpeakerName
// 0x0060 (0x0060 - 0x0000)
struct FNECon_conversation_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fFNECon_2fconversation__component_N_RGetSpeakerName final
{
public:
	struct FNE_ConversationRuntime_0::Ftuple_L_R  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerse_message*                         RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0010(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x0028(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0038(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
};

// Function FNE_ConversationRuntime.FNECon_conversation_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fFNECon_2fconversation__component_N_RMakeMessage_L_N_Kchar_R
// 0x0268 (0x0268 - 0x0000)
struct FNECon_conversation_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fFNECon_2fconversation__component_N_RMakeMessage_L_N_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UVerse_message*                         RetVal;                                            // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__string_R _ExprResult_1;                                     // 0x0030(0x0070)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x00A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x00B0(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UVerse_localizable_string*> _ExprResult_4;                                     // 0x00C0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0110(0x0010)(HasGetValueTypeHash)
	class UVerse_localizable_string*              _ExprResultStack_6;                                // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0128(0x0018)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x0140(0x0018)(HasGetValueTypeHash)
	struct Ftuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__string_R _ExprResult_9;                                     // 0x0158(0x0070)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_10;                                    // 0x01C8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x01D8(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UVerse_localizable_string*> _ExprResult_12;                                    // 0x01E8(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_13;                                    // 0x0238(0x0010)(HasGetValueTypeHash)
	class UVerse_localizable_string*              _ExprResultStack_14;                               // 0x0248(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_15;                                        // 0x0250(0x0018)(HasGetValueTypeHash)
};

// Function FNE_ConversationRuntime.FNECon_conversation_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fFNECon_2fconversation__component_N_RSetSpeakerName_L_Nmessage_R
// 0x0008 (0x0008 - 0x0000)
struct FNECon_conversation_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fFNECon_2fconversation__component_N_RSetSpeakerName_L_Nmessage_R final
{
public:
	class UVerse_message*                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function FNE_ConversationRuntime.FNECon_conversation_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fFNECon_2fconversation__component_N_RStartConversation_L_Nagent_R
// 0x0008 (0x0008 - 0x0000)
struct FNECon_conversation_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fFNECon_2fconversation__component_N_RStartConversation_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function FNE_ConversationRuntime.FNECon_conversation_component._L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable
// 0x0001 (0x0001 - 0x0000)
struct FNECon_conversation_component__L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable final
{
public:
	struct FNE_ConversationRuntime_0::Ftuple_L_R  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function FNE_ConversationRuntime.FNECon_conversation_component._L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable
// 0x0001 (0x0001 - 0x0000)
struct FNECon_conversation_component__L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable final
{
public:
	struct FNE_ConversationRuntime_0::Ftuple_L_R  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function FNE_ConversationRuntime.FNECon_conversation_component._L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled
// 0x0003 (0x0003 - 0x0000)
struct FNECon_conversation_component__L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled final
{
public:
	struct FNE_ConversationRuntime_0::Ftuple_L_R  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

