#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FNE_ConversationRuntime

#include "Basic.hpp"

#include "LocalizableMessage_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class FNE_ConversationRuntime.ConversationEntityProxyActor
// 0x0058 (0x0478 - 0x0420)
class AConversationEntityProxyActor final : public AActor
{
public:
	TArray<class AController*>                    ControllersInConversation;                         // 0x0420(0x0010)(Net, ZeroConstructor, RepNotify, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class USceneComponent*                        RootSceneComponent;                                // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortNonPlayerConversationParticipantComponent* NonPlayerConversationComponent;                    // 0x0438(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLocalizableMessage                    SpeakerName;                                       // 0x0440(0x0030)(Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	class UObject*                                CachedConversationEntityComponent;                 // 0x0470(0x0008)(Net, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnRep_ControllersInConversation();
	void OnRep_SpeakerName();
	void OnServerConversationEnded(class AActor* ParticipantActorPlayer);
	void OnServerConversationStarted(class AActor* ParticipantActorPlayer, const struct FGameplayTag& ParticipantID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationEntityProxyActor">();
	}
	static class AConversationEntityProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AConversationEntityProxyActor>();
	}
};

// Class FNE_ConversationRuntime.FNE_NonPlayerConversationParticipantComponent
// 0x0000 (0x06C8 - 0x06C8)
class UFNE_NonPlayerConversationParticipantComponent final : public UFortNonPlayerConversationParticipantComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FNE_NonPlayerConversationParticipantComponent">();
	}
	static class UFNE_NonPlayerConversationParticipantComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFNE_NonPlayerConversationParticipantComponent>();
	}
};

}

