#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FNE_UILibrary

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "CommonUI_classes.hpp"
#include "FNE_UILibrary_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class FNE_UILibrary.FNE_ModularButton
// 0x0010 (0x1810 - 0x1800)
class UFNE_ModularButton : public UCommonButtonBase
{
public:
	TArray<class UFNE_UIBlock*>                   ModularBlocks;                                     // 0x1800(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void RegisterModularBlock(class UFNE_UIBlock* Block);
	void RequestInstantTransitionOnBlocks(EFNE_UIBlockInstantTransitionState State);
	void RequestTransitionOnBlocks(EFNE_UIBlockVisualState State);
	void SetBlocksTiming(const struct FFNE_UIBlockTiming& Timing);
	void UnregisterAllModularBlocks();
	void UnregisterModularBlock(class UFNE_UIBlock* Block);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FNE_ModularButton">();
	}
	static class UFNE_ModularButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFNE_ModularButton>();
	}
};

// Class FNE_UILibrary.FNE_UIBlock
// 0x0040 (0x0458 - 0x0418)
class UFNE_UIBlock final : public UUserWidget
{
public:
	TMulticastInlineDelegate<void()>              ViewportResizedEvent;                              // 0x0418(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FFNE_UIBlockTiming                     TransitionTiming;                                  // 0x0428(0x002C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetTransitionTime(EFNE_UIBlockVisualState State);
	void OnInstantTransitionToDeselected();
	void OnInstantTransitionToDisabled();
	void OnInstantTransitionToEnabled();
	void OnInstantTransitionToLocked();
	void OnInstantTransitionToSelected();
	void OnInstantTransitionToUnlocked();
	void OnTransitionDeselectedFocusedRequested();
	void OnTransitionDeselectedIdleRequested();
	void OnTransitionDisabledRequested();
	void OnTransitionEnabledRequested();
	void OnTransitionFocusedRequested();
	void OnTransitionHoveredRequested();
	void OnTransitionPressedRequested();
	void OnTransitionReleasedRequested();
	void OnTransitionSelectedRequested();
	void OnTransitionUnfocusedRequested();
	void OnTransitionUnhoveredRequested();
	void PlayTransition(class UWidgetAnimation* Animation, const bool bPlayForward);
	void RequestInstantTransition(EFNE_UIBlockInstantTransitionState State);
	void RequestTransition(EFNE_UIBlockVisualState State);
	void SetBlockTiming(const struct FFNE_UIBlockTiming& Timing);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FNE_UIBlock">();
	}
	static class UFNE_UIBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFNE_UIBlock>();
	}
};

// Class FNE_UILibrary.FNE_UIBlueprintFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class UFNE_UIBlueprintFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void PlayAnimationDuringTime(class UUserWidget* Widget, class UWidgetAnimation* Animation, const float PlayTime, const bool bPlayForward);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FNE_UIBlueprintFunctionLibrary">();
	}
	static class UFNE_UIBlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFNE_UIBlueprintFunctionLibrary>();
	}
};

// Class FNE_UILibrary.FNE_CTAButton
// 0x0020 (0x1830 - 0x1810)
class UFNE_CTAButton final : public UFNE_ModularButton
{
public:
	class FText                                   Text;                                              // 0x1810(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   SecondaryText;                                     // 0x1820(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	void BP_SetSecondaryText(const class FText& ButtonSecondaryText);
	void BP_SetText(const class FText& ButtonText);
	void SetSecondaryText(const class FText& ButtonSecondaryText);
	void SetText(const class FText& ButtonText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FNE_CTAButton">();
	}
	static class UFNE_CTAButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFNE_CTAButton>();
	}
};

// Class FNE_UILibrary.FNE_StylableButton
// 0x0020 (0x1830 - 0x1810)
class UFNE_StylableButton final : public UFNE_ModularButton
{
public:
	class FText                                   Text;                                              // 0x1810(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   SecondaryText;                                     // 0x1820(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	void BP_SetSecondaryText(const class FText& ButtonSecondaryText);
	void BP_SetText(const class FText& ButtonText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FNE_StylableButton">();
	}
	static class UFNE_StylableButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFNE_StylableButton>();
	}
};

}

