#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FNE_ConversationRuntime_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Entity_0_classes.hpp"
#include "VerseAssets_0_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass FNE_ConversationRuntime.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class FNE_ConversationRuntime_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass FNE_ConversationRuntime.$SolarisSignatureFunctionOuter", true>();
	}
	static class FNE_ConversationRuntime_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<FNE_ConversationRuntime_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass FNE_ConversationRuntime.FNECon_conversation_component
// 0x0068 (0x00B8 - 0x0050)
class UFNECon_conversation_component final : public Ucomponent
{
public:
	uint8                                         __verse_0x5CDFC2A5_Enabled : 1;                    // 0x0050(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Net, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_50_1 : 7;                                   // 0x0050(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x7C5B6343_ShowNameWhenNearby : 1;         // 0x0051(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_51_1 : 7;                                   // 0x0051(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0xA89F1EDE_ShowIndicatorBubble : 1;        // 0x0052(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0x78107DFF_IndicatorBubbleRange;           // 0x0058(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x6EF46B10_ShowConversationText : 1;       // 0x0060(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFNECon_conversation_database*          __verse_0x2AFE2AC7_ConversationDatabase;           // 0x0068(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_70[0x30];                                      // 0x0070(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         __verse_0xB8B80D31_MaximumParticipatingAgents;     // 0x00A0(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __verse_0x1EA0DE50_ConversationStartedEvent;       // 0x00A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x23D944E3_ConversationEndedEvent;         // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct FNE_ConversationRuntime_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fFNECon_2fconversation__component_N_REndAllConversations(const struct FNE_ConversationRuntime_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fFNECon_2fconversation__component_N_REndConversation_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	class UVerse_message* _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fFNECon_2fconversation__component_N_RGetSpeakerName(const struct FNE_ConversationRuntime_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UVerse_message* _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fFNECon_2fconversation__component_N_RMakeMessage_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fFNECon_2fconversation__component_N_RSetSpeakerName_L_Nmessage_R(class UVerse_message* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fFNECon_2fconversation__component_N_RStartConversation_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(const struct FNE_ConversationRuntime_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(const struct FNE_ConversationRuntime_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(const struct FNE_ConversationRuntime_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FNECon_conversation_component">();
	}
	static class UFNECon_conversation_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFNECon_conversation_component>();
	}
};

// VerseClass FNE_ConversationRuntime.FNECon_conversation_database
// 0x0000 (0x00C0 - 0x00C0)
class UFNECon_conversation_database final : public UAssets_asset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FNECon_conversation_database">();
	}
	static class UFNECon_conversation_database* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFNECon_conversation_database>();
	}
};

}

