#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FNE_VolumeRuntime

#include "Basic.hpp"

#include "PlayspaceSystem_classes.hpp"
#include "FNE_VolumeRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Class FNE_VolumeRuntime.FNE_Volume
// 0x0000 (0x04D0 - 0x04D0)
class AFNE_Volume final : public AGameplayVolume
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FNE_Volume">();
	}
	static class AFNE_Volume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFNE_Volume>();
	}
};

// Class FNE_VolumeRuntime.FNE_VolumeComponent
// 0x00A0 (0x0370 - 0x02D0)
class UFNE_VolumeComponent final : public UChildActorComponent
{
public:
	TMulticastInlineDelegate<void(class APlayerState* PlayerState)> OnPlayerStateBeginOverlap;                         // 0x02C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class APlayerState* PlayerState)> OnPlayerStateEndOverlap;                           // 0x02D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* OtherActor)> OnOtherActorBeginOverlap;                          // 0x02E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* OtherActor)> OnOtherActorEndOverlap;                            // 0x02F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bEnableOverlap;                                    // 0x0308(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EFNEVolumeShapeTypeEnum, class UStaticMesh*> FNEVolumeShapeMap;                                 // 0x0310(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class USpatialGameplayActorTrackerComponent*  SpatialGameplayActorTracker;                       // 0x0360(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool BindToOnOtherActorBeginOverlap(const TDelegate<void(class AActor* OtherActor)>& InEvent);
	bool BindToOnOtherActorEndOverlap(const TDelegate<void(class AActor* OtherActor)>& InEvent);
	class UOverlapComponent* GetSpawnedVolumeBoundsComponent();
	void HandleNotifyActorBeginOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void HandleNotifyActorEndOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void HandleNotifyPlayerStateBeginOverlap(class APlayerState* TouchingPlayerState, class AGameplayVolume* Volume);
	void HandleNotifyPlayerStateEndOverlap(class APlayerState* TouchingPlayerState, class AGameplayVolume* Volume);
	void SetEnableOverlap(const bool bEnable);
	void SetRelativeScale3DForBoundsComponent(const struct FVector& Scale3D);
	bool SetStaticMeshForBoundsComponent(class UStaticMesh* NewMesh);
	void UnBindFromOnOtherActorBeginOverlap(const TDelegate<void(class AActor* OtherActor)>& InEvent);
	void UnBindFromOnOtherActorEndOverlap(const TDelegate<void(class AActor* OtherActor)>& InEvent);
	void UpdateOverLapShape(EFNEVolumeShapeTypeEnum EShape, const bool bUseCustomShape, class UStaticMesh* CustomShape);

	TArray<class APawn*> GetAllPlayerPawns() const;
	TArray<class APlayerState*> GetAllPlayerStates() const;
	TArray<class AActor*> GetAllTrackedActors() const;
	bool GetEnableOverlap() const;
	class AFNE_Volume* GetSpawnedVolume() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FNE_VolumeComponent">();
	}
	static class UFNE_VolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFNE_VolumeComponent>();
	}
};

// Class FNE_VolumeRuntime.FNE_VolumeOverlapComponent
// 0x0140 (0x07E0 - 0x06A0)
class UFNE_VolumeOverlapComponent final : public UStaticMeshComponent
{
public:
	TMulticastInlineDelegate<void(class APlayerState* PlayerState)> OnPlayerStateBeginOverlap;                         // 0x06A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class APlayerState* PlayerState)> OnPlayerStateEndOverlap;                           // 0x06B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* OtherActor)> OnOtherActorBeginOverlap;                          // 0x06C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* OtherActor)> OnOtherActorEndOverlap;                            // 0x06D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	EVolumeEnableOverlapBehavior                  EnableOverlapBehavior;                             // 0x06E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EFNEVolumeShapeTypeEnum, class UStaticMesh*> FNEVolumeShapeMap;                                 // 0x06E8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	EFNEVolumeShapeTypeEnum                       SceneQueryShape;                                   // 0x0738(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_739[0x7];                                      // 0x0739(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      SceneQueryObjectTypes;                             // 0x0740(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_750[0x30];                                     // 0x0750(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AFortMinigame>           CachedMinigame;                                    // 0x0780(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSet<class AActor*>                           TrackedActors;                                     // 0x0788(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7D8[0x8];                                      // 0x07D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActorEnteredVolume(class AActor* EnteringActor);
	void ActorExitVolume(class AActor* LeavingActor);
	bool BindToOnOtherActorBeginOverlap(const TDelegate<void(class AActor* OtherActor)>& InEvent);
	bool BindToOnOtherActorEndOverlap(const TDelegate<void(class AActor* OtherActor)>& InEvent);
	void CheckCollidingActorsSceneQuery();
	void ComponentAddedToMinigame(class AFortMinigame* Minigame);
	void HandleTrackedActorEndPlay(class AActor* Actor, EEndPlayReason EndPlayReason);
	void OnBeginActorOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnEndActorOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnMinigameEnded();
	void OnMinigameRoundEnded(class AFortPlayerController* Instigator, EFortMinigameEnd EndMethod, EFortMinigameState NextState);
	void OnMinigameStarted();
	void SetEnableOverlapBehavior(const EVolumeEnableOverlapBehavior InOverlapBehavior);
	void SetRelativeScale3DForBoundsComponent(const struct FVector& Scale3D);
	bool SetStaticMeshForBoundsComponent(class UStaticMesh* NewMesh);
	void SetVolumeMaterial(TSoftObjectPtr<class UMaterialInterface> MaterialToLoad, int32 ElementIndex);
	bool ShouldAllowOverlapEventToFire(class AActor* OverlapActor);
	void UnBindFromOnOtherActorBeginOverlap(const TDelegate<void(class AActor* OtherActor)>& InEvent);
	void UnBindFromOnOtherActorEndOverlap(const TDelegate<void(class AActor* OtherActor)>& InEvent);
	void UpdateOverlapShape(EFNEVolumeShapeTypeEnum EShape, const bool bUseCustomShape, class UStaticMesh* CustomShape);

	TArray<class APawn*> GetAllPlayerPawns() const;
	TArray<class APlayerState*> GetAllPlayerStates() const;
	TArray<class AActor*> GetAllTrackedActors() const;
	EVolumeEnableOverlapBehavior GetEnableOverlap() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FNE_VolumeOverlapComponent">();
	}
	static class UFNE_VolumeOverlapComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFNE_VolumeOverlapComponent>();
	}
};

}

