#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortMetasound

#include "Basic.hpp"


namespace SDK
{

// Enum FortMetasound.EFortMetaSoundAutoInterfaceTypes
// NumValues: 0x0005
enum class EFortMetaSoundAutoInterfaceTypes : uint8
{
	None                                     = 0,
	Movement                                 = 1,
	Time                                     = 2,
	ActiveSound                              = 4,
	EFortMetaSoundAutoInterfaceTypes_MAX     = 5,
};

// Enum FortMetasound.EFortAudioAffiliation
// NumValues: 0x0005
enum class EFortAudioAffiliation : uint8
{
	Local                                    = 0,
	Friendly                                 = 1,
	Enemy                                    = 2,
	Neutral                                  = 3,
	EFortAudioAffiliation_MAX                = 4,
};

// ScriptStruct FortMetasound.FortMetaSoundCacheEntry
// 0x0038 (0x0038 - 0x0000)
struct FFortMetaSoundCacheEntry final
{
public:
	TSoftObjectPtr<class UMetaSoundSource>        MetaSound;                                         // 0x0000(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxInstancesToCache;                               // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSharedCache;                                   // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FortMetasound.FortMetaSoundCache
// 0x0010 (0x0010 - 0x0000)
struct FFortMetaSoundCache final
{
public:
	TArray<struct FFortMetaSoundCacheEntry>       CacheEntries;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FortMetasound.CachedMetaSoundContainer
// 0x0010 (0x0010 - 0x0000)
struct FCachedMetaSoundContainer final
{
public:
	TArray<class UMetaSoundSource*>               CachedMetaSounds;                                  // 0x0000(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

}

