#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteGameDebuggersRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonConversationRuntime_structs.hpp"


namespace SDK
{

// Enum FortniteGameDebuggersRuntime.EQuestDebuggerMenuTab
// NumValues: 0x0004
enum class EQuestDebuggerMenuTab : uint8
{
	None                                     = 0,
	Client                                   = 1,
	Server                                   = 2,
	EQuestDebuggerMenuTab_MAX                = 3,
};

// Enum FortniteGameDebuggersRuntime.EQuestDebuggerOwnerFilter
// NumValues: 0x0005
enum class EQuestDebuggerOwnerFilter : uint8
{
	None                                     = 0,
	Owned                                    = 1,
	Unowned                                  = 2,
	OwnedByLocalPlayer                       = 3,
	MAX                                      = 4,
};

// ScriptStruct FortniteGameDebuggersRuntime.InjectedBehaviorDebugInfo
// 0x00A0 (0x00A0 - 0x0000)
struct FInjectedBehaviorDebugInfo final
{
public:
	TSubclassOf<class UFortInjectedBehavior>      InjectedBehavior;                                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      ItemQueryFilter;                                   // 0x0008(0x0048)(NativeAccessSpecifierPublic)
	class UFortItemDefinition*                    ItemFilter;                                        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      PawnTagQueryFilter;                                // 0x0058(0x0048)(NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.BehaviorInjectionItemDebugInfo
// 0x0018 (0x0018 - 0x0000)
struct FBehaviorInjectionItemDebugInfo final
{
public:
	class UItemDefinitionBase*                    ItemDefinition;                                    // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ItemName;                                          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FortniteGameDebuggersRuntime.BehaviorInjectionInjectionPointDebugInfo
// 0x0030 (0x0030 - 0x0000)
struct FBehaviorInjectionInjectionPointDebugInfo final
{
public:
	struct FGameplayTag                           InjectionTag;                                      // 0x0000(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInjectedBehaviorDebugInfo>     InjectedBehaviors;                                 // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInjectedBehaviorDebugInfo>     RejectedBehaviors;                                 // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.BehaviorInjectionDebugInfo
// 0x0048 (0x0048 - 0x0000)
struct FBehaviorInjectionDebugInfo final
{
public:
	class AActor*                                 DebugActor;                                        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PawnTags;                                          // 0x0008(0x0020)(NativeAccessSpecifierPublic)
	TArray<struct FBehaviorInjectionInjectionPointDebugInfo> TagInjectionInfo;                                  // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBehaviorInjectionItemDebugInfo> Items;                                             // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.ConversationServiceInfo
// 0x0030 (0x0030 - 0x0000)
struct FConversationServiceInfo final
{
public:
	struct FServiceSupportedQueryResult           SupportedServiceQueryResult;                       // 0x0000(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
	struct FSupportedService                      SupportedService;                                  // 0x0008(0x0028)(NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.FailedAndHiddenClientConversationOptionEntry
// 0x0010 (0x0078 - 0x0068)
struct FFailedAndHiddenClientConversationOptionEntry final : public FClientConversationOptionEntry
{
public:
	TArray<struct FFortDebugInfoKeyValue>         FailedRequirements;                                // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.ConversationParticipantInfo
// 0x0014 (0x0014 - 0x0000)
struct FConversationParticipantInfo final
{
public:
	TWeakObjectPtr<class AActor>                  Actor;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ParticipantID;                                     // 0x0008(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.ConversationQuestAndFilterCategoryInfo
// 0x0038 (0x0038 - 0x0000)
struct FConversationQuestAndFilterCategoryInfo final
{
public:
	struct FSoftObjectPath                        QuestAsset;                                        // 0x0000(0x0028)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           OptionalFilterCategory;                            // 0x0028(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FortniteGameDebuggersRuntime.ConversationInstanceInfo
// 0x00A0 (0x00A0 - 0x0000)
struct FConversationInstanceInfo final
{
public:
	TArray<struct FClientConversationOptionEntry> VisibleChoices;                                    // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FFailedAndHiddenClientConversationOptionEntry> FailedAndHiddenChoices;                            // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FConversationParticipantInfo>   Participants;                                      // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FClientConversationMessagePayload      LastMessage;                                       // 0x0030(0x0070)(NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.ConversationProviderStateSnapshot
// 0x0108 (0x0108 - 0x0000)
struct FConversationProviderStateSnapshot final
{
public:
	class FString                                 DisplayName;                                       // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ConversationEntryTag;                              // 0x0010(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ServiceProviderTag;                                // 0x001C(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanStartConversationWithLocalPlayer;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDesiresConversationWithLocalPlayer;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInActiveConversation;                             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortDebugInfoCollector                GeneralDebugInfo;                                  // 0x0030(0x0030)(NativeAccessSpecifierPublic)
	struct FFortDebugInfoCollector                EntryTagHistoryKeyValueData;                       // 0x0060(0x0030)(NativeAccessSpecifierPublic)
	struct FFortDebugInfoCollector                ParticipantHistoryKeyValueData;                    // 0x0090(0x0030)(NativeAccessSpecifierPublic)
	TArray<struct FConversationServiceInfo>       SupportedServiceInfo;                              // 0x00C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNPCSaleInventoryRow>           SupportedSaleInfo;                                 // 0x00D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FConversationQuestAndFilterCategoryInfo> SupportedQuestInfo;                                // 0x00E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         MaxNumQuestsToSupport;                             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConversationInstanceInfo>      ActiveConversations;                               // 0x00F8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.QuestObjectiveSnapshot
// 0x0038 (0x0038 - 0x0000)
struct FQuestObjectiveSnapshot final
{
public:
	class FName                                   BackendName;                                       // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FilterSummary;                                     // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AchievedCount;                                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RequiredCount;                                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class APlayerState>            LastContributingPlayer;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FQuestItemComponentDebuggerDisplayData> ComponentData;                                     // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.QuestSnapshot
// 0x0050 (0x0050 - 0x0000)
struct FQuestSnapshot final
{
public:
	class FString                                 QuestID;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  Owner;                                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FManagerParticipantSubsetID            ParticipantSubsetID;                               // 0x0018(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParticipantSubsetIDDesc;                           // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQuestParticipationScope                      OwningManagerScope;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FQuestObjectiveSnapshot>        ObjectiveSnapshots;                                // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           ComponentCategories;                               // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.ParticipantDebugInfo
// 0x000C (0x000C - 0x0000)
struct FParticipantDebugInfo final
{
public:
	TWeakObjectPtr<class APlayerState>            PlayerParticipant;                                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuestInstanceParticipantConfiguration ParticipantConfiguration;                          // 0x0008(0x0001)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FortniteGameDebuggersRuntime.ParticipantSubsetDebugInfo
// 0x0020 (0x0020 - 0x0000)
struct FParticipantSubsetDebugInfo final
{
public:
	struct FManagerParticipantSubsetID            SubsetID;                                          // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SubsetDebugName;                                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FParticipantDebugInfo>          Participants;                                      // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.QuestManagerStateSnapshot
// 0x0040 (0x0040 - 0x0000)
struct FQuestManagerStateSnapshot final
{
public:
	TArray<struct FQuestSnapshot>                 ActiveQuestSnapshots;                              // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FParticipantSubsetDebugInfo>    ParticipantSubsets;                                // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FParticipantSubsetGrantedQuestData> ParticipantSubsetGrantedQuestData;                 // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FParticipantSubsetUpdatedQuestObjectiveData> ParticipantSubsetUpdatedQuestObjectiveData;        // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.VerbProcessorSnapshot
// 0x0038 (0x0038 - 0x0000)
struct FVerbProcessorSnapshot final
{
public:
	class FString                                 ProcessorName;                                     // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ProcessorClass;                                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVerbProcessorEventSnapshot            VerbProcessorEventSnapshot;                        // 0x0018(0x0020)(NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.VerbEventManagerSnapshot
// 0x0020 (0x0020 - 0x0000)
struct FVerbEventManagerSnapshot final
{
public:
	class FString                                 EventManagerName;                                  // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventManagerEventsDebugInfo;                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.VerbParticipantSnapshot
// 0x0020 (0x0020 - 0x0000)
struct FVerbParticipantSnapshot final
{
public:
	class FString                                 ParticipantName;                                   // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         EventManagerNames;                                 // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.VerbContextCollectorSnapshot
// 0x0010 (0x0010 - 0x0000)
struct FVerbContextCollectorSnapshot final
{
public:
	class FString                                 CollectorName;                                     // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.VerbWorldEventManagerSnapshot
// 0x0010 (0x0010 - 0x0000)
struct FVerbWorldEventManagerSnapshot final
{
public:
	class FString                                 WorldEventManagerName;                             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.VerbProcessorStateSnapshot
// 0x0050 (0x0050 - 0x0000)
struct FVerbProcessorStateSnapshot final
{
public:
	TArray<struct FVerbProcessorSnapshot>         VerbProcessorSnapshots;                            // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVerbEventManagerSnapshot>      VerbEventManagerSnapshots;                         // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVerbParticipantSnapshot>       VerbParticipantSnapshots;                          // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVerbContextCollectorSnapshot>  VerbContextCollectorSnapshots;                     // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVerbWorldEventManagerSnapshot> VerbWorldEventManagerSnapshots;                    // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.WorldReactionSnapshot
// 0x0018 (0x0018 - 0x0000)
struct FWorldReactionSnapshot final
{
public:
	class FString                                 WorldReactionName;                                 // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTriggered;                                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FortniteGameDebuggersRuntime.WorldStateSnapshot
// 0x0010 (0x0010 - 0x0000)
struct FWorldStateSnapshot final
{
public:
	class FString                                 WorldStateName;                                    // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.WorldStatSnapshot
// 0x0018 (0x0018 - 0x0000)
struct FWorldStatSnapshot final
{
public:
	class FString                                 WorldStatName;                                     // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        WorldStatCount;                                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FortniteGameDebuggersRuntime.WorldProgressionStateSnapshot
// 0x0030 (0x0030 - 0x0000)
struct FWorldProgressionStateSnapshot final
{
public:
	TArray<struct FWorldReactionSnapshot>         WorldReactionSnapshots;                            // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWorldStateSnapshot>            WorldStateSnapshots;                               // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWorldStatSnapshot>             WorldStatSnapshots;                                // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

}

