#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortLiveLink

#include "Basic.hpp"

#include "LiveLinkInterface_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class FortLiveLink.FortLiveMannequin
// 0x0028 (0x0898 - 0x0870)
class AFortLiveMannequin : public AFortPlayerMannequin
{
public:
	struct FLiveLinkSubjectName                   FaceSubject;                                       // 0x0870(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLiveLinkSubjectName                   BodySubject;                                       // 0x087C(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULiveLinkRetargetAsset>     BodyRetargetAsset;                                 // 0x0888(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateInEditor;                                   // 0x0890(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisibil;                                          // 0x0891(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_892[0x6];                                      // 0x0892(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyBodySubject(const struct FLiveLinkSubjectName& inBodySubject);
	void ApplyFaceSubject(const struct FLiveLinkSubjectName& inFaceSubject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortLiveMannequin">();
	}
	static class AFortLiveMannequin* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortLiveMannequin>();
	}
};

}

