#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortImGuiCore

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class FortImGuiCore.DebuggableObject
// 0x0000 (0x0030 - 0x0030)
class IDebuggableObject final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DebuggableObject">();
	}
	static class IDebuggableObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDebuggableObject>();
	}
};

// Class FortImGuiCore.ImGuiDebugMenuBase
// 0x0230 (0x0650 - 0x0420)
#pragma pack(push, 0x1)
class alignas(0x10) AImGuiDebugMenuBase : public AActor
{
public:
	uint8                                         Pad_420[0xA0];                                     // 0x0420(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      PrivateLocalPlayerController;                      // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C8[0x180];                                    // 0x04C8(0x0180)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ToggleInputLock();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImGuiDebugMenuBase">();
	}
	static class AImGuiDebugMenuBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AImGuiDebugMenuBase>();
	}
};
#pragma pack(pop)

// Class FortImGuiCore.ImGuiReplicatedDebugMenuBase
// 0x0010 (0x0660 - 0x0650)
class AImGuiReplicatedDebugMenuBase : public AImGuiDebugMenuBase
{
public:
	uint8                                         Pad_648[0x18];                                     // 0x0648(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ServerClose();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImGuiReplicatedDebugMenuBase">();
	}
	static class AImGuiReplicatedDebugMenuBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AImGuiReplicatedDebugMenuBase>();
	}
};

// Class FortImGuiCore.ObjectDebuggerMenu
// 0x0130 (0x0780 - 0x0650)
class AObjectDebuggerMenu final : public AImGuiDebugMenuBase
{
public:
	uint8                                         Pad_648[0x138];                                    // 0x0648(0x0138)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectDebuggerMenu">();
	}
	static class AObjectDebuggerMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<AObjectDebuggerMenu>();
	}
};

}

