#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortOcclusionNetRelevancy

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "IrisCore_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortOcclusionNetRelevancy_structs.hpp"


namespace SDK
{

// Class FortOcclusionNetRelevancy.FortOcclusionClientStatsComponent
// 0x0028 (0x0100 - 0x00D8)
class UFortOcclusionClientStatsComponent final : public UActorComponent
{
public:
	int32                                         NumPawnsWithinRelevancyRange;                      // 0x00D8(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumPawnsCulled;                                    // 0x00DC(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bServerSystemEnabled;                              // 0x00E0(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bServerUsingOcclusionFilter;                       // 0x00E1(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        OccludedLocations;                                 // 0x00E8(0x0010)(Net, ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_IsSystemEnabled();
	void OnRep_IsUsingOcclusionFilter();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortOcclusionClientStatsComponent">();
	}
	static class UFortOcclusionClientStatsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortOcclusionClientStatsComponent>();
	}
};

// Class FortOcclusionNetRelevancy.FortOcclusionNetRelevancyServerDebug
// 0x0058 (0x0478 - 0x0420)
class AFortOcclusionNetRelevancyServerDebug final : public AActor
{
public:
	struct FFortOcclusionNetRelevancyStats        ServerCurrentStats;                                // 0x0420(0x0050)(Net, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_470[0x8];                                      // 0x0470(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortOcclusionNetRelevancyServerDebug">();
	}
	static class AFortOcclusionNetRelevancyServerDebug* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortOcclusionNetRelevancyServerDebug>();
	}
};

// Class FortOcclusionNetRelevancy.FortOcclusionNetRelevancyWorldSubsystem
// 0x0138 (0x0180 - 0x0048)
class UFortOcclusionNetRelevancyWorldSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_48[0xA0];                                      // 0x0048(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APawn*>                          AllPawns;                                          // 0x00E8(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   PawnClass;                                         // 0x00F8(0x0030)(Transient, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class APawn>                      PawnClassLoaded;                                   // 0x0128(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECollisionChannel                             CollisionChannelForOcclusionTraces;                // 0x0130(0x0001)(ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortOcclusionNetRelevancyServerDebug*  ServerDebugActor;                                  // 0x0138(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_140[0x40];                                     // 0x0140(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FilterActorForAllConections(class AActor* Actor, bool bOccluded);
	void OnPawnEndPlay(class AActor* Actor, EEndPlayReason EndPlayReason);
	void SetActorOccludedToConnections(class AActor* Actor, const TArray<int32>& ConnectionIds, bool bOccluded);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortOcclusionNetRelevancyWorldSubsystem">();
	}
	static class UFortOcclusionNetRelevancyWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortOcclusionNetRelevancyWorldSubsystem>();
	}
};

// Class FortOcclusionNetRelevancy.NetObjectGridOcclusionFilter
// 0x0018 (0x0180 - 0x0168)
class UNetObjectGridOcclusionFilter final : public UNetObjectGridWorldLocFilter
{
public:
	uint8                                         Pad_168[0x18];                                     // 0x0168(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetObjectGridOcclusionFilter">();
	}
	static class UNetObjectGridOcclusionFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetObjectGridOcclusionFilter>();
	}
};

}

