#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortMetasound

#include "Basic.hpp"

#include "FortMetasound_structs.hpp"
#include "Engine_classes.hpp"
#include "GameFeatures_classes.hpp"


namespace SDK
{

// Class FortMetasound.FortMetaSoundCacheDefinition
// 0x0010 (0x0048 - 0x0038)
class UFortMetaSoundCacheDefinition final : public UDataAsset
{
public:
	struct FFortMetaSoundCache                    Cache;                                             // 0x0038(0x0010)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMetaSoundCacheDefinition">();
	}
	static class UFortMetaSoundCacheDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMetaSoundCacheDefinition>();
	}
};

// Class FortMetasound.FortGameFeatureAction_PrecacheMetaSounds
// 0x0070 (0x00B0 - 0x0040)
class UFortGameFeatureAction_PrecacheMetaSounds final : public UGameFeatureAction_AudioActionBase
{
public:
	bool                                          bDefineCacheInline;                                // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMetaSoundCacheDefinition*          CacheDefinition;                                   // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortMetaSoundCache                    InlineCacheDefinition;                             // 0x0050(0x0010)(Edit, NativeAccessSpecifierPublic)
	TMap<uint32, struct FCachedMetaSoundContainer> CachedMetaSoundsForDevice;                         // 0x0060(0x0050)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameFeatureAction_PrecacheMetaSounds">();
	}
	static class UFortGameFeatureAction_PrecacheMetaSounds* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameFeatureAction_PrecacheMetaSounds>();
	}
};

// Class FortMetasound.FortMetaSoundInterfaceSubsystem
// 0x00C0 (0x00F8 - 0x0038)
class UFortMetaSoundInterfaceSubsystem final : public UAudioEngineSubsystem
{
public:
	uint8                                         Pad_38[0xC0];                                      // 0x0038(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMetaSoundInterfaceSubsystem">();
	}
	static class UFortMetaSoundInterfaceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMetaSoundInterfaceSubsystem>();
	}
};

}

