#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "CommonUILegacy_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "FortniteAI_structs.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SocialUMG_structs.hpp"
#include "SocialUMG_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CommonInput_structs.hpp"
#include "CommonInput_classes.hpp"
#include "LinkId_structs.hpp"
#include "InputCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ModelViewViewModel_classes.hpp"
#include "MotdOverride_classes.hpp"
#include "EpicMediaBasePlayer_structs.hpp"
#include "Slate_structs.hpp"
#include "EpicMediaVideoWidgetBase_classes.hpp"
#include "LauncherSocialTypes_structs.hpp"
#include "Party_structs.hpp"
#include "GameFeatures_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "BlueprintContext_classes.hpp"
#include "OnlineSubsystemMcp_structs.hpp"
#include "DynamicUI_classes.hpp"
#include "LinkEntry_structs.hpp"
#include "Hotfix_structs.hpp"
#include "FortniteVersion_structs.hpp"
#include "GameplayMessages_structs.hpp"
#include "CosmeticsFrameworkLoadouts_structs.hpp"
#include "McpProfileSys_structs.hpp"
#include "AudioMixer_structs.hpp"
#include "UIChart_structs.hpp"
#include "UIChart_classes.hpp"


namespace SDK
{

// Class FortniteUI.AthenaCreativeItemTileView
// 0x0020 (0x0DC0 - 0x0DA0)
class UAthenaCreativeItemTileView final : public UCommonTileView
{
public:
	class UFortOptionsTab*                        ParentTab;                                         // 0x0DA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                              CurrentlyFocusedItem;                              // 0x0DA8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DB0[0x10];                                     // 0x0DB0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCreativeItemTileView">();
	}
	static class UAthenaCreativeItemTileView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCreativeItemTileView>();
	}
};

// Class FortniteUI.FortUIGameFeatureAction
// 0x0000 (0x0030 - 0x0030)
class UFortUIGameFeatureAction : public UGameFeatureAction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIGameFeatureAction">();
	}
	static class UFortUIGameFeatureAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIGameFeatureAction>();
	}
};

// Class FortniteUI.FortUIGameFeatureAction_AddRichTextDecorators
// 0x0010 (0x0040 - 0x0030)
class UFortUIGameFeatureAction_AddRichTextDecorators final : public UFortUIGameFeatureAction
{
public:
	TArray<struct FFortRichTextDecoratorExtension> AdditionalRichTextDecorators;                      // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIGameFeatureAction_AddRichTextDecorators">();
	}
	static class UFortUIGameFeatureAction_AddRichTextDecorators* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIGameFeatureAction_AddRichTextDecorators>();
	}
};

// Class FortniteUI.AccoladeProductData
// 0x0010 (0x0048 - 0x0038)
class UAccoladeProductData final : public UDataAsset
{
public:
	TArray<struct FAthenaCollectionScreenContainerTabInfo> TabInfos;                                          // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AccoladeProductData">();
	}
	static class UAccoladeProductData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccoladeProductData>();
	}
};

// Class FortniteUI.FortBacchusControlsHelp
// 0x0030 (0x05A8 - 0x0578)
class UFortBacchusControlsHelp final : public UCommonActivatableWidget
{
public:
	class UFortBacchusControlsDiagram*            ControlsDiagram;                                   // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_TouchClose;                                 // 0x0580(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    CloseAction;                                       // 0x0588(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A0[0x8];                                      // 0x05A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCloseAction();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBacchusControlsHelp">();
	}
	static class UFortBacchusControlsHelp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBacchusControlsHelp>();
	}
};

// Class FortniteUI.FortSocialButton
// 0x0020 (0x1870 - 0x1850)
class UFortSocialButton final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_1850[0x10];                                    // 0x1850(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_NumFriends;                                   // 0x1860(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_ActiveInviteBang;                            // 0x1868(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnNumFriendsTextUpdated(const int32 FriendsOnline);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSocialButton">();
	}
	static class UFortSocialButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSocialButton>();
	}
};

// Class FortniteUI.FortAsyncAction_LoadCurrentSubgameProfiles
// 0x0028 (0x0060 - 0x0038)
class UFortAsyncAction_LoadCurrentSubgameProfiles final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnSuccess;                                         // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFailure;                                         // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AFortPlayerController*                  PlayerController;                                  // 0x0058(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UFortAsyncAction_LoadCurrentSubgameProfiles* LoadCurrentSubgameProfiles(class AFortPlayerController* PlayerController_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAsyncAction_LoadCurrentSubgameProfiles">();
	}
	static class UFortAsyncAction_LoadCurrentSubgameProfiles* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAsyncAction_LoadCurrentSubgameProfiles>();
	}
};

// Class FortniteUI.AllSelectSubsystem
// 0x0008 (0x0040 - 0x0038)
class UAllSelectSubsystem final : public ULocalPlayerSubsystem
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AllSelectSubsystem">();
	}
	static class UAllSelectSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAllSelectSubsystem>();
	}
};

// Class FortniteUI.FortHUDElementWidget
// 0x0048 (0x0488 - 0x0440)
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	uint8                                         Pad_440[0x8];                                      // 0x0440(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ElementTag;                                        // 0x0448(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  HUDElementTag;                                     // 0x0458(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	ESlateVisibility                              HiddenVisibility;                                  // 0x0478(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRequiresAnElementTag;                             // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_47A[0x6];                                      // 0x047A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTutorialHighlight*                     TutorialHighlight;                                 // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void AppendHUDElementTags(const struct FGameplayTagContainer& AdditionalTags);
	void HandleGetHUDElementWidgetsForTags(const struct FGameplayTagContainer& HUDElementTags, TArray<class UFortHUDElementWidget*>* OutWidgets);
	void HandleOnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenHUDElementTags);
	void OnPlayerControllerSet_BP();
	void OnVisibilitySetEvent(ESlateVisibility InVisibility);

	bool HasAnyTags(const struct FGameplayTagContainer& InTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHUDElementWidget">();
	}
	static class UFortHUDElementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHUDElementWidget>();
	}
};

// Class FortniteUI.SquadComsKey
// 0x0008 (0x0490 - 0x0488)
class USquadComsKey final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleBindNPCConvertEvent(class AFortPlayerController* PlayerController, class AActor* OldViewTarget, class AActor* NewViewTarget);
	void HandleOnNPCConvertEvent(class AFortPawn* ConvertedFortPawn);
	void HandleOnNPCUnconvertEvent(class AFortPawn* UnconvertedFortPawn, const EUnconvertReason UnconvertReason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SquadComsKey">();
	}
	static class USquadComsKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<USquadComsKey>();
	}
};

// Class FortniteUI.LTMWidgetBase
// 0x0070 (0x04F8 - 0x0488)
class ULTMWidgetBase : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_488[0x40];                                     // 0x0488(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AFortGameplayMutator>       MutatorClassToWaitFor;                             // 0x04C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortGameplayMutator*                   CachedGameplayMutator;                             // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4D8[0x1];                                      // 0x04D8(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPrioritizedWidgetData             PrioritizationData;                                // 0x04D9(0x0002)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4DB[0x1D];                                     // 0x04DB(0x001D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void K2_OnBecomeActive();
	void K2_OnBecomeInactive();
	void OnHandleSpectatingChanged(class AFortPlayerStateZone* SpectatingTarget);
	void OnMutatorAvailable_BP(const class AFortGameplayMutator* MutatorActor);
	void OnStompedByOtherWidget();
	void OnStompFailed();

	class AFortPlayerStateAthena* GetViewingPlayerState() const;
	uint8 GetViewingTeam() const;
	bool K2_HasActiveContent() const;
	void SetPlayerPortrait(class AFortPlayerStateAthena* Player, class UFortLazyImage* PortraitImage) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LTMWidgetBase">();
	}
	static class ULTMWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULTMWidgetBase>();
	}
};

// Class FortniteUI.CobaltPlayersLeftWidgetBase
// 0x0018 (0x0510 - 0x04F8)
class UCobaltPlayersLeftWidgetBase final : public ULTMWidgetBase
{
public:
	uint8                                         Pad_4F8[0x18];                                     // 0x04F8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateDisplay(int32 NewTeamPlayersLeft, int32 NewEnemyPlayersLeft);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CobaltPlayersLeftWidgetBase">();
	}
	static class UCobaltPlayersLeftWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCobaltPlayersLeftWidgetBase>();
	}
};

// Class FortniteUI.AthenaSpatialScreen
// 0x00A0 (0x0618 - 0x0578)
class UAthenaSpatialScreen : public UCommonActivatableWidget
{
public:
	bool                                          bEnableSpatialInputPreprocessing;                  // 0x0578(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableAnalytics;                                  // 0x0579(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_57A[0x2];                                      // 0x057A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           OverrideScreenTag;                                 // 0x057C(0x000C)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_Back;                                       // 0x0588(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ScreenTag;                                         // 0x0590(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_59C[0x4];                                      // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    Button_TouchBack;                                  // 0x05A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bNeedsBottomBar;                                   // 0x05A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A9[0x6F];                                     // 0x05A9(0x006F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddSpatialScreenSessionCounter(const class FString& Entry, int32 Count);
	void FireSpatialScreenAnalytic(const class FString& Interaction);
	void OnInputSuspensionChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaSpatialScreen">();
	}
	static class UAthenaSpatialScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSpatialScreen>();
	}
};

// Class FortniteUI.DonutChallengeScreen
// 0x00A0 (0x06B8 - 0x0618)
class UDonutChallengeScreen final : public UAthenaSpatialScreen
{
public:
	uint8                                         Pad_618[0x18];                                     // 0x0618(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameStateComponent_EventLevel*     EventGameStateComponent;                           // 0x0630(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSeasonItemDefinition*            SeasonData;                                        // 0x0638(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   CustomMouseCursorWidget;                           // 0x0640(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UDonutChallengeEntryHeader> HeaderEntryClass;                                  // 0x0670(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UDonutChallengeEntry>       EntryClass;                                        // 0x0678(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortChallengeBundleItemDefinition*> DonutBundles;                                      // 0x0680(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UFortChallengeBundleItemDefinition*     SkinUnlockBundle;                                  // 0x0690(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_AttractChallengeDescription;                  // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_BattlepassUpsell;                           // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonHierarchicalScrollBox*           ScrollBox_Challenges;                              // 0x06A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_Challenges;                               // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ScrollToEndOfChallenges();
	void SetEntryFocus();
	void SetStyledCursorEnabled(bool bEnableStyledCursor);
	void ShowSkinUnlockMessage(bool bShowMessage, int32 InChallengeNum);
	void UpdateBPOwnedStateVisuals(bool bInOwnsBattlePass);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DonutChallengeScreen">();
	}
	static class UDonutChallengeScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDonutChallengeScreen>();
	}
};

// Class FortniteUI.AthenaChallengeComponentWidget
// 0x0000 (0x0418 - 0x0418)
class UAthenaChallengeComponentWidget : public UUserWidget
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaChallengeComponentWidget">();
	}
	static class UAthenaChallengeComponentWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaChallengeComponentWidget>();
	}
};

// Class FortniteUI.BallerRaceIntroWidget
// 0x0008 (0x0500 - 0x04F8)
class UBallerRaceIntroWidget final : public ULTMWidgetBase
{
public:
	float                                         LengthOfCountdown;                                 // 0x04F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ShowIntro();
	void StartCountdown();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BallerRaceIntroWidget">();
	}
	static class UBallerRaceIntroWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBallerRaceIntroWidget>();
	}
};

// Class FortniteUI.HUDLayoutToolV2_LinkAcrossActionSetting
// 0x0078 (0x04B8 - 0x0440)
class UHUDLayoutToolV2_LinkAcrossActionSetting final : public UCommonUserWidget
{
public:
	uint8                                         Pad_440[0x10];                                     // 0x0440(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           EnabledCheckBoxBorderColor;                        // 0x0450(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           DisabledCheckBoxBorderColor;                       // 0x0460(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPaperSprite*                           CheckMarkSprite;                                   // 0x0470(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_478[0x10];                                     // 0x0478(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 Image_ActionIcon;                                  // 0x0488(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ActionName;                                   // 0x0490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHUDLayoutToolV2_LinkAcrossWarningIndicator* LinkAcrossWarningIndicator_Warning;                // 0x0498(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHUDLayoutToolV2_LinkAcrossNumericalIndicator* NumericalIndicator_ActionImpact;                   // 0x04A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_CheckboxBorder;                              // 0x04A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHUDLayoutToolV2_Button*                Button_SelectAction;                               // 0x04B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDLayoutToolV2_LinkAcrossActionSetting">();
	}
	static class UHUDLayoutToolV2_LinkAcrossActionSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDLayoutToolV2_LinkAcrossActionSetting>();
	}
};

// Class FortniteUI.AthenaAIKillsBase
// 0x0018 (0x04A0 - 0x0488)
class UAthenaAIKillsBase final : public UFortHUDElementWidget
{
public:
	class UTextBlock*                             KillsText;                                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                KillsSource;                                       // 0x0490(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCustomKillSource;                                 // 0x0498(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetKillsSourcePlayerController(class AFortPlayerControllerAthena* InPlayerController);
	void SetKillsSourcePlayerState(class AFortPlayerStateAthena* InPlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAIKillsBase">();
	}
	static class UAthenaAIKillsBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAIKillsBase>();
	}
};

// Class FortniteUI.AthenaChallengeListEntryContextInterface
// 0x0000 (0x0030 - 0x0030)
class IAthenaChallengeListEntryContextInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaChallengeListEntryContextInterface">();
	}
	static class IAthenaChallengeListEntryContextInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAthenaChallengeListEntryContextInterface>();
	}
};

// Class FortniteUI.AthenaItemElementWidgetBase
// 0x0020 (0x0460 - 0x0440)
class UAthenaItemElementWidgetBase : public UCommonUserWidget
{
public:
	uint8                                         Pad_440[0x8];                                      // 0x0440(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDesignTime_SetItemToRepresent;                    // 0x0448(0x0001)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    DesignTime_ItemDefinitionToRepresent;              // 0x0450(0x0008)(Edit, ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         DesignTime_ItemStackCount;                         // 0x0458(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDesignTime_SetItemRarity;                         // 0x045C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFortRarity                                   DesignTime_ItemRarity;                             // 0x045D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_45E[0x2];                                      // 0x045E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleItemChanged(bool bItemChanged, bool bAmmoChanged, bool bIngredientsChanged);
	void OnItemRarityUpdated(const EFortRarity ItemRarity, const struct FFortRarityItemData& RarityItemData);
	void OnPostItemToRepresentChanged(const class UFortItem* ItemToRepresent);
	void OnPreItemToRepresentChanged(const class UFortItem* ItemToRepresent);
	void SetItemToRepresent(const class UFortItem* ItemToRepresent);

	const class UFortItem* GetItemToRepresent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaItemElementWidgetBase">();
	}
	static class UAthenaItemElementWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaItemElementWidgetBase>();
	}
};

// Class FortniteUI.AthenaItemTierWidget
// 0x0010 (0x0470 - 0x0460)
class UAthenaItemTierWidget final : public UAthenaItemElementWidgetBase
{
public:
	class UDynamicEntryBox*                       EntryBox_TierPips;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDesignTime_UpdateItemTier;                        // 0x0468(0x0001)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFortItemTier                                 DesignTime_ItemTier;                               // 0x0469(0x0001)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_46A[0x6];                                      // 0x046A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnItemTierUpdated(const EFortItemTier ItemTier);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaItemTierWidget">();
	}
	static class UAthenaItemTierWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaItemTierWidget>();
	}
};

// Class FortniteUI.FortItemListViewInterface
// 0x0000 (0x0030 - 0x0030)
class IFortItemListViewInterface final : public IInterface
{
public:
	void CenterSelectedItemListEntryWidget();
	void ClearCustomItemList();
	void HandleItemEvolutionBegun(const class FString& OriginalItemInstanceId);
	void HandleItemEvolutionCompleted(const bool bWasSuccessful, const class FString& OriginalItemInstanceId, const TArray<struct FFortItemInstanceQuantityPair>& ItemQuantities);
	void HandleItemRarityUpgradeBegun(const class FString& OriginalItemInstanceId);
	void HandleItemRarityUpgradeCompleted(const bool bWasSuccessful, const class FString& OriginalItemInstanceId, const TArray<struct FFortItemInstanceQuantityPair>& ItemQuantities);
	void HandleItemRefundBegun(const class FString& OriginalItemInstanceId);
	void HandleItemRefundCompleted(const bool bWasSuccessful, const class FString& OriginalItemInstanceId, const TArray<struct FFortItemInstanceQuantityPair>& ItemQuantities);
	void HideNullItemListEntry();
	void RefreshFilterAndSort();
	void RefreshSort();
	void SetConfig(const struct FFortItemListViewConfig& Config);
	void SetCustomItemList(const TArray<class UFortItem*>& ItemList);
	void SetFilter(const struct FFortItemFilterDefinition& Filter);
	void SetFilterAndSorter(const struct FFortItemFilterDefinition& Filter, const struct FFortItemSorterDefinition& Sorter);
	void SetItemViewContext(TScriptInterface<class IFortItemViewContextInterface> ItemViewContext);
	void SetSorter(const struct FFortItemSorterDefinition& Sorter);
	void ShowNullItemListEntry();

	bool ContainsItem(const class UFortItem* Item) const;
	const struct FFortItemListViewConfig GetConfig() const;
	const struct FFortItemFilterDefinition GetFilter() const;
	const struct FFortItemSorterDefinition GetSorter() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemListViewInterface">();
	}
	static class IFortItemListViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortItemListViewInterface>();
	}
};

// Class FortniteUI.AthenaFPSBase
// 0x0028 (0x0468 - 0x0440)
class UAthenaFPSBase final : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                       FPS;                                               // 0x0440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_448[0x20];                                     // 0x0448(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleShowFPSChanged(bool bInShowFPS);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaFPSBase">();
	}
	static class UAthenaFPSBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaFPSBase>();
	}
};

// Class FortniteUI.FortSubscriptionPlatformModal
// 0x0030 (0x05A8 - 0x0578)
class UFortSubscriptionPlatformModal : public UCommonActivatableWidget
{
public:
	class UCommonButtonLegacy*                    Button_Back;                                       // 0x0578(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_TouchBack;                                  // 0x0580(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ModalId;                                           // 0x0588(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_598[0x10];                                     // 0x0598(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ExitModal();
	void OnModalBackout();
	void SendSubscriptionAnalyticsEvent(const class FString& Interaction);
	void SetPlatformSpecificEntries(const TArray<class FText>& Entries);
	void SetPlatformSpecificQRCode(const class FString& QRCodeAssetURL);

	class FText GetSubscriptionNextBillingDateAsText() const;
	bool IsOnActiveSubscriptionPlatform() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSubscriptionPlatformModal">();
	}
	static class UFortSubscriptionPlatformModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSubscriptionPlatformModal>();
	}
};

// Class FortniteUI.FortSubscriptionCrewBlingInfoModal
// 0x0000 (0x05A8 - 0x05A8)
class UFortSubscriptionCrewBlingInfoModal final : public UFortSubscriptionPlatformModal
{
public:
	class FText FormatBulletPoint(const class FText& InBulletPoint);
	void SetPlatformGenericEntries(const TArray<class FText>& Entries);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSubscriptionCrewBlingInfoModal">();
	}
	static class UFortSubscriptionCrewBlingInfoModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSubscriptionCrewBlingInfoModal>();
	}
};

// Class FortniteUI.PerkAvailableAlertBaseWidget
// 0x0008 (0x0500 - 0x04F8)
class UPerkAvailableAlertBaseWidget final : public ULTMWidgetBase
{
public:
	TWeakObjectPtr<class AFortAthenaMutator_PerkSystemMutator> CachedMutator;                                     // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnPerkAvailibilityChanged(int32 TagCount);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PerkAvailableAlertBaseWidget">();
	}
	static class UPerkAvailableAlertBaseWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerkAvailableAlertBaseWidget>();
	}
};

// Class FortniteUI.FortMobileHUDElement
// 0x0038 (0x04C0 - 0x0488)
class UFortMobileHUDElement : public UFortHUDElementWidget
{
public:
	struct FGameplayTag                           SizePropertyTag;                                   // 0x0488(0x000C)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_494[0x14];                                     // 0x0494(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 Image_Background;                                  // 0x04A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ForcedZOrder;                                      // 0x04B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShouldFillParent;                                 // 0x04B4(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4B5[0x3];                                      // 0x04B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UScaleBox*                              ScaleBox_HUDWidgetScale;                           // 0x04B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnHUDThemeChanged(const EHUDLayoutToolTheme EHUDLayoutToolTheme);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileHUDElement">();
	}
	static class UFortMobileHUDElement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileHUDElement>();
	}
};

// Class FortniteUI.AthenaMapPlayersLeftWidget
// 0x0028 (0x04B0 - 0x0488)
class UAthenaMapPlayersLeftWidget final : public UFortHUDElementWidget
{
public:
	class UCommonTextBlock*                       Text_PlayersTeamsLeft;                             // 0x0488(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                   PlayersTeamsLeftTextFormat;                        // 0x0490(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4A0[0x10];                                     // 0x04A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandlePlayersLeftChanged(int32 NumPlayersLeft);
	void HandleTeamsLeftChanged(int32 NumTeamsLeft);
	void OnMaxSquadSizeSet(int32 MaxSquadSize);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaMapPlayersLeftWidget">();
	}
	static class UAthenaMapPlayersLeftWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMapPlayersLeftWidget>();
	}
};

// Class FortniteUI.FortReplayBrowserRenameDialog
// 0x0038 (0x05B0 - 0x0578)
class UFortReplayBrowserRenameDialog final : public UCommonActivatableWidget
{
public:
	int32                                         MaxReplayNameLength;                               // 0x0578(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEditableText*                          TextBox_Name;                                      // 0x0580(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Confirm;                                    // 0x0588(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Decline;                                    // 0x0590(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_TapToClose;                                 // 0x0598(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A0[0x10];                                     // 0x05A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleTextChanged(const class FText& Text);
	void HandleTextCommitted(const class FText& Text, ETextCommit CommitMethod);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortReplayBrowserRenameDialog">();
	}
	static class UFortReplayBrowserRenameDialog* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortReplayBrowserRenameDialog>();
	}
};

// Class FortniteUI.BacchusHUDElement
// 0x0020 (0x04E0 - 0x04C0)
class UBacchusHUDElement : public UFortMobileHUDElement
{
public:
	bool                                          bHideWhenNotUsingTouch;                            // 0x04C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUpdatesWithHUDState;                              // 0x04C1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAlwaysShow;                                       // 0x04C2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInBuildMode;                                     // 0x04C3(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInCombatMode;                                    // 0x04C4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInEditMode;                                      // 0x04C5(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInCreativeMode;                                  // 0x04C6(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInBattleLabMode;                                 // 0x04C7(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          IsFreeFalling;                                     // 0x04C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          IsGliding;                                         // 0x04C9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          CanOpenChute;                                      // 0x04CA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          InLockedBus;                                       // 0x04CB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          InUnlockedBus;                                     // 0x04CC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnTargeting;                                       // 0x04CD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnUsingScopeTargeting;                             // 0x04CE(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCanTarget;                                       // 0x04CF(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCanUseScopeTargeting;                            // 0x04D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCrouching;                                       // 0x04D1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCanUseSecondaryAbility;                          // 0x04D2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnDBNO;                                            // 0x04D3(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCarryingDBNO;                                    // 0x04D4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCarryingHeldObject;                              // 0x04D5(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnImprovedDBNO;                                    // 0x04D6(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnControllingRCPawn;                               // 0x04D7(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInVehicle;                                       // 0x04D8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnDrivingVehicle;                                  // 0x04D9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnZiplining;                                       // 0x04DA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4DB[0x5];                                      // 0x04DB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleInputMethodChanged(ECommonInputType CurrentInputType);
	void OnHUDStateUpdate(const struct FFortHUDState& NewState);
	void ShowHighlight(bool Show);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BacchusHUDElement">();
	}
	static class UBacchusHUDElement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBacchusHUDElement>();
	}
};

// Class FortniteUI.FortAsyncAction_CreateWidgetAsync
// 0x0080 (0x00B8 - 0x0038)
class UFortAsyncAction_CreateWidgetAsync final : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UUserWidget* UserWidget)> OnComplete;                                        // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x60];                                      // 0x0058(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFortAsyncAction_CreateWidgetAsync* CreateWidgetAsync(class UObject* WorldContextObject, TSoftClassPtr<class UClass> UserWidgetSoftClass, class APlayerController* OwningPlayer, bool bSuspendInputUntilComplete);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAsyncAction_CreateWidgetAsync">();
	}
	static class UFortAsyncAction_CreateWidgetAsync* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAsyncAction_CreateWidgetAsync>();
	}
};

// Class FortniteUI.FortTeamMemberEntryBase
// 0x0030 (0x1880 - 0x1850)
#pragma pack(push, 0x1)
class alignas(0x10) UFortTeamMemberEntryBase : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_1850[0x28];                                    // 0x1850(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnTeamMemberEstablished(bool bHasValidMember);
	void OnMemberGameReadinessChanged(EGameReadiness ReadyStatus);
	void OnMemberIsInFrontendChanged(bool bIsInFrontend);

	EGameReadiness GetCurrentMemberGameReadiness() const;
	bool IsCurrentMemberInFrontend() const;
	bool IsCurrentMemberLocal() const;
	bool IsCurrentMemberValid() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTeamMemberEntryBase">();
	}
	static class UFortTeamMemberEntryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTeamMemberEntryBase>();
	}
};
#pragma pack(pop)

// Class FortniteUI.AthenaMinimalSquadMemberEntry
// 0x0000 (0x1880 - 0x1880)
class UAthenaMinimalSquadMemberEntry final : public UFortTeamMemberEntryBase
{
public:
	class UImage*                                 Image_ReadyIcon;                                   // 0x1878(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaMinimalSquadMemberEntry">();
	}
	static class UAthenaMinimalSquadMemberEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMinimalSquadMemberEntry>();
	}
};

// Class FortniteUI.AthenaEquippedItemBase
// 0x00E8 (0x05C8 - 0x04E0)
class UAthenaEquippedItemBase : public UBacchusHUDElement
{
public:
	EEquippedWeaponDisplay                        CurrentMode;                                       // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4E1[0x17];                                     // 0x04E1(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AmountConsideredInfinite;                          // 0x04F8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DefaultOutOfAmmoText;                              // 0x0500(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*              Switcher_Content;                                  // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                           Panel_ResourceContent;                             // 0x0518(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                           Panel_AmmoContent;                                 // 0x0520(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                           Panel_UtilityContent;                              // 0x0528(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_AmmoIcon;                                    // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_AmmoSplit;                                   // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_UtilityIcon;                                 // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_ResourceIcon;                                // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_UtilitySplit;                                // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_RechargeableIcon;                            // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_MagazineAmmoCount;                            // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_SurplusAmmoCount;                             // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_ResourceCount;                                // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_SurplusUtilityAmmoCount;                      // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_UtilityAmmoCount;                             // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_OutOfAmmo;                                    // 0x0588(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOverlay*                               Overlay_UtilityAmmoIcon;                           // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScaleBox*                              RootScaleBox;                                      // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESlateVisibility                              WeaponEquipVisibility;                             // 0x05A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A1[0x3];                                      // 0x05A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           OutOfAmmoCol;                                      // 0x05A4(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayAttribute>             TrackedAttributes;                                 // 0x05B8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void BP_HandleAmmoClipAttributeChanged(float Value);
	void BP_HandleResourceCountChanged(int32 ResourceCount);
	void BP_HandleResourceTypeChanged(const class UFortResourceItemDefinition* Item, int32 ResourceCount);
	void BP_HandleSecondaryFirePressed();
	void BP_HandleSecondaryFireReleased();
