#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteGameFramework

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "StateTreeModule_classes.hpp"
#include "FortniteGameFramework_structs.hpp"


namespace SDK
{

// Class FortniteGameFramework.FGF_Character
// 0x0010 (0x07F0 - 0x07E0)
class AFGF_Character : public ACharacter
{
public:
	uint8                                         Pad_7D8[0x18];                                     // 0x07D8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGF_Character">();
	}
	static class AFGF_Character* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFGF_Character>();
	}
};

// Class FortniteGameFramework.FGF_PlayerState
// 0x0010 (0x04F8 - 0x04E8)
class AFGF_PlayerState : public APlayerState
{
public:
	uint8                                         Pad_4E8[0x10];                                     // 0x04E8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGF_PlayerState">();
	}
	static class AFGF_PlayerState* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFGF_PlayerState>();
	}
};

// Class FortniteGameFramework.StateTreeManagerComponent
// 0x0148 (0x0220 - 0x00D8)
class UStateTreeManagerComponent final : public UActorComponent
{
public:
	TArray<struct FStateTreeRuntimeData>          StateTreeRuntimeDataList;                          // 0x00D8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FStateTreeClientSimulationData> SimulatedDataList;                                 // 0x00E8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	struct FStateChangeDataArray                  ReplicatedStateChanges;                            // 0x00F8(0x0128)(Net, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeManagerComponent">();
	}
	static class UStateTreeManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeManagerComponent>();
	}
};

// Class FortniteGameFramework.FGF_PlayerController
// 0x0010 (0x0A00 - 0x09F0)
class AFGF_PlayerController : public APlayerController
{
public:
	uint8                                         Pad_9F0[0x10];                                     // 0x09F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGF_PlayerController">();
	}
	static class AFGF_PlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFGF_PlayerController>();
	}
};

// Class FortniteGameFramework.FGF_GameMode
// 0x0010 (0x0520 - 0x0510)
class AFGF_GameMode : public AGameMode
{
public:
	uint8                                         Pad_510[0x10];                                     // 0x0510(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGF_GameMode">();
	}
	static class AFGF_GameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFGF_GameMode>();
	}
};

// Class FortniteGameFramework.FGF_GameState
// 0x0018 (0x04C0 - 0x04A8)
class AFGF_GameState : public AGameState
{
public:
	uint8                                         Pad_4A8[0x18];                                     // 0x04A8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGF_GameState">();
	}
	static class AFGF_GameState* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFGF_GameState>();
	}
};

// Class FortniteGameFramework.ObjectBasedStateTreeSchema
// 0x0000 (0x0030 - 0x0030)
class UObjectBasedStateTreeSchema final : public UStateTreeSchema
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectBasedStateTreeSchema">();
	}
	static class UObjectBasedStateTreeSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectBasedStateTreeSchema>();
	}
};

// Class FortniteGameFramework.StateTreeTaskObject
// 0x0008 (0x0088 - 0x0080)
class UStateTreeTaskObject final : public UStateTreeTaskBlueprintBase
{
public:
	bool                                          bReplicates;                                       // 0x0080(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeTaskObject">();
	}
	static class UStateTreeTaskObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeTaskObject>();
	}
};

}

