#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteEditor

#include "Basic.hpp"

#include "FortniteVersion_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteEditor_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function FortniteEditor.FortAssetDataUtilityToolAction.RunActionOnAssetDataArray
// 0x0018 (0x0018 - 0x0000)
struct FortAssetDataUtilityToolAction_RunActionOnAssetDataArray final
{
public:
	TArray<struct FAssetData>                     AssetDataArray;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortAssetDataUtilityToolFilter.AssetDataPassesFilter
// 0x00A0 (0x00A0 - 0x0000)
struct FortAssetDataUtilityToolFilter_AssetDataPassesFilter final
{
public:
	struct FAssetData                             AssetData;                                         // 0x0000(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0098(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortAssetDataUtilityToolGatherer.RunGatherer
// 0x0010 (0x0010 - 0x0000)
struct FortAssetDataUtilityToolGatherer_RunGatherer final
{
public:
	TArray<struct FAssetData>                     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortSeasonItemDefinitionCopyUtilityLibrary.CleanupScratchAssets
// 0x0008 (0x0008 - 0x0000)
struct FortSeasonItemDefinitionCopyUtilityLibrary_CleanupScratchAssets final
{
public:
	class UAthenaSeasonItemDefinition*            SeasonItem;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortSeasonItemDefinitionCopyUtilityLibrary.CopySeasonItemDefinitionAndSubAssets
// 0x0018 (0x0018 - 0x0000)
struct FortSeasonItemDefinitionCopyUtilityLibrary_CopySeasonItemDefinitionAndSubAssets final
{
public:
	class UAthenaSeasonItemDefinition*            SourceSeasonItem;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewSeasonNumber;                                   // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaSeasonItemDefinition*            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortSeasonItemDefinitionCopyUtilityLibrary.NewSeasonPostCopy
// 0x0010 (0x0010 - 0x0000)
struct FortSeasonItemDefinitionCopyUtilityLibrary_NewSeasonPostCopy final
{
public:
	class UAthenaSeasonItemDefinition*            SeasonItem;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortSeasonItemDefinitionCopyUtilityLibrary.SaveScratchAssets
// 0x0010 (0x0010 - 0x0000)
struct FortSeasonItemDefinitionCopyUtilityLibrary_SaveScratchAssets final
{
public:
	class UAthenaSeasonItemDefinition*            SeasonItem;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeSeasonItem;                                // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWaitForCompletion;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortSeasonItemDefinitionCopyUtilityLibrary.UpdateOfferIdsFromCatalog
// 0x0040 (0x0040 - 0x0000)
struct FortSeasonItemDefinitionCopyUtilityLibrary_UpdateOfferIdsFromCatalog final
{
public:
	class UAthenaSeasonItemDefinition*            SeasonDefToUpdate;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCatalogDefinition>      SourceCatalogSoftPtr;                              // 0x0008(0x0030)(ConstParm, Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortCharacterPartEditorFunctionLibrary.GetCharacterPartHighQualityOverlayMaterial
// 0x0038 (0x0038 - 0x0000)
struct FortCharacterPartEditorFunctionLibrary_GetCharacterPartHighQualityOverlayMaterial final
{
public:
	const class UCustomCharacterPart*             CharacterPart;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      ReturnValue;                                       // 0x0008(0x0030)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortCharacterPartEditorFunctionLibrary.GetCharacterPartLowQualityOverlayMaterial
// 0x0038 (0x0038 - 0x0000)
struct FortCharacterPartEditorFunctionLibrary_GetCharacterPartLowQualityOverlayMaterial final
{
public:
	const class UCustomCharacterPart*             CharacterPart;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      ReturnValue;                                       // 0x0008(0x0030)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortCollapseButton.SetWidgetToCollapse
// 0x0008 (0x0008 - 0x0000)
struct FortCollapseButton_SetWidgetToCollapse final
{
public:
	class UWidget*                                InWidgetToCollapse;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortCollapseButton.OnVisibilityStateBrushChanged
// 0x00D0 (0x00D0 - 0x0000)
struct FortCollapseButton_OnVisibilityStateBrushChanged final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.EditorQuestToolUtilityWidget.OnAssetPropertyChanged
// 0x000C (0x000C - 0x0000)
struct EditorQuestToolUtilityWidget_OnAssetPropertyChanged final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.EditorQuestToolUtilityWidget.SetAssetObject
// 0x0008 (0x0008 - 0x0000)
struct EditorQuestToolUtilityWidget_SetAssetObject final
{
public:
	class UObject*                                InAssetObject;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortCosmeticPlacementTool.GetPossibleBackblingCombinationsCount
// 0x0004 (0x0004 - 0x0000)
struct FortCosmeticPlacementTool_GetPossibleBackblingCombinationsCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.AddCurveToAnimSequenceBaseWithValue
// 0x0020 (0x0020 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_AddCurveToAnimSequenceBaseWithValue final
{
public:
	class UAnimSequenceBase*                      AnimSequenceBase;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CurveName;                                         // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverwrite;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.CompileAnimationBlueprints
// 0x0040 (0x0040 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_CompileAnimationBlueprints final
{
public:
	class FString                                 OutputFilePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     AssetData;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ParentFilter;                                      // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetListFile;                                     // 0x0030(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.FilterAssetByParent
// 0x0038 (0x0038 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_FilterAssetByParent final
{
public:
	class FName                                   ClassName;                                         // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAssetData>                     OutAssetData;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bUseNativeParent;                                  // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAssetData>                     InAssetData;                                       // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.FilterAssetsFromFile
// 0x0030 (0x0030 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_FilterAssetsFromFile final
{
public:
	TArray<struct FAssetData>                     OutAssetData;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 FileName;                                          // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     InAssetData;                                       // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.ListAnimationBlueprintCustomBlueprintEvents
// 0x00A8 (0x00A8 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_ListAnimationBlueprintCustomBlueprintEvents final
{
public:
	class FString                                 OutputFilePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAssetData                             AnimBlueprintAsset;                                // 0x0010(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.ListAnimationBlueprintParents
// 0x0020 (0x0020 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_ListAnimationBlueprintParents final
{
public:
	class FString                                 OutputFilePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     AssetData;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.ListAnimationBlueprintSlotUsage
// 0x0020 (0x0020 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_ListAnimationBlueprintSlotUsage final
{
public:
	class FString                                 OutputFilePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     AssetData;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.ListAnimationLayerInterfacesImplementations
// 0x0028 (0x0028 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_ListAnimationLayerInterfacesImplementations final
{
public:
	class FString                                 OutputFilePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCompileBlueprints;                                // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAssetData>                     AssetData;                                         // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.ListAnimationLayerInterfacesUsage
// 0x0028 (0x0028 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_ListAnimationLayerInterfacesUsage final
{
public:
	class FString                                 OutputFilePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCompileBlueprints;                                // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAssetData>                     AssetData;                                         // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.ListAnimationSequenceCurveUsage
// 0x0028 (0x0028 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_ListAnimationSequenceCurveUsage final
{
public:
	class FString                                 OutputFilePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     AssetData;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         StartIdx;                                          // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.ListAnimationSequencesByRetargetSource
// 0x0030 (0x0030 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_ListAnimationSequencesByRetargetSource final
{
public:
	class FString                                 SearchString;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutputFilePath;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     AssetData;                                         // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.ListAnimationSequencesForSkeleton
// 0x0028 (0x0028 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_ListAnimationSequencesForSkeleton final
{
public:
	const class USkeleton*                        Skeleton;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     AssetData;                                         // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     AnimSequenceAssets;                                // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.ListAnimationSequencesWithBoneData
// 0x0038 (0x0038 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_ListAnimationSequencesWithBoneData final
{
public:
	const class USkeleton*                        Skeleton;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BoneName;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutputFilePath;                                    // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     AssetData;                                         // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.ListAnimationSetsContent
// 0x0028 (0x0028 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_ListAnimationSetsContent final
{
public:
	class FString                                 OutputFilePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     AssetData;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bFortWeaponAnimSet;                                // 0x0020(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFortPlayerGliderAnimSet;                          // 0x0021(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFortPatrolAnimAsset;                              // 0x0022(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFortPlayerSkydiveAnimSet;                         // 0x0023(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFortWeaponAdditiveAnimSet;                        // 0x0024(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFortLocomotionAnimSetData;                        // 0x0025(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFortTacticalStateAnimSetData;                     // 0x0026(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.ListAnimationSyncData
// 0x00A8 (0x00A8 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_ListAnimationSyncData final
{
public:
	class FString                                 OutputFilePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAssetData                             AnimBlueprintAsset;                                // 0x0010(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.ListAnimBlueprintAssetOverrides
// 0x0038 (0x0038 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_ListAnimBlueprintAssetOverrides final
{
public:
	class FString                                 OutputFilePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     AssetData;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ParentFilter;                                      // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseNativeParent;                                  // 0x0030(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCompileBlueprints;                                // 0x0031(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.ListAnimBlueprintProperties
// 0x0038 (0x0038 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_ListAnimBlueprintProperties final
{
public:
	class FString                                 OutputFilePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     AssetData;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ParentFilter;                                      // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseNativeParent;                                  // 0x0030(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCompileBlueprints;                                // 0x0031(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.ListBlendSpaceProperties
// 0x0030 (0x0030 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_ListBlendSpaceProperties final
{
public:
	class FString                                 OutputFilePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     AssetData;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 BlendSpaceAssetNames;                              // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.ListWeaponAnimSetUsage
// 0x0020 (0x0020 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_ListWeaponAnimSetUsage final
{
public:
	class FString                                 OutputFilePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     AssetData;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.ListWeaponCoreAnimType
// 0x0020 (0x0020 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_ListWeaponCoreAnimType final
{
public:
	class FString                                 OutputFilePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     AssetData;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.ListWeaponItemDefinitionProperties
// 0x0020 (0x0020 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_ListWeaponItemDefinitionProperties final
{
public:
	class FString                                 OutputFilePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     AssetData;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.ListWeaponMontageUsage
// 0x0020 (0x0020 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_ListWeaponMontageUsage final
{
public:
	class FString                                 OutputFilePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     AssetData;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.RemoveCurveFromAnimSequenceBase
// 0x0018 (0x0018 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_RemoveCurveFromAnimSequenceBase final
{
public:
	class UAnimSequenceBase*                      AnimSequenceBase;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CurveName;                                         // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.SaveAllBlueprintsAsText
// 0x0020 (0x0020 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_SaveAllBlueprintsAsText final
{
public:
	class FString                                 OutputDirectory;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     AssetData;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortAnimationBlueprintEditorLibrary.SaveBlueprintListsAsT3D
// 0x0030 (0x0030 - 0x0000)
struct FortAnimationBlueprintEditorLibrary_SaveBlueprintListsAsT3D final
{
public:
	class FString                                 OutputDirectory;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetData>                     AssetData;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 AssetNames;                                        // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentManifest.HasManifest
// 0x0001 (0x0001 - 0x0000)
struct FortExposedContentManifest_HasManifest final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentManifest.IsValidAssetPathReference
// 0x001C (0x001C - 0x0000)
struct FortExposedContentManifest_IsValidAssetPathReference final
{
public:
	struct FTopLevelAssetPath                     AssetPath;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortExposedContentManifest.IsValidObjectPathReference
// 0x0030 (0x0030 - 0x0000)
struct FortExposedContentManifest_IsValidObjectPathReference final
{
public:
	struct FSoftObjectPath                        ObjectPath;                                        // 0x0000(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortExposedContentManifest.ValidatePackage
// 0x0048 (0x0048 - 0x0000)
struct FortExposedContentManifest_ValidatePackage final
{
public:
	class FString                                 PackageFilename;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortExposedContentValidatePackagesResult ReturnValue;                                       // 0x0010(0x0038)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentManifest.ValidatePackages
// 0x0048 (0x0048 - 0x0000)
struct FortExposedContentManifest_ValidatePackages final
{
public:
	TArray<class FString>                         PackageFilenames;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FFortExposedContentValidatePackagesResult ReturnValue;                                       // 0x0010(0x0038)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentManifest.ValidatePluginPackage
// 0x0058 (0x0058 - 0x0000)
struct FortExposedContentManifest_ValidatePluginPackage final
{
public:
	class FString                                 PackageFilename;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         AllowedPluginReferences;                           // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FFortExposedContentValidatePackagesResult ReturnValue;                                       // 0x0020(0x0038)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentManifest.ValidatePluginPackages
// 0x0058 (0x0058 - 0x0000)
struct FortExposedContentManifest_ValidatePluginPackages final
{
public:
	TArray<class FString>                         PackageFilenames;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         AllowedPluginReferences;                           // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FFortExposedContentValidatePackagesResult ReturnValue;                                       // 0x0020(0x0038)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentValidationActorProxy.GetActor
// 0x0008 (0x0008 - 0x0000)
struct FortExposedContentValidationActorProxy_GetActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentValidationActorProxy.ValidateActor
// 0x0040 (0x0040 - 0x0000)
struct FortExposedContentValidationActorProxy_ValidateActor final
{
public:
	const class UFortExposedContentManifest*      Manifest;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortExposedContentValidatePackagesResult ReturnValue;                                       // 0x0008(0x0038)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentValidationWorldProxy.SpawnActor
// 0x0010 (0x0010 - 0x0000)
struct FortExposedContentValidationWorldProxy_SpawnActor final
{
public:
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortExposedContentValidationActorProxy* ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentValidationWorldProxy.SpawnActorWithTransform
// 0x0080 (0x0080 - 0x0000)
struct FortExposedContentValidationWorldProxy_SpawnActorWithTransform final
{
public:
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ActorTransform;                                    // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortExposedContentValidationActorProxy* ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortExposedContentValidationWorldProxy.SpawnLevelSaveRecord
// 0x0018 (0x0018 - 0x0000)
struct FortExposedContentValidationWorldProxy_SpawnLevelSaveRecord final
{
public:
	class ULevelSaveRecord*                       LevelSaveRecord;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UFortExposedContentValidationActorProxy*> ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentValidationWorldProxy.SpawnLevelSaveRecordProvider
// 0x0020 (0x0020 - 0x0000)
struct FortExposedContentValidationWorldProxy_SpawnLevelSaveRecordProvider final
{
public:
	TScriptInterface<class ILevelSaveRecordProvider> LevelSaveRecordProvider;                           // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UFortExposedContentValidationActorProxy*> ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentValidationWorldProxy.SpawnLevelSaveRecordProviderWithTransform
// 0x0080 (0x0080 - 0x0000)
struct FortExposedContentValidationWorldProxy_SpawnLevelSaveRecordProviderWithTransform final
{
public:
	TScriptInterface<class ILevelSaveRecordProvider> LevelSaveRecordProvider;                           // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             LevelSaveRecordRootTransform;                      // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UFortExposedContentValidationActorProxy*> ReturnValue;                                       // 0x0070(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentValidationWorldProxy.SpawnLevelSaveRecordWithTransform
// 0x0080 (0x0080 - 0x0000)
struct FortExposedContentValidationWorldProxy_SpawnLevelSaveRecordWithTransform final
{
public:
	class ULevelSaveRecord*                       LevelSaveRecord;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LevelSaveRecordRootTransform;                      // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UFortExposedContentValidationActorProxy*> ReturnValue;                                       // 0x0070(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentValidationWorldProxy.GetWorld
// 0x0008 (0x0008 - 0x0000)
struct FortExposedContentValidationWorldProxy_GetWorld final
{
public:
	class UWorld*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentValidationSubsystem.CreateBackgroundValidationWorld
// 0x0008 (0x0008 - 0x0000)
struct FortExposedContentValidationSubsystem_CreateBackgroundValidationWorld final
{
public:
	class UFortExposedContentValidationWorldProxy* ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentValidationSubsystem.CreateEditorValidationWorld
// 0x0010 (0x0010 - 0x0000)
struct FortExposedContentValidationSubsystem_CreateEditorValidationWorld final
{
public:
	bool                                          bSilent;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortExposedContentValidationWorldProxy* ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentValidationSubsystem.GetCurrentManifest
// 0x0008 (0x0008 - 0x0000)
struct FortExposedContentValidationSubsystem_GetCurrentManifest final
{
public:
	const class UFortExposedContentManifest*      ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentValidationSubsystem.GetPreviousManifest
// 0x0008 (0x0008 - 0x0000)
struct FortExposedContentValidationSubsystem_GetPreviousManifest final
{
public:
	const class UFortExposedContentManifest*      ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentValidationSubsystem.ShowValidationReport
// 0x0040 (0x0040 - 0x0000)
struct FortExposedContentValidationSubsystem_ShowValidationReport final
{
public:
	struct FFortExposedContentValidatePackagesResult Result;                                            // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bClearPage;                                        // 0x0038(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortExposedContentValidationSubsystem.BuildCurrentManifest
// 0x0002 (0x0002 - 0x0000)
struct FortExposedContentValidationSubsystem_BuildCurrentManifest final
{
public:
	bool                                          bSilent;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortExposedContentValidationSubsystem.SyncCurrentManifest
// 0x0002 (0x0002 - 0x0000)
struct FortExposedContentValidationSubsystem_SyncCurrentManifest final
{
public:
	bool                                          bSilent;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortEditorUtilityLibrary.FindServerPlayWorld
// 0x0008 (0x0008 - 0x0000)
struct FortEditorUtilityLibrary_FindServerPlayWorld final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortEditorUtilityLibrary.GetAvailableMaterialParameters
// 0x0020 (0x0020 - 0x0000)
struct FortEditorUtilityLibrary_GetAvailableMaterialParameters final
{
public:
	const class UMaterial*                        Material;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      MaterialInstance;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMaterialParameterInfo>         VisibleExpressions;                                // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortEditorUtilityLibrary.IsMaterialParameterAvailable
// 0x0018 (0x0018 - 0x0000)
struct FortEditorUtilityLibrary_IsMaterialParameterAvailable final
{
public:
	class UMaterialInstance*                      MaterialInstance;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortEditorUtilityLibrary.SaveAssetsWhilePlaying
// 0x0018 (0x0018 - 0x0000)
struct FortEditorUtilityLibrary_SaveAssetsWhilePlaying final
{
public:
	TArray<class UObject*>                        AssetsToSave;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bOnlyIfIsDirty;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortMapMarkerIconOverrideComboBox.HandleSelectedIconChanged
// 0x0010 (0x0010 - 0x0000)
struct FortMapMarkerIconOverrideComboBox_HandleSelectedIconChanged final
{
public:
	class FName                                   SelectedIconName;                                  // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESelectInfo                                   SelectionType;                                     // 0x000C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortMapMarkerIconOverrideComboBox.GenerateMapIconOverrideEntry
// 0x0018 (0x0018 - 0x0000)
struct FortMapMarkerIconOverrideComboBox_GenerateMapIconOverrideEntry final
{
public:
	class FName                                   IconName;                                          // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMapMarkerIconOverrideComboBoxEntryType       Type;                                              // 0x000C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.EditorOnlyGateExpressionExtension.GetAllGateNames
// 0x0010 (0x0010 - 0x0000)
struct EditorOnlyGateExpressionExtension_GetAllGateNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.EditorOnlyGateEntryExtension.GetAllGateNames
// 0x0010 (0x0010 - 0x0000)
struct EditorOnlyGateEntryExtension_GetAllGateNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.EditorOnlyGateEntryExtension.GetObjectiveSubjectNames
// 0x0010 (0x0010 - 0x0000)
struct EditorOnlyGateEntryExtension_GetObjectiveSubjectNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortMultiPropertyView.AddGeneratePathPropertyNestedIndexData
// 0x0028 (0x0028 - 0x0000)
struct FortMultiPropertyView_AddGeneratePathPropertyNestedIndexData final
{
public:
	class FString                                 RootPropertyName;                                  // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NestedPropertyName;                                // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IndexData;                                         // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortQuestToolPropertyView.SetObjectiveFiltersIndexToShow
// 0x0008 (0x0008 - 0x0000)
struct FortQuestToolPropertyView_SetObjectiveFiltersIndexToShow final
{
public:
	int32                                         InObjectiveIndexToShow;                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InObjectiveFiltersIndexToShow;                     // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortQuestToolPropertyView.SetObjectiveIndexToShow
// 0x0004 (0x0004 - 0x0000)
struct FortQuestToolPropertyView_SetObjectiveIndexToShow final
{
public:
	int32                                         InObjectiveIndexToShow;                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortQuestToolPropertyView.SetObjectiveStatsIndexToShow
// 0x0008 (0x0008 - 0x0000)
struct FortQuestToolPropertyView_SetObjectiveStatsIndexToShow final
{
public:
	int32                                         InObjectiveIndexToShow;                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InObjectiveStatsIndexToShow;                       // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.QuestEditorSubWidget.HandleExpandableAreaChanged
// 0x0010 (0x0010 - 0x0000)
struct QuestEditorSubWidget_HandleExpandableAreaChanged final
{
public:
	class UExpandableArea*                        Area;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsExpanded;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortQuestItemDefComponentEditor_MapMarkers.HandleIconOverrideChanged
// 0x000C (0x000C - 0x0000)
struct FortQuestItemDefComponentEditor_MapMarkers_HandleIconOverrideChanged final
{
public:
	class FName                                   SelectedIconOverride;                              // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteEditor.FortQuestItemDefComponentEditor_MapMarkers.HandleMapSelectionChanged
// 0x0010 (0x0010 - 0x0000)
struct FortQuestItemDefComponentEditor_MapMarkers_HandleMapSelectionChanged final
{
public:
	class FName                                   SelectedMapName;                                   // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESelectInfo                                   SelectionType;                                     // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortniteEditor.FortQuestItemDefComponentEditor_ObjectiveMapMarkers.HandleIconOverrideChanged
// 0x000C (0x000C - 0x0000)
struct FortQuestItemDefComponentEditor_ObjectiveMapMarkers_HandleIconOverrideChanged final
{
public:
