#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteEditor

#include "Basic.hpp"

#include "GameSubCatalogEditor_classes.hpp"
#include "UnrealEd_classes.hpp"
#include "GameplayTagsEditor_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteEditor_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ScriptableEditorWidgets_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Blutility_classes.hpp"
#include "EditorSubsystem_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "DataValidation_classes.hpp"
#include "FortniteVersion_structs.hpp"
#include "Kismet_classes.hpp"
#include "AssetTools_classes.hpp"
#include "UMGEditor_classes.hpp"


namespace SDK
{

// Class FortniteEditor.AssetDefinition_AthenaCharacterItemDefinition
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_AthenaCharacterItemDefinition final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_AthenaCharacterItemDefinition">();
	}
	static class UAssetDefinition_AthenaCharacterItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_AthenaCharacterItemDefinition>();
	}
};

// Class FortniteEditor.AssetDefinition_FortChallengeBundleItemDefinition
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_FortChallengeBundleItemDefinition final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_FortChallengeBundleItemDefinition">();
	}
	static class UAssetDefinition_FortChallengeBundleItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_FortChallengeBundleItemDefinition>();
	}
};

// Class FortniteEditor.AssetDefinition_FortItemDefinition
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_FortItemDefinition final : public UAssetDefinition_GameplayTagAssetBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_FortItemDefinition">();
	}
	static class UAssetDefinition_FortItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_FortItemDefinition>();
	}
};

// Class FortniteEditor.AssetDefinition_FortPlaysetItemDefinition
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_FortPlaysetItemDefinition final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_FortPlaysetItemDefinition">();
	}
	static class UAssetDefinition_FortPlaysetItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_FortPlaysetItemDefinition>();
	}
};

// Class FortniteEditor.AssetDefinition_FortPlaysetPropItemDefinition
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_FortPlaysetPropItemDefinition final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_FortPlaysetPropItemDefinition">();
	}
	static class UAssetDefinition_FortPlaysetPropItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_FortPlaysetPropItemDefinition>();
	}
};

// Class FortniteEditor.AssetDefinition_FortQuestItemDefinition
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_FortQuestItemDefinition final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_FortQuestItemDefinition">();
	}
	static class UAssetDefinition_FortQuestItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_FortQuestItemDefinition>();
	}
};

// Class FortniteEditor.AssetDefinition_FortTrapItemDefinition
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_FortTrapItemDefinition final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_FortTrapItemDefinition">();
	}
	static class UAssetDefinition_FortTrapItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_FortTrapItemDefinition>();
	}
};

// Class FortniteEditor.BuildingTextureDataThumbnailRenderer
// 0x0018 (0x0048 - 0x0030)
class UBuildingTextureDataThumbnailRenderer final : public UTextureThumbnailRenderer
{
public:
	int32                                         DefaultSizeX;                                      // 0x0030(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DefaultSizeY;                                      // 0x0034(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuildingTextureDataThumbnailRenderer">();
	}
	static class UBuildingTextureDataThumbnailRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuildingTextureDataThumbnailRenderer>();
	}
};

// Class FortniteEditor.FortBaseValidationDataRepository
// 0x0010 (0x0048 - 0x0038)
class UFortBaseValidationDataRepository final : public UDataAsset
{
public:
	TArray<struct FFortValidationData>            ValidationData;                                    // 0x0038(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBaseValidationDataRepository">();
	}
	static class UFortBaseValidationDataRepository* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBaseValidationDataRepository>();
	}
};

// Class FortniteEditor.CustomCharacterPartThumbnailRenderer
// 0x0000 (0x0088 - 0x0088)
class UCustomCharacterPartThumbnailRenderer final : public USkeletalMeshThumbnailRenderer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomCharacterPartThumbnailRenderer">();
	}
	static class UCustomCharacterPartThumbnailRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomCharacterPartThumbnailRenderer>();
	}
};

// Class FortniteEditor.CustomPropertyView
// 0x0258 (0x0528 - 0x02D0)
class UCustomPropertyView final : public UPropertyViewBase
{
public:
	uint8                                         Pad_2D0[0x10];                                     // 0x02D0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPropertyViewColumnData>        Columns;                                           // 0x02E0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bShowAllProperties;                                // 0x02F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bParentPropertiesStartCollapsed;                   // 0x02F1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F2[0x6];                                      // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPropertyToShowData>            PropertiesToShow;                                  // 0x02F8(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bShowPropertiesThatMatchGeneratedPropertyPaths;    // 0x0308(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PropertiesToExclude;                               // 0x0310(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           PropertiesToSkipPropertyPathGeneration;            // 0x0320(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FPropertyGroupData>             PropertyGroups;                                    // 0x0330(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FPropertyBorderStyle                   OuterBorderStyle;                                  // 0x0340(0x002C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FPropertyBorderStyle                   ParentBorderStyle;                                 // 0x036C(0x002C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FPropertyBorderStyle                   ChildBorderStyle;                                  // 0x0398(0x002C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FMargin                                NamePadding;                                       // 0x03C4(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FMargin                                ValuePadding;                                      // 0x03D4(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E4[0x144];                                    // 0x03E4(0x0144)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomPropertyView">();
	}
	static class UCustomPropertyView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomPropertyView>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolAction
// 0x0000 (0x0030 - 0x0030)
class UFortAssetDataUtilityToolAction : public UObject
{
public:
	bool RunActionOnAssetDataArray(const TArray<struct FAssetData>& AssetDataArray) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolAction">();
	}
	static class UFortAssetDataUtilityToolAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolAction>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityTool_LogResults
// 0x0000 (0x0030 - 0x0030)
class UFortAssetDataUtilityTool_LogResults final : public UFortAssetDataUtilityToolAction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityTool_LogResults">();
	}
	static class UFortAssetDataUtilityTool_LogResults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityTool_LogResults>();
	}
};

// Class FortniteEditor.FortActiveComponentWidget
// 0x0008 (0x0420 - 0x0418)
class UFortActiveComponentWidget final : public UUserWidget
{
public:
	class UCommonTextBlock*                       Text_ActiveComponentName;                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActiveComponentWidget">();
	}
	static class UFortActiveComponentWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActiveComponentWidget>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolFilter
// 0x0000 (0x0030 - 0x0030)
class UFortAssetDataUtilityToolFilter : public UObject
{
public:
	void CleanupFilterData();
	void InitializeFilterData();

	bool AssetDataPassesFilter(const struct FAssetData& AssetData) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolFilter">();
	}
	static class UFortAssetDataUtilityToolFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolFilter>();
	}
};

// Class FortniteEditor.FADUT_Filter_HIDHasLinkedCID
// 0x0008 (0x0038 - 0x0030)
class UFADUT_Filter_HIDHasLinkedCID final : public UFortAssetDataUtilityToolFilter
{
public:
	bool                                          bRequireInverse;                                   // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FADUT_Filter_HIDHasLinkedCID">();
	}
	static class UFADUT_Filter_HIDHasLinkedCID* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFADUT_Filter_HIDHasLinkedCID>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolFilter_DataTableRowStruct
// 0x0010 (0x0040 - 0x0030)
class UFortAssetDataUtilityToolFilter_DataTableRowStruct final : public UFortAssetDataUtilityToolFilter
{
public:
	struct FInstancedStruct                       TableRowStruct;                                    // 0x0030(0x0010)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolFilter_DataTableRowStruct">();
	}
	static class UFortAssetDataUtilityToolFilter_DataTableRowStruct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolFilter_DataTableRowStruct>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolFilter_TagQuery
// 0x0048 (0x0078 - 0x0030)
class UFortAssetDataUtilityToolFilter_TagQuery final : public UFortAssetDataUtilityToolFilter
{
public:
	struct FGameplayTagQuery                      TagQuery;                                          // 0x0030(0x0048)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolFilter_TagQuery">();
	}
	static class UFortAssetDataUtilityToolFilter_TagQuery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolFilter_TagQuery>();
	}
};

// Class FortniteEditor.FortListAllTexturesCommandlet
// 0x0000 (0x0088 - 0x0088)
class UFortListAllTexturesCommandlet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortListAllTexturesCommandlet">();
	}
	static class UFortListAllTexturesCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortListAllTexturesCommandlet>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolFilter_VerbTypeQs1
// 0x0010 (0x0040 - 0x0030)
class UFortAssetDataUtilityToolFilter_VerbTypeQs1 final : public UFortAssetDataUtilityToolFilter
{
public:
	TArray<EFortQuestObjectiveStatEvent>          VerbsToFilterFor;                                  // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolFilter_VerbTypeQs1">();
	}
	static class UFortAssetDataUtilityToolFilter_VerbTypeQs1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolFilter_VerbTypeQs1>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolFilter_ObjectiveFilterTypeQs2
// 0x0018 (0x0048 - 0x0030)
class UFortAssetDataUtilityToolFilter_ObjectiveFilterTypeQs2 final : public UFortAssetDataUtilityToolFilter
{
public:
	TArray<struct FInstancedStruct>               ObjectiveFilterTypes;                              // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bExactTypeMatchesOnly;                             // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolFilter_ObjectiveFilterTypeQs2">();
	}
	static class UFortAssetDataUtilityToolFilter_ObjectiveFilterTypeQs2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolFilter_ObjectiveFilterTypeQs2>();
	}
};

// Class FortniteEditor.FADUT_Action_HIDCIDPropertyEqualityTestReport
// 0x0078 (0x00A8 - 0x0030)
class UFADUT_Action_HIDCIDPropertyEqualityTestReport final : public UFortAssetDataUtilityToolAction
{
public:
	struct FCIDHIDPropertyEvaluationSettings      Settings;                                          // 0x0030(0x0060)(Edit, NativeAccessSpecifierPublic)
	class FString                                 CustomReportDescription;                           // 0x0090(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputOwningPluginInfo;                           // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FADUT_Action_HIDCIDPropertyEqualityTestReport">();
	}
	static class UFADUT_Action_HIDCIDPropertyEqualityTestReport* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFADUT_Action_HIDCIDPropertyEqualityTestReport>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolFilter_ObjectiveFilterByTagQuery
// 0x0048 (0x0078 - 0x0030)
class UFortAssetDataUtilityToolFilter_ObjectiveFilterByTagQuery final : public UFortAssetDataUtilityToolFilter
{
public:
	struct FGameplayTagQuery                      FilterTagQuery;                                    // 0x0030(0x0048)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolFilter_ObjectiveFilterByTagQuery">();
	}
	static class UFortAssetDataUtilityToolFilter_ObjectiveFilterByTagQuery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolFilter_ObjectiveFilterByTagQuery>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolFilter_QuestProductCompatibilityQueryTagsMatch
// 0x0020 (0x0050 - 0x0030)
class UFortAssetDataUtilityToolFilter_QuestProductCompatibilityQueryTagsMatch final : public UFortAssetDataUtilityToolFilter
{
public:
	struct FGameplayTagContainer                  ProductTagsToTest;                                 // 0x0030(0x0020)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolFilter_QuestProductCompatibilityQueryTagsMatch">();
	}
	static class UFortAssetDataUtilityToolFilter_QuestProductCompatibilityQueryTagsMatch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolFilter_QuestProductCompatibilityQueryTagsMatch>();
	}
};

// Class FortniteEditor.AthenaContainerToPropMapUpdateCommandlet
// 0x0000 (0x0088 - 0x0088)
class UAthenaContainerToPropMapUpdateCommandlet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaContainerToPropMapUpdateCommandlet">();
	}
	static class UAthenaContainerToPropMapUpdateCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaContainerToPropMapUpdateCommandlet>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolFilter_QuestProductCompatibilityQueryIsPopulated
// 0x0000 (0x0030 - 0x0030)
class UFortAssetDataUtilityToolFilter_QuestProductCompatibilityQueryIsPopulated final : public UFortAssetDataUtilityToolFilter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolFilter_QuestProductCompatibilityQueryIsPopulated">();
	}
	static class UFortAssetDataUtilityToolFilter_QuestProductCompatibilityQueryIsPopulated* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolFilter_QuestProductCompatibilityQueryIsPopulated>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolFilter_IsUsingObjectiveFilters
// 0x0000 (0x0030 - 0x0030)
class UFortAssetDataUtilityToolFilter_IsUsingObjectiveFilters final : public UFortAssetDataUtilityToolFilter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolFilter_IsUsingObjectiveFilters">();
	}
	static class UFortAssetDataUtilityToolFilter_IsUsingObjectiveFilters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolFilter_IsUsingObjectiveFilters>();
	}
};

// Class FortniteEditor.LevelSaveRecordExporter
// 0x0000 (0x0080 - 0x0080)
class ULevelSaveRecordExporter final : public UExporter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelSaveRecordExporter">();
	}
	static class ULevelSaveRecordExporter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelSaveRecordExporter>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolFilter_HasMatchingQuestDefComponents
// 0x0010 (0x0040 - 0x0030)
class UFortAssetDataUtilityToolFilter_HasMatchingQuestDefComponents final : public UFortAssetDataUtilityToolFilter
{
public:
	TArray<TSoftClassPtr<class UClass>>           QuestDefinitionComponents;                         // 0x0030(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolFilter_HasMatchingQuestDefComponents">();
	}
	static class UFortAssetDataUtilityToolFilter_HasMatchingQuestDefComponents* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolFilter_HasMatchingQuestDefComponents>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolFilter_QuestHasRewards
// 0x0028 (0x0058 - 0x0030)
class UFortAssetDataUtilityToolFilter_QuestHasRewards final : public UFortAssetDataUtilityToolFilter
{
public:
	EAssetFilterType                              AssetFilterType;                                   // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERewardFilterType                             RewardFilterType;                                  // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           QuestRewardDefinitions;                            // 0x0038(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FPrimaryAssetId>                QuestRewardPrimaryAssetIds;                        // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolFilter_QuestHasRewards">();
	}
	static class UFortAssetDataUtilityToolFilter_QuestHasRewards* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolFilter_QuestHasRewards>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolGatherer
// 0x0000 (0x0030 - 0x0030)
class UFortAssetDataUtilityToolGatherer : public UObject
{
public:
	TArray<struct FAssetData> RunGatherer() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolGatherer">();
	}
	static class UFortAssetDataUtilityToolGatherer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolGatherer>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolGatherer_FortItemType
// 0x0008 (0x0038 - 0x0030)
class UFortAssetDataUtilityToolGatherer_FortItemType final : public UFortAssetDataUtilityToolGatherer
{
public:
	EFortItemType                                 ItemTypeToGather;                                  // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolGatherer_FortItemType">();
	}
	static class UFortAssetDataUtilityToolGatherer_FortItemType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolGatherer_FortItemType>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolFilter_UsesGameplayAbilityGates
// 0x0000 (0x0030 - 0x0030)
class UFortAssetDataUtilityToolFilter_UsesGameplayAbilityGates final : public UFortAssetDataUtilityToolFilter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolFilter_UsesGameplayAbilityGates">();
	}
	static class UFortAssetDataUtilityToolFilter_UsesGameplayAbilityGates* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolFilter_UsesGameplayAbilityGates>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolFilter_QuestType
// 0x0010 (0x0040 - 0x0030)
class UFortAssetDataUtilityToolFilter_QuestType final : public UFortAssetDataUtilityToolFilter
{
public:
	TArray<EFortQuestType>                        QuestTypes;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolFilter_QuestType">();
	}
	static class UFortAssetDataUtilityToolFilter_QuestType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolFilter_QuestType>();
	}
};

// Class FortniteEditor.FortSeasonItemDefinitionCopyUtilityLibrary
// 0x0000 (0x0030 - 0x0030)
class UFortSeasonItemDefinitionCopyUtilityLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void CleanupScratchAssets(class UAthenaSeasonItemDefinition* SeasonItem);
	static class UAthenaSeasonItemDefinition* CopySeasonItemDefinitionAndSubAssets(class UAthenaSeasonItemDefinition* SourceSeasonItem, const int32 NewSeasonNumber);
	static bool NewSeasonPostCopy(class UAthenaSeasonItemDefinition* SeasonItem);
	static void SaveScratchAssets(class UAthenaSeasonItemDefinition* SeasonItem, bool bIncludeSeasonItem, bool bWaitForCompletion);
	static bool UpdateOfferIdsFromCatalog(class UAthenaSeasonItemDefinition* SeasonDefToUpdate, const TSoftObjectPtr<class UCatalogDefinition> SourceCatalogSoftPtr);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSeasonItemDefinitionCopyUtilityLibrary">();
	}
	static class UFortSeasonItemDefinitionCopyUtilityLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSeasonItemDefinitionCopyUtilityLibrary>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolFilter_QuestSubType
// 0x0010 (0x0040 - 0x0030)
class UFortAssetDataUtilityToolFilter_QuestSubType final : public UFortAssetDataUtilityToolFilter
{
public:
	TArray<EFortQuestSubtype>                     QuestSubTypes;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolFilter_QuestSubType">();
	}
	static class UFortAssetDataUtilityToolFilter_QuestSubType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolFilter_QuestSubType>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolFilter_QuestCompletionPathCount
// 0x0018 (0x0048 - 0x0030)
class UFortAssetDataUtilityToolFilter_QuestCompletionPathCount final : public UFortAssetDataUtilityToolFilter
{
public:
	struct FInt32Range                            CompletionPathCountRange;                          // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAssetDataUtilityToolFilterResult             NotQuestDefinitionBehavior;                        // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolFilter_QuestCompletionPathCount">();
	}
	static class UFortAssetDataUtilityToolFilter_QuestCompletionPathCount* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolFilter_QuestCompletionPathCount>();
	}
};

// Class FortniteEditor.FADUT_Filter_HIDCIDPropertyEqualityTest
// 0x0060 (0x0090 - 0x0030)
class UFADUT_Filter_HIDCIDPropertyEqualityTest final : public UFortAssetDataUtilityToolFilter
{
public:
	struct FCIDHIDPropertyEvaluationSettings      Settings;                                          // 0x0030(0x0060)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FADUT_Filter_HIDCIDPropertyEqualityTest">();
	}
	static class UFADUT_Filter_HIDCIDPropertyEqualityTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFADUT_Filter_HIDCIDPropertyEqualityTest>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolFilter_QuestHiddenRewardsHasManualTemplateId
// 0x0000 (0x0030 - 0x0030)
class UFortAssetDataUtilityToolFilter_QuestHiddenRewardsHasManualTemplateId final : public UFortAssetDataUtilityToolFilter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolFilter_QuestHiddenRewardsHasManualTemplateId">();
	}
	static class UFortAssetDataUtilityToolFilter_QuestHiddenRewardsHasManualTemplateId* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolFilter_QuestHiddenRewardsHasManualTemplateId>();
	}
};

// Class FortniteEditor.ReimportFortHomebaseSquadDataTableFactory
// 0x0020 (0x00E0 - 0x00C0)
class UReimportFortHomebaseSquadDataTableFactory final : public UCSVImportFactory
{
public:
	uint8                                         Pad_C0[0x20];                                      // 0x00C0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReimportFortHomebaseSquadDataTableFactory">();
	}
	static class UReimportFortHomebaseSquadDataTableFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReimportFortHomebaseSquadDataTableFactory>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolAction_LogQuestReports
// 0x0008 (0x0038 - 0x0030)
class UFortAssetDataUtilityToolAction_LogQuestReports final : public UFortAssetDataUtilityToolAction
{
public:
	bool                                          bIncludeEmptyCategories;                           // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeTagDetailsForQuests;                       // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeVerbTagReport;                             // 0x0032(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolAction_LogQuestReports">();
	}
	static class UFortAssetDataUtilityToolAction_LogQuestReports* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolAction_LogQuestReports>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolAction_GenerateQuestCompletionPaths
// 0x0000 (0x0030 - 0x0030)
class UFortAssetDataUtilityToolAction_GenerateQuestCompletionPaths final : public UFortAssetDataUtilityToolAction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolAction_GenerateQuestCompletionPaths">();
	}
	static class UFortAssetDataUtilityToolAction_GenerateQuestCompletionPaths* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolAction_GenerateQuestCompletionPaths>();
	}
};

// Class FortniteEditor.FADUT_Gatherer_PrimaryAssetTypeFromAssetRegistry
// 0x0010 (0x0040 - 0x0030)
class UFADUT_Gatherer_PrimaryAssetTypeFromAssetRegistry final : public UFortAssetDataUtilityToolGatherer
{
public:
	struct FPrimaryAssetType                      PrimaryAssetType;                                  // 0x0030(0x000C)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FADUT_Gatherer_PrimaryAssetTypeFromAssetRegistry">();
	}
	static class UFADUT_Gatherer_PrimaryAssetTypeFromAssetRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFADUT_Gatherer_PrimaryAssetTypeFromAssetRegistry>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolAction_LogGateAbilities
// 0x0000 (0x0030 - 0x0030)
class UFortAssetDataUtilityToolAction_LogGateAbilities final : public UFortAssetDataUtilityToolAction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolAction_LogGateAbilities">();
	}
	static class UFortAssetDataUtilityToolAction_LogGateAbilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolAction_LogGateAbilities>();
	}
};

// Class FortniteEditor.FortAssetDataUtilityToolAction_DetailedTagReport
// 0x0008 (0x0038 - 0x0030)
class UFortAssetDataUtilityToolAction_DetailedTagReport final : public UFortAssetDataUtilityToolAction
{
public:
	bool                                          bIncludeTagByVerbUsage;                            // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAssetDataUtilityToolAction_DetailedTagReport">();
	}
	static class UFortAssetDataUtilityToolAction_DetailedTagReport* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAssetDataUtilityToolAction_DetailedTagReport>();
	}
};

// Class FortniteEditor.FortBaseValidator
// 0x0000 (0x0030 - 0x0030)
class UFortBaseValidator : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBaseValidator">();
	}
	static class UFortBaseValidator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBaseValidator>();
	}
};

// Class FortniteEditor.FortCurveTableIterativeValidator
// 0x0010 (0x0040 - 0x0030)
class UFortCurveTableIterativeValidator final : public UFortBaseValidator
{
public:
	TArray<class UFortBaseValidator*>             Validators;                                        // 0x0030(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCurveTableIterativeValidator">();
	}
	static class UFortCurveTableIterativeValidator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCurveTableIterativeValidator>();
	}
};

// Class FortniteEditor.FortCharacterPartEditorFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class UFortCharacterPartEditorFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static TSoftObjectPtr<class UMaterialInterface> GetCharacterPartHighQualityOverlayMaterial(const class UCustomCharacterPart* CharacterPart);
	static TSoftObjectPtr<class UMaterialInterface> GetCharacterPartLowQualityOverlayMaterial(const class UCustomCharacterPart* CharacterPart);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCharacterPartEditorFunctionLibrary">();
	}
	static class UFortCharacterPartEditorFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCharacterPartEditorFunctionLibrary>();
	}
};

// Class FortniteEditor.FortCollapseButton
// 0x01B0 (0x19B0 - 0x1800)
class UFortCollapseButton final : public UCommonButtonBase
{
public:
	struct FSlateBrush                            WidgetVisibleBrushOverride;                        // 0x1800(0x00D0)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                            WidgetCollapsedBrushOverride;                      // 0x18D0(0x00D0)(Edit, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UWidget>                 WidgetToCollapse;                                  // 0x19A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_19A8[0x8];                                     // 0x19A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetWidgetToCollapse(class UWidget* InWidgetToCollapse);

	void OnVisibilityStateBrushChanged(const struct FSlateBrush& Brush) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollapseButton">();
	}
	static class UFortCollapseButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollapseButton>();
	}
};

// Class FortniteEditor.DadPersistAssetCommandlet
// 0x0028 (0x00B0 - 0x0088)
class UDadPersistAssetCommandlet final : public UCommandlet
{
public:
	class FString                                 BaseServiceUrl;                                    // 0x0088(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 PersistAssetPath;                                  // 0x0098(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RequestTimeout;                                    // 0x00A8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DadPersistAssetCommandlet">();
	}
	static class UDadPersistAssetCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDadPersistAssetCommandlet>();
	}
};

// Class FortniteEditor.EditorQuestToolUtilityWidget
// 0x0008 (0x0448 - 0x0440)
class UEditorQuestToolUtilityWidget : public UEditorUtilityWidget
{
public:
	class UObject*                                AssetObject;                                       // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_OnAssetObjectSet();
	void BP_OnAssetUndoRedo();
	void OnAssetPropertyChanged(const class FName& PropertyName);
	void SetAssetObject(class UObject* InAssetObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorQuestToolUtilityWidget">();
	}
	static class UEditorQuestToolUtilityWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorQuestToolUtilityWidget>();
	}
};

// Class FortniteEditor.FortCommonQuestTagQueryMenu
// 0x00B0 (0x04F8 - 0x0448)
class UFortCommonQuestTagQueryMenu final : public UEditorQuestToolUtilityWidget
{
public:
	class UQuestEditorButton*                     Button_TagQueryMenu;                               // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, struct FCommonQuestTagQueryData> TagQueryDataTables;                                // 0x0450(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A0[0x10];                                     // 0x04A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      TagQueryExportText_Helper;                         // 0x04B0(0x0048)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCommonQuestTagQueryMenu">();
	}
	static class UFortCommonQuestTagQueryMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCommonQuestTagQueryMenu>();
	}
};

// Class FortniteEditor.FortEditorValidator
// 0x0000 (0x0078 - 0x0078)
class UFortEditorValidator : public UEditorValidatorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEditorValidator">();
	}
	static class UFortEditorValidator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEditorValidator>();
	}
};

// Class FortniteEditor.FortValidator_AllowedLocation
// 0x0060 (0x00D8 - 0x0078)
class UFortValidator_AllowedLocation final : public UFortEditorValidator
{
public:
	TArray<struct FClassToDisallowedPath>         ClassToDisallowedPath;                             // 0x0078(0x0010)(ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	TSet<TSoftObjectPtr<class UObject>>           LegacyExceptions;                                  // 0x0088(0x0050)(Config, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortValidator_AllowedLocation">();
	}
	static class UFortValidator_AllowedLocation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortValidator_AllowedLocation>();
	}
};

// Class FortniteEditor.FortCosmeticPlacementTool
// 0x0020 (0x0460 - 0x0440)
class UFortCosmeticPlacementTool final : public UEditorUtilityWidget
{
public:
	TArray<class UFortItemDefinition*>            CachedCharacterPartItemDefs;                       // 0x0440(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_450[0x10];                                     // 0x0450(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetPossibleBackblingCombinationsCount() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCosmeticPlacementTool">();
	}
	static class UFortCosmeticPlacementTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCosmeticPlacementTool>();
	}
};

// Class FortniteEditor.FortCosmeticsEditorSubsystem
// 0x0010 (0x0048 - 0x0038)
class UFortCosmeticsEditorSubsystem final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCosmeticsFlowgraphManager*             FlowManager;                                       // 0x0040(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCosmeticsEditorSubsystem">();
	}
	static class UFortCosmeticsEditorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCosmeticsEditorSubsystem>();
	}
};

// Class FortniteEditor.FADUTCIDMigrationPreviewSettingsConfig
// 0x00B8 (0x00F0 - 0x0038)
class UFADUTCIDMigrationPreviewSettingsConfig final : public UDataAsset
{
public:
	TMap<struct FGameplayTag, struct FFortCosmeticFrontendPawnPreviewSettings> FrontendPreviewSettingsByCIDTag;                   // 0x0038(0x0050)(Edit, NativeAccessSpecifierPublic)
	struct FFortCosmeticFrontendPawnPreviewSettings FallbackSettings;                                  // 0x0088(0x0068)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FADUTCIDMigrationPreviewSettingsConfig">();
	}
	static class UFADUTCIDMigrationPreviewSettingsConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFADUTCIDMigrationPreviewSettingsConfig>();
	}
};

// Class FortniteEditor.FortCreativeAssetItemReportCommandlet
// 0x00D0 (0x0158 - 0x0088)
class UFortCreativeAssetItemReportCommandlet final : public UCommandlet
{
public:
	TArray<struct FCreativeAssetReportData>       CreativeAssets;                                    // 0x0088(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_98[0xC0];                                      // 0x0098(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCreativeAssetItemReportCommandlet">();
	}
	static class UFortCreativeAssetItemReportCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCreativeAssetItemReportCommandlet>();
	}
};

// Class FortniteEditor.FortCreativeDevicesTemplatesManager
// 0x0150 (0x0180 - 0x0030)
class UFortCreativeDevicesTemplatesManager final : public UObject
{
public:
	TMap<TSoftClassPtr<class UClass>, class UClass*> LoadedActorClasses;                                // 0x0030(0x0050)(NativeAccessSpecifierPrivate)
	TMap<TSoftClassPtr<class UClass>, class UClass*> LoadedActorComponentClasses;                       // 0x0080(0x0050)(NativeAccessSpecifierPrivate)
	TSet<TSoftClassPtr<class UClass>>             InvalidCreativeDeviceClasses;                      // 0x00D0(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	class UWorld*                                 ActorTemplatesWorld;                               // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_128[0x50];                                     // 0x0128(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCreativeActorCollection*           CreativeAssetCollection;                           // 0x0178(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCreativeDevicesTemplatesManager">();
	}
	static class UFortCreativeDevicesTemplatesManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCreativeDevicesTemplatesManager>();
	}
};

// Class FortniteEditor.FortConversationEditorPlayback
// 0x0038 (0x0068 - 0x0030)
class UFortConversationEditorPlayback final : public UObject
{
public:
	uint8                                         Pad_30[0x38];                                      // 0x0030(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationEditorPlayback">();
	}
	static class UFortConversationEditorPlayback* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationEditorPlayback>();
	}
};

// Class FortniteEditor.FortCreativeIslandProcessingTaskBase
// 0x0000 (0x0030 - 0x0030)
class UFortCreativeIslandProcessingTaskBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCreativeIslandProcessingTaskBase">();
	}
	static class UFortCreativeIslandProcessingTaskBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCreativeIslandProcessingTaskBase>();
	}
};

// Class FortniteEditor.FortDataLayerManagerLoader
// 0x0010 (0x0450 - 0x0440)
class UFortDataLayerManagerLoader final : public UEditorUtilityWidget
{
public:
	class UButton*                                Button_Run;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       TextField_Directory;                               // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnRunButtonClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDataLayerManagerLoader">();
	}
	static class UFortDataLayerManagerLoader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDataLayerManagerLoader>();
	}
};

// Class FortniteEditor.FortAnimationBlueprintEditorLibrary
// 0x0000 (0x0030 - 0x0030)
class UFortAnimationBlueprintEditorLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddCurveToAnimSequenceBaseWithValue(class UAnimSequenceBase* AnimSequenceBase, class FName CurveName, float Value, bool bOverwrite);
	static void CompileAnimationBlueprints(const class FString& OutputFilePath, const TArray<struct FAssetData>& AssetData, const class FString& ParentFilter, const class FString& AssetListFile);
	static void FilterAssetByParent(class FName ClassName, TArray<struct FAssetData>* OutAssetData, bool bUseNativeParent, const TArray<struct FAssetData>& InAssetData);
	static void FilterAssetsFromFile(TArray<struct FAssetData>* OutAssetData, const class FString& FileName, const TArray<struct FAssetData>& InAssetData);
	static void ListAnimationBlueprintCustomBlueprintEvents(const class FString& OutputFilePath, const struct FAssetData& AnimBlueprintAsset);
	static void ListAnimationBlueprintParents(const class FString& OutputFilePath, const TArray<struct FAssetData>& AssetData);
	static void ListAnimationBlueprintSlotUsage(const class FString& OutputFilePath, const TArray<struct FAssetData>& AssetData);
	static void ListAnimationLayerInterfacesImplementations(const class FString& OutputFilePath, const bool bCompileBlueprints, const TArray<struct FAssetData>& AssetData);
	static void ListAnimationLayerInterfacesUsage(const class FString& OutputFilePath, const bool bCompileBlueprints, const TArray<struct FAssetData>& AssetData);
	static void ListAnimationSequenceCurveUsage(const class FString& OutputFilePath, const TArray<struct FAssetData>& AssetData, const int32 StartIdx);
	static void ListAnimationSequencesByRetargetSource(const class FString& SearchString, const class FString& OutputFilePath, const TArray<struct FAssetData>& AssetData);
	static void ListAnimationSequencesForSkeleton(const class USkeleton* Skeleton, const TArray<struct FAssetData>& AssetData, TArray<struct FAssetData>* AnimSequenceAssets);
	static void ListAnimationSequencesWithBoneData(const class USkeleton* Skeleton, const class FString& BoneName, const class FString& OutputFilePath, const TArray<struct FAssetData>& AssetData);
	static void ListAnimationSetsContent(const class FString& OutputFilePath, const TArray<struct FAssetData>& AssetData, const bool bFortWeaponAnimSet, const bool bFortPlayerGliderAnimSet, const bool bFortPatrolAnimAsset, const bool bFortPlayerSkydiveAnimSet, const bool bFortWeaponAdditiveAnimSet, const bool bFortLocomotionAnimSetData, const bool bFortTacticalStateAnimSetData);
	static void ListAnimationSyncData(const class FString& OutputFilePath, const struct FAssetData& AnimBlueprintAsset);
	static void ListAnimBlueprintAssetOverrides(const class FString& OutputFilePath, const TArray<struct FAssetData>& AssetData, const class FString& ParentFilter, const bool bUseNativeParent, const bool bCompileBlueprints);
	static void ListAnimBlueprintProperties(const class FString& OutputFilePath, const TArray<struct FAssetData>& AssetData, const class FString& ParentFilter, const bool bUseNativeParent, const bool bCompileBlueprints);
	static void ListBlendSpaceProperties(const class FString& OutputFilePath, const TArray<struct FAssetData>& AssetData, const class FString& BlendSpaceAssetNames);
	static void ListWeaponAnimSetUsage(const class FString& OutputFilePath, const TArray<struct FAssetData>& AssetData);
	static void ListWeaponCoreAnimType(const class FString& OutputFilePath, const TArray<struct FAssetData>& AssetData);
	static void ListWeaponItemDefinitionProperties(const class FString& OutputFilePath, const TArray<struct FAssetData>& AssetData);
	static void ListWeaponMontageUsage(const class FString& OutputFilePath, const TArray<struct FAssetData>& AssetData);
	static void RemoveCurveFromAnimSequenceBase(class UAnimSequenceBase* AnimSequenceBase, class FName CurveName);
	static void SaveAllBlueprintsAsText(const class FString& OutputDirectory, const TArray<struct FAssetData>& AssetData);
	static void SaveBlueprintListsAsT3D(const class FString& OutputDirectory, const TArray<struct FAssetData>& AssetData, const class FString& AssetNames);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimationBlueprintEditorLibrary">();
	}
	static class UFortAnimationBlueprintEditorLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimationBlueprintEditorLibrary>();
	}
};

// Class FortniteEditor.FortDetectParentHardRefPropertyDeltasCommandLet
// 0x0000 (0x0088 - 0x0088)
class UFortDetectParentHardRefPropertyDeltasCommandLet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDetectParentHardRefPropertyDeltasCommandLet">();
	}
	static class UFortDetectParentHardRefPropertyDeltasCommandLet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDetectParentHardRefPropertyDeltasCommandLet>();
	}
};

// Class FortniteEditor.FortDetermineSharedPluginsCommandlet
// 0x0038 (0x00C0 - 0x0088)
class UFortDetermineSharedPluginsCommandlet final : public UCommandlet
{
public:
	struct FSharedGFPFilter                       MinimalLobby;                                      // 0x0088(0x0028)(Config, NativeAccessSpecifierPrivate)
	TArray<struct FSharedGFPFilter>               RootGFPsToUse;                                     // 0x00B0(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDetermineSharedPluginsCommandlet">();
	}
	static class UFortDetermineSharedPluginsCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDetermineSharedPluginsCommandlet>();
	}
};

// Class FortniteEditor.FortDataValidationCommandlet
// 0x0000 (0x0088 - 0x0088)
class UFortDataValidationCommandlet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDataValidationCommandlet">();
	}
	static class UFortDataValidationCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDataValidationCommandlet>();
	}
};

// Class FortniteEditor.FortEditorSubmitToolSettings
// 0x0028 (0x0088 - 0x0060)
class UFortEditorSubmitToolSettings final : public UDeveloperSettings
{
public:
	class FString                                 SubmitToolPath;                                    // 0x0060(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SubmitToolArguments;                               // 0x0070(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSubmitToolEnabled;                                // 0x0080(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnforceDataValidation;                            // 0x0081(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEditorSubmitToolSettings">();
	}
	static class UFortEditorSubmitToolSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEditorSubmitToolSettings>();
	}
};

// Class FortniteEditor.FortEditorValidatorSettings
// 0x0000 (0x0060 - 0x0060)
class UFortEditorValidatorSettings final : public UDeveloperSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEditorValidatorSettings">();
	}
	static class UFortEditorValidatorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEditorValidatorSettings>();
	}
};

// Class FortniteEditor.FortEditorValidatorSubsystem
// 0x0000 (0x00B8 - 0x00B8)
class UFortEditorValidatorSubsystem final : public UEditorValidatorSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEditorValidatorSubsystem">();
	}
	static class UFortEditorValidatorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEditorValidatorSubsystem>();
	}
};

// Class FortniteEditor.FortEstimatePluginSplitCommandlet
// 0x0000 (0x0088 - 0x0088)
class UFortEstimatePluginSplitCommandlet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEstimatePluginSplitCommandlet">();
	}
	static class UFortEstimatePluginSplitCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEstimatePluginSplitCommandlet>();
	}
};

// Class FortniteEditor.FortHomebaseNodeGameplayEffectDataTableFactory
// 0x0000 (0x0088 - 0x0088)
class UFortHomebaseNodeGameplayEffectDataTableFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHomebaseNodeGameplayEffectDataTableFactory">();
	}
	static class UFortHomebaseNodeGameplayEffectDataTableFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHomebaseNodeGameplayEffectDataTableFactory>();
	}
};

// Class FortniteEditor.FortExposedAssetSubsystem
// 0x0138 (0x0170 - 0x0038)
class UFortExposedAssetSubsystem final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0x138];                                     // 0x0038(0x0138)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortExposedAssetSubsystem">();
	}
	static class UFortExposedAssetSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortExposedAssetSubsystem>();
	}
};

// Class FortniteEditor.FortExposedContentManifest
// 0x0030 (0x0060 - 0x0030)
class UFortExposedContentManifest final : public UObject
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool HasManifest() const;
	bool IsValidAssetPathReference(const struct FTopLevelAssetPath& AssetPath) const;
	bool IsValidObjectPathReference(const struct FSoftObjectPath& ObjectPath) const;
	struct FFortExposedContentValidatePackagesResult ValidatePackage(const class FString& PackageFilename) const;
	struct FFortExposedContentValidatePackagesResult ValidatePackages(const TArray<class FString>& PackageFilenames) const;
	struct FFortExposedContentValidatePackagesResult ValidatePluginPackage(const class FString& PackageFilename, const TArray<class FString>& AllowedPluginReferences) const;
	struct FFortExposedContentValidatePackagesResult ValidatePluginPackages(const TArray<class FString>& PackageFilenames, const TArray<class FString>& AllowedPluginReferences) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortExposedContentManifest">();
	}
	static class UFortExposedContentManifest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortExposedContentManifest>();
	}
};

// Class FortniteEditor.FortContentEncryptionCommandlet
