#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteK2Nodes

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "AnimGraph_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "BlueprintGraph_classes.hpp"
#include "FortniteK2Nodes_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class FortniteK2Nodes.AnimBlueprintExtension_LinkedGraphGate
// 0x0000 (0x0030 - 0x0030)
class UAnimBlueprintExtension_LinkedGraphGate final : public UAnimBlueprintExtension
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimBlueprintExtension_LinkedGraphGate">();
	}
	static class UAnimBlueprintExtension_LinkedGraphGate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBlueprintExtension_LinkedGraphGate>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_Layering
// 0x0160 (0x03F8 - 0x0298)
class UFortAnimGraphNode_Layering final : public UAnimGraphNode_BlendListBase
{
public:
	struct FFortAnimNode_Layering                 Node;                                              // 0x0298(0x0160)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_Layering">();
	}
	static class UFortAnimGraphNode_Layering* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_Layering>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_PoseDebug
// 0x0098 (0x0328 - 0x0290)
class UFortAnimGraphNode_PoseDebug final : public UAnimGraphNode_Base
{
public:
	struct FFortAnimNode_PoseDebug                Node;                                              // 0x0290(0x0098)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_PoseDebug">();
	}
	static class UFortAnimGraphNode_PoseDebug* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_PoseDebug>();
	}
};

// Class FortniteK2Nodes.FortniteK2NodeSettings
// 0x0008 (0x0068 - 0x0060)
class UFortniteK2NodeSettings final : public UDeveloperSettings
{
public:
	bool                                          bShouldDisplayInfinityWithSymbol;                  // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortniteK2NodeSettings">();
	}
	static class UFortniteK2NodeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortniteK2NodeSettings>();
	}
};

// Class FortniteK2Nodes.K2Node_RootMotionMME
// 0x0018 (0x00D8 - 0x00C0)
class UK2Node_RootMotionMME final : public UK2Node
{
public:
	uint8                                         Pad_C0[0x18];                                      // 0x00C0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_RootMotionMME">();
	}
	static class UK2Node_RootMotionMME* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_RootMotionMME>();
	}
};

// Class FortniteK2Nodes.K2Node_SpawnBuildingActorFromClass
// 0x0000 (0x00E8 - 0x00E8)
class UK2Node_SpawnBuildingActorFromClass final : public UK2Node_ConstructObjectFromClass
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_SpawnBuildingActorFromClass">();
	}
	static class UK2Node_SpawnBuildingActorFromClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_SpawnBuildingActorFromClass>();
	}
};

// Class FortniteK2Nodes.K2Node_SwitchByRange
// 0x0018 (0x00F8 - 0x00E0)
class UK2Node_SwitchByRange final : public UK2Node_Switch
{
public:
	TArray<struct FDoubleRange>                   PinRanges;                                         // 0x00E0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bOnlyExecuteOncePerRange;                          // 0x00F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_SwitchByRange">();
	}
	static class UK2Node_SwitchByRange* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_SwitchByRange>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_AttackIK
// 0x0210 (0x04A0 - 0x0290)
class UFortAnimGraphNode_AttackIK final : public UAnimGraphNode_SkeletalControlBase
{
public:
	struct FFortAnimNode_AttackIK                 Node;                                              // 0x0290(0x0210)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_AttackIK">();
	}
	static class UFortAnimGraphNode_AttackIK* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_AttackIK>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_CachePose
// 0x01B8 (0x0448 - 0x0290)
class UFortAnimGraphNode_CachePose final : public UAnimGraphNode_SkeletalControlBase
{
public:
	struct FFortAnimNode_CachePose                Node;                                              // 0x0290(0x01B8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_CachePose">();
	}
	static class UFortAnimGraphNode_CachePose* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_CachePose>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_CurveFilterSlot
// 0x0180 (0x0410 - 0x0290)
class UFortAnimGraphNode_CurveFilterSlot final : public UAnimGraphNode_Base
{
public:
	struct FFortAnimNode_CurveFilterSlot          Node;                                              // 0x0290(0x0120)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B0[0x60];                                     // 0x03B0(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_CurveFilterSlot">();
	}
	static class UFortAnimGraphNode_CurveFilterSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_CurveFilterSlot>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_Flap
// 0x0230 (0x04C0 - 0x0290)
class UFortAnimGraphNode_Flap final : public UAnimGraphNode_SkeletalControlBase
{
public:
	struct FFortAnimNode_Flap                     Node;                                              // 0x0290(0x01D0)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_460[0x60];                                     // 0x0460(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_Flap">();
	}
	static class UFortAnimGraphNode_Flap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_Flap>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_LinkedGraphGate
// 0x0118 (0x03A8 - 0x0290)
class UFortAnimGraphNode_LinkedGraphGate final : public UAnimGraphNode_Base
{
public:
	struct FFortAnimNode_LinkedGraphGate          Node;                                              // 0x0290(0x00B8)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_348[0x60];                                     // 0x0348(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_LinkedGraphGate">();
	}
	static class UFortAnimGraphNode_LinkedGraphGate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_LinkedGraphGate>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_NoBlendCurveSlot
// 0x0160 (0x03F0 - 0x0290)
class UFortAnimGraphNode_NoBlendCurveSlot final : public UAnimGraphNode_Base
{
public:
	struct FFortAnimNode_NoBlendCurveSlot         Node;                                              // 0x0290(0x0100)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_390[0x60];                                     // 0x0390(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_NoBlendCurveSlot">();
	}
	static class UFortAnimGraphNode_NoBlendCurveSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_NoBlendCurveSlot>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_OrientationWarping
// 0x0210 (0x04A0 - 0x0290)
class UFortAnimGraphNode_OrientationWarping final : public UAnimGraphNode_SkeletalControlBase
{
public:
	struct FFortAnimNode_OrientationWarping       Node;                                              // 0x0290(0x0210)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_OrientationWarping">();
	}
	static class UFortAnimGraphNode_OrientationWarping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_OrientationWarping>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_PredictiveSlopeWarping
// 0x0678 (0x0908 - 0x0290)
class UFortAnimGraphNode_PredictiveSlopeWarping final : public UAnimGraphNode_SkeletalControlBase
{
public:
	struct FFortAnimNode_PredictiveSlopeWarping   Node;                                              // 0x0290(0x0678)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_PredictiveSlopeWarping">();
	}
	static class UFortAnimGraphNode_PredictiveSlopeWarping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_PredictiveSlopeWarping>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_PredictiveStrideWarping
// 0x02E8 (0x0578 - 0x0290)
class UFortAnimGraphNode_PredictiveStrideWarping final : public UAnimGraphNode_SkeletalControlBase
{
public:
	struct FFortAnimNode_PredictiveStrideWarping  Node;                                              // 0x0290(0x02E8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_PredictiveStrideWarping">();
	}
	static class UFortAnimGraphNode_PredictiveStrideWarping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_PredictiveStrideWarping>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_ProfilerStatEvent
// 0x0108 (0x0398 - 0x0290)
class UFortAnimGraphNode_ProfilerStatEvent final : public UAnimGraphNode_Base
{
public:
	struct FFortAnimNode_ProfilerStatEvent        Node;                                              // 0x0290(0x0108)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_ProfilerStatEvent">();
	}
	static class UFortAnimGraphNode_ProfilerStatEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_ProfilerStatEvent>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_QuadrupedSlopeWarping
// 0x06C8 (0x0958 - 0x0290)
class UFortAnimGraphNode_QuadrupedSlopeWarping final : public UAnimGraphNode_SkeletalControlBase
{
public:
	struct FFortAnimNode_QuadrupedSlopeWarping    Node;                                              // 0x0290(0x06C8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_QuadrupedSlopeWarping">();
	}
	static class UFortAnimGraphNode_QuadrupedSlopeWarping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_QuadrupedSlopeWarping>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_RandomPetAnim
// 0x0110 (0x03A0 - 0x0290)
class UFortAnimGraphNode_RandomPetAnim final : public UAnimGraphNode_Base
{
public:
	struct FFortAnimNode_AnimSetDrivenRandom      Node;                                              // 0x0290(0x0110)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_RandomPetAnim">();
	}
	static class UFortAnimGraphNode_RandomPetAnim* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_RandomPetAnim>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_ScaleCharacterBones
// 0x01B0 (0x0440 - 0x0290)
class UFortAnimGraphNode_ScaleCharacterBones final : public UAnimGraphNode_SkeletalControlBase
{
public:
	struct FFortAnimNode_ScaleCharacterBones      Node;                                              // 0x0290(0x01B0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_ScaleCharacterBones">();
	}
	static class UFortAnimGraphNode_ScaleCharacterBones* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_ScaleCharacterBones>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_ScaleHuskBones
// 0x0288 (0x0518 - 0x0290)
class UFortAnimGraphNode_ScaleHuskBones final : public UAnimGraphNode_Base
{
public:
	struct FFortAnimNode_ScaleHuskBones           ScaleNode;                                         // 0x0290(0x0288)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_ScaleHuskBones">();
	}
	static class UFortAnimGraphNode_ScaleHuskBones* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_ScaleHuskBones>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_SetIKTarget
// 0x0308 (0x0598 - 0x0290)
class UFortAnimGraphNode_SetIKTarget final : public UAnimGraphNode_SkeletalControlBase
{
public:
	struct FFortAnimNode_SetIKTarget              Node;                                              // 0x0290(0x0308)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_SetIKTarget">();
	}
	static class UFortAnimGraphNode_SetIKTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_SetIKTarget>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_SlopeWarping
// 0x03D0 (0x0660 - 0x0290)
class UFortAnimGraphNode_SlopeWarping final : public UAnimGraphNode_SkeletalControlBase
{
public:
	struct FFortAnimNode_SlopeWarping             Node;                                              // 0x0290(0x03D0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_SlopeWarping">();
	}
	static class UFortAnimGraphNode_SlopeWarping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_SlopeWarping>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_SpeedWarping
// 0x02E8 (0x0578 - 0x0290)
class UFortAnimGraphNode_SpeedWarping final : public UAnimGraphNode_SkeletalControlBase
{
public:
	struct FFortAnimNode_SpeedWarping             Node;                                              // 0x0290(0x02E8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_SpeedWarping">();
	}
	static class UFortAnimGraphNode_SpeedWarping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_SpeedWarping>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_TransformRollerTreads
// 0x0228 (0x04B8 - 0x0290)
class UFortAnimGraphNode_TransformRollerTreads final : public UAnimGraphNode_SkeletalControlBase
{
public:
	struct FFortAnimNode_TransformRollerTreads    Node;                                              // 0x0290(0x0228)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_TransformRollerTreads">();
	}
	static class UFortAnimGraphNode_TransformRollerTreads* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_TransformRollerTreads>();
	}
};

// Class FortniteK2Nodes.FortAnimGraphNode_WeightedLookAt
// 0x0560 (0x07F0 - 0x0290)
class UFortAnimGraphNode_WeightedLookAt final : public UAnimGraphNode_SkeletalControlBase
{
public:
	struct FFortAnimNode_WeightedLookAt           Node;                                              // 0x0290(0x0500)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_790[0x60];                                     // 0x0790(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimGraphNode_WeightedLookAt">();
	}
	static class UFortAnimGraphNode_WeightedLookAt* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimGraphNode_WeightedLookAt>();
	}
};

// Class FortniteK2Nodes.FortEditorData
// 0x00B0 (0x00E8 - 0x0038)
class UFortEditorData final : public UDataAsset
{
public:
	TSoftObjectPtr<class UDataTable>              MissionAlertSpreadDatas;                           // 0x0038(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              MissionAlerts;                                     // 0x0068(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFortClientEventData>    ClientEventData;                                   // 0x0098(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortSkelMeshBudgetLODSettings> SkelMeshBudgetLODSettings;                         // 0x00C8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 FortEditorDataPath;                                // 0x00D8(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEditorData">();
	}
	static class UFortEditorData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEditorData>();
	}
};

// Class FortniteK2Nodes.K2Node_CountActorsInVolume
// 0x0000 (0x0148 - 0x0148)
class UK2Node_CountActorsInVolume final : public UK2Node_CallFunction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_CountActorsInVolume">();
	}
	static class UK2Node_CountActorsInVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_CountActorsInVolume>();
	}
};

// Class FortniteK2Nodes.K2Node_ExecuteClientEvent
// 0x0000 (0x0148 - 0x0148)
class UK2Node_ExecuteClientEvent final : public UK2Node_CallFunction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_ExecuteClientEvent">();
	}
	static class UK2Node_ExecuteClientEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_ExecuteClientEvent>();
	}
};

// Class FortniteK2Nodes.K2Node_ExecuteMissionEvent
// 0x0000 (0x0148 - 0x0148)
class UK2Node_ExecuteMissionEvent final : public UK2Node_CallFunction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_ExecuteMissionEvent">();
	}
	static class UK2Node_ExecuteMissionEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_ExecuteMissionEvent>();
	}
};

// Class FortniteK2Nodes.K2Node_FortCreateUINotification
// 0x0000 (0x00E8 - 0x00E8)
class UK2Node_FortCreateUINotification final : public UK2Node_ConstructObjectFromClass
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_FortCreateUINotification">();
	}
	static class UK2Node_FortCreateUINotification* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_FortCreateUINotification>();
	}
};

// Class FortniteK2Nodes.K2Node_HandleClientEvent
// 0x0018 (0x0178 - 0x0160)
class UK2Node_HandleClientEvent final : public UK2Node_Event
{
public:
	struct FFortClientEventName                   ClientEventName;                                   // 0x0160(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_HandleClientEvent">();
	}
	static class UK2Node_HandleClientEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_HandleClientEvent>();
	}
};

// Class FortniteK2Nodes.K2Node_HandleMissionEvent
// 0x0018 (0x0178 - 0x0160)
class UK2Node_HandleMissionEvent final : public UK2Node_Event
{
public:
	struct FFortMissionEventName                  MissionEventName;                                  // 0x0160(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_HandleMissionEvent">();
	}
	static class UK2Node_HandleMissionEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_HandleMissionEvent>();
	}
};

// Class FortniteK2Nodes.K2Node_OverrideAISpawnerComponent
// 0x0010 (0x00F8 - 0x00E8)
class UK2Node_OverrideAISpawnerComponent final : public UK2Node_ConstructObjectFromClass
{
public:
	uint8                                         bInstancedComponentAllowed : 1;                    // 0x00E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAthenaAISpawnerDataComponent*      InstancedComponent;                                // 0x00F0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_OverrideAISpawnerComponent">();
	}
	static class UK2Node_OverrideAISpawnerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_OverrideAISpawnerComponent>();
	}
};

}

