#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteExternalRpc

#include "Basic.hpp"


namespace SDK::Params
{

// Function FortniteExternalRpc.FortExternalRpcUtils.FindGameWorld
// 0x0008 (0x0008 - 0x0000)
struct FortExternalRpcUtils_FindGameWorld final
{
public:
	class UWorld*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteExternalRpc.FortExternalRpcUtils.FindPlayerController
// 0x0008 (0x0008 - 0x0000)
struct FortExternalRpcUtils_FindPlayerController final
{
public:
	class AFortPlayerController*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteExternalRpc.FortExternalRpcUtils.TryExecuteConsoleCommand
// 0x0028 (0x0028 - 0x0000)
struct FortExternalRpcUtils_TryExecuteConsoleCommand final
{
public:
	class FString                                 CommandString;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutError;                                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

