#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteEngineLoadingScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class FortniteEngineLoadingScreen.FortniteUserInterfaceSettings
// 0x0550 (0x05B0 - 0x0060)
class UFortniteUserInterfaceSettings final : public UDeveloperSettings
{
public:
	struct FRuntimeFloatCurve                     WidthScaleCurve;                                   // 0x0060(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     HeightScaleCurve;                                  // 0x00E8(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     WidthScaleCurve_iOS_InGame;                        // 0x0170(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     HeightScaleCurve_iOS_InGame;                       // 0x01F8(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     WidthScaleCurve_iOS_FrontEnd;                      // 0x0280(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     HeightScaleCurve_iOS_FrontEnd;                     // 0x0308(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     WidthScaleCurve_Android_InGame;                    // 0x0390(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     HeightScaleCurve_Android_InGame;                   // 0x0418(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     WidthScaleCurve_Android_FrontEnd;                  // 0x04A0(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     HeightScaleCurve_Android_FrontEnd;                 // 0x0528(0x0088)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortniteUserInterfaceSettings">();
	}
	static class UFortniteUserInterfaceSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortniteUserInterfaceSettings>();
	}
};

}

