#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortVehicleSimulationStepsRuntime

#include "Basic.hpp"

#include "FortVehicleSimulationStepsRuntime_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class FortVehicleSimulationStepsRuntime.FortVehicleSimulationStepsManager
// 0x0068 (0x0098 - 0x0030)
class UFortVehicleSimulationStepsManager final : public UObject
{
public:
	bool                                          bEnabled;                                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EVehicleSimStepFlags                          DefaultSimulationStepFlags;                        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataRegistryType                      DataRegistryType_VehicleSimulationStepsPermissions; // 0x0034(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataRegistryType                      DataRegistryType_VehicleSimulationStepsConfig;     // 0x0040(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C[0x4C];                                      // 0x004C(0x004C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleSimulationStepsManager">();
	}
	static class UFortVehicleSimulationStepsManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleSimulationStepsManager>();
	}
};

}

