#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteGameDebuggersRuntime

#include "Basic.hpp"

#include "FortniteGameDebuggersRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "FortImGuiCore_classes.hpp"


namespace SDK
{

// Class FortniteGameDebuggersRuntime.BehaviorInjectionDebugMenu
// 0x0050 (0x06A0 - 0x0650)
class ABehaviorInjectionDebugMenu final : public AImGuiDebugMenuBase
{
public:
	struct FBehaviorInjectionDebugInfo            DebugInfo;                                         // 0x0648(0x0048)(Net, NativeAccessSpecifierPrivate)
	uint8                                         Pad_690[0x10];                                     // 0x0690(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ServerClose();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BehaviorInjectionDebugMenu">();
	}
	static class ABehaviorInjectionDebugMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABehaviorInjectionDebugMenu>();
	}
};

// Class FortniteGameDebuggersRuntime.CheatManager_FortniteGameDebuggers
// 0x0000 (0x0030 - 0x0030)
class UCheatManager_FortniteGameDebuggers final : public UChildCheatManager
{
public:
	void EnableBehaviorInjectionDebug();
	void EnableConversationDebugger();
	void EnableQuestDebugger();
	void EnableVerbProcessorDebugger();
	void EnableWorldProgressionDebugger();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CheatManager_FortniteGameDebuggers">();
	}
	static class UCheatManager_FortniteGameDebuggers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCheatManager_FortniteGameDebuggers>();
	}
};

// Class FortniteGameDebuggersRuntime.ConversationDebuggerMenu
// 0x02A0 (0x08F0 - 0x0650)
class AConversationDebuggerMenu final : public AImGuiDebugMenuBase
{
public:
	struct FConversationProviderStateSnapshot     ServerServiceProviderSnapshot;                     // 0x0648(0x0108)(Net, Transient, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_750[0x130];                                    // 0x0750(0x0130)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class AActor>>          ConversationProviderSelectionCandidates;           // 0x0880(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_890[0x60];                                     // 0x0890(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_ServerServiceProviderSnapshot(const struct FConversationProviderStateSnapshot& OldSnapshot);
	void ServerClose();
	void ServerSetSelectedConversationProvider(const class AActor* InSelectedConversationProvider);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationDebuggerMenu">();
	}
	static class AConversationDebuggerMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<AConversationDebuggerMenu>();
	}
};

// Class FortniteGameDebuggersRuntime.QuestDebuggerMenu
// 0x02A0 (0x08F0 - 0x0650)
class AQuestDebuggerMenu final : public AImGuiDebugMenuBase
{
public:
	uint8                                         Pad_648[0x18];                                     // 0x0648(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestManagerStateSnapshot             ServerManagerStateSnapshot;                        // 0x0660(0x0040)(Net, Transient, NativeAccessSpecifierPrivate)
	struct FQuestSnapshot                         ServerSelectedQuestSnapshot;                       // 0x06A0(0x0050)(Net, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6F0[0x200];                                    // 0x06F0(0x0200)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ServerClose();
	void ServerGrantPlayspaceQuest(const class UFortQuestItemDefinition* QuestDef);
	void ServerSetSelectedManagerScope(const EQuestParticipationScope InSelectedScope);
	void ServerSetSelectedPlayspace(const class APlayspace* Playspace);
	void ServerSetSelectedQuest(const struct FQuestSnapshot& InSelectedQuestSnapshot);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"QuestDebuggerMenu">();
	}
	static class AQuestDebuggerMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<AQuestDebuggerMenu>();
	}
};

// Class FortniteGameDebuggersRuntime.VerbProcessorDebuggerMenu
// 0x0110 (0x0760 - 0x0650)
class AVerbProcessorDebuggerMenu final : public AImGuiDebugMenuBase
{
public:
	struct FVerbProcessorStateSnapshot            ServerVerbProcessorStateSnapshot;                  // 0x0648(0x0050)(Net, Transient, NativeAccessSpecifierPrivate)
	struct FVerbProcessorSnapshot                 SelectedVerbProcessorSnapshot;                     // 0x0698(0x0038)(Transient, NativeAccessSpecifierPrivate)
	struct FVerbEventManagerSnapshot              SelectedVerbEventManagerSnapshot;                  // 0x06D0(0x0020)(Transient, NativeAccessSpecifierPrivate)
	struct FVerbParticipantSnapshot               SelectedVerbParticipantSnapshot;                   // 0x06F0(0x0020)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_710[0x40];                                     // 0x0710(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ServerVerbProcessingTimeSpent;                     // 0x0750(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_758[0x8];                                      // 0x0758(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ServerClose();
	void ServerSendVerbMessage(const class APlayerController* LocalController, const class UClass* ProcessorType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerbProcessorDebuggerMenu">();
	}
	static class AVerbProcessorDebuggerMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVerbProcessorDebuggerMenu>();
	}
};

// Class FortniteGameDebuggersRuntime.WorldProgressionDebuggerMenu
// 0x0090 (0x06E0 - 0x0650)
class AWorldProgressionDebuggerMenu final : public AImGuiDebugMenuBase
{
public:
	struct FWorldProgressionStateSnapshot         ServerWorldProgressionStateSnapshot;               // 0x0648(0x0030)(Net, Transient, NativeAccessSpecifierPrivate)
	struct FWorldReactionSnapshot                 SelectedWorldReactionSnapshot;                     // 0x0678(0x0018)(Transient, NativeAccessSpecifierPrivate)
	struct FWorldStatSnapshot                     SelectedWorldStatSnapshot;                         // 0x0690(0x0018)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6A8[0x38];                                     // 0x06A8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ServerClose();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldProgressionDebuggerMenu">();
	}
	static class AWorldProgressionDebuggerMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWorldProgressionDebuggerMenu>();
	}
};

}

