#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortSoundCueTemplates

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SoundCueTemplates_classes.hpp"
#include "FortSoundCueTemplates_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class FortSoundCueTemplates.FortSoundCueTemplateBase
// 0x0060 (0x0658 - 0x05F8)
class UFortSoundCueTemplateBase : public USoundCueTemplate
{
public:
	float                                         TemplateVolumeMultiplier;                          // 0x05F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TemplatePitchMultiplier;                           // 0x05FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              PitchModulationRange;                              // 0x0600(0x0010)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              VolumeModulationRange;                             // 0x0610(0x0010)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              StartDelay;                                        // 0x0620(0x0010)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortSoundCueTemplateDefaults*          TemplateDefaults;                                  // 0x0630(0x0008)(ZeroConstructor, Transient, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEditDefaultSettings;                              // 0x0638(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_639[0x7];                                      // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSoundCueTemplateDefaults*          DefaultTemplateSettings;                           // 0x0640(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, EditorOnly, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        PreviewComponent;                                  // 0x0648(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    SoundCueTemplateClass;                             // 0x0650(0x0008)(ZeroConstructor, EditorOnly, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void Preview();
	void ReloadDefaultSettings();
	void StopPreview();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSoundCueTemplateBase">();
	}
	static class UFortSoundCueTemplateBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSoundCueTemplateBase>();
	}
};

// Class FortSoundCueTemplates.EmoteBase
// 0x0040 (0x0698 - 0x0658)
class UEmoteBase : public UFortSoundCueTemplateBase
{
public:
	class USoundWave*                             SoundWave;                                         // 0x0658(0x0008)(Edit, ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USoundWave*>                     Variations;                                        // 0x0660(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         bLooping : 1;                                      // 0x0670(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCopyrightedAudio : 1;                             // 0x0670(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_671[0x7];                                      // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundWave*                             IntroSoundWave;                                    // 0x0678(0x0008)(Edit, ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LoopDelay;                                         // 0x0680(0x0010)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_690[0x8];                                      // 0x0690(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmoteBase">();
	}
	static class UEmoteBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmoteBase>();
	}
};

// Class FortSoundCueTemplates.EmoteFoley
// 0x0000 (0x0698 - 0x0698)
class UEmoteFoley final : public UEmoteBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmoteFoley">();
	}
	static class UEmoteFoley* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmoteFoley>();
	}
};

// Class FortSoundCueTemplates.EmoteMusic
// 0x0000 (0x0698 - 0x0698)
class UEmoteMusic final : public UEmoteBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmoteMusic">();
	}
	static class UEmoteMusic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmoteMusic>();
	}
};

// Class FortSoundCueTemplates.EmoteMusic3P
// 0x0000 (0x0698 - 0x0698)
class UEmoteMusic3P final : public UEmoteBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmoteMusic3P">();
	}
	static class UEmoteMusic3P* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmoteMusic3P>();
	}
};

// Class FortSoundCueTemplates.PlayerFoleyBase
// 0x0018 (0x0670 - 0x0658)
class UPlayerFoleyBase : public UFortSoundCueTemplateBase
{
public:
	int32                                         MaxVariations;                                     // 0x0658(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxVariationsMobile;                               // 0x065C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortFootstepPlayerRelation                   RelationToPlayer;                                  // 0x0660(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortFootstepStanceType                       StepType;                                          // 0x0661(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_662[0x2];                                      // 0x0662(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Elevation;                                         // 0x0664(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0668(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerFoleyBase">();
	}
	static class UPlayerFoleyBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerFoleyBase>();
	}
};

// Class FortSoundCueTemplates.PlayerFoley
// 0x00E0 (0x0750 - 0x0670)
class UPlayerFoley : public UPlayerFoleyBase
{
public:
	TArray<class USoundWave*>                     WaveVariations;                                    // 0x0670(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class USoundWave*>                     WalkVariations;                                    // 0x0680(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class USoundWave*>                     RunVariations;                                     // 0x0690(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class USoundWave*>                     SprintVariations;                                  // 0x06A0(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class USoundWave*>                     CrouchWalkVariations;                              // 0x06B0(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class USoundWave*>                     CrouchRunVariations;                               // 0x06C0(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class USoundWave*>                     WalkVariationsAboveBelow;                          // 0x06D0(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class USoundWave*>                     RunVariationsAboveBelow;                           // 0x06E0(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class USoundWave*>                     SprintVariationsAboveBelow;                        // 0x06F0(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class USoundWave*>                     CrouchWalkVariationsAboveBelow;                    // 0x0700(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class USoundWave*>                     CrouchRunVariationsAboveBelow;                     // 0x0710(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                         VariationVolume;                                   // 0x0720(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WalkVolume;                                        // 0x0724(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RunVolume;                                         // 0x0728(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SprintVolume;                                      // 0x072C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CrouchWalkVolume;                                  // 0x0730(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CrouchRunVolume;                                   // 0x0734(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WalkVolumeAboveBelow;                              // 0x0738(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RunVolumeAboveBelow;                               // 0x073C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SprintVolumeAboveBelow;                            // 0x0740(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CrouchWalkVolumeAboveBelow;                        // 0x0744(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CrouchRunVolumeAboveBelow;                         // 0x0748(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsingStances;                                     // 0x074C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74D[0x3];                                      // 0x074D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerFoley">();
	}
	static class UPlayerFoley* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerFoley>();
	}
};

// Class FortSoundCueTemplates.FootstepFoley
// 0x0010 (0x0760 - 0x0750)
class UFootstepFoley final : public UPlayerFoley
{
public:
	uint8                                         Pad_750[0x10];                                     // 0x0750(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FootstepFoley">();
	}
	static class UFootstepFoley* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFootstepFoley>();
	}
};

// Class FortSoundCueTemplates.FortSoundCueTemplateDefaults
// 0x0060 (0x0098 - 0x0038)
class UFortSoundCueTemplateDefaults : public UDataAsset
{
public:
	class USoundClass*                            SoundClass;                                        // 0x0038(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      Attenuation;                                       // 0x0040(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundConcurrency*                      Concurrency;                                       // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeMultiplier;                                  // 0x0050(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMultiplier;                                   // 0x0054(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortSubmixPair>                SubmixSends;                                       // 0x0058(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FFortBusPair>                   PreEffectBusSends;                                 // 0x0068(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FFortBusPair>                   PostEffectBusSends;                                // 0x0078(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class USoundWave*                             LicensedTrackAlternative;                          // 0x0088(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundSubmixBase*                       LicensedSubmix;                                    // 0x0090(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSoundCueTemplateDefaults">();
	}
	static class UFortSoundCueTemplateDefaults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSoundCueTemplateDefaults>();
	}
};

// Class FortSoundCueTemplates.FortSoundCueTemplateDefaultSettings
// 0x0050 (0x0088 - 0x0038)
class UFortSoundCueTemplateDefaultSettings final : public UDataAsset
{
public:
	TMap<TSubclassOf<class UFortSoundCueTemplateBase>, class UFortSoundCueTemplateDefaults*> TemplateDefaults;                                  // 0x0038(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	class UFortSoundCueTemplateDefaults* GetSettingsForTemplateType(TSubclassOf<class UFortSoundCueTemplateBase> TemplateType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSoundCueTemplateDefaultSettings">();
	}
	static class UFortSoundCueTemplateDefaultSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSoundCueTemplateDefaultSettings>();
	}
};

// Class FortSoundCueTemplates.FortSoundCueTemplateSettings
// 0x0030 (0x0090 - 0x0060)
class UFortSoundCueTemplateSettings final : public UDeveloperSettings
{
public:
	TSoftObjectPtr<class UFortSoundCueTemplateDefaultSettings> DefaultTemplateSettings;                           // 0x0060(0x0030)(Edit, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class UFortSoundCueTemplateDefaults* GetDefaultSettingsForTemplateType(TSubclassOf<class UFortSoundCueTemplateBase> TemplateType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSoundCueTemplateSettings">();
	}
	static class UFortSoundCueTemplateSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSoundCueTemplateSettings>();
	}
};

// Class FortSoundCueTemplates.FortSoundCueTemplateSimple
// 0x0010 (0x0668 - 0x0658)
class UFortSoundCueTemplateSimple : public UFortSoundCueTemplateBase
{
public:
	TArray<class USoundWave*>                     Variations;                                        // 0x0658(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSoundCueTemplateSimple">();
	}
	static class UFortSoundCueTemplateSimple* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSoundCueTemplateSimple>();
	}
};

// Class FortSoundCueTemplates.GliderThrustSCTDefaults
// 0x0180 (0x0218 - 0x0098)
class UGliderThrustSCTDefaults final : public UFortSoundCueTemplateDefaults
{
public:
	struct FGliderThrustData                      Forward;                                           // 0x0098(0x0060)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FGliderThrustData                      Sideways;                                          // 0x00F8(0x0060)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FGliderThrustData                      Backwards;                                         // 0x0158(0x0060)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FGliderThrustData                      AnyDirection;                                      // 0x01B8(0x0060)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GliderThrustSCTDefaults">();
	}
	static class UGliderThrustSCTDefaults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGliderThrustSCTDefaults>();
	}
};

// Class FortSoundCueTemplates.GliderThrustLoop
// 0x0190 (0x07E8 - 0x0658)
class UGliderThrustLoop final : public UFortSoundCueTemplateBase
{
public:
	struct FGliderThrustData                      Forward;                                           // 0x0658(0x0060)(Edit, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FGliderThrustData                      Sideways;                                          // 0x06B8(0x0060)(Edit, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FGliderThrustData                      Backwards;                                         // 0x0718(0x0060)(Edit, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FGliderThrustData                      AnyDirection;                                      // 0x0778(0x0060)(Edit, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ForwardsParamPreviewValue;                         // 0x07D8(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SidewaysParamPreviewValue;                         // 0x07DC(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BackwardsParamPreviewValue;                        // 0x07E0(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnyDirectionParamPreviewValue;                     // 0x07E4(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GliderThrustLoop">();
	}
	static class UGliderThrustLoop* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGliderThrustLoop>();
	}
};

// Class FortSoundCueTemplates.GliderThrustStart
// 0x0010 (0x0668 - 0x0658)
class UGliderThrustStart final : public UFortSoundCueTemplateBase
{
public:
	TArray<class USoundWave*>                     Variations;                                        // 0x0658(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GliderThrustStart">();
	}
	static class UGliderThrustStart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGliderThrustStart>();
	}
};

// Class FortSoundCueTemplates.GliderOpen
// 0x0000 (0x0668 - 0x0668)
class UGliderOpen final : public UFortSoundCueTemplateSimple
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GliderOpen">();
	}
	static class UGliderOpen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGliderOpen>();
	}
};

// Class FortSoundCueTemplates.GliderClose
// 0x0000 (0x0668 - 0x0668)
class UGliderClose final : public UFortSoundCueTemplateSimple
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GliderClose">();
	}
	static class UGliderClose* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGliderClose>();
	}
};

// Class FortSoundCueTemplates.MusicPack
// 0x0010 (0x0668 - 0x0658)
class UMusicPack final : public UFortSoundCueTemplateBase
{
public:
	class USoundWave*                             MusicLoop;                                         // 0x0658(0x0008)(Edit, ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bCopyrightedAudio : 1;                             // 0x0660(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MusicPack">();
	}
	static class UMusicPack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMusicPack>();
	}
};

// Class FortSoundCueTemplates.PhysicsStateSCTDefaults
// 0x0270 (0x0308 - 0x0098)
class UPhysicsStateSCTDefaults final : public UFortSoundCueTemplateDefaults
{
public:
	class FName                                   SpeedParameterName;                                // 0x0098(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsStateData                      Rolling;                                           // 0x00A8(0x0098)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsStateData                      Sliding;                                           // 0x0140(0x0098)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsStateData                      Flying;                                            // 0x01D8(0x0098)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsStateData                      Floating;                                          // 0x0270(0x0098)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsStateSCTDefaults">();
	}
	static class UPhysicsStateSCTDefaults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsStateSCTDefaults>();
	}
};

// Class FortSoundCueTemplates.PhysicsStateLoop
// 0x0288 (0x08E0 - 0x0658)
class UPhysicsStateLoop final : public UFortSoundCueTemplateBase
{
public:
	class FName                                   SpeedParameterName;                                // 0x0658(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_664[0x4];                                      // 0x0664(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsStateData                      Rolling;                                           // 0x0668(0x0098)(Edit, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsStateData                      Sliding;                                           // 0x0700(0x0098)(Edit, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsStateData                      Flying;                                            // 0x0798(0x0098)(Edit, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsStateData                      Floating;                                          // 0x0830(0x0098)(Edit, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SpeedParamPreviewValue;                            // 0x08C8(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RollingParamPreviewValue;                          // 0x08CC(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SlidingParamPreviewValue;                          // 0x08D0(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlyingParamPreviewValue;                           // 0x08D4(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatingParamPreviewValue;                         // 0x08D8(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8DC[0x4];                                      // 0x08DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsStateLoop">();
	}
	static class UPhysicsStateLoop* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsStateLoop>();
	}
};

// Class FortSoundCueTemplates.PhysicsImpactSCTDefaults
// 0x0120 (0x01B8 - 0x0098)
class UPhysicsImpactSCTDefaults final : public UFortSoundCueTemplateDefaults
{
public:
	class FName                                   ImpactTypeParameterName;                           // 0x0098(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StrengthParameterName;                             // 0x00A4(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPhysicsImpactData                     Light;                                             // 0x00B0(0x0058)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FPhysicsImpactData                     Medium;                                            // 0x0108(0x0058)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FPhysicsImpactData                     Heavy;                                             // 0x0160(0x0058)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsImpactSCTDefaults">();
	}
	static class UPhysicsImpactSCTDefaults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsImpactSCTDefaults>();
	}
};

// Class FortSoundCueTemplates.PhysicsImpact
// 0x0128 (0x0780 - 0x0658)
class UPhysicsImpact final : public UFortSoundCueTemplateBase
{
public:
	class FName                                   ImpactTypeParameterName;                           // 0x0658(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StrengthParameterName;                             // 0x0664(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPhysicsImpactData                     Light;                                             // 0x0670(0x0058)(Edit, EditorOnly, NativeAccessSpecifierPublic)
	struct FPhysicsImpactData                     Medium;                                            // 0x06C8(0x0058)(Edit, EditorOnly, NativeAccessSpecifierPublic)
	struct FPhysicsImpactData                     Heavy;                                             // 0x0720(0x0058)(Edit, EditorOnly, NativeAccessSpecifierPublic)
	int32                                         ImpactTypeParamPreviewValue;                       // 0x0778(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StrengthParamPreviewValue;                         // 0x077C(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsImpact">();
	}
	static class UPhysicsImpact* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsImpact>();
	}
};

// Class FortSoundCueTemplates.PickaxeSCTDefaults
// 0x0020 (0x00B8 - 0x0098)
class UPickaxeSCTDefaults final : public UFortSoundCueTemplateDefaults
{
public:
	class USoundAttenuation*                      CloseAttenuation;                                  // 0x0098(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      DistantAttenuation;                                // 0x00A0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USoundWave*>                     DistantVariations;                                 // 0x00A8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PickaxeSCTDefaults">();
	}
	static class UPickaxeSCTDefaults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickaxeSCTDefaults>();
	}
};

// Class FortSoundCueTemplates.PickaxeBase
// 0x0020 (0x0678 - 0x0658)
class UPickaxeBase : public UFortSoundCueTemplateBase
{
public:
	TArray<class USoundWave*>                     CloseVariations;                                   // 0x0658(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      CloseAttenuationSettings;                          // 0x0668(0x0008)(Edit, ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      DistantAttenuationSettings;                        // 0x0670(0x0008)(Edit, ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PickaxeBase">();
	}
	static class UPickaxeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickaxeBase>();
	}
};

// Class FortSoundCueTemplates.PickaxeSwing
// 0x0000 (0x0678 - 0x0678)
class UPickaxeSwing final : public UPickaxeBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PickaxeSwing">();
	}
	static class UPickaxeSwing* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickaxeSwing>();
	}
};

// Class FortSoundCueTemplates.PickaxeReady
// 0x0000 (0x0678 - 0x0678)
class UPickaxeReady final : public UPickaxeBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PickaxeReady">();
	}
	static class UPickaxeReady* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickaxeReady>();
	}
};

// Class FortSoundCueTemplates.PickaxeImpactEnemy
// 0x0000 (0x0668 - 0x0668)
class UPickaxeImpactEnemy final : public UFortSoundCueTemplateSimple
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PickaxeImpactEnemy">();
	}
	static class UPickaxeImpactEnemy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickaxeImpactEnemy>();
	}
};

// Class FortSoundCueTemplates.PlayerFoleyDefaults
// 0x0048 (0x00E0 - 0x0098)
class UPlayerFoleyDefaults final : public UFortSoundCueTemplateDefaults
{
public:
	class USoundClass*                            LocalPlayerSoundClass;                             // 0x0098(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundClass*                            TeammateSoundClass;                                // 0x00A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundClass*                            HostileSoundClass;                                 // 0x00A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      LocalPlayerAttenuation;                            // 0x00B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      AboveAttenuation;                                  // 0x00B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      BelowAttenuation;                                  // 0x00C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      ParallelAttenuation;                               // 0x00C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDistanceDatum>                 ElevationCrossfadeDistances;                       // 0x00D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerFoleyDefaults">();
	}
	static class UPlayerFoleyDefaults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerFoleyDefaults>();
	}
};

// Class FortSoundCueTemplates.WeaponLowAmmo
// 0x0000 (0x0668 - 0x0668)
class UWeaponLowAmmo final : public UFortSoundCueTemplateSimple
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WeaponLowAmmo">();
	}
	static class UWeaponLowAmmo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponLowAmmo>();
	}
};

// Class FortSoundCueTemplates.WeaponOutOfAmmo
// 0x0000 (0x0668 - 0x0668)
class UWeaponOutOfAmmo final : public UFortSoundCueTemplateSimple
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WeaponOutOfAmmo">();
	}
	static class UWeaponOutOfAmmo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponOutOfAmmo>();
	}
};

