#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteGameDebuggersRuntime

#include "Basic.hpp"

#include "FortniteGameDebuggersRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function FortniteGameDebuggersRuntime.ConversationDebuggerMenu.OnRep_ServerServiceProviderSnapshot
// 0x0108 (0x0108 - 0x0000)
struct ConversationDebuggerMenu_OnRep_ServerServiceProviderSnapshot final
{
public:
	struct FConversationProviderStateSnapshot     OldSnapshot;                                       // 0x0000(0x0108)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteGameDebuggersRuntime.ConversationDebuggerMenu.ServerSetSelectedConversationProvider
// 0x0008 (0x0008 - 0x0000)
struct ConversationDebuggerMenu_ServerSetSelectedConversationProvider final
{
public:
	const class AActor*                           InSelectedConversationProvider;                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGameDebuggersRuntime.QuestDebuggerMenu.ServerGrantPlayspaceQuest
// 0x0008 (0x0008 - 0x0000)
struct QuestDebuggerMenu_ServerGrantPlayspaceQuest final
{
public:
	const class UFortQuestItemDefinition*         QuestDef;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGameDebuggersRuntime.QuestDebuggerMenu.ServerSetSelectedManagerScope
// 0x0001 (0x0001 - 0x0000)
struct QuestDebuggerMenu_ServerSetSelectedManagerScope final
{
public:
	EQuestParticipationScope                      InSelectedScope;                                   // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGameDebuggersRuntime.QuestDebuggerMenu.ServerSetSelectedPlayspace
// 0x0008 (0x0008 - 0x0000)
struct QuestDebuggerMenu_ServerSetSelectedPlayspace final
{
public:
	const class APlayspace*                       Playspace;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGameDebuggersRuntime.QuestDebuggerMenu.ServerSetSelectedQuest
// 0x0050 (0x0050 - 0x0000)
struct QuestDebuggerMenu_ServerSetSelectedQuest final
{
public:
	struct FQuestSnapshot                         InSelectedQuestSnapshot;                           // 0x0000(0x0050)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteGameDebuggersRuntime.VerbProcessorDebuggerMenu.ServerSendVerbMessage
// 0x0010 (0x0010 - 0x0000)
struct VerbProcessorDebuggerMenu_ServerSendVerbMessage final
{
public:
	const class APlayerController*                LocalController;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UClass*                           ProcessorType;                                     // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

