#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteConversationUI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteConversationUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteConversationRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class FortniteConversationUI.FortConversationOptionBrief
// 0x0000 (0x0440 - 0x0440)
class UFortConversationOptionBrief : public UCommonUserWidget
{
public:
	void ConfigureBP(const struct FConversationContext& ClientContext, const struct FClientConversationOptionEntry& OptionEntry, const int32 SelectedIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationOptionBrief">();
	}
	static class UFortConversationOptionBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationOptionBrief>();
	}
};

// Class FortniteConversationUI.FortItemTransactionBrief
// 0x0018 (0x0458 - 0x0440)
class UFortItemTransactionBrief : public UFortConversationOptionBrief
{
public:
	uint8                                         Pad_440[0x8];                                      // 0x0440(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTransactionStrip*                  TransactionStrip_Main;                             // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItem*                              DisplayItem;                                       // 0x0450(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnTransactionInfoReceived(class UFortItem* Item);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemTransactionBrief">();
	}
	static class UFortItemTransactionBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemTransactionBrief>();
	}
};

// Class FortniteConversationUI.FortApplyAbilityBrief
// 0x0018 (0x0470 - 0x0458)
class UFortApplyAbilityBrief final : public UFortItemTransactionBrief
{
public:
	class FText                                   PurchaseServiceText;                               // 0x0458(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   Text_Display;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnAbleToPurchase();
	void OnUnableToPurchase(EPreventAbilityUseReason Reason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortApplyAbilityBrief">();
	}
	static class UFortApplyAbilityBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortApplyAbilityBrief>();
	}
};

// Class FortniteConversationUI.FortBasicBrief
// 0x0000 (0x0440 - 0x0440)
class UFortBasicBrief final : public UFortConversationOptionBrief
{
public:
	void OnChoiceTextReceived(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBasicBrief">();
	}
	static class UFortBasicBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBasicBrief>();
	}
};

// Class FortniteConversationUI.FortBasicItemBrief
// 0x0070 (0x04B0 - 0x0440)
class UFortBasicItemBrief final : public UFortConversationOptionBrief
{
public:
	uint8                                         Pad_440[0x8];                                      // 0x0440(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_TitleBar;                                     // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTransactionStrip*                  TransactionStrip_Main;                             // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItem*                              DisplayItem;                                       // 0x0458(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FDataDrivenServiceBriefConfig> ServiceConfigs;                                    // 0x0460(0x0050)(Edit, NativeAccessSpecifierPrivate)

public:
	void OnAbleToUse(const bool bShowWarningMessage);
	void OnItemInfoReceived(class UFortItem* Item, int32 StackSize);
	void OnUnableToUse(const class FText& Reason);
	void OnUpdateDescriptionText(const class FText& DescriptionText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBasicItemBrief">();
	}
	static class UFortBasicItemBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBasicItemBrief>();
	}
};

// Class FortniteConversationUI.FortBuyBrief
// 0x0000 (0x0458 - 0x0458)
class UFortBuyBrief final : public UFortItemTransactionBrief
{
public:
	void OnDisplayUnavailability(ECannotBuyReason CannotBuyReason);
	void OnPurchaseDataReceived(int32 StackSize, int32 RemainingForSale);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBuyBrief">();
	}
	static class UFortBuyBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBuyBrief>();
	}
};

// Class FortniteConversationUI.FortConversationMarker
// 0x0120 (0x0650 - 0x0530)
class UFortConversationMarker final : public UFortActorIndicatorWidget
{
public:
	uint8                                         Pad_530[0x10];                                     // 0x0530(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bShowConversationLimitHit;                         // 0x0540(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_541[0x27];                                     // 0x0541(0x0027)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InitialOffset;                                     // 0x0568(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                ManualOffset;                                      // 0x0580(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MessageBubbleDuration;                             // 0x0598(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LastTextBubbleDuration;                            // 0x059C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSetCustomInteractionWidgetOnlyWhenNeeded;         // 0x05A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonVisibilitySwitcher*              Switcher_States;                                   // 0x05A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_PreviewState;                              // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B8[0x8];                                      // 0x05B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortConversationMessageWidget*         ConversationMessage_Main;                          // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5C8[0x8];                                      // 0x05C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_ParticipantName;                              // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D8[0x8];                                      // 0x05D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortKeybindWidget*                     Keybind_Nameplate;                                 // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 NPCIcon;                                           // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture2D*                             CustomDialogMarkerIndicatorIcon;                   // 0x05F0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture2D*                             DefaultDialogMarkerIndicatorIcon;                  // 0x05F8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UTexture2D>              DefaultMaxParticipantIconTexture;                  // 0x0600(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_630[0x20];                                     // 0x0630(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCanInteract(bool bCanInteract);
	void OnConversationActorProximityChanged(EInteractionRange TargetInteractionRange, class UFortNonPlayerConversationParticipantComponent* ConversationComponent);
	void OnEntityConversationComponentParticipantsChanged(class UFortNonPlayerConversationParticipantComponent* ConversationComponent, const TArray<class AController*>& Participants, const bool bIsMaxParticipants);
	void OnInteractionRangeChanged(EInteractionRange TargetInteractionRange);
	void OnMessageShownOverActor(class AActor* OverActor);
	void OnParticipantNameSanitizationComplete(bool bSuccess, const TArray<struct FSanitizedEntry>& SanitizedEntries, const int32 SanitizeID);
	void OnSetIndicatedActor(class AActor* NewIndicatorActor);
	void SetIsAtMaxConversations(class UFortNonPlayerConversationParticipantComponent* ConversationComponent, bool bIsAtMaxConversations);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationMarker">();
	}
	static class UFortConversationMarker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationMarker>();
	}
};

// Class FortniteConversationUI.FortConversationMessageWidget
// 0x0000 (0x0488 - 0x0488)
class UFortConversationMessageWidget final : public UFortHUDElementWidget
{
public:
	void OnMainMessageSet(const class FText& NPCName, const class FText& MessageBody);
	void OnMessageHidden();
	void OnMessageShown();
	void OnPreviewMessageSet(const class FText& PreviewText);
	void SetPreviewMessage(const class FText& MessageToSet);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationMessageWidget">();
	}
	static class UFortConversationMessageWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationMessageWidget>();
	}
};

// Class FortniteConversationUI.FortConversationOption
// 0x00E0 (0x19A0 - 0x18C0)
class UFortConversationOption final : public UFortRadialPickerEntry
{
public:
	uint8                                         Pad_18C0[0x8];                                     // 0x18C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             OnOptionConfirmedSound;                            // 0x18C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                             OnOptionHoveredSound;                              // 0x18D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonVisibilitySwitcher*              Switcher_DisplayAsset;                             // 0x18D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UObject>                 DefaultSoftTaskIcon;                               // 0x18E0(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundBase>              DefaultConfirmChoiceSound;                         // 0x1910(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundBase>              DefaultHoverChoiceSound;                           // 0x1940(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1970[0x30];                                    // 0x1970(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnOptionConfirmed();
	void OnSetupFromDisplayAsset(class UObject* DisplayAsset);
	void OnSetupFromItemDef(class UFortItem* Item);
	void OnSetupPivotFromRadialInformation(int32 NumElements, int32 ItemIndex);

	int32 GetUnlockLevel() const;
	bool IsAvailable() const;
	bool IsLocked() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationOption">();
	}
	static class UFortConversationOption* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationOption>();
	}
};

// Class FortniteConversationUI.FortConversationOptionsPanel
// 0x0018 (0x0280 - 0x0268)
class UFortConversationOptionsPanel final : public UPanelWidget
{
public:
	uint8                                         Pad_268[0x10];                                     // 0x0268(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxRows;                                           // 0x0278(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MiddleColumnWidth;                                 // 0x027C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UPanelSlot* AddChildToDynamicPanel(class UWidget* Content);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationOptionsPanel">();
	}
	static class UFortConversationOptionsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationOptionsPanel>();
	}
};

// Class FortniteConversationUI.FortConversationScreen
// 0x0230 (0x07A8 - 0x0578)
class UFortConversationScreen : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x18];                                     // 0x0578(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonVisibilitySwitcher*              Switcher_Details;                                  // 0x0590(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_598[0x38];                                     // 0x0598(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        ConversationInputComp;                             // 0x05D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CurrentlySelectedIndex;                            // 0x05D8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bBlockOptionIntroAnimation;                        // 0x05DC(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5DD[0x3];                                      // 0x05DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RadialSelectionMaterialParameterName;              // 0x05E0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5EC[0x4];                                      // 0x05EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   TagPriorities;                                     // 0x05F0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class FName                                   InteractActionNameKBM;                             // 0x0600(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ADSInputAction;                                    // 0x060C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   InteractActionNameGamepad;                         // 0x0618(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_624[0x4];                                      // 0x0624(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ConfirmBinding;                                    // 0x0628(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    MakeSelectionBinding;                              // 0x0640(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    ADSMouseBinding;                                   // 0x0658(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    CancelActionBinding;                               // 0x0670(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    RightTriggerBinding;                               // 0x0688(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	TMap<class FString, TSoftClassPtr<class UClass>> DetailsNodeTypeToBrief;                            // 0x06A0(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   ChatBrief;                                         // 0x06F0(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DataDrivenBriefPrefix;                             // 0x0720(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   DataDrivenBrief;                                   // 0x0730(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSlottedRadialMenu*                 RadialMenu_DialogOptions;                          // 0x0760(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_RadialHighlight;                             // 0x0768(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortKeybindWidget*                     Keybind_Confirm;                                   // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBasicBrief*                        BasicBrief_Main;                                   // 0x0778(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                               SizeBox_RadialMenu;                                // 0x0780(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_Details;                                   // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_WheelContainer;                            // 0x0790(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_Background;                                  // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_LoadingSpinner;                              // 0x07A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void EndConversation();
	void OnConversationOptionUnavailable(class UFortRadialSlot* SelectedEntry);
	void OnConversationStarted();
	void OnItemSelected(int32 OriginalIndex);
	void OnOptionsPopulated();
	void OnSelectedItemAvailabilityChanged(bool bIsAvailable);

	bool ShouldBlockOptionIntroAnim() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationScreen">();
	}
	static class UFortConversationScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationScreen>();
	}
};

// Class FortniteConversationUI.FortDataDrivenServiceBrief
// 0x0078 (0x04B8 - 0x0440)
class UFortDataDrivenServiceBrief final : public UFortConversationOptionBrief
{
public:
	uint8                                         Pad_440[0x8];                                      // 0x0440(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_TitleBar;                                     // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   RichText_Description;                              // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_StockRemaining;                               // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortTransactionStrip*                  TransactionStrip_Main;                             // 0x0460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, struct FDataDrivenServiceBriefConfig> ServiceConfigs;                                    // 0x0468(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	void OnAbleToPurchase();
	void OnTransactionInfoReceived(class UFortItem* Item);
	void OnUnableToPurchase(const class FText& Reason);
	void OnWarningMessageUpdated(const class FText& WarningMessage);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDataDrivenServiceBrief">();
	}
	static class UFortDataDrivenServiceBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDataDrivenServiceBrief>();
	}
};

// Class FortniteConversationUI.FortDuelBrief
// 0x0020 (0x0478 - 0x0458)
class UFortDuelBrief final : public UFortItemTransactionBrief
{
public:
	class FText                                   TextTemplate;                                      // 0x0458(0x0010)(Edit, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_Objective;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTileView*                        TileView;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void DisplayLootItems(const TArray<class UFortItem*>& Items);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDuelBrief">();
	}
	static class UFortDuelBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDuelBrief>();
	}
};

// Class FortniteConversationUI.FortHireBrief
// 0x0020 (0x0478 - 0x0458)
class UFortHireBrief final : public UFortItemTransactionBrief
{
public:
	class FText                                   TextTemplate;                                      // 0x0458(0x0010)(Edit, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_Objective;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             SpecializationsVisualDataTable;                    // 0x0470(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BP_SetSpecializationIcon(class UObject* ResourceObject);
	void HandleNPCDismissal(bool bAtMaxNPCNum, bool bWillDismissNPCAtHire);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHireBrief">();
	}
	static class UFortHireBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHireBrief>();
	}
};

// Class FortniteConversationUI.FortIntelBrief
// 0x0018 (0x0470 - 0x0458)
class UFortIntelBrief final : public UFortItemTransactionBrief
{
public:
	class FText                                   TextTemplate;                                      // 0x0458(0x0010)(Edit, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_Objective;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortIntelBrief">();
	}
	static class UFortIntelBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortIntelBrief>();
	}
};

// Class FortniteConversationUI.FortItemFundBrief
// 0x0128 (0x0568 - 0x0440)
class UFortItemFundBrief final : public UCommonUserWidget
{
public:
	uint8                                         Pad_440[0xA8];                                     // 0x0440(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_TitleBar;                                     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ProgressPercent;                              // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ProgressCount;                                // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSimpleMaterialProgressBar*         Progress_Funding;                                  // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         LazyImage_Icon;                                    // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTransactionStrip*                  TransactionStrip_Main;                             // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FDataDrivenServiceBriefConfig> ServiceConfigs;                                    // 0x0518(0x0050)(Edit, NativeAccessSpecifierPrivate)

public:
	const class FText GetDataForKey(const class FString& Key, const bool bUseIndexAdjustment);
	void InitializeFromContext(const struct FConversationContext& ConversationContext);
	void OnIntializationComplete();
	void OnProgressUpdated(const float CurrentFundingFraction);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemFundBrief">();
	}
	static class UFortItemFundBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemFundBrief>();
	}
};

// Class FortniteConversationUI.FortSingleItemFundBrief
// 0x0068 (0x04A8 - 0x0440)
class UFortSingleItemFundBrief : public UFortConversationOptionBrief
{
public:
	uint8                                         Pad_440[0x8];                                      // 0x0440(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemFundBrief*                     Item_Entry;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortNPCTextDisplay*                    NPCTextDisplay;                                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, struct FDataDrivenServiceBriefConfig> ServiceConfigs;                                    // 0x0458(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSingleItemFundBrief">();
	}
	static class UFortSingleItemFundBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSingleItemFundBrief>();
	}
};

// Class FortniteConversationUI.FortMultiItemFundBrief
// 0x0010 (0x04B8 - 0x04A8)
class UFortMultiItemFundBrief final : public UFortSingleItemFundBrief
{
public:
	class UFortItemFundBrief*                     Item_EntrySecondary;                               // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemFundBrief*                     Item_EntryTertiary;                                // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void UpdateSelectedVisuals(int32 SelectedIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMultiItemFundBrief">();
	}
	static class UFortMultiItemFundBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMultiItemFundBrief>();
	}
};

// Class FortniteConversationUI.FortNPCTextDisplay
// 0x0010 (0x0428 - 0x0418)
class UFortNPCTextDisplay final : public UUserWidget
{
public:
	class UCommonRichTextBlock*                   Text_Message;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         LazyImage_NPCImage;                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnItemNameUpdated(const class FString& ItemName);
	void OnTextUpdated();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortNPCTextDisplay">();
	}
	static class UFortNPCTextDisplay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortNPCTextDisplay>();
	}
};

// Class FortniteConversationUI.FortPlayerConversationUIComponent
// 0x0178 (0x0250 - 0x00D8)
class UFortPlayerConversationUIComponent final : public UActorComponent
{
public:
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bBlockUISpawning;                                  // 0x00E0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   DialogWidgetSoftClass;                             // 0x00E8(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   DialogMarkerSoftClass;                             // 0x0118(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   MobileDialogWidgetSoftClass;                       // 0x0148(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UDynamicUIScene*>                SpectatorConversationScenes;                       // 0x0178(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UDynamicUIScene*>                SpectatorMobileConversationScenes;                 // 0x0188(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TSubclassOf<class UUserWidget>                DialogWidgetClass;                                 // 0x0198(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UUserWidget>                DialogMarkerClass;                                 // 0x01A0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUserWidgetPool                        DialogWidgetPool;                                  // 0x01A8(0x0088)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_230[0x20];                                     // 0x0230(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnMinigameReady(class AFortMinigame* InMinigame);
	void OnMinigameStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerConversationUIComponent">();
	}
	static class UFortPlayerConversationUIComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerConversationUIComponent>();
	}
};

// Class FortniteConversationUI.FortQuestBrief
// 0x0048 (0x0488 - 0x0440)
class UFortQuestBrief final : public UFortConversationOptionBrief
{
public:
	uint8                                         Pad_440[0x8];                                      // 0x0440(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ThisMatchOnlyQuestText;                            // 0x0448(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   Text_Objective;                                    // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_MoneyReward;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_XpReward;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ExpirationTime;                               // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLazyImage*                       LazyImage_QuestProviderImage;                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_QuestProvider;                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnQuestExpirationTimeSet(const bool bDisplayExpirationTime);
	void OnQuestInformationRecieved(const class FText& Objective, const struct FFortRarityItemData& RarityData, const struct FGameplayTag& CategoryTag, int32 XPReward, int32 MoneyReward, int32 TokenReward, const TSoftObjectPtr<class UTexture2D>& TokenRewardIcon);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQuestBrief">();
	}
	static class UFortQuestBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuestBrief>();
	}
};

// Class FortniteConversationUI.FortShowFutureStormCircleBrief
// 0x0018 (0x0470 - 0x0458)
class UFortShowFutureStormCircleBrief final : public UFortItemTransactionBrief
{
public:
	class FText                                   PurchaseServiceText;                               // 0x0458(0x0010)(Edit, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_Display;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnAbleToPurchase();
	void OnUnableToPurchase(EPreventUseStormCircleServiceReason Reason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortShowFutureStormCircleBrief">();
	}
	static class UFortShowFutureStormCircleBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortShowFutureStormCircleBrief>();
	}
};

// Class FortniteConversationUI.FortSingleOrMultiItemFundBrief
// 0x0070 (0x04B0 - 0x0440)
class UFortSingleOrMultiItemFundBrief final : public UFortConversationOptionBrief
{
public:
	uint8                                         Pad_440[0x8];                                      // 0x0440(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   SingleItemBrief;                                   // 0x0448(0x0030)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   MultiItemsBrief;                                   // 0x0478(0x0030)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOverlay*                               Overlay_Brief;                                     // 0x04A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSingleOrMultiItemFundBrief">();
	}
	static class UFortSingleOrMultiItemFundBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSingleOrMultiItemFundBrief>();
	}
};

// Class FortniteConversationUI.FortTransactionStrip
// 0x0088 (0x04A0 - 0x0418)
class UFortTransactionStrip final : public UUserWidget
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_CostDescription;                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortWorldItemDefinition> CachedGlobalCurrency;                              // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortWorldItemDefinition*               ResourceCurrency;                                  // 0x0430(0x0008)(Edit, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_438[0x68];                                     // 0x0438(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSetTransactionCostVisibility(const bool bVisible);
	void OnTransactionInfoReceived(const struct FFortServiceTransactionInfo& TransactionInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTransactionStrip">();
	}
	static class UFortTransactionStrip* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTransactionStrip>();
	}
};

// Class FortniteConversationUI.FortUpgradeBrief
// 0x0000 (0x0458 - 0x0458)
class UFortUpgradeBrief final : public UFortItemTransactionBrief
{
public:
	void OnUnableToUpgrade(EFortWeaponUpgradeInteractionResult CannotUpgradeCause);
	void OnUpgradeInfoReceived(class UFortItem* CurrentWeapon);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUpgradeBrief">();
	}
	static class UFortUpgradeBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUpgradeBrief>();
	}
};

// Class FortniteConversationUI.MobileConversationScreen
// 0x0030 (0x07D8 - 0x07A8)
class UMobileConversationScreen final : public UFortConversationScreen
{
public:
	class UButton*                                MobileButtonConfirm;                               // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                                MobileButtonTouchInformation;                      // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7B8[0x8];                                      // 0x07B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      MobileCloseButton;                                 // 0x07C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*              Switcher_CenteredDetails;                          // 0x07C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7D0[0x8];                                      // 0x07D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnHandleConfirmClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MobileConversationScreen">();
	}
	static class UMobileConversationScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMobileConversationScreen>();
	}
};

}

