#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortFirstPersonModeRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class FortFirstPersonModeRuntime.FortFirstPersonMode_CameraController
// 0x0038 (0x0678 - 0x0640)
class AFortFirstPersonMode_CameraController final : public AFortFirstPersonCameraController
{
public:
	float                                         HeadMotionScalar;                                  // 0x0640(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class AFortWeapon>>        AllowedWeaponClassList;                            // 0x0648(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	class USkeletalMeshComponentBudgeted*         FirstPersonSkeletalMeshComp;                       // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponentBudgeted*         ThirdPersonWeaponMeshComp;                         // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CameraYawClampAngleForStasis;                      // 0x0668(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_66C[0xC];                                      // 0x066C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AssignFirstPersonMesh(class AFortPlayerPawn* FortPlayerPawn);
	void CreateFirstPersonProxyMeshes();
	void HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void OnLocalPlayerVisibilityChanged(const bool bShouldBeVisible);
	void OnWeaponHolstered();
	void OnWeaponUnHolstered();
	void SetVisibilityForProxyMeshes(const bool bNewVisibility);
	void SetWeaponModMeshesFirstPersonVisibility(class UFortWeaponModItemDefinition* Mod, class AFortWeapon* Weapon);
	void SetWPOEnabled(const bool bEnable);
	void UpdateCharacterMeshMaterials(class AFortPlayerPawn* FortPlayerPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortFirstPersonMode_CameraController">();
	}
	static class AFortFirstPersonMode_CameraController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortFirstPersonMode_CameraController>();
	}
};

// Class FortFirstPersonModeRuntime.FortFirstPersonMode_CheatManager
// 0x0008 (0x0038 - 0x0030)
class UFortFirstPersonMode_CheatManager final : public UChildCheatManager
{
public:
	TSubclassOf<class AFortCustomCameraController> CameraControllerClass;                             // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void EnableFpCamera(const bool bEnable);
	void EnableFpCameraForAllPlayers(const bool bEnable);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortFirstPersonMode_CheatManager">();
	}
	static class UFortFirstPersonMode_CheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortFirstPersonMode_CheatManager>();
	}
};

}

