#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FractureEditor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Chaos_structs.hpp"
#include "FractureEditor_structs.hpp"
#include "UnrealEd_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class FractureEditor.FractureToolSettings
// 0x0008 (0x0038 - 0x0030)
class UFractureToolSettings : public UObject
{
public:
	class UFractureModalTool*                     OwnerTool;                                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolSettings">();
	}
	static class UFractureToolSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolSettings>();
	}
};

// Class FractureEditor.FractureProximitySettings
// 0x0038 (0x0070 - 0x0038)
class UFractureProximitySettings final : public UFractureToolSettings
{
public:
	EProximityMethod                              Method;                                            // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DistanceThreshold;                                 // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProximityContactMethod                       ContactMethod;                                     // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ContactThreshold;                                  // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAsConnectionGraph;                             // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConnectionContactMethod                      ContactAreaMethod;                                 // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowProximity;                                    // 0x005A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyShowForSelected;                              // 0x005B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LineThickness;                                     // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 LineColor;                                         // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CenterSize;                                        // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 CenterColor;                                       // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureProximitySettings">();
	}
	static class UFractureProximitySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureProximitySettings>();
	}
};

// Class FractureEditor.FractureProximityActions
// 0x0000 (0x0038 - 0x0038)
class UFractureProximityActions final : public UFractureToolSettings
{
public:
	void SaveAsDefaults();
	void SetFromDefaults();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureProximityActions">();
	}
	static class UFractureProximityActions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureProximityActions>();
	}
};

// Class FractureEditor.FractureActionTool
// 0x0010 (0x0040 - 0x0030)
class UFractureActionTool : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureActionTool">();
	}
	static class UFractureActionTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureActionTool>();
	}
};

// Class FractureEditor.FractureModalTool
// 0x0028 (0x0068 - 0x0040)
class UFractureModalTool : public UFractureActionTool
{
public:
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGeometryCollectionComponent*>   VisualizedCollections;                             // 0x0058(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureModalTool">();
	}
	static class UFractureModalTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureModalTool>();
	}
};

// Class FractureEditor.FractureToolProximity
// 0x0020 (0x0088 - 0x0068)
class UFractureToolProximity final : public UFractureModalTool
{
public:
	class UFractureProximitySettings*             ProximitySettings;                                 // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFractureProximityActions*              ProximityActions;                                  // 0x0070(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x10];                                      // 0x0078(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolProximity">();
	}
	static class UFractureToolProximity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolProximity>();
	}
};

// Class FractureEditor.FractureEditorMode
// 0x0040 (0x0190 - 0x0150)
class UFractureEditorMode final : public UBaseLegacyWidgetEdMode
{
public:
	uint8                                         Pad_150[0x40];                                     // 0x0150(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureEditorMode">();
	}
	static class UFractureEditorMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureEditorMode>();
	}
};

// Class FractureEditor.FractureModeCustomizationSettings
// 0x0040 (0x00A0 - 0x0060)
class UFractureModeCustomizationSettings final : public UDeveloperSettings
{
public:
	TArray<class FString>                         ToolSectionOrder;                                  // 0x0060(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         ToolFavorites;                                     // 0x0070(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FFractureModeCustomSectionColor> SectionColors;                                     // 0x0080(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FFractureModeCustomToolColor>   ToolColors;                                        // 0x0090(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureModeCustomizationSettings">();
	}
	static class UFractureModeCustomizationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureModeCustomizationSettings>();
	}
};

// Class FractureEditor.FractureModeSettings
// 0x0048 (0x00A8 - 0x0060)
class UFractureModeSettings final : public UDeveloperSettings
{
public:
	EFractureModeNewAssetLocation                 NewAssetLocation;                                  // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConvexCanExceedFraction;                           // 0x0064(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConvexSimplificationDistanceThreshold;             // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConvexOverlapRemoval                         ConvexRemoveOverlaps;                              // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConvexOverlapRemovalShrinkPercent;                 // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ConvexFractionAllowRemove;                         // 0x0078(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProximityMethod                              ProximityMethod;                                   // 0x0080(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ProximityDistanceThreshold;                        // 0x0084(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProximityUseAsConnectionGraph;                    // 0x0088(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConnectionContactMethod                      ProximityConnectionContactAreaMethod;              // 0x0089(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProximityContactMethod                       ProximityContactMethod;                            // 0x008A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProximityContactThreshold;                         // 0x008C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x18];                                      // 0x0090(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureModeSettings">();
	}
	static class UFractureModeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureModeSettings>();
	}
};

// Class FractureEditor.FractureSettings
// 0x0018 (0x0048 - 0x0030)
class UFractureSettings final : public UObject
{
public:
	float                                         ExplodeAmount;                                     // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FractureLevel;                                     // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideUnselected;                                   // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UGeometryCollection>     RestCollection;                                    // 0x003C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureSettings">();
	}
	static class UFractureSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureSettings>();
	}
};

// Class FractureEditor.FractureAutoClusterSettings
// 0x0040 (0x0078 - 0x0038)
class UFractureAutoClusterSettings final : public UFractureToolSettings
{
public:
	EFractureAutoClusterMode                      AutoClusterMode;                                   // 0x0038(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EClusterSizeMethod                            ClusterSizeMethod;                                 // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        SiteCount;                                         // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SiteCountFraction;                                 // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SiteSize;                                          // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ClusterGridWidth;                                  // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ClusterGridDepth;                                  // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ClusterGridHeight;                                 // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowGridLines;                                    // 0x0054(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumSize;                                       // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DriftIterations;                                   // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreferConvexity;                                  // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ConcavityTolerance;                                // 0x0068(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnforceConnectivity;                              // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnforceSiteParameters;                            // 0x0071(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAvoidIsolated;                                    // 0x0072(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureAutoClusterSettings">();
	}
	static class UFractureAutoClusterSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureAutoClusterSettings>();
	}
};

// Class FractureEditor.FractureToolAutoCluster
// 0x0048 (0x00B0 - 0x0068)
class UFractureToolAutoCluster final : public UFractureModalTool
{
public:
	class UFractureAutoClusterSettings*           AutoClusterSettings;                               // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x40];                                      // 0x0070(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolAutoCluster">();
	}
	static class UFractureToolAutoCluster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolAutoCluster>();
	}
};

// Class FractureEditor.FractureBrickSettings
// 0x0010 (0x0048 - 0x0038)
class UFractureBrickSettings final : public UFractureToolSettings
{
public:
	EFractureBrickBond                            Bond;                                              // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BrickLength;                                       // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BrickHeight;                                       // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BrickDepth;                                        // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureBrickSettings">();
	}
	static class UFractureBrickSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureBrickSettings>();
	}
};

// Class FractureEditor.FractureInteractiveTool
// 0x0000 (0x0068 - 0x0068)
class UFractureInteractiveTool : public UFractureModalTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureInteractiveTool">();
	}
	static class UFractureInteractiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureInteractiveTool>();
	}
};

// Class FractureEditor.FractureToolCutterBase
// 0x0018 (0x0080 - 0x0068)
class UFractureToolCutterBase : public UFractureInteractiveTool
{
public:
	class UFractureCutterSettings*                CutterSettings;                                    // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFractureCollisionSettings*             CollisionSettings;                                 // 0x0070(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolCutterBase">();
	}
	static class UFractureToolCutterBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolCutterBase>();
	}
};

// Class FractureEditor.FractureToolBrick
// 0x0058 (0x00D8 - 0x0080)
class UFractureToolBrick final : public UFractureToolCutterBase
{
public:
	class UFractureBrickSettings*                 BrickSettings;                                     // 0x0080(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_88[0x50];                                      // 0x0088(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolBrick">();
	}
	static class UFractureToolBrick* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolBrick>();
	}
};

// Class FractureEditor.FractureClusterCutterSettings
// 0x0020 (0x0058 - 0x0038)
class UFractureClusterCutterSettings final : public UFractureToolSettings
{
public:
	int32                                         NumberClustersMin;                                 // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumberClustersMax;                                 // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SitesPerClusterMin;                                // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SitesPerClusterMax;                                // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClusterRadiusFractionMin;                          // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClusterRadiusFractionMax;                          // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClusterRadiusOffset;                               // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureClusterCutterSettings">();
	}
	static class UFractureClusterCutterSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureClusterCutterSettings>();
	}
};

// Class FractureEditor.FractureToolVoronoiCutterBase
// 0x0098 (0x0118 - 0x0080)
class UFractureToolVoronoiCutterBase : public UFractureToolCutterBase
{
public:
	TArray<class ULineSetComponent*>              VoronoiLineSets;                                   // 0x0080(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x88];                                      // 0x0090(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolVoronoiCutterBase">();
	}
	static class UFractureToolVoronoiCutterBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolVoronoiCutterBase>();
	}
};

// Class FractureEditor.FractureToolClusterCutter
// 0x0008 (0x0120 - 0x0118)
class UFractureToolClusterCutter final : public UFractureToolVoronoiCutterBase
{
public:
	class UFractureClusterCutterSettings*         ClusterSettings;                                   // 0x0118(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolClusterCutter">();
	}
	static class UFractureToolClusterCutter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolClusterCutter>();
	}
};

// Class FractureEditor.FractureToolFlattenAll
// 0x0000 (0x0040 - 0x0040)
class UFractureToolFlattenAll final : public UFractureActionTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolFlattenAll">();
	}
	static class UFractureToolFlattenAll* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolFlattenAll>();
	}
};

// Class FractureEditor.FractureToolCluster
// 0x0000 (0x0040 - 0x0040)
class UFractureToolCluster final : public UFractureActionTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolCluster">();
	}
	static class UFractureToolCluster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolCluster>();
	}
};

// Class FractureEditor.FractureToolUncluster
// 0x0000 (0x0040 - 0x0040)
class UFractureToolUncluster final : public UFractureActionTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolUncluster">();
	}
	static class UFractureToolUncluster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolUncluster>();
	}
};

// Class FractureEditor.FractureToolMoveUp
// 0x0000 (0x0040 - 0x0040)
class UFractureToolMoveUp final : public UFractureActionTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolMoveUp">();
	}
	static class UFractureToolMoveUp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolMoveUp>();
	}
};

// Class FractureEditor.FractureToolClusterMerge
// 0x0000 (0x0040 - 0x0040)
class UFractureToolClusterMerge final : public UFractureActionTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolClusterMerge">();
	}
	static class UFractureToolClusterMerge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolClusterMerge>();
	}
};

// Class FractureEditor.FractureClusterMagnetSettings
// 0x0008 (0x0040 - 0x0038)
class UFractureClusterMagnetSettings final : public UFractureToolSettings
{
public:
	uint32                                        Iterations;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureClusterMagnetSettings">();
	}
	static class UFractureClusterMagnetSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureClusterMagnetSettings>();
	}
};

// Class FractureEditor.FractureToolClusterMagnet
// 0x0008 (0x0070 - 0x0068)
class UFractureToolClusterMagnet final : public UFractureModalTool
{
public:
	class UFractureClusterMagnetSettings*         ClusterMagnetSettings;                             // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolClusterMagnet">();
	}
	static class UFractureToolClusterMagnet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolClusterMagnet>();
	}
};

// Class FractureEditor.FractureConvertSettings
// 0x0008 (0x0040 - 0x0038)
class UFractureConvertSettings final : public UFractureToolSettings
{
public:
	bool                                          bPromptForBaseName;                                // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPerBone;                                          // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCenterPivots;                                     // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlaceInWorld;                                     // 0x003B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectNewActors;                                  // 0x003C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureConvertSettings">();
	}
	static class UFractureConvertSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureConvertSettings>();
	}
};

// Class FractureEditor.FractureReimportSettings
// 0x0008 (0x0040 - 0x0038)
class UFractureReimportSettings final : public UFractureToolSettings
{
public:
	bool                                          bOddMaterialsAreInternal;                          // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureReimportSettings">();
	}
	static class UFractureReimportSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureReimportSettings>();
	}
};

// Class FractureEditor.FractureToolConvert
// 0x0010 (0x0078 - 0x0068)
class UFractureToolConvert final : public UFractureModalTool
{
public:
	class UFractureConvertSettings*               ConvertSettings;                                   // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFractureReimportSettings*              ReimportSettings;                                  // 0x0070(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolConvert">();
	}
	static class UFractureToolConvert* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolConvert>();
	}
};

// Class FractureEditor.FractureConvexSettings
// 0x0030 (0x0068 - 0x0038)
class UFractureConvexSettings final : public UFractureToolSettings
{
public:
	double                                        CanExceedFraction;                                 // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        SimplificationDistanceThreshold;                   // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConvexOverlapRemoval                         RemoveOverlaps;                                    // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        OverlapRemovalShrinkPercent;                       // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        FractionAllowRemove;                               // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSeeThroughLines;                                  // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LineThickness;                                     // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ClearCustomConvex();
	void DeleteFromSelected();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureConvexSettings">();
	}
	static class UFractureConvexSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureConvexSettings>();
	}
};

// Class FractureEditor.FractureConvexActions
// 0x0000 (0x0038 - 0x0038)
class UFractureConvexActions final : public UFractureToolSettings
{
public:
	void SaveAsDefaults();
	void SetFromDefaults();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureConvexActions">();
	}
	static class UFractureConvexActions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureConvexActions>();
	}
};

// Class FractureEditor.FractureToolConvex
// 0x0040 (0x00A8 - 0x0068)
class UFractureToolConvex final : public UFractureModalTool
{
public:
	class UFractureConvexSettings*                ConvexSettings;                                    // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFractureConvexActions*                 ConvexActions;                                     // 0x0070(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_78[0x30];                                      // 0x0078(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolConvex">();
	}
	static class UFractureToolConvex* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolConvex>();
	}
};

// Class FractureEditor.FractureCustomVoronoiSettings
// 0x0040 (0x0078 - 0x0038)
class UFractureCustomVoronoiSettings final : public UFractureToolSettings
{
public:
	EVoronoiPattern                               VoronoiPattern;                                    // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalOffset;                                      // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Variability;                                       // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SitesToAdd;                                        // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GridX;                                             // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GridY;                                             // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GridZ;                                             // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkipFraction;                                      // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDownsamplingMode                             SkipMode;                                          // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TLazyObjectPtr<class AStaticMeshActor>        ReferenceMesh;                                     // 0x005C(0x0018)(Edit, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartAtActor;                                     // 0x0074(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearFrozenSites();
	void FreezeLiveSites();
	void RegenerateLiveSites();
	void UnfreezeSites();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureCustomVoronoiSettings">();
	}
	static class UFractureCustomVoronoiSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureCustomVoronoiSettings>();
	}
};

// Class FractureEditor.FractureToolCustomVoronoi
// 0x0068 (0x0180 - 0x0118)
class UFractureToolCustomVoronoi final : public UFractureToolVoronoiCutterBase
{
public:
	class UFractureCustomVoronoiSettings*         CustomVoronoiSettings;                             // 0x0118(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFractureTransformGizmoSettings*        GizmoSettings;                                     // 0x0120(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_128[0x58];                                     // 0x0128(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolCustomVoronoi">();
	}
	static class UFractureToolCustomVoronoi* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolCustomVoronoi>();
	}
};

// Class FractureEditor.FractureCutterSettings
// 0x0068 (0x00A0 - 0x0038)
class UFractureCutterSettings final : public UFractureToolSettings
{
public:
	class FString                                 InternalMaterial;                                  // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RandomSeed;                                        // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChanceToFracture;                                  // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGroupFracture;                                    // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGroupFractureToggleEnabled;                       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSplitIslands;                                     // 0x0052(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Grout;                                             // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGroutSettingEnabled;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawSites;                                        // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawSitesToggleEnabled;                           // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawDiagram;                                      // 0x005B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawNoisePreview;                                 // 0x005C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNoisePreviewToggleEnabled;                        // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FractionPreviewCells;                              // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NoisePreviewScale;                                 // 0x0068(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNoisePreviewHasScale;                             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Amplitude;                                         // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Frequency;                                         // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Persistence;                                       // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Lacunarity;                                        // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OctaveNumber;                                      // 0x0084(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PointSpacing;                                      // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNoiseSettingsEnabled;                             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ActiveMaterialNamesList;                           // 0x0090(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	const TArray<class FString> GetMaterialNamesFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureCutterSettings">();
	}
	static class UFractureCutterSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureCutterSettings>();
	}
};

// Class FractureEditor.FractureCollisionSettings
// 0x0008 (0x0040 - 0x0038)
class UFractureCollisionSettings final : public UFractureToolSettings
{
public:
	bool                                          bAddSamplesForCollision;                           // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PointSpacing;                                      // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureCollisionSettings">();
	}
	static class UFractureCollisionSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureCollisionSettings>();
	}
};

// Class FractureEditor.FractureTransformGizmoSettings
// 0x0028 (0x0060 - 0x0038)
class UFractureTransformGizmoSettings final : public UFractureToolSettings
{
public:
	bool                                          bUseGizmo;                                         // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCenterOnSelection;                                // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowUseGizmoOption;                               // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCombinedTransformGizmo*                TransformGizmo;                                    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTransformProxy*                        TransformProxy;                                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFractureToolCutterBase*                AttachedCutter;                                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInteractiveToolsContext*               UsedToolsContext;                                  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureTransformGizmoSettings">();
	}
	static class UFractureTransformGizmoSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureTransformGizmoSettings>();
	}
};

// Class FractureEditor.FractureToolDeleteBranch
// 0x0000 (0x0040 - 0x0040)
class UFractureToolDeleteBranch final : public UFractureActionTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolDeleteBranch">();
	}
	static class UFractureToolDeleteBranch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolDeleteBranch>();
	}
};

// Class FractureEditor.FractureToolMergeSelected
// 0x0000 (0x0040 - 0x0040)
class UFractureToolMergeSelected final : public UFractureActionTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolMergeSelected">();
	}
	static class UFractureToolMergeSelected* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolMergeSelected>();
	}
};

// Class FractureEditor.FractureToolSplitSelected
// 0x0000 (0x0040 - 0x0040)
class UFractureToolSplitSelected final : public UFractureActionTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolSplitSelected">();
	}
	static class UFractureToolSplitSelected* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolSplitSelected>();
	}
};

// Class FractureEditor.FractureToolHide
// 0x0000 (0x0040 - 0x0040)
class UFractureToolHide final : public UFractureActionTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolHide">();
	}
	static class UFractureToolHide* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolHide>();
	}
};

// Class FractureEditor.FractureToolUnhide
// 0x0000 (0x0040 - 0x0040)
class UFractureToolUnhide final : public UFractureActionTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolUnhide">();
	}
	static class UFractureToolUnhide* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolUnhide>();
	}
};

// Class FractureEditor.FractureValidateSettings
// 0x0008 (0x0040 - 0x0038)
class UFractureValidateSettings final : public UFractureToolSettings
{
public:
	bool                                          bRemoveUnreferencedGeometry;                       // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveClustersOfOne;                              // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveDanglingClusters;                           // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureValidateSettings">();
	}
	static class UFractureValidateSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureValidateSettings>();
	}
};

// Class FractureEditor.FractureToolValidate
// 0x0008 (0x0070 - 0x0068)
class UFractureToolValidate final : public UFractureModalTool
{
public:
	class UFractureValidateSettings*              ValidationSettings;                                // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolValidate">();
	}
	static class UFractureToolValidate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolValidate>();
	}
};

// Class FractureEditor.FractureToolAddEmbeddedGeometry
// 0x0000 (0x0040 - 0x0040)
class UFractureToolAddEmbeddedGeometry final : public UFractureActionTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolAddEmbeddedGeometry">();
	}
	static class UFractureToolAddEmbeddedGeometry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolAddEmbeddedGeometry>();
	}
};

// Class FractureEditor.FractureToolAutoEmbedGeometry
// 0x0000 (0x0040 - 0x0040)
class UFractureToolAutoEmbedGeometry final : public UFractureActionTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolAutoEmbedGeometry">();
	}
	static class UFractureToolAutoEmbedGeometry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolAutoEmbedGeometry>();
	}
};

// Class FractureEditor.FractureToolFlushEmbeddedGeometrySettings
// 0x0008 (0x0040 - 0x0038)
class UFractureToolFlushEmbeddedGeometrySettings final : public UFractureToolSettings
{
public:
	bool                                          bExtractAsStaticMeshActors;                        // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolFlushEmbeddedGeometrySettings">();
	}
	static class UFractureToolFlushEmbeddedGeometrySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolFlushEmbeddedGeometrySettings>();
	}
};

// Class FractureEditor.FractureToolFlushEmbeddedGeometry
// 0x0008 (0x0070 - 0x0068)
class UFractureToolFlushEmbeddedGeometry final : public UFractureModalTool
{
public:
	class UFractureToolFlushEmbeddedGeometrySettings* FlushEmbeddedGeometrySettings;                     // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolFlushEmbeddedGeometry">();
	}
	static class UFractureToolFlushEmbeddedGeometry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolFlushEmbeddedGeometry>();
	}
};

// Class FractureEditor.FractureTinyGeoSettings
// 0x0028 (0x0060 - 0x0038)
class UFractureTinyGeoSettings final : public UFractureToolSettings
{
public:
	EMergeType                                    MergeType;                                         // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnFractureLevel;                                  // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyClusters;                                     // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlySameParent;                                   // 0x003B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFractureLevelIsAll;                               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ENeighborSelectionMethod                      NeighborSelection;                                 // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyToConnected;                                  // 0x0044(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EUseBoneSelection                             UseBoneSelection;                                  // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometrySelectionMethod                      SelectionMethod;                                   // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        MinVolumeCubeRoot;                                 // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RelativeVolume;                                    // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureTinyGeoSettings">();
	}
	static class UFractureTinyGeoSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureTinyGeoSettings>();
	}
};

// Class FractureEditor.FractureToolFixTinyGeo
// 0x0030 (0x00B0 - 0x0080)
class UFractureToolFixTinyGeo final : public UFractureToolCutterBase
{
public:
	class UFractureTinyGeoSettings*               TinyGeoSettings;                                   // 0x0080(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_88[0x28];                                      // 0x0088(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FractureToolFixTinyGeo">();
	}
	static class UFractureToolFixTinyGeo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFractureToolFixTinyGeo>();
	}
};

// Class FractureEditor.FractureToolGenerateAsset
// 0x0030 (0x0070 - 0x0040)
