#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayGraph

#include "Basic.hpp"

#include "GameplayGraph_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GameplayGraph.GraphElement
// 0x0020 (0x0050 - 0x0030)
class UGraphElement : public UObject
{
public:
	EGraphElementType                             ElementType;                                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGraphUniqueIndex                      UniqueIndex;                                       // 0x0034(0x0014)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UGraph>                  ParentGraph;                                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GraphElement">();
	}
	static class UGraphElement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGraphElement>();
	}
};

// Class GameplayGraph.Graph
// 0x0108 (0x0138 - 0x0030)
class UGraph : public UObject
{
public:
	uint8                                         Pad_30[0x60];                                      // 0x0030(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGraphVertexHandle, class UGraphVertex*> Vertices;                                          // 0x0090(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<struct FGraphIslandHandle, class UGraphIsland*> Islands;                                           // 0x00E0(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_130[0x8];                                      // 0x0130(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Graph">();
	}
	static class UGraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGraph>();
	}
};

// Class GameplayGraph.GraphIsland
// 0x00B8 (0x0108 - 0x0050)
class UGraphIsland : public UGraphElement
{
public:
	uint8                                         Pad_50[0x60];                                      // 0x0050(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FGraphVertexHandle>               Vertices;                                          // 0x00B0(0x0050)(SaveGame, NativeAccessSpecifierPrivate)
	EGraphIslandOperations                        AllowedOperations;                                 // 0x0100(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GraphIsland">();
	}
	static class UGraphIsland* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGraphIsland>();
	}
};

// Class GameplayGraph.GraphVertex
// 0x00A8 (0x00F8 - 0x0050)
class UGraphVertex : public UGraphElement
{
public:
	uint8                                         Pad_50[0x30];                                      // 0x0050(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FGraphVertexHandle>               Edges;                                             // 0x0080(0x0050)(NativeAccessSpecifierPrivate)
	struct FGraphIslandHandle                     ParentIsland;                                      // 0x00D0(0x0028)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GraphVertex">();
	}
	static class UGraphVertex* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGraphVertex>();
	}
};

}

