#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamepadKeyTextButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GamepadKeyTextButton.GamepadKeyTextButton_C
// 0x00C0 (0x1920 - 0x1860)
class UGamepadKeyTextButton_C final : public UFortGamepadCustomListItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1860(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UKeybindWidget_C*                       BoundKey;                                          // 0x1868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x1870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRichTextBlockLegacy*               FortRichTextBlock_Desc;                            // 0x1878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRichTextBlockLegacy*               FortRichTextBlock_NoKey;                           // 0x1880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Nokey;                                     // 0x1888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x1890(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UClass*                                 ControllerInputStyle;                              // 0x18A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EHorizontalAlignment                          ContentAlignment;                                  // 0x18A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A9[0x7];                                     // 0x18A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class FName ActionName, const struct FKey& Key)> ChangeTheBinding_Button;                           // 0x18B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   ActionNameData;                                    // 0x18C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18CC[0x4];                                     // 0x18CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   KeyData;                                           // 0x18D0(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FText                                   TextData;                                          // 0x18F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FKey                                   KeyNone;                                           // 0x1900(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GamepadKeyTextButton(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void PreConstruct(bool IsDesignTime);
	void SetContentAlignment(EHorizontalAlignment ContentAlignment_0);
	void SetData(const struct FKey& Key, const class FText& DescText, class FName ActionName);
	void SetDataAndUpdateButton(const struct FKey& Key, const class FText& DescText, class FName ActionName);
	void SetNonInteractableStyle();
	void SetTabLabelInfo(const struct FFortTabButtonLabelInfo& TabLabelInfo);
	void UpdateButton(class UGamepadKeyTextButton_C* Button);
	void UpdateContentAlignment();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GamepadKeyTextButton_C">();
	}
	static class UGamepadKeyTextButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGamepadKeyTextButton_C>();
	}
};

}

