#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameInputBase

#include "Basic.hpp"

#include "DeveloperSettings_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "GameInputBase_structs.hpp"


namespace SDK
{

// Class GameInputBase.GameInputPlatformSettings
// 0x0020 (0x0070 - 0x0050)
class UGameInputPlatformSettings final : public UPlatformSettings
{
public:
	bool                                          bProcessController;                                // 0x0050(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProcessRawInput;                                  // 0x0051(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSpecialDevicesRequireExplicitDeviceConfiguration; // 0x0052(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProcessGamepad;                                   // 0x0053(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProcessKeyboard;                                  // 0x0054(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProcessMouse;                                     // 0x0055(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProcessRacingWheel;                               // 0x0056(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RacingWheelDeadzone;                               // 0x0058(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProcessArcadeStick;                               // 0x005C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProcessFlightStick;                               // 0x005D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FlightStickPitchDeadzone;                          // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlightStickRollDeadzone;                           // 0x0064(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlightStickThrottleDeadzone;                       // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlightStickYawDeadzone;                            // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameInputPlatformSettings">();
	}
	static class UGameInputPlatformSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameInputPlatformSettings>();
	}
};

// Class GameInputBase.GameInputDeveloperSettings
// 0x0038 (0x0068 - 0x0030)
class UGameInputDeveloperSettings final : public UObject
{
public:
	TArray<struct FGameInputDeviceConfiguration>  DeviceConfigurations;                              // 0x0030(0x0010)(Edit, ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	struct FPerPlatformSettings                   PlatformSpecificSettings;                          // 0x0040(0x0010)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          bDoNotProcessDuplicateCapabilitiesForSingleUser;   // 0x0050(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x17];                                      // 0x0051(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static const TArray<uint32> GetControllerButtonMappingDataKeyOptions();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameInputDeveloperSettings">();
	}
	static class UGameInputDeveloperSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameInputDeveloperSettings>();
	}
};

}

