#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameSubCatalogEditor

#include "Basic.hpp"

#include "TabularDataBridgeEditor_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "ExcelBridgeEditor_structs.hpp"


namespace SDK
{

// Enum GameSubCatalogEditor.ECatalogOfferRequirementMode
// NumValues: 0x0003
enum class ECatalogOfferRequirementMode : uint32
{
	Require                                  = 0,
	Deny                                     = 1,
	ECatalogOfferRequirementMode_MAX         = 2,
};

// ScriptStruct GameSubCatalogEditor.GrantPackage
// 0x0020 (0x0020 - 0x0000)
struct FGrantPackage final
{
public:
	class FString                                 PackageName;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FItemQuantity>                  ItemGrants;                                        // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GameSubCatalogEditor.EpicOfferGrantInfo
// 0x0020 (0x0020 - 0x0000)
struct FEpicOfferGrantInfo final
{
public:
	class FString                                 OfferNamespace;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OfferId;                                           // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GameSubCatalogEditor.CatalogOfferRequirementEditor
// 0x0028 (0x0028 - 0x0000)
struct FCatalogOfferRequirementEditor final
{
public:
	ECatalogOfferRequirementMode                  Mode;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinQuantity;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCatalogFulfillment*                    Fulfillment;                                       // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMcpItemDefinitionBase*                 Item;                                              // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemTemplateIdOnlyHack;                            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GameSubCatalogEditor.CatalogGiftInfoEditor
// 0x0038 (0x0038 - 0x0000)
struct FCatalogGiftInfoEditor final
{
public:
	bool                                          bGiftingEnabled;                                   // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ForcedGiftBoxTemplateId;                           // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCatalogOfferRequirementEditor> PurchaseRequirements;                              // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         GiftRecordIds;                                     // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GameSubCatalogEditor.CatalogOfferDefinition
// 0x0110 (0x0358 - 0x0248)
struct FCatalogOfferDefinition final : public FCatalogOffer
{
public:
	bool                                          bEnabledForExport;                                 // 0x0248(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRevealItemGrants;                                 // 0x0249(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCatalogKeyValue>               ServerMetaInfo;                                    // 0x0250(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 DisplayAsset;                                      // 0x0260(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCatalogMetaAsset*                      MetaAsset;                                         // 0x0290(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UCatalogFulfillment*>            Fulfillments;                                      // 0x0298(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FItemQuantity>                  InlineFulfillment;                                 // 0x02A8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 MatchFilter;                                       // 0x02B8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FilterWeight;                                      // 0x02C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCatalogOfferRequirementEditor> OfferRequirements;                                 // 0x02D0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FCatalogGiftInfoEditor                 GiftConfiguration;                                 // 0x02E0(0x0038)(Edit, NativeAccessSpecifierPublic)
	class FString                                 InlineFulfillmentClass;                            // 0x0318(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UCatalogFulfillment*>            RequiredFulfillments;                              // 0x0328(0x0010)(ZeroConstructor, Deprecated, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UCatalogFulfillment*>            DenyFulfillments;                                  // 0x0338(0x0010)(ZeroConstructor, Deprecated, UObjectWrapper, NativeAccessSpecifierPrivate)
	bool                                          SinglePurchaseOnly;                                // 0x0348(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCatalogFulfillment*                    Fulfillment;                                       // 0x0350(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct GameSubCatalogEditor.CatalogStorefrontMatch
// 0x0068 (0x0068 - 0x0000)
struct FCatalogStorefrontMatch final
{
public:
	class FString                                 MatchFilter;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PullCount;                                         // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            MetaData;                                          // 0x0018(0x0050)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct GameSubCatalogEditor.CatalogStorefrontDef
// 0x0020 (0x0020 - 0x0000)
struct FCatalogStorefrontDef final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCatalogStorefrontMatch>        Matches;                                           // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GameSubCatalogEditor.CatalogTableFilter
// 0x0028 (0x0028 - 0x0000)
struct FCatalogTableFilter final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Match;                                             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PullCount;                                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameSubCatalogEditor.CatalogOfferSource
// 0x00F0 (0x00F0 - 0x0000)
struct FCatalogOfferSource final
{
public:
	class FString                                 SourceName;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FExcelImportUtil                       ExcelImport;                                       // 0x0010(0x0050)(Edit, NativeAccessSpecifierPublic)
	struct FTabularDataTransferUtil               TabDataTransfer;                                   // 0x0060(0x0070)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FCatalogOfferDefinition>        Offers;                                            // 0x00D0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class UCatalogDefinition*                     Parent;                                            // 0x00E0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerated;                                        // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameSubCatalogEditor.LocalizedCatalogSettings
// 0x0060 (0x0060 - 0x0000)
struct FLocalizedCatalogSettings final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LocalizedCatalogFileName;                          // 0x0010(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExportCatalogFileName;                             // 0x0020(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExportLocalizationCatalogFileName;                 // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TemplateName;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         SuppressCultures;                                  // 0x0050(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
};

}

