#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameInputBase

#include "Basic.hpp"


namespace SDK
{

// Enum GameInputBase.ERawDeviceReportTranslationBehavior
// NumValues: 0x0006
enum class ERawDeviceReportTranslationBehavior : uint8
{
	TreatAsTrigger                           = 0,
	TreatAsAnalog                            = 1,
	TreatAsButton                            = 2,
	TreatAsButtonBitmask                     = 3,
	TreatAsPackedAxisPair                    = 4,
	ERawDeviceReportTranslationBehavior_MAX  = 5,
};

// ScriptStruct GameInputBase.GameInputDeviceIdentifier
// 0x0004 (0x0004 - 0x0000)
struct FGameInputDeviceIdentifier final
{
public:
	uint16                                        VendorId;                                          // 0x0000(0x0002)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        ProductId;                                         // 0x0002(0x0002)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GameInputBase.GameInputControllerAxisData
// 0x0018 (0x0018 - 0x0000)
struct FGameInputControllerAxisData final
{
public:
	class FName                                   KeyName;                                           // 0x0000(0x000C)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeadZone;                                          // 0x000C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scalar;                                            // 0x0010(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPackedPositveAndNegative;                       // 0x0014(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameInputBase.GameInputRawDeviceReportData
// 0x0070 (0x0070 - 0x0000)
struct FGameInputRawDeviceReportData final
{
public:
	class FName                                   KeyName;                                           // 0x0000(0x000C)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreAnalogInputDeviceScopeForThisRawReport;     // 0x000C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERawDeviceReportTranslationBehavior           TranslationBehavior;                               // 0x000D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         AnalogDeadzone;                                    // 0x000E(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Scalar;                                            // 0x0010(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class FName>                      ButtonBitMaskMappings;                             // 0x0018(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	uint8                                         LowerBitAxisIndex;                                 // 0x0068(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         HigherBitAxisIndex;                                // 0x0069(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GameInputBase.GameInputDeviceConfiguration
// 0x0130 (0x0130 - 0x0000)
struct FGameInputDeviceConfiguration final
{
public:
	struct FGameInputDeviceIdentifier             DeviceIdentifier;                                  // 0x0000(0x0004)(Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Description;                                       // 0x0008(0x0010)(Edit, ZeroConstructor, Config, EditorOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideHardwareDeviceIdString;                   // 0x0018(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OverriddenHardwareDeviceId;                        // 0x0020(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProcessControllerButtons;                         // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProcessControllerSwitchState;                     // 0x0031(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProcessControllerAxis;                            // 0x0032(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<uint32, class FName>                     ControllerButtonMappingData;                       // 0x0038(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	TMap<uint32, struct FGameInputControllerAxisData> ControllerAxisMappingData;                         // 0x0088(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	bool                                          bProcessRawReportData;                             // 0x00D8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        RawReportReadingId;                                // 0x00DC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<int32, struct FGameInputRawDeviceReportData> RawReportMappingData;                              // 0x00E0(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
};

}

