#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameFeatures

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameFeatures_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class GameFeatures.GameFeatureStateChangeObserver
// 0x0000 (0x0030 - 0x0030)
class IGameFeatureStateChangeObserver final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureStateChangeObserver">();
	}
	static class IGameFeatureStateChangeObserver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGameFeatureStateChangeObserver>();
	}
};

// Class GameFeatures.GameFeatureVersePathMapperCommandlet
// 0x0000 (0x0088 - 0x0088)
class UGameFeatureVersePathMapperCommandlet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureVersePathMapperCommandlet">();
	}
	static class UGameFeatureVersePathMapperCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureVersePathMapperCommandlet>();
	}
};

// Class GameFeatures.GameFeatureAction
// 0x0000 (0x0030 - 0x0030)
class UGameFeatureAction : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction">();
	}
	static class UGameFeatureAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction>();
	}
};

// Class GameFeatures.GameFeatureAction_AddActorFactory
// 0x0038 (0x0068 - 0x0030)
class UGameFeatureAction_AddActorFactory final : public UGameFeatureAction
{
public:
	TSoftClassPtr<class UClass>                   ActorFactory;                                      // 0x0030(0x0030)(Edit, EditorOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_AddActorFactory">();
	}
	static class UGameFeatureAction_AddActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddActorFactory>();
	}
};

// Class GameFeatures.GameFeatureAction_AddCheats
// 0x0038 (0x0068 - 0x0030)
class UGameFeatureAction_AddCheats final : public UGameFeatureAction
{
public:
	TArray<TSoftClassPtr<class UClass>>           CheatManagers;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bLoadCheatManagersAsync;                           // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0xF];                                       // 0x0041(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class UCheatManagerExtension>> SpawnedCheatManagers;                              // 0x0050(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_AddCheats">();
	}
	static class UGameFeatureAction_AddCheats* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddCheats>();
	}
};

// Class GameFeatures.GameFeatureAction_AddChunkOverride
// 0x0010 (0x0040 - 0x0030)
class UGameFeatureAction_AddChunkOverride final : public UGameFeatureAction
{
public:
	bool                                          bShouldOverrideChunk;                              // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ChunkId;                                           // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ParentChunk;                                       // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         LowestAllowedChunkIndexForAutoGeneration;          // 0x003C(0x0004)(ZeroConstructor, Config, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_AddChunkOverride">();
	}
	static class UGameFeatureAction_AddChunkOverride* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddChunkOverride>();
	}
};

// Class GameFeatures.GameFeatureAction_AddComponents
// 0x0060 (0x0090 - 0x0030)
class UGameFeatureAction_AddComponents final : public UGameFeatureAction
{
public:
	TArray<struct FGameFeatureComponentEntry>     ComponentList;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x50];                                      // 0x0040(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_AddComponents">();
	}
	static class UGameFeatureAction_AddComponents* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddComponents>();
	}
};

// Class GameFeatures.GameFeatureAction_AddWorldPartitionContent
// 0x0028 (0x0058 - 0x0030)
class UGameFeatureAction_AddWorldPartitionContent final : public UGameFeatureAction
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UExternalDataLayerAsset*                ExternalDataLayerAsset;                            // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  ConvertedContentBundleGuid;                        // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_AddWorldPartitionContent">();
	}
	static class UGameFeatureAction_AddWorldPartitionContent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddWorldPartitionContent>();
	}
};

// Class GameFeatures.GameFeatureAction_AddWPContent
// 0x0018 (0x0048 - 0x0030)
class UGameFeatureAction_AddWPContent final : public UGameFeatureAction
{
public:
	class UContentBundleDescriptor*               ContentBundleDescriptor;                           // 0x0030(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_AddWPContent">();
	}
	static class UGameFeatureAction_AddWPContent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddWPContent>();
	}
};

// Class GameFeatures.GameFeatureAction_AudioActionBase
// 0x0010 (0x0040 - 0x0030)
class UGameFeatureAction_AudioActionBase : public UGameFeatureAction
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_AudioActionBase">();
	}
	static class UGameFeatureAction_AudioActionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AudioActionBase>();
	}
};

// Class GameFeatures.GameFeatureAction_DataRegistry
// 0x0018 (0x0048 - 0x0030)
class UGameFeatureAction_DataRegistry final : public UGameFeatureAction
{
public:
	TArray<TSoftObjectPtr<class UDataRegistry>>   RegistriesToAdd;                                   // 0x0030(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	bool                                          bPreloadInEditor;                                  // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPreloadInCommandlets;                             // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_DataRegistry">();
	}
	static class UGameFeatureAction_DataRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_DataRegistry>();
	}
};

// Class GameFeatures.GameFeatureAction_DataRegistrySource
// 0x0018 (0x0048 - 0x0030)
class UGameFeatureAction_DataRegistrySource final : public UGameFeatureAction
{
public:
	TArray<struct FDataRegistrySourceToAdd>       SourcesToAdd;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bPreloadInEditor;                                  // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_DataRegistrySource">();
	}
	static class UGameFeatureAction_DataRegistrySource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_DataRegistrySource>();
	}
};

// Class GameFeatures.GameFeatureData
// 0x0020 (0x0068 - 0x0048)
class UGameFeatureData : public UPrimaryDataAsset
{
public:
	TArray<class UGameFeatureAction*>             Actions;                                           // 0x0048(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FPrimaryAssetTypeInfo>          PrimaryAssetTypesToScan;                           // 0x0058(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static void GetPluginName(const class UGameFeatureData* GFD, class FString* PluginName);

	TArray<class UClass*> GetDisallowedActions() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureData">();
	}
	static class UGameFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureData>();
	}
};

// Class GameFeatures.GameFeatureOptionalContentInstaller
// 0x0110 (0x0140 - 0x0030)
class UGameFeatureOptionalContentInstaller final : public UObject
{
public:
	uint8                                         Pad_30[0x110];                                     // 0x0030(0x0110)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureOptionalContentInstaller">();
	}
	static class UGameFeatureOptionalContentInstaller* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureOptionalContentInstaller>();
	}
};

// Class GameFeatures.GameFeaturePluginStateMachine
// 0x0218 (0x0248 - 0x0030)
class UGameFeaturePluginStateMachine final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameFeaturePluginStateMachineProperties StateProperties;                                   // 0x0038(0x00E0)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_118[0x130];                                    // 0x0118(0x0130)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeaturePluginStateMachine">();
	}
	static class UGameFeaturePluginStateMachine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeaturePluginStateMachine>();
	}
};

// Class GameFeatures.GameFeaturesProjectPolicies
// 0x0000 (0x0030 - 0x0030)
class UGameFeaturesProjectPolicies : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeaturesProjectPolicies">();
	}
	static class UGameFeaturesProjectPolicies* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeaturesProjectPolicies>();
	}
};

// Class GameFeatures.DefaultGameFeaturesProjectPolicies
// 0x0000 (0x0030 - 0x0030)
class UDefaultGameFeaturesProjectPolicies final : public UGameFeaturesProjectPolicies
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DefaultGameFeaturesProjectPolicies">();
	}
	static class UDefaultGameFeaturesProjectPolicies* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultGameFeaturesProjectPolicies>();
	}
};

// Class GameFeatures.GameFeaturesSubsystem
// 0x0178 (0x01B0 - 0x0038)
class UGameFeaturesSubsystem final : public UEngineSubsystem
{
public:
	TMap<class FString, class UGameFeaturePluginStateMachine*> GameFeaturePluginStateMachines;                    // 0x0038(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UGameFeaturePluginStateMachine*> TerminalGameFeaturePluginStateMachines;            // 0x0088(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_98[0xA0];                                      // 0x0098(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        Observers;                                         // 0x0138(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UGameFeaturesProjectPolicies*           GameSpecificPolicies;                              // 0x0148(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_150[0x60];                                     // 0x0150(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeaturesSubsystem">();
	}
	static class UGameFeaturesSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeaturesSubsystem>();
	}
};

// Class GameFeatures.GameFeaturesSubsystemSettings
// 0x0078 (0x00D8 - 0x0060)
class UGameFeaturesSubsystemSettings final : public UDeveloperSettings
{
public:
	struct FSoftClassPath                         GameFeaturesManagerClassName;                      // 0x0060(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         EnabledPlugins;                                    // 0x0088(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         DisabledPlugins;                                   // 0x0098(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         AdditionalPluginMetadataKeys;                      // 0x00A8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x20];                                      // 0x00B8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeaturesSubsystemSettings">();
	}
	static class UGameFeaturesSubsystemSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeaturesSubsystemSettings>();
	}
};

}

