#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayCameras

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayCameras_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GameplayCameras.HasCameraBuildStatus
// 0x0000 (0x0030 - 0x0030)
class IHasCameraBuildStatus final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HasCameraBuildStatus">();
	}
	static class IHasCameraBuildStatus* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHasCameraBuildStatus>();
	}
};

// Class GameplayCameras.CameraRigProxyAsset
// 0x0010 (0x0040 - 0x0030)
class UCameraRigProxyAsset final : public UObject
{
public:
	struct FGuid                                  Guid;                                              // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraRigProxyAsset">();
	}
	static class UCameraRigProxyAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigProxyAsset>();
	}
};

// Class GameplayCameras.CameraRigProxyTable
// 0x0010 (0x0040 - 0x0030)
class UCameraRigProxyTable final : public UObject
{
public:
	TArray<struct FCameraRigProxyTableEntry>      Entries;                                           // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraRigProxyTable">();
	}
	static class UCameraRigProxyTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigProxyTable>();
	}
};

// Class GameplayCameras.LegacyCameraShake
// 0x0110 (0x01F0 - 0x00E0)
class ULegacyCameraShake final : public UCameraShakeBase
{
public:
	float                                         OscillationDuration;                               // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OscillationBlendInTime;                            // 0x00DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OscillationBlendOutTime;                           // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FROscillator                           RotOscillation;                                    // 0x00E4(0x0024)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FVOscillator                           LocOscillation;                                    // 0x0108(0x0024)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FFOscillator                           FOVOscillation;                                    // 0x012C(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         AnimPlayRate;                                      // 0x0138(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimScale;                                         // 0x013C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimBlendInTime;                                   // 0x0140(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimBlendOutTime;                                  // 0x0144(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RandomAnimSegmentDuration;                         // 0x0148(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraAnimationSequence*               AnimSequence;                                      // 0x0150(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bRandomAnimSegment : 1;                            // 0x0158(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OscillatorTimeRemaining;                           // 0x015C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_160[0x78];                                     // 0x0160(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class USequenceCameraShakePattern*            SequenceShakePattern;                              // 0x01D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E0[0x10];                                     // 0x01E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class ULegacyCameraShake* StartLegacyCameraShake(class APlayerCameraManager* PlayerCameraManager, TSubclassOf<class ULegacyCameraShake> ShakeClass, float Scale, ECameraShakePlaySpace PlaySpace, const struct FRotator& UserPlaySpaceRot);
	static class ULegacyCameraShake* StartLegacyCameraShakeFromSource(class APlayerCameraManager* PlayerCameraManager, TSubclassOf<class ULegacyCameraShake> ShakeClass, class UCameraShakeSourceComponent* SourceComponent, float Scale, ECameraShakePlaySpace PlaySpace, const struct FRotator& UserPlaySpaceRot);

	void BlueprintUpdateCameraShake(float DeltaTime, float Alpha, const struct FMinimalViewInfo& POV, struct FMinimalViewInfo* ModifiedPOV);
	void ReceivePlayShake(float Scale);
	void ReceiveStopShake(bool bImmediately);

	bool ReceiveIsFinished() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LegacyCameraShake">();
	}
	static class ULegacyCameraShake* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyCameraShake>();
	}
};

// Class GameplayCameras.LegacyCameraShakePattern
// 0x0000 (0x0030 - 0x0030)
class ULegacyCameraShakePattern final : public UCameraShakePattern
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LegacyCameraShakePattern">();
	}
	static class ULegacyCameraShakePattern* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyCameraShakePattern>();
	}
};

// Class GameplayCameras.LegacyCameraShakeFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class ULegacyCameraShakeFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class ULegacyCameraShake* Conv_LegacyCameraShake(class UCameraShakeBase* CameraShake);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LegacyCameraShakeFunctionLibrary">();
	}
	static class ULegacyCameraShakeFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyCameraShakeFunctionLibrary>();
	}
};

// Class GameplayCameras.ObjectTreeGraphObject
// 0x0000 (0x0030 - 0x0030)
class IObjectTreeGraphObject final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectTreeGraphObject">();
	}
	static class IObjectTreeGraphObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IObjectTreeGraphObject>();
	}
};

// Class GameplayCameras.ObjectTreeGraphRootObject
// 0x0000 (0x0030 - 0x0030)
class IObjectTreeGraphRootObject final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectTreeGraphRootObject">();
	}
	static class IObjectTreeGraphRootObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IObjectTreeGraphRootObject>();
	}
};

// Class GameplayCameras.CameraAnimationCameraModifier
// 0x0018 (0x0068 - 0x0050)
class UCameraAnimationCameraModifier final : public UCameraModifier
{
public:
	TArray<struct FActiveCameraAnimationInfo>     ActiveAnimations;                                  // 0x0050(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint16                                        NextInstanceSerialNumber;                          // 0x0060(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UCameraAnimationCameraModifier* GetCameraAnimationCameraModifier(const class UObject* WorldContextObject, int32 PlayerIndex);
	static class UCameraAnimationCameraModifier* GetCameraAnimationCameraModifierFromID(const class UObject* WorldContextObject, int32 ControllerID);
	static class UCameraAnimationCameraModifier* GetCameraAnimationCameraModifierFromPlayerController(const class APlayerController* PlayerController);

	struct FCameraAnimationHandle PlayCameraAnimation(class UCameraAnimationSequence* Sequence, const struct FCameraAnimationParams& Params_0);
	void StopAllCameraAnimations(bool bImmediate);
	void StopAllCameraAnimationsOf(class UCameraAnimationSequence* Sequence, bool bImmediate);
	void StopCameraAnimation(const struct FCameraAnimationHandle& Handle, bool bImmediate);

	bool IsCameraAnimationActive(const struct FCameraAnimationHandle& Handle) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraAnimationCameraModifier">();
	}
	static class UCameraAnimationCameraModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraAnimationCameraModifier>();
	}
};

// Class GameplayCameras.GameplayCamerasFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class UGameplayCamerasFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UCameraAnimationCameraModifier* Conv_CameraAnimationCameraModifier(class APlayerCameraManager* PlayerCameraManager);
	static ECameraAnimationPlaySpace Conv_CameraAnimationPlaySpace(ECameraShakePlaySpace CameraShakePlaySpace);
	static ECameraShakePlaySpace Conv_CameraShakePlaySpace(ECameraAnimationPlaySpace CameraAnimationPlaySpace);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayCamerasFunctionLibrary">();
	}
	static class UGameplayCamerasFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCamerasFunctionLibrary>();
	}
};

// Class GameplayCameras.CameraNode
// 0x0030 (0x0060 - 0x0030)
class UCameraNode : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsEnabled;                                        // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntVector2                            GraphNodePos;                                      // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GraphNodeComment;                                  // 0x0048(0x0010)(ZeroConstructor, EditorOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GraphNodePosX;                                     // 0x0058(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GraphNodePosY;                                     // 0x005C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraNode">();
	}
	static class UCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraNode>();
	}
};

// Class GameplayCameras.BlendCameraNode
// 0x0000 (0x0060 - 0x0060)
class UBlendCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlendCameraNode">();
	}
	static class UBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendCameraNode>();
	}
};

// Class GameplayCameras.BlendStackCameraNode
// 0x0008 (0x0068 - 0x0060)
class UBlendStackCameraNode final : public UCameraNode
{
public:
	bool                                          bAutoPop;                                          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlendFirstCameraRig;                              // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlendStackCameraNode">();
	}
	static class UBlendStackCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendStackCameraNode>();
	}
};

// Class GameplayCameras.BlendStackRootCameraNode
// 0x0010 (0x0070 - 0x0060)
class UBlendStackRootCameraNode final : public UCameraNode
{
public:
	class UBlendCameraNode*                       Blend;                                             // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraNode*                            RootNode;                                          // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlendStackRootCameraNode">();
	}
	static class UBlendStackRootCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendStackRootCameraNode>();
	}
};

// Class GameplayCameras.CameraAsset
// 0x0088 (0x00B8 - 0x0030)
class UCameraAsset final : public UObject
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraDirector*                        CameraDirector;                                    // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UCameraRigAsset*>                CameraRigs;                                        // 0x0058(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UCameraRigTransition*>           EnterTransitions;                                  // 0x0068(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UCameraRigTransition*>           ExitTransitions;                                   // 0x0078(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	ECameraBuildStatus                            BuildStatus;                                       // 0x0088(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntVector2                            TransitionGraphNodePos;                            // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TransitionGraphNodeComment;                        // 0x0098(0x0010)(ZeroConstructor, EditorOnly, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                        AllSharedTransitionsObjects;                       // 0x00A8(0x0010)(ExportObject, ZeroConstructor, EditorOnly, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraAsset">();
	}
	static class UCameraAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraAsset>();
	}
};

// Class GameplayCameras.CameraDirector
// 0x0000 (0x0030 - 0x0030)
class UCameraDirector : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraDirector">();
	}
	static class UCameraDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraDirector>();
	}
};

// Class GameplayCameras.CameraRigInterfaceParameter
// 0x0040 (0x0070 - 0x0030)
class UCameraRigInterfaceParameter final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraNode*                            Target;                                            // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetPropertyName;                                // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InterfaceParameterName;                            // 0x0050(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraVariableAsset*                   PrivateVariable;                                   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector2                            GraphNodePos;                                      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraRigInterfaceParameter">();
	}
	static class UCameraRigInterfaceParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigInterfaceParameter>();
	}
};

// Class GameplayCameras.CameraRigAsset
// 0x0100 (0x0130 - 0x0030)
class UCameraRigAsset final : public UObject
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraNode*                            RootNode;                                          // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x0058(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FCameraRigInterface                    Interface;                                         // 0x0078(0x0020)(ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UCameraRigTransition*>           EnterTransitions;                                  // 0x0098(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UCameraRigTransition*>           ExitTransitions;                                   // 0x00A8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FCameraRigAllocationInfo               AllocationInfo;                                    // 0x00B8(0x0018)(NativeAccessSpecifierPublic)
	ECameraBuildStatus                            BuildStatus;                                       // 0x00D0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntVector2                            NodeGraphNodePos;                                  // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FIntVector2                            TransitionGraphNodePos;                            // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NodeGraphNodeComment;                              // 0x00E8(0x0010)(ZeroConstructor, EditorOnly, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 TransitionGraphNodeComment;                        // 0x00F8(0x0010)(ZeroConstructor, EditorOnly, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                        AllNodeTreeObjects;                                // 0x0108(0x0010)(ExportObject, ZeroConstructor, EditorOnly, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                        AllTransitionsObjects;                             // 0x0118(0x0010)(ExportObject, ZeroConstructor, EditorOnly, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	int32                                         GraphNodePosX;                                     // 0x0128(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         GraphNodePosY;                                     // 0x012C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraRigAsset">();
	}
	static class UCameraRigAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigAsset>();
	}
};

// Class GameplayCameras.CameraRigTransitionCondition
// 0x0028 (0x0058 - 0x0030)
class UCameraRigTransitionCondition : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntVector2                            GraphNodePos;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 GraphNodeComment;                                  // 0x0040(0x0010)(ZeroConstructor, EditorOnly, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         GraphNodePosX;                                     // 0x0050(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         GraphNodePosY;                                     // 0x0054(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraRigTransitionCondition">();
	}
	static class UCameraRigTransitionCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigTransitionCondition>();
	}
};

// Class GameplayCameras.CameraRigTransition
// 0x0040 (0x0070 - 0x0030)
class UCameraRigTransition final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCameraRigTransitionCondition*>  Conditions;                                        // 0x0038(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	class UBlendCameraNode*                       Blend;                                             // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector2                            GraphNodePos;                                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 GraphNodeComment;                                  // 0x0058(0x0010)(ZeroConstructor, EditorOnly, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         GraphNodePosX;                                     // 0x0068(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         GraphNodePosY;                                     // 0x006C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraRigTransition">();
	}
	static class UCameraRigTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigTransition>();
	}
};

// Class GameplayCameras.CameraVariableAsset
// 0x0018 (0x0048 - 0x0030)
class UCameraVariableAsset : public UObject
{
public:
	class FString                                 DisplayName;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, EditorOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoReset;                                        // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPrivate;                                        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraVariableID                      VariableID;                                        // 0x0044(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraVariableAsset">();
	}
	static class UCameraVariableAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraVariableAsset>();
	}
};

// Class GameplayCameras.BooleanCameraVariable
// 0x0008 (0x0050 - 0x0048)
class UBooleanCameraVariable final : public UCameraVariableAsset
{
public:
	bool                                          bDefaultValue;                                     // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BooleanCameraVariable">();
	}
	static class UBooleanCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBooleanCameraVariable>();
	}
};

// Class GameplayCameras.Integer32CameraVariable
// 0x0008 (0x0050 - 0x0048)
class UInteger32CameraVariable final : public UCameraVariableAsset
{
public:
	int32                                         DefaultValue;                                      // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Integer32CameraVariable">();
	}
	static class UInteger32CameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteger32CameraVariable>();
	}
};

// Class GameplayCameras.FloatCameraVariable
// 0x0008 (0x0050 - 0x0048)
class UFloatCameraVariable final : public UCameraVariableAsset
{
public:
	float                                         DefaultValue;                                      // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FloatCameraVariable">();
	}
	static class UFloatCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFloatCameraVariable>();
	}
};

// Class GameplayCameras.DoubleCameraVariable
// 0x0008 (0x0050 - 0x0048)
class UDoubleCameraVariable final : public UCameraVariableAsset
{
public:
	double                                        DefaultValue;                                      // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DoubleCameraVariable">();
	}
	static class UDoubleCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDoubleCameraVariable>();
	}
};

// Class GameplayCameras.Vector2fCameraVariable
// 0x0008 (0x0050 - 0x0048)
class UVector2fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector2f                              DefaultValue;                                      // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vector2fCameraVariable">();
	}
	static class UVector2fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector2fCameraVariable>();
	}
};

// Class GameplayCameras.Vector2dCameraVariable
// 0x0010 (0x0058 - 0x0048)
class UVector2dCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector2D                              DefaultValue;                                      // 0x0048(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vector2dCameraVariable">();
	}
	static class UVector2dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector2dCameraVariable>();
	}
};

// Class GameplayCameras.Vector3fCameraVariable
// 0x0010 (0x0058 - 0x0048)
class UVector3fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector3f                              DefaultValue;                                      // 0x0048(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vector3fCameraVariable">();
	}
	static class UVector3fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector3fCameraVariable>();
	}
};

// Class GameplayCameras.Vector3dCameraVariable
// 0x0018 (0x0060 - 0x0048)
class UVector3dCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector3d                              DefaultValue;                                      // 0x0048(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vector3dCameraVariable">();
	}
	static class UVector3dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector3dCameraVariable>();
	}
};

// Class GameplayCameras.Vector4fCameraVariable
// 0x0018 (0x0060 - 0x0048)
class UVector4fCameraVariable final : public UCameraVariableAsset
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4f                              DefaultValue;                                      // 0x0050(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vector4fCameraVariable">();
	}
	static class UVector4fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector4fCameraVariable>();
	}
};

// Class GameplayCameras.Vector4dCameraVariable
// 0x0028 (0x0070 - 0x0048)
class UVector4dCameraVariable final : public UCameraVariableAsset
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4d                              DefaultValue;                                      // 0x0050(0x0020)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vector4dCameraVariable">();
	}
	static class UVector4dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector4dCameraVariable>();
	}
};

// Class GameplayCameras.Rotator3fCameraVariable
// 0x0010 (0x0058 - 0x0048)
class URotator3fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FRotator3f                             DefaultValue;                                      // 0x0048(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Rotator3fCameraVariable">();
	}
	static class URotator3fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<URotator3fCameraVariable>();
	}
};

// Class GameplayCameras.Rotator3dCameraVariable
// 0x0018 (0x0060 - 0x0048)
class URotator3dCameraVariable final : public UCameraVariableAsset
{
public:
	struct FRotator3d                             DefaultValue;                                      // 0x0048(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Rotator3dCameraVariable">();
	}
	static class URotator3dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<URotator3dCameraVariable>();
	}
};

// Class GameplayCameras.Transform3fCameraVariable
// 0x0038 (0x0080 - 0x0048)
class UTransform3fCameraVariable final : public UCameraVariableAsset
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform3f                           DefaultValue;                                      // 0x0050(0x0030)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Transform3fCameraVariable">();
	}
	static class UTransform3fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTransform3fCameraVariable>();
	}
};

// Class GameplayCameras.Transform3dCameraVariable
// 0x0068 (0x00B0 - 0x0048)
class UTransform3dCameraVariable final : public UCameraVariableAsset
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform3d                           DefaultValue;                                      // 0x0050(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Transform3dCameraVariable">();
	}
	static class UTransform3dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTransform3dCameraVariable>();
	}
};

// Class GameplayCameras.CameraVariableCollection
// 0x0010 (0x0040 - 0x0030)
class UCameraVariableCollection final : public UObject
{
public:
	TArray<class UCameraVariableAsset*>           Variables;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraVariableCollection">();
	}
	static class UCameraVariableCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraVariableCollection>();
	}
};

// Class GameplayCameras.RootCameraNode
// 0x0000 (0x0060 - 0x0060)
class URootCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RootCameraNode">();
	}
	static class URootCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootCameraNode>();
	}
};

// Class GameplayCameras.DefaultRootCameraNode
// 0x0020 (0x0080 - 0x0060)
class UDefaultRootCameraNode final : public URootCameraNode
{
public:
	class UBlendStackCameraNode*                  BaseLayer;                                         // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendStackCameraNode*                  MainLayer;                                         // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendStackCameraNode*                  GlobalLayer;                                       // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendStackCameraNode*                  VisualLayer;                                       // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DefaultRootCameraNode">();
	}
	static class UDefaultRootCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultRootCameraNode>();
	}
};

// Class GameplayCameras.BlueprintCameraDirectorEvaluator
// 0x0010 (0x0040 - 0x0030)
class UBlueprintCameraDirectorEvaluator final : public UObject
{
public:
	struct FBlueprintCameraDirectorEvaluationResult CurrentResult;                                     // 0x0030(0x0010)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)

public:
	void ActivateCameraRig(class UCameraRigProxyAsset* CameraRigProxy);
	void RunCameraDirector(const struct FBlueprintCameraDirectorEvaluationParams& Params_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintCameraDirectorEvaluator">();
	}
	static class UBlueprintCameraDirectorEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintCameraDirectorEvaluator>();
	}
};

// Class GameplayCameras.BlueprintCameraDirector
// 0x0010 (0x0040 - 0x0030)
class UBlueprintCameraDirector final : public UCameraDirector
{
public:
	TSubclassOf<class UBlueprintCameraDirectorEvaluator> CameraDirectorEvaluatorClass;                      // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraRigProxyTable*                   CameraRigProxyTable;                               // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintCameraDirector">();
	}
	static class UBlueprintCameraDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintCameraDirector>();
	}
};

// Class GameplayCameras.PriorityQueueCameraDirector
// 0x0000 (0x0030 - 0x0030)
class UPriorityQueueCameraDirector final : public UCameraDirector
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PriorityQueueCameraDirector">();
	}
	static class UPriorityQueueCameraDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPriorityQueueCameraDirector>();
	}
};

// Class GameplayCameras.SingleCameraDirector
// 0x0008 (0x0038 - 0x0030)
class USingleCameraDirector final : public UCameraDirector
{
public:
	class UCameraRigAsset*                        CameraRig;                                         // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SingleCameraDirector">();
	}
	static class USingleCameraDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<USingleCameraDirector>();
	}
};

// Class GameplayCameras.ActivateCameraRigFunctions
// 0x0000 (0x0030 - 0x0030)
class UActivateCameraRigFunctions final : public UBlueprintFunctionLibrary
{
public:
	static void ActivateBaseCameraRig(class UObject* WorldContextObject, class APlayerController* PlayerController, class UCameraRigAsset* CameraRig);
	static void ActivateCameraRig(class UObject* WorldContextObject, class APlayerController* PlayerController, class UCameraRigAsset* CameraRig, ECameraRigLayer EvaluationLayer);
	static void ActivateGlobalCameraRig(class UObject* WorldContextObject, class APlayerController* PlayerController, class UCameraRigAsset* CameraRig);
	static void ActivateVisualCameraRig(class UObject* WorldContextObject, class APlayerController* PlayerController, class UCameraRigAsset* CameraRig);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivateCameraRigFunctions">();
	}
	static class UActivateCameraRigFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivateCameraRigFunctions>();
	}
};

// Class GameplayCameras.CameraEvaluationResultInterop
// 0x0008 (0x0038 - 0x0030)
class UCameraEvaluationResultInterop final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBooleanCameraVariable(class UBooleanCameraVariable* InVariableAsset, bool InValue);
	void SetCameraPose(const struct FCameraPose& InCameraPose);
	void SetDoubleCameraVariable(class UDoubleCameraVariable* InVariableAsset, double InValue);
	void SetFloatCameraVariable(class UFloatCameraVariable* InVariableAsset, float InValue);
	void SetInteger32CameraVariable(class UInteger32CameraVariable* InVariableAsset, int32 InValue);
	void SetRotatorCameraVariable(class URotator3dCameraVariable* InVariableAsset, const struct FRotator& InValue);
	void SetTransformCameraVariable(class UTransform3dCameraVariable* InVariableAsset, const struct FTransform& InValue);
	void SetVector2CameraVariable(class UVector2dCameraVariable* InVariableAsset, const struct FVector2D& InValue);
	void SetVector3CameraVariable(class UVector3dCameraVariable* InVariableAsset, const struct FVector& InValue);
	void SetVector4CameraVariable(class UVector4dCameraVariable* InVariableAsset, const struct FVector4& InValue);

	bool GetBooleanCameraVariable(class UBooleanCameraVariable* InVariableAsset) const;
	const struct FCameraPose GetCameraPose() const;
	double GetDoubleCameraVariable(class UDoubleCameraVariable* InVariableAsset) const;
	float GetFloatCameraVariable(class UFloatCameraVariable* InVariableAsset) const;
	int32 GetInteger32CameraVariable(class UInteger32CameraVariable* InVariableAsset) const;
	struct FRotator GetRotatorCameraVariable(class URotator3dCameraVariable* InVariableAsset) const;
	struct FTransform GetTransformCameraVariable(class UTransform3dCameraVariable* InVariableAsset) const;
	struct FVector2D GetVector2CameraVariable(class UVector2dCameraVariable* InVariableAsset) const;
	struct FVector GetVector3CameraVariable(class UVector3dCameraVariable* InVariableAsset) const;
	struct FVector4 GetVector4CameraVariable(class UVector4dCameraVariable* InVariableAsset) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraEvaluationResultInterop">();
	}
	static class UCameraEvaluationResultInterop* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraEvaluationResultInterop>();
	}
};

// Class GameplayCameras.CameraRigParameterInterop
// 0x0000 (0x0030 - 0x0030)
class UCameraRigParameterInterop final : public UBlueprintFunctionLibrary
{
public:
	static void SetBooleanParameter(class UCameraEvaluationResultInterop* ResultInterop, class UCameraRigAsset* CameraRig, const class FString& ParameterName, bool bParameterValue);
	static void SetDoubleParameter(class UCameraEvaluationResultInterop* ResultInterop, class UCameraRigAsset* CameraRig, const class FString& ParameterName, double ParameterValue);
	static void SetFloatParameter(class UCameraEvaluationResultInterop* ResultInterop, class UCameraRigAsset* CameraRig, const class FString& ParameterName, double ParameterValue);
	static void SetIntegerParameter(class UCameraEvaluationResultInterop* ResultInterop, class UCameraRigAsset* CameraRig, const class FString& ParameterName, int32 ParameterValue);
	static void SetRotatorParameter(class UCameraEvaluationResultInterop* ResultInterop, class UCameraRigAsset* CameraRig, const class FString& ParameterName, const struct FRotator& ParameterValue);
	static void SetTransformParameter(class UCameraEvaluationResultInterop* ResultInterop, class UCameraRigAsset* CameraRig, const class FString& ParameterName, const struct FTransform& ParameterValue);
	static void SetVector2Parameter(class UCameraEvaluationResultInterop* ResultInterop, class UCameraRigAsset* CameraRig, const class FString& ParameterName, const struct FVector2D& ParameterValue);
	static void SetVector3Parameter(class UCameraEvaluationResultInterop* ResultInterop, class UCameraRigAsset* CameraRig, const class FString& ParameterName, const struct FVector& ParameterValue);
	static void SetVector4Parameter(class UCameraEvaluationResultInterop* ResultInterop, class UCameraRigAsset* CameraRig, const class FString& ParameterName, const struct FVector4& ParameterValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraRigParameterInterop">();
	}
	static class UCameraRigParameterInterop* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigParameterInterop>();
	}
};

// Class GameplayCameras.GameplayCameraActor
// 0x0008 (0x0428 - 0x0420)
class AGameplayCameraActor final : public AActor
{
public:
	class UGameplayCameraComponent*               CameraComponent;                                   // 0x0420(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UGameplayCameraComponent* GetCameraComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayCameraActor">();
	}
	static class AGameplayCameraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameplayCameraActor>();
	}
};

// Class GameplayCameras.GameplayCameraComponent
// 0x0040 (0x02B0 - 0x0270)
class UGameplayCameraComponent final : public USceneComponent
{
public:
	class UCameraAsset*                           Camera;                                            // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAutoReceiveInput                             AutoActivateForPlayer;                             // 0x0278(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_279[0x17];                                     // 0x0279(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraEvaluationResultInterop*         InitialResultInterop;                              // 0x0290(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMesh*                            PreviewMesh;                                       // 0x0298(0x0008)(ZeroConstructor, Transient, EditorOnly, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   PreviewMeshComponent;                              // 0x02A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, EditorOnly, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateCamera(int32 PlayerIndex);
	void DeactivateCamera();

	class UCameraEvaluationResultInterop* GetInitialResult() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayCameraComponent">();
	}
	static class UGameplayCameraComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCameraComponent>();
	}
};

// Class GameplayCameras.GameplayCameraSystemActor
// 0x0008 (0x0428 - 0x0420)
class AGameplayCameraSystemActor final : public AActor
{
public:
	class UGameplayCameraSystemComponent*         CameraSystemComponent;                             // 0x0420(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UGameplayCameraSystemComponent* GetCameraSystemComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayCameraSystemActor">();
	}
	static class AGameplayCameraSystemActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameplayCameraSystemActor>();
	}
};

// Class GameplayCameras.GameplayCameraSystemComponent
// 0x0040 (0x02B0 - 0x0270)
class UGameplayCameraSystemComponent final : public USceneComponent
{
public:
	EAutoReceiveInput                             AutoActivateForPlayer;                             // 0x0270(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_271[0x27];                                     // 0x0271(0x0027)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            PreviewMesh;                                       // 0x0298(0x0008)(ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   PreviewMeshComponent;                              // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateCameraSystem(int32 PlayerIndex);
	void DeactivateCameraSystem(class AActor* NextViewTarget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayCameraSystemComponent">();
	}
	static class UGameplayCameraSystemComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCameraSystemComponent>();
	}
};

// Class GameplayCameras.GameplayCamerasSubsystem
// 0x0000 (0x0038 - 0x0038)
class UGameplayCamerasSubsystem final : public UWorldSubsystem
{
public:
	struct FCameraAnimationHandle PlayCameraAnimation(class APlayerController* PlayerController, class UCameraAnimationSequence* Sequence, const struct FCameraAnimationParams& Params_0);
	void StopAllCameraAnimations(class APlayerController* PlayerController, bool bImmediate);
	void StopAllCameraAnimationsOf(class APlayerController* PlayerController, class UCameraAnimationSequence* Sequence, bool bImmediate);
	void StopCameraAnimation(class APlayerController* PlayerController, const struct FCameraAnimationHandle& Handle, bool bImmediate);

	bool IsCameraAnimationActive(class APlayerController* PlayerController, const struct FCameraAnimationHandle& Handle) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayCamerasSubsystem">();
	}
	static class UGameplayCamerasSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCamerasSubsystem>();
	}
};

// Class GameplayCameras.AttachToPlayerPawnCameraNode
// 0x0020 (0x0080 - 0x0060)
class UAttachToPlayerPawnCameraNode final : public UCameraNode
{
public:
	struct FBooleanCameraParameter                AttachToLocation;                                  // 0x0060(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBooleanCameraParameter                AttachToRotation;                                  // 0x0070(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AttachToPlayerPawnCameraNode">();
	}
	static class UAttachToPlayerPawnCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttachToPlayerPawnCameraNode>();
	}
};

// Class GameplayCameras.SimpleBlendCameraNode
// 0x0000 (0x0060 - 0x0060)
class USimpleBlendCameraNode : public UBlendCameraNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimpleBlendCameraNode">();
	}
	static class USimpleBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleBlendCameraNode>();
	}
};

// Class GameplayCameras.SimpleFixedTimeBlendCameraNode
// 0x0008 (0x0068 - 0x0060)
class USimpleFixedTimeBlendCameraNode : public USimpleBlendCameraNode
{
public:
	float                                         BlendTime;                                         // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimpleFixedTimeBlendCameraNode">();
	}
	static class USimpleFixedTimeBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleFixedTimeBlendCameraNode>();
	}
};

// Class GameplayCameras.LinearBlendCameraNode
// 0x0000 (0x0068 - 0x0068)
class ULinearBlendCameraNode final : public USimpleFixedTimeBlendCameraNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LinearBlendCameraNode">();
	}
	static class ULinearBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULinearBlendCameraNode>();
	}
};

// Class GameplayCameras.PopBlendCameraNode
// 0x0000 (0x0060 - 0x0060)
class UPopBlendCameraNode final : public UBlendCameraNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PopBlendCameraNode">();
	}
	static class UPopBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPopBlendCameraNode>();
	}
};

// Class GameplayCameras.SmoothBlendCameraNode
// 0x0008 (0x0070 - 0x0068)
class USmoothBlendCameraNode final : public USimpleFixedTimeBlendCameraNode
{
public:
	ESmoothCameraBlendType                        BlendType;                                         // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmoothBlendCameraNode">();
	}
	static class USmoothBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmoothBlendCameraNode>();
	}
};

// Class GameplayCameras.OcclusionMaterialCameraNode
// 0x0040 (0x00A0 - 0x0060)
class UOcclusionMaterialCameraNode final : public UCameraNode
{
public:
	class UMaterialInterface*                     OcclusionTransparencyMaterial;                     // 0x0060(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatCameraParameter                  OcclusionSphereRadius;                             // 0x0068(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	ECollisionChannel                             OcclusionChannel;                                  // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector3dCameraParameter               OcclusionTargetOffset;                             // 0x0080(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OcclusionMaterialCameraNode">();
	}
	static class UOcclusionMaterialCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOcclusionMaterialCameraNode>();
	}
};

// Class GameplayCameras.ArrayCameraNode
// 0x0010 (0x0070 - 0x0060)
class UArrayCameraNode final : public UCameraNode
{
public:
	TArray<class UCameraNode*>                    Children;                                          // 0x0060(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
