#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameProjectGeneration

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "EditorSubsystem_classes.hpp"
#include "AddContentDialog_structs.hpp"
#include "GameProjectGeneration_structs.hpp"


namespace SDK
{

// Class GameProjectGeneration.TemplateCategories
// 0x0010 (0x0040 - 0x0030)
class UTemplateCategories final : public UObject
{
public:
	TArray<struct FTemplateCategoryDef>           Categories;                                        // 0x0030(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TemplateCategories">();
	}
	static class UTemplateCategories* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTemplateCategories>();
	}
};

// Class GameProjectGeneration.ClassTemplate
// 0x0008 (0x0038 - 0x0030)
class UClassTemplate : public UObject
{
public:
	TSubclassOf<class UObject>                    GeneratedBaseClass;                                // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClassTemplate">();
	}
	static class UClassTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClassTemplate>();
	}
};

// Class GameProjectGeneration.PluginClassTemplate
// 0x0010 (0x0048 - 0x0038)
class UPluginClassTemplate : public UClassTemplate
{
public:
	class FString                                 PluginName;                                        // 0x0038(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PluginClassTemplate">();
	}
	static class UPluginClassTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPluginClassTemplate>();
	}
};

// Class GameProjectGeneration.ClassTemplateEditorSubsystem
// 0x0050 (0x0088 - 0x0038)
class UClassTemplateEditorSubsystem final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClassTemplateEditorSubsystem">();
	}
	static class UClassTemplateEditorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClassTemplateEditorSubsystem>();
	}
};

// Class GameProjectGeneration.TemplateProjectDefs
// 0x0100 (0x0130 - 0x0030)
class UTemplateProjectDefs : public UObject
{
public:
	TArray<struct FLocalizedTemplateString>       LocalizedDisplayNames;                             // 0x0030(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FLocalizedTemplateString>       LocalizedDescriptions;                             // 0x0040(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         FoldersToIgnore;                                   // 0x0050(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         FilesToIgnore;                                     // 0x0060(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FTemplateFolderRename>          FolderRenames;                                     // 0x0070(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FTemplateReplacement>           FilenameReplacements;                              // 0x0080(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FTemplateReplacement>           ReplacementsInFiles;                               // 0x0090(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	class FString                                 SortKey;                                           // 0x00A0(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           Categories;                                        // 0x00B0(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	class FString                                 ClassTypes;                                        // 0x00C0(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetTypes;                                        // 0x00D0(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowProjectCreation;                             // 0x00E0(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnterprise;                                     // 0x00E1(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBlank;                                          // 0x00E2(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bThumbnailAsIcon;                                  // 0x00E3(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ETemplateSetting>                      HiddenSettings;                                    // 0x00E8(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         PacksToInclude;                                    // 0x00F8(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	EFeaturePackDetailLevel                       EditDetailLevelPreference;                         // 0x0108(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFeaturePackLevelSet>           SharedContentPacks;                                // 0x0110(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	class FString                                 StarterContent;                                    // 0x0120(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TemplateProjectDefs">();
	}
	static class UTemplateProjectDefs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTemplateProjectDefs>();
	}
};

// Class GameProjectGeneration.DefaultTemplateProjectDefs
// 0x0000 (0x0130 - 0x0130)
class UDefaultTemplateProjectDefs final : public UTemplateProjectDefs
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DefaultTemplateProjectDefs">();
	}
	static class UDefaultTemplateProjectDefs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultTemplateProjectDefs>();
	}
};

}

