#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameSubCatalogEditor

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "GameSubCatalogEditor_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameSubCatalog_structs.hpp"


namespace SDK
{

// Class GameSubCatalogEditor.CatalogFulfillment
// 0x0160 (0x0198 - 0x0038)
class UCatalogFulfillment final : public UDataAsset
{
public:
	class FString                                 UniqueId;                                          // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, DuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCrossPromotionEnabled;                            // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FulfillmentClass;                                  // 0x0050(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCatalogKeyValue>               MetaInfo;                                          // 0x0060(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FItemQuantity>                  ItemGrants;                                        // 0x0070(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGrantPackage>                  AdditionalGrants;                                  // 0x0080(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 LootTableAward;                                    // 0x0090(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FEpicOfferGrantInfo                    EpicOfferGrantInfo;                                // 0x00A0(0x0020)(Edit, NativeAccessSpecifierPublic)
	int32                                         MaximumUseCount;                                   // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AppStoreId[0xC];                                   // 0x00C8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EpicOfferGrant;                                    // 0x0188(0x0010)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CatalogFulfillment">();
	}
	static class UCatalogFulfillment* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCatalogFulfillment>();
	}
};

// Class GameSubCatalogEditor.CatalogMetaAsset
// 0x0000 (0x0038 - 0x0038)
class UCatalogMetaAsset : public UDataAsset
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CatalogMetaAsset">();
	}
	static class UCatalogMetaAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCatalogMetaAsset>();
	}
};

// Class GameSubCatalogEditor.CatalogDefinition
// 0x0058 (0x0090 - 0x0038)
class UCatalogDefinition final : public UDataAsset
{
public:
	class FString                                 ETag;                                              // 0x0038(0x0010)(Edit, ZeroConstructor, DuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RefreshIntervalHrs;                                // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DailyPurchaseHrs;                                  // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCatalogOfferSource>            Sources;                                           // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCatalogStorefrontDef>          Storefronts;                                       // 0x0060(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCatalogOfferDefinition>        CatalogOffers;                                     // 0x0070(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	TArray<struct FCatalogTableFilter>            StorefrontFilters;                                 // 0x0080(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CatalogDefinition">();
	}
	static class UCatalogDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCatalogDefinition>();
	}
};

// Class GameSubCatalogEditor.StoreAssetGatherer
// 0x0000 (0x0030 - 0x0030)
class UStoreAssetGatherer final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StoreAssetGatherer">();
	}
	static class UStoreAssetGatherer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreAssetGatherer>();
	}
};

// Class GameSubCatalogEditor.StoreOfferGatherer
// 0x0000 (0x0030 - 0x0030)
class UStoreOfferGatherer final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StoreOfferGatherer">();
	}
	static class UStoreOfferGatherer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreOfferGatherer>();
	}
};

// Class GameSubCatalogEditor.StoreCanonicalExport
// 0x0000 (0x0030 - 0x0030)
class UStoreCanonicalExport final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StoreCanonicalExport">();
	}
	static class UStoreCanonicalExport* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreCanonicalExport>();
	}
};

// Class GameSubCatalogEditor.StoreBranchSpecificCatalogExport
// 0x0010 (0x0040 - 0x0030)
class UStoreBranchSpecificCatalogExport final : public UObject
{
public:
	TArray<struct FLocalizedCatalogSettings>      LocalizedCatalogSettings;                          // 0x0030(0x0010)(ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StoreBranchSpecificCatalogExport">();
	}
	static class UStoreBranchSpecificCatalogExport* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreBranchSpecificCatalogExport>();
	}
};

}

