#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameSubCatalog

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "GameSubCatalog_structs.hpp"


namespace SDK
{

// Class GameSubCatalog.CatalogOffersPriceConfig
// 0x0050 (0x0080 - 0x0030)
class UCatalogOffersPriceConfig final : public UObject
{
public:
	TMap<EAppStore, struct FOfferNumericPriceAdjustments> AppStoreOfferNumericPriceAdjustments;              // 0x0030(0x0050)(Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CatalogOffersPriceConfig">();
	}
	static class UCatalogOffersPriceConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCatalogOffersPriceConfig>();
	}
};

// Class GameSubCatalog.McpCatalogItemsForRandomPlayer
// 0x0028 (0x0058 - 0x0030)
class UMcpCatalogItemsForRandomPlayer final : public UObject
{
public:
	uint32                                        Percentage;                                        // 0x0030(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Salt;                                              // 0x0038(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         CatalogItems;                                      // 0x0048(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"McpCatalogItemsForRandomPlayer">();
	}
	static class UMcpCatalogItemsForRandomPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMcpCatalogItemsForRandomPlayer>();
	}
};

// Class GameSubCatalog.McpRmtParamOverrideSelector
// 0x0020 (0x0050 - 0x0030)
class UMcpRmtParamOverrideSelector final : public UObject
{
public:
	uint32                                        RangeStart;                                        // 0x0030(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        RangeEnd;                                          // 0x0034(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Salt;                                              // 0x0038(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerifierModeOverride                         VerifierModeOverride;                              // 0x0048(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFulfillmentVerifierModeOverride              FulfillmentVerifierModeOverride;                   // 0x0049(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"McpRmtParamOverrideSelector">();
	}
	static class UMcpRmtParamOverrideSelector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMcpRmtParamOverrideSelector>();
	}
};

}

