#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GasDebugger

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GasDebugger_structs.hpp"


namespace SDK::Params
{

// Function GasDebugger.GasDebuggerMenu.ClientReceiveCallStack
// 0x0028 (0x0028 - 0x0000)
struct GasDebuggerMenu_ClientReceiveCallStack final
{
public:
	struct FGasDebugReplicatableCallStack         CallStack;                                         // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
};

// Function GasDebugger.GasDebuggerMenu.ServerRemoveEffect
// 0x0010 (0x0010 - 0x0000)
struct GasDebuggerMenu_ServerRemoveEffect final
{
public:
	class FString                                 EffectUsefulName;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GasDebugger.GasDebuggerMenu.ServerRemoveTag
// 0x000C (0x000C - 0x0000)
struct GasDebuggerMenu_ServerRemoveTag final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GasDebugger.GasDebuggerMenu.ServerRequestCallStack
// 0x0002 (0x0002 - 0x0000)
struct GasDebuggerMenu_ServerRequestCallStack final
{
public:
	uint16                                        Id;                                                // 0x0000(0x0002)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GasDebugger.GasDebuggerMenu.ServerSetAttribute
// 0x0018 (0x0018 - 0x0000)
struct GasDebuggerMenu_ServerSetAttribute final
{
public:
	class FString                                 AttributeName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewValue;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GasDebugger.GasDebuggerMenu.ServerSetMonitoredActor
// 0x0008 (0x0008 - 0x0000)
struct GasDebuggerMenu_ServerSetMonitoredActor final
{
public:
	class AActor*                                 ActorToMonitor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

