#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GasDebugger

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum GasDebugger.EGasDebugDiffState
// NumValues: 0x0005
enum class EGasDebugDiffState : uint8
{
	Unchanged                                = 0,
	Changed                                  = 1,
	Added                                    = 2,
	Removed                                  = 3,
	EGasDebugDiffState_MAX                   = 4,
};

// Enum GasDebugger.EGasDebuggerFilterMode
// NumValues: 0x0003
enum class EGasDebuggerFilterMode : uint8
{
	Show                                     = 0,
	Highlight                                = 1,
	EGasDebuggerFilterMode_MAX               = 2,
};

// Enum GasDebugger.EGasDebuggerSection
// NumValues: 0x0007
enum class EGasDebuggerSection : uint8
{
	Tags                                     = 0,
	Abilities                                = 1,
	Effects                                  = 2,
	EventHistory                             = 3,
	Attributes                               = 4,
	NumSections                              = 5,
	EGasDebuggerSection_MAX                  = 6,
};

// Enum GasDebugger.EAbilityHistoryEventType
// NumValues: 0x0008
enum class EAbilityHistoryEventType : uint8
{
	Added                                    = 0,
	Removed                                  = 1,
	Committed                                = 2,
	Activated                                = 3,
	Cancelled                                = 4,
	Ended                                    = 5,
	FailedActivation                         = 6,
	EAbilityHistoryEventType_MAX             = 7,
};

// Enum GasDebugger.EAbilityHistoryClassType
// NumValues: 0x0005
enum class EAbilityHistoryClassType : uint8
{
	Ability                                  = 0,
	Effect                                   = 1,
	Tag                                      = 2,
	NumTypes                                 = 3,
	EAbilityHistoryClassType_MAX             = 4,
};

// ScriptStruct GasDebugger.GasDebugReplicatableCallStack
// 0x0028 (0x0028 - 0x0000)
struct FGasDebugReplicatableCallStack final
{
public:
	uint16                                        EventId;                                           // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 BlueprintCallStack;                                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint64>                                NativeCallStack;                                   // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct GasDebugger.GasDebugAbilitySnapshot
// 0x0010 (0x0010 - 0x0000)
struct FGasDebugAbilitySnapshot final
{
public:
	TSubclassOf<class UGameplayAbility>           Ability;                                           // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0008(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsActive;                                         // 0x000C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReplicated;                                     // 0x000D(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GasDebugger.GasDebugEffectSnapshot
// 0x0088 (0x0088 - 0x0000)
struct FGasDebugEffectSnapshot final
{
public:
	struct FGameplayEffectContext                 Context;                                           // 0x0000(0x0080)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            Effect;                                            // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GasDebugger.GasEventHistoryItem
// 0x0080 (0x0080 - 0x0000)
struct FGasEventHistoryItem final
{
public:
	uint16                                        Id;                                                // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Depth;                                             // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAbilityHistoryClassType                      ClassType;                                         // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Class;                                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Timestamp;                                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InstigatingTag;                                    // 0x0018(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Reason;                                            // 0x0028(0x0020)(NativeAccessSpecifierPublic)
	EAbilityHistoryEventType                      EventType;                                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 BlueprintCallStack;                                // 0x0050(0x0010)(ZeroConstructor, RepSkip, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint64>                                NativeCallStack;                                   // 0x0060(0x0010)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	class FString                                 NativeCallStackAsString;                           // 0x0070(0x0010)(ZeroConstructor, RepSkip, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct GasDebugger.GasDebugSnapshot
// 0x0080 (0x0080 - 0x0000)
struct FGasDebugSnapshot final
{
public:
	TArray<struct FGameplayTag>                   ActiveTags;                                        // 0x0000(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<int8>                                  ActiveTagCounts;                                   // 0x0010(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class FString>                         AttributeNames;                                    // 0x0020(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<float>                                 AttributeBaseValues;                               // 0x0030(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<float>                                 AttributeFinalValues;                              // 0x0040(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FGasDebugEffectSnapshot>        ActiveEffectSnapshots;                             // 0x0050(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FGasDebugAbilitySnapshot>       AbilitySnapshots;                                  // 0x0060(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FGasEventHistoryItem>           EventHistory;                                      // 0x0070(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};

// ScriptStruct GasDebugger.GasDebugTagDiff
// 0x0010 (0x0010 - 0x0000)
struct FGasDebugTagDiff final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          RelativeCount;                                     // 0x000C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGasDebugDiffState                            State;                                             // 0x000D(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GasDebugger.GasDebugDiffSnapshot
// 0x0010 (0x0010 - 0x0000)
struct FGasDebugDiffSnapshot final
{
public:
	TArray<struct FGasDebugTagDiff>               Tags;                                              // 0x0000(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};

// ScriptStruct GasDebugger.GasEventHistory
// 0x0018 (0x0018 - 0x0000)
struct FGasEventHistory final
{
public:
	TArray<struct FGasEventHistoryItem>           Items;                                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         CurrentItemDepth;                                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

