#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GasDebugger

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "GasDebugger_structs.hpp"
#include "FortImGuiCore_classes.hpp"


namespace SDK
{

// Class GasDebugger.GasDebuggerMenu
// 0x0400 (0x0A50 - 0x0650)
class AGasDebuggerMenu final : public AImGuiDebugMenuBase
{
public:
	TWeakObjectPtr<class AActor>                  MonitoredActor;                                    // 0x0648(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         NearbyActorsWithASC;                               // 0x0650(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_660[0x118];                                    // 0x0660(0x0118)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EditedAttributeIndex;                              // 0x0778(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EditedAttributeValue;                              // 0x077C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         EventHistoryClassFilterFlags;                      // 0x0780(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EGasDebuggerSection                           Section;                                           // 0x0784(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EGasDebuggerSection                           NextSection;                                       // 0x0785(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsDataPaused;                                     // 0x0786(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsDiffing;                                        // 0x0787(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsInputEnabled;                                   // 0x0788(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bWasActorSelectionOpenLastFrame;                   // 0x0789(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisplayClient;                                    // 0x078A(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisplayServer;                                    // 0x078B(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MenuBackgroundAlpha;                               // 0x078C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EGasDebuggerFilterMode                        FilterMode;                                        // 0x0790(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_791[0x7];                                      // 0x0791(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGasDebugSnapshot                      ServerGasDebugSnapshot;                            // 0x0798(0x0080)(Net, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FGasDebugSnapshot                      PausedServerGasDebugSnapshot;                      // 0x0818(0x0080)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FGasDebugSnapshot                      PausedClientGasDebugSnapshot;                      // 0x0898(0x0080)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FGasDebugSnapshot                      DiffServerGasDebugSnapshot;                        // 0x0918(0x0080)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FGasDebugSnapshot                      DiffClientGasDebugSnapshot;                        // 0x0998(0x0080)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FGasDebugReplicatableCallStack> ReceivedCallStacks;                                // 0x0A18(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<uint16>                                CurrentlyRequestingCallStacks;                     // 0x0A28(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A38[0x18];                                     // 0x0A38(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientReceiveCallStack(const struct FGasDebugReplicatableCallStack& CallStack);
	void ServerClose();
	void ServerRemoveEffect(const class FString& EffectUsefulName);
	void ServerRemoveTag(const struct FGameplayTag& Tag);
	void ServerRequestCallStack(uint16 Id);
	void ServerSetAttribute(const class FString& AttributeName, float NewValue);
	void ServerSetMonitoredActor(class AActor* ActorToMonitor);
	void ServerTogglePause();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GasDebuggerMenu">();
	}
	static class AGasDebuggerMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGasDebuggerMenu>();
	}
};

// Class GasDebugger.GasEventHistoryComponent
// 0x0018 (0x00F0 - 0x00D8)
class UGasEventHistoryComponent final : public UActorComponent
{
public:
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GasEventHistoryComponent">();
	}
	static class UGasEventHistoryComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGasEventHistoryComponent>();
	}
};

// Class GasDebugger.GasDebuggerCheatManager
// 0x0000 (0x0030 - 0x0030)
class UGasDebuggerCheatManager final : public UCheatManagerExtension
{
public:
	void GasDebugger() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GasDebuggerCheatManager">();
	}
	static class UGasDebuggerCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGasDebuggerCheatManager>();
	}
};

}

