#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeometryScriptingEditor

#include "Basic.hpp"

#include "GeometryScriptingEditor_structs.hpp"
#include "GeometryScriptingCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GeometryScriptingEditor.GeometryScriptLibrary_EditorDynamicMeshFunctions.BeginTrackedMeshChange
// 0x0030 (0x0030 - 0x0000)
struct GeometryScriptLibrary_EditorDynamicMeshFunctions_BeginTrackedMeshChange final
{
public:
	class UDynamicMesh*                           TargetMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDynamicMeshChangeContainer            ChangeTracker;                                     // 0x0008(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GeometryScriptingEditor.GeometryScriptLibrary_EditorDynamicMeshFunctions.EmitTrackedMeshChange
// 0x0030 (0x0030 - 0x0000)
struct GeometryScriptLibrary_EditorDynamicMeshFunctions_EmitTrackedMeshChange final
{
public:
	class UDynamicMesh*                           TargetMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDynamicMeshChangeContainer            ChangeTracker;                                     // 0x0008(0x0020)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GeometryScriptingEditor.GeometryScriptLibrary_EditorDynamicMeshFunctions.FetchDebugMesh
// 0x0028 (0x0028 - 0x0000)
struct GeometryScriptLibrary_EditorDynamicMeshFunctions_FetchDebugMesh final
{
public:
	class FString                                 DebugMeshName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ToTargetMesh;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClearDebugMesh;                                   // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugMeshExists;                                  // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicMesh*                           ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GeometryScriptingEditor.GeometryScriptLibrary_EditorDynamicMeshFunctions.StashDebugMesh
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_EditorDynamicMeshFunctions_StashDebugMesh final
{
public:
	class UDynamicMesh*                           TargetMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DebugMeshName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GeometryScriptingEditor.GeometryScriptLibrary_EditorTextureMapFunctions.ChannelPack
// 0x0058 (0x0058 - 0x0000)
struct GeometryScriptLibrary_EditorTextureMapFunctions_ChannelPack final
{
public:
	struct FGeometryScriptChannelPackSource       RChannelSource;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGeometryScriptChannelPackSource       GChannelSource;                                    // 0x0010(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGeometryScriptChannelPackSource       BChannelSource;                                    // 0x0020(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGeometryScriptChannelPackSource       AChannelSource;                                    // 0x0030(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          OutputSRGB;                                        // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0048(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptChannelPackResult       ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function GeometryScriptingEditor.GeometryScriptLibrary_CreateNewAssetFunctions.CreateNewSkeletalMeshAssetFromMesh
// 0x0098 (0x0098 - 0x0000)
struct GeometryScriptLibrary_CreateNewAssetFunctions_CreateNewSkeletalMeshAssetFromMesh final
{
public:
	class UDynamicMesh*                           FromDynamicMesh;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeleton*                              InSkeleton;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetPathAndName;                                  // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptCreateNewSkeletalMeshAssetOptions Options;                                           // 0x0020(0x0060)(Parm, NativeAccessSpecifierPublic)
	EGeometryScriptOutcomePins                    Outcome;                                           // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0088(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          ReturnValue;                                       // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GeometryScriptingEditor.GeometryScriptLibrary_CreateNewAssetFunctions.CreateNewSkeletalMeshAssetFromMeshLODs
// 0x00A0 (0x00A0 - 0x0000)
struct GeometryScriptLibrary_CreateNewAssetFunctions_CreateNewSkeletalMeshAssetFromMeshLODs final
{
public:
	TArray<class UDynamicMesh*>                   FromDynamicMeshLODs;                               // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class USkeleton*                              InSkeleton;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetPathAndName;                                  // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptCreateNewSkeletalMeshAssetOptions Options;                                           // 0x0028(0x0060)(Parm, NativeAccessSpecifierPublic)
	EGeometryScriptOutcomePins                    Outcome;                                           // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0090(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          ReturnValue;                                       // 0x0098(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GeometryScriptingEditor.GeometryScriptLibrary_CreateNewAssetFunctions.CreateNewStaticMeshAssetFromMesh
// 0x0080 (0x0080 - 0x0000)
struct GeometryScriptLibrary_CreateNewAssetFunctions_CreateNewStaticMeshAssetFromMesh final
{
public:
	class UDynamicMesh*                           FromDynamicMesh;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetPathAndName;                                  // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptCreateNewStaticMeshAssetOptions Options;                                           // 0x0018(0x0050)(Parm, NativeAccessSpecifierPublic)
	EGeometryScriptOutcomePins                    Outcome;                                           // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0070(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            ReturnValue;                                       // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GeometryScriptingEditor.GeometryScriptLibrary_CreateNewAssetFunctions.CreateNewStaticMeshAssetFromMeshLODs
// 0x0088 (0x0088 - 0x0000)
struct GeometryScriptLibrary_CreateNewAssetFunctions_CreateNewStaticMeshAssetFromMeshLODs final
{
public:
	TArray<class UDynamicMesh*>                   FromDynamicMesh;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 AssetPathAndName;                                  // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptCreateNewStaticMeshAssetOptions Options;                                           // 0x0020(0x0050)(Parm, NativeAccessSpecifierPublic)
	EGeometryScriptOutcomePins                    Outcome;                                           // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0078(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            ReturnValue;                                       // 0x0080(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GeometryScriptingEditor.GeometryScriptLibrary_CreateNewAssetFunctions.CreateNewTexture2DAsset
// 0x0030 (0x0030 - 0x0000)
struct GeometryScriptLibrary_CreateNewAssetFunctions_CreateNewTexture2DAsset final
{
public:
	class UTexture2D*                             FromTexture;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetPathAndName;                                  // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptCreateNewTexture2DAssetOptions Options;                                           // 0x0018(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EGeometryScriptOutcomePins                    Outcome;                                           // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GeometryScriptingEditor.GeometryScriptLibrary_CreateNewAssetFunctions.CreateNewVolumeFromMesh
// 0x00B0 (0x00B0 - 0x0000)
struct GeometryScriptLibrary_CreateNewAssetFunctions_CreateNewVolumeFromMesh final
{
public:
	class UDynamicMesh*                           FromDynamicMesh;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 CreateInWorld;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ActorTransform;                                    // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BaseActorName;                                     // 0x0070(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptCreateNewVolumeFromMeshOptions Options;                                           // 0x0080(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EGeometryScriptOutcomePins                    Outcome;                                           // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0098(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AVolume*                                ReturnValue;                                       // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GeometryScriptingEditor.GeometryScriptLibrary_CreateNewAssetFunctions.CreateUniqueNewAssetPathName
// 0x0050 (0x0050 - 0x0000)
struct GeometryScriptLibrary_CreateNewAssetFunctions_CreateUniqueNewAssetPathName final
{
public:
	class FString                                 AssetFolderPath;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BaseAssetName;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UniqueAssetPathAndName;                            // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UniqueAssetName;                                   // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptUniqueAssetNameOptions  Options;                                           // 0x0040(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EGeometryScriptOutcomePins                    Outcome;                                           // 0x0044(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0048(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GeometryScriptingEditor.GeneratedDynamicMeshActor.CopyPropertiesFromStaticMesh
// 0x0010 (0x0010 - 0x0000)
struct GeneratedDynamicMeshActor_CopyPropertiesFromStaticMesh final
{
public:
	class AStaticMeshActor*                       StaticMeshActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCopyComponentMaterials;                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GeometryScriptingEditor.GeneratedDynamicMeshActor.CopyPropertiesToStaticMesh
// 0x0010 (0x0010 - 0x0000)
struct GeneratedDynamicMeshActor_CopyPropertiesToStaticMesh final
{
public:
	class AStaticMeshActor*                       StaticMeshActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCopyComponentMaterials;                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GeometryScriptingEditor.GeneratedDynamicMeshActor.IncrementProgress
// 0x0018 (0x0018 - 0x0000)
struct GeneratedDynamicMeshActor_IncrementProgress final
{
public:
	int32                                         NumSteps;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GeometryScriptingEditor.GeneratedDynamicMeshActor.MarkForMeshRebuild
// 0x0002 (0x0002 - 0x0000)
struct GeneratedDynamicMeshActor_MarkForMeshRebuild final
{
public:
	bool                                          bImmediate;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImmediateEvenIfFrozen;                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GeometryScriptingEditor.GeneratedDynamicMeshActor.OnRebuildGeneratedMesh
// 0x0008 (0x0008 - 0x0000)
struct GeneratedDynamicMeshActor_OnRebuildGeneratedMesh final
{
public:
	class UDynamicMesh*                           TargetMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GeometryScriptingEditor.GeometryScriptLibrary_OpenSubdivFunctions.ApplyPolygroupCatmullClarkSubD
// 0x0028 (0x0028 - 0x0000)
struct GeometryScriptLibrary_OpenSubdivFunctions_ApplyPolygroupCatmullClarkSubD final
{
public:
	class UDynamicMesh*                           FromDynamicMesh;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Subdivisions;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptGroupLayer              GroupLayer;                                        // 0x000C(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GeometryScriptingEditor.GeometryScriptLibrary_OpenSubdivFunctions.ApplyTriangleLoopSubD
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_OpenSubdivFunctions_ApplyTriangleLoopSubD final
{
public:
	class UDynamicMesh*                           FromDynamicMesh;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Subdivisions;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

