#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeometryScriptingEditor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// Enum GeometryScriptingEditor.EGeometryScriptRGBAChannel
// NumValues: 0x0005
enum class EGeometryScriptRGBAChannel : uint8
{
	R                                        = 0,
	G                                        = 1,
	B                                        = 2,
	A                                        = 3,
	EGeometryScriptRGBAChannel_MAX           = 4,
};

// Enum GeometryScriptingEditor.EGeometryScriptReadGammaSpace
// NumValues: 0x0004
enum class EGeometryScriptReadGammaSpace : uint8
{
	FromTextureSettings                      = 0,
	Linear                                   = 1,
	SRGB                                     = 2,
	EGeometryScriptReadGammaSpace_MAX        = 3,
};

// ScriptStruct GeometryScriptingEditor.DynamicMeshChangeContainer
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FDynamicMeshChangeContainer final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GeometryScriptingEditor.GeometryScriptChannelPackSource
// 0x0010 (0x0010 - 0x0000)
struct FGeometryScriptChannelPackSource final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometryScriptReadGammaSpace                 ReadGammaSpace;                                    // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometryScriptRGBAChannel                    Channel;                                           // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultValue;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryScriptingEditor.GeometryScriptChannelPackResult
// 0x0008 (0x0008 - 0x0000)
struct FGeometryScriptChannelPackResult final
{
public:
	class UTexture2D*                             Output;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryScriptingEditor.GeometryScriptUniqueAssetNameOptions
// 0x0004 (0x0004 - 0x0000)
struct FGeometryScriptUniqueAssetNameOptions final
{
public:
	int32                                         UniqueIDDigits;                                    // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryScriptingEditor.GeometryScriptCreateNewVolumeFromMeshOptions
// 0x0010 (0x0010 - 0x0000)
struct FGeometryScriptCreateNewVolumeFromMeshOptions final
{
public:
	TSubclassOf<class AVolume>                    VolumeType;                                        // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoSimplify;                                     // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxTriangles;                                      // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct GeometryScriptingEditor.GeometryScriptCreateNewStaticMeshAssetOptions
// 0x0050 (0x0050 - 0x0000)
struct FGeometryScriptCreateNewStaticMeshAssetOptions final
{
public:
	bool                                          bEnableRecomputeNormals;                           // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableRecomputeTangents;                          // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableNanite;                                     // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMeshNaniteSettings                    NaniteSettings;                                    // 0x0008(0x0040)(BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         NaniteProxyTrianglePercent;                        // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableCollision;                                  // 0x004C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionTraceFlag                           CollisionMode;                                     // 0x004D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GeometryScriptingEditor.GeometryScriptCreateNewSkeletalMeshAssetOptions
// 0x0060 (0x0060 - 0x0000)
struct FGeometryScriptCreateNewSkeletalMeshAssetOptions final
{
public:
	bool                                          bEnableRecomputeNormals;                           // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableRecomputeTangents;                          // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UMaterialInterface*>  Materials;                                         // 0x0008(0x0050)(BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bUseMeshBoneProportions;                           // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct GeometryScriptingEditor.GeometryScriptCreateNewTexture2DAssetOptions
// 0x0001 (0x0001 - 0x0000)
struct FGeometryScriptCreateNewTexture2DAssetOptions final
{
public:
	bool                                          bOverwriteIfExists;                                // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

