#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GizmoEdMode

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "UnrealEd_classes.hpp"


namespace SDK
{

// Class GizmoEdMode.AssetEditorGizmoFactory
// 0x0000 (0x0030 - 0x0030)
class IAssetEditorGizmoFactory final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetEditorGizmoFactory">();
	}
	static class IAssetEditorGizmoFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAssetEditorGizmoFactory>();
	}
};

// Class GizmoEdMode.DefaultAssetEditorGizmoFactory
// 0x0008 (0x0038 - 0x0030)
class UDefaultAssetEditorGizmoFactory final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DefaultAssetEditorGizmoFactory">();
	}
	static class UDefaultAssetEditorGizmoFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultAssetEditorGizmoFactory>();
	}
};

// Class GizmoEdMode.GizmoEdModeSettings
// 0x0000 (0x0030 - 0x0030)
class UGizmoEdModeSettings final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GizmoEdModeSettings">();
	}
	static class UGizmoEdModeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGizmoEdModeSettings>();
	}
};

// Class GizmoEdMode.GizmoEdMode
// 0x0038 (0x0168 - 0x0130)
class UGizmoEdMode final : public UEdMode
{
public:
	TArray<TScriptInterface<class IAssetEditorGizmoFactory>> GizmoFactories;                                    // 0x0130(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_140[0x8];                                      // 0x0140(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInteractiveGizmo*>              InteractiveGizmos;                                 // 0x0148(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_158[0x10];                                     // 0x0158(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GizmoEdMode">();
	}
	static class UGizmoEdMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGizmoEdMode>();
	}
};

}

