#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: guard_spawner_device

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "guard_spawner_device_structs.hpp"


namespace SDK::Params
{

// Function guard_spawner_device.guard_spawner_device.$InitCDO
// 0x0DC0 (0x0DC0 - 0x0000)
struct guard_spawner_device__InitCDO final
{
public:
	class UDevices_device_event_agent*            _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_2;                            // 0x0010(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0020(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_ai_interaction*   _ExprResult_4;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_6;                            // 0x0040(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_8;                            // 0x0060(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_9;                                     // 0x0070(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_10;                           // 0x0080(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x0090(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_ai_interaction*   _ExprResult_12;                                    // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_13;                               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_14;                           // 0x00B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x00C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_16;                           // 0x00D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_17;                                    // 0x00E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_18;                           // 0x00F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_19;                                    // 0x0100(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_agent*            _ExprResult_20;                                    // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_21;                               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_22;                           // 0x0120(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_23;                                    // 0x0130(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_agent*            _ExprResult_24;                                    // 0x0140(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_25;                               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_26;                           // 0x0150(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_27;                                    // 0x0160(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_ai_interaction*   _ExprResult_28;                                    // 0x0170(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_29;                               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_30;                           // 0x0180(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_31;                                    // 0x0190(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_32;                           // 0x01A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_33;                                    // 0x01B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_34;                           // 0x01C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_35;                                    // 0x01D0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_ai_interaction*   _ExprResult_36;                                    // 0x01E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_37;                               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_38;                           // 0x01F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_39;                                    // 0x0200(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_40;                           // 0x0210(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_41;                                    // 0x0220(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_42;                           // 0x0230(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_43;                                    // 0x0240(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_ai_interaction*   _ExprResult_44;                                    // 0x0250(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_45;                               // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_46;                           // 0x0260(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_47;                                    // 0x0270(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_48;                           // 0x0280(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_49;                                    // 0x0290(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_50;                           // 0x02A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_51;                                    // 0x02B0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_ai_interaction*   _ExprResult_52;                                    // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_53;                               // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_54;                           // 0x02D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_55;                                    // 0x02E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_56;                           // 0x02F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_57;                                    // 0x0300(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_58;                           // 0x0310(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_59;                                    // 0x0320(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_ai_interaction*   _ExprResult_60;                                    // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_61;                               // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_62;                           // 0x0340(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_63;                                    // 0x0350(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_64;                           // 0x0360(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_65;                                    // 0x0370(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_66;                           // 0x0380(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_67;                                    // 0x0390(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_68;                                    // 0x03A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_69;                               // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_70;                           // 0x03B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_71;                                    // 0x03C0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_72;                                    // 0x03D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_73;                               // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_74;                           // 0x03E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_75;                                    // 0x03F0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_76;                                    // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_77;                               // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_78;                           // 0x0410(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_79;                                    // 0x0420(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_80;                                    // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_81;                               // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_82;                           // 0x0440(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_83;                                    // 0x0450(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_84;                                    // 0x0460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_85;                               // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_86;                           // 0x0470(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_87;                                    // 0x0480(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_88;                                    // 0x0490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_89;                               // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_90;                           // 0x04A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_91;                                    // 0x04B0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_92;                                    // 0x04C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_93;                               // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_94;                           // 0x04D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_95;                                    // 0x04E0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_96;                                    // 0x04F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_97;                               // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_98;                           // 0x0500(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_99;                                    // 0x0510(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_100;                                   // 0x0520(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_101;                              // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_102;                          // 0x0530(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_103;                                   // 0x0540(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_name* _ExprResult_104;                                   // 0x0550(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_105;                              // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_106;                          // 0x0560(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_107;                                   // 0x0570(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UClass*>    _ArchetypeFieldValue_108;                          // 0x0580(0x0050)(ContainsInstancedReference)
	TMap<FVerseStringProperty_, class UClass*>    _ExprResult_109;                                   // 0x05D0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_110;                                   // 0x0620(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_111;                                   // 0x0630(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_112;                                   // 0x0640(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_113;                                   // 0x0650(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_114;                              // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_115;                          // 0x0660(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_116;                                   // 0x0670(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_117;                                   // 0x0680(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_118;                              // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_119;                          // 0x0690(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_120;                                   // 0x06A0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_int*       _ExprResult_121;                                   // 0x06B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_122;                              // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_123;                          // 0x06C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_124;                                   // 0x06D0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_agent*            _ExprResult_125;                                   // 0x06E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_126;                              // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_127;                          // 0x06F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_128;                                   // 0x0700(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_ai_interaction*   _ExprResult_129;                                   // 0x0710(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_130;                              // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_131;                          // 0x0720(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_132;                                   // 0x0730(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_133;                          // 0x0740(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_134;                                   // 0x0750(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_135;                          // 0x0760(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_136;                                   // 0x0770(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_ai_interaction*   _ExprResult_137;                                   // 0x0780(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_138;                              // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_139;                          // 0x0790(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_140;                                   // 0x07A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_141;                          // 0x07B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_142;                                   // 0x07C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_143;                          // 0x07D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_144;                                   // 0x07E0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_agent*            _ExprResult_145;                                   // 0x07F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_146;                              // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_147;                          // 0x0800(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_148;                                   // 0x0810(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_agent*            _ExprResult_149;                                   // 0x0820(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_150;                              // 0x0828(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_151;                          // 0x0830(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_152;                                   // 0x0840(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_ai_interaction*   _ExprResult_153;                                   // 0x0850(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_154;                              // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_155;                          // 0x0860(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_156;                                   // 0x0870(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_157;                          // 0x0880(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_158;                                   // 0x0890(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_159;                          // 0x08A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_160;                                   // 0x08B0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_ai_interaction*   _ExprResult_161;                                   // 0x08C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_162;                              // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_163;                          // 0x08D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_164;                                   // 0x08E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_165;                          // 0x08F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_166;                                   // 0x0900(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_167;                          // 0x0910(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_168;                                   // 0x0920(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_ai_interaction*   _ExprResult_169;                                   // 0x0930(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_170;                              // 0x0938(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_171;                          // 0x0940(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_172;                                   // 0x0950(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_173;                          // 0x0960(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_174;                                   // 0x0970(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_175;                          // 0x0980(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_176;                                   // 0x0990(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_ai_interaction*   _ExprResult_177;                                   // 0x09A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_178;                              // 0x09A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_179;                          // 0x09B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_180;                                   // 0x09C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_181;                          // 0x09D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_182;                                   // 0x09E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_183;                          // 0x09F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_184;                                   // 0x0A00(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_ai_interaction*   _ExprResult_185;                                   // 0x0A10(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_186;                              // 0x0A18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_187;                          // 0x0A20(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_188;                                   // 0x0A30(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_189;                          // 0x0A40(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_190;                                   // 0x0A50(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_191;                          // 0x0A60(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_192;                                   // 0x0A70(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_193;                                   // 0x0A80(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_194;                              // 0x0A88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_195;                          // 0x0A90(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_196;                                   // 0x0AA0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_197;                                   // 0x0AB0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_198;                              // 0x0AB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_199;                          // 0x0AC0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_200;                                   // 0x0AD0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_201;                                   // 0x0AE0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_202;                              // 0x0AE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_203;                          // 0x0AF0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_204;                                   // 0x0B00(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_205;                                   // 0x0B10(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_206;                              // 0x0B18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_207;                          // 0x0B20(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_208;                                   // 0x0B30(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_209;                                   // 0x0B40(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_210;                              // 0x0B48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_211;                          // 0x0B50(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_212;                                   // 0x0B60(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_213;                                   // 0x0B70(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_214;                              // 0x0B78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_215;                          // 0x0B80(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_216;                                   // 0x0B90(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_217;                                   // 0x0BA0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_218;                              // 0x0BA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_219;                          // 0x0BB0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_220;                                   // 0x0BC0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_221;                                   // 0x0BD0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_222;                              // 0x0BD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_223;                          // 0x0BE0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_224;                                   // 0x0BF0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_225;                                   // 0x0C00(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_226;                              // 0x0C08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_227;                          // 0x0C10(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_228;                                   // 0x0C20(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_name* _ExprResult_229;                                   // 0x0C30(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_230;                              // 0x0C38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_231;                          // 0x0C40(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_232;                                   // 0x0C50(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UClass*>    _ArchetypeFieldValue_233;                          // 0x0C60(0x0050)(ContainsInstancedReference)
	TMap<FVerseStringProperty_, class UClass*>    _ExprResult_234;                                   // 0x0CB0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_235;                                   // 0x0D00(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_236;                                   // 0x0D10(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_237;                                   // 0x0D20(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_238;                                   // 0x0D30(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_239;                              // 0x0D38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_240;                          // 0x0D40(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_241;                                   // 0x0D50(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_242;                                   // 0x0D60(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_243;                              // 0x0D68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_244;                          // 0x0D70(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_245;                                   // 0x0D80(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_int*       _ExprResult_246;                                   // 0x0D90(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_247;                              // 0x0D98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_248;                          // 0x0DA0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_249;                                   // 0x0DB0(0x0010)(HasGetValueTypeHash)
};

// Function guard_spawner_device.guard_spawner_device._L_2fFortnite_2ecom_2fDevices_2fguard__spawner__device_N_RDespawn
// 0x0068 (0x0068 - 0x0000)
struct guard_spawner_device__L_2fFortnite_2ecom_2fDevices_2fguard__spawner__device_N_RDespawn final
{
public:
	struct guard_spawner_device::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct guard_spawner_device::Ftuple_L_R       _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct guard_spawner_device::Ftuple_L_R       _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function guard_spawner_device.guard_spawner_device._L_2fFortnite_2ecom_2fDevices_2fguard__spawner__device_N_RDespawn_L_Nagent_R
// 0x0058 (0x0058 - 0x0000)
struct guard_spawner_device__L_2fFortnite_2ecom_2fDevices_2fguard__spawner__device_N_RDespawn_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
};

// Function guard_spawner_device.guard_spawner_device._L_2fFortnite_2ecom_2fDevices_2fguard__spawner__device_N_RDisable
// 0x0068 (0x0068 - 0x0000)
struct guard_spawner_device__L_2fFortnite_2ecom_2fDevices_2fguard__spawner__device_N_RDisable final
{
public:
	struct guard_spawner_device::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct guard_spawner_device::Ftuple_L_R       _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct guard_spawner_device::Ftuple_L_R       _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function guard_spawner_device.guard_spawner_device._L_2fFortnite_2ecom_2fDevices_2fguard__spawner__device_N_RDismissAgentHiredGuards_L_Nagent_R
// 0x0058 (0x0058 - 0x0000)
struct guard_spawner_device__L_2fFortnite_2ecom_2fDevices_2fguard__spawner__device_N_RDismissAgentHiredGuards_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
};

// Function guard_spawner_device.guard_spawner_device._L_2fFortnite_2ecom_2fDevices_2fguard__spawner__device_N_RDismissAllHiredGuards
// 0x0068 (0x0068 - 0x0000)
struct guard_spawner_device__L_2fFortnite_2ecom_2fDevices_2fguard__spawner__device_N_RDismissAllHiredGuards final
{
public:
	struct guard_spawner_device::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct guard_spawner_device::Ftuple_L_R       _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct guard_spawner_device::Ftuple_L_R       _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function guard_spawner_device.guard_spawner_device._L_2fFortnite_2ecom_2fDevices_2fguard__spawner__device_N_REnable
// 0x0068 (0x0068 - 0x0000)
struct guard_spawner_device__L_2fFortnite_2ecom_2fDevices_2fguard__spawner__device_N_REnable final
{
public:
	struct guard_spawner_device::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct guard_spawner_device::Ftuple_L_R       _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct guard_spawner_device::Ftuple_L_R       _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function guard_spawner_device.guard_spawner_device._L_2fFortnite_2ecom_2fDevices_2fguard__spawner__device_N_RForceAttackTarget_L_Nagent_M_N_QForgetTime_Nfloat_20_3d_20_2e_2e_2e_M_N_QForgetDistance_Nfloat_20_3d_20_2e_2e_2e_R
// 0x0218 (0x0218 - 0x0000)
struct guard_spawner_device__L_2fFortnite_2ecom_2fDevices_2fguard__spawner__device_N_RForceAttackTarget_L_Nagent_M_N_QForgetTime_Nfloat_20_3d_20_2e_2e_2e_M_N_QForgetDistance_Nfloat_20_3d_20_2e_2e_2e_R final
{
public:
	struct Ftuple_Lagent_M_QForgetTime_Nfloat_20_3d_20_2e_2e_2e_M_QForgetDistance_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0028)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UDevices_function_parameter_base*> __verse_0x9EEAD8C9_NamedParameterValues_2;         // 0x0028(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0078(0x0010)(HasGetValueTypeHash)
	class UDevices_function_parameter_agent*      _ExprResult_1;                                     // 0x0088(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_2;                                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ArchetypeFieldValue_3;                            // 0x0098(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResult_4;                                     // 0x00A0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x00A8(0x0010)(HasGetValueTypeHash)
	class UDevices_function_parameter_float*      _ExprResult_6;                                     // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_7;                                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ArchetypeFieldValue_8;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_9;                                     // 0x00D0(0x0010)(HasGetValueTypeHash)
	class UDevices_function_parameter_float*      _ExprResult_10;                                    // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_11;                               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ArchetypeFieldValue_12;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_name* __verse_0x00000000__3;                             // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UDevices_function_parameter_base*, true> _InvokeSureResultDummy_13;                         // 0x0100(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_14;                                        // 0x0108(0x0018)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UDevices_function_parameter_base*> __verse_0x9EEAD8C9_NamedParameterValues_5;         // 0x0120(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x0170(0x0010)(HasGetValueTypeHash)
	class UDevices_function_parameter_agent*      _ExprResult_16;                                    // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_17;                               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ArchetypeFieldValue_18;                           // 0x0190(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResult_19;                                    // 0x0198(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_20;                                    // 0x01A0(0x0010)(HasGetValueTypeHash)
