#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HardwareTargeting

#include "Basic.hpp"

#include "HardwareTargeting_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class HardwareTargeting.HardwareTargetingSettings
// 0x0020 (0x0050 - 0x0030)
class UHardwareTargetingSettings final : public UObject
{
public:
	EHardwareClass                                TargetedHardwareClass;                             // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHardwareClass                                AppliedTargetedHardwareClass;                      // 0x0031(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGraphicsPreset                               DefaultGraphicsPerformance;                        // 0x0032(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGraphicsPreset                               AppliedDefaultGraphicsPerformance;                 // 0x0033(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x1C];                                      // 0x0034(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HardwareTargetingSettings">();
	}
	static class UHardwareTargetingSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHardwareTargetingSettings>();
	}
};

}

