#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HarmonixMetasoundTests

#include "Basic.hpp"

#include "FunctionalTesting_structs.hpp"
#include "FunctionalTesting_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "AudioExtensions_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class HarmonixMetasoundTests.HarmonixFunctionalTestAction
// 0x0008 (0x0038 - 0x0030)
class UHarmonixFunctionalTestAction : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Finish(bool bContinue);
	void OnFinished();
	void OnStart(class AFunctionalTest* Test);
	void Prepare(class AFunctionalTest* Test);
	void Tick(class AFunctionalTest* Test, float DeltaSeconds);

	bool IsFinished() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarmonixFunctionalTestAction">();
	}
	static class UHarmonixFunctionalTestAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarmonixFunctionalTestAction>();
	}
};

// Class HarmonixMetasoundTests.HarmonixFunctionalTestActionSequence
// 0x0028 (0x0060 - 0x0038)
class UHarmonixFunctionalTestActionSequence final : public UHarmonixFunctionalTestAction
{
public:
	TArray<class UHarmonixFunctionalTestAction*>  ActionSequence;                                    // 0x0038(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UHarmonixFunctionalTestAction*>  ActionStack;                                       // 0x0048(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UHarmonixFunctionalTestAction*          CurrentAction;                                     // 0x0058(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarmonixFunctionalTestActionSequence">();
	}
	static class UHarmonixFunctionalTestActionSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarmonixFunctionalTestActionSequence>();
	}
};

// Class HarmonixMetasoundTests.HarmonixFunctionalTestActionParallel
// 0x0020 (0x0058 - 0x0038)
class UHarmonixFunctionalTestActionParallel final : public UHarmonixFunctionalTestAction
{
public:
	TArray<class UHarmonixFunctionalTestAction*>  ParallelActions;                                   // 0x0038(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UHarmonixFunctionalTestAction*>  ActionStack;                                       // 0x0048(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarmonixFunctionalTestActionParallel">();
	}
	static class UHarmonixFunctionalTestActionParallel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarmonixFunctionalTestActionParallel>();
	}
};

// Class HarmonixMetasoundTests.HarmonixFunctionalTestActionDelay
// 0x0008 (0x0040 - 0x0038)
class UHarmonixFunctionalTestActionDelay final : public UHarmonixFunctionalTestAction
{
public:
	float                                         DelaySeconds;                                      // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarmonixFunctionalTestActionDelay">();
	}
	static class UHarmonixFunctionalTestActionDelay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarmonixFunctionalTestActionDelay>();
	}
};

// Class HarmonixMetasoundTests.HarmonixFunctionalTestActionWaitForTimeout
// 0x0000 (0x0038 - 0x0038)
class UHarmonixFunctionalTestActionWaitForTimeout final : public UHarmonixFunctionalTestAction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarmonixFunctionalTestActionWaitForTimeout">();
	}
	static class UHarmonixFunctionalTestActionWaitForTimeout* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarmonixFunctionalTestActionWaitForTimeout>();
	}
};

// Class HarmonixMetasoundTests.HarmonixFunctionalTestActionFinishTest
// 0x0018 (0x0050 - 0x0038)
class UHarmonixFunctionalTestActionFinishTest final : public UHarmonixFunctionalTestAction
{
public:
	EFunctionalTestResult                         Result;                                            // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarmonixFunctionalTestActionFinishTest">();
	}
	static class UHarmonixFunctionalTestActionFinishTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarmonixFunctionalTestActionFinishTest>();
	}
};

// Class HarmonixMetasoundTests.HarmonixMetasoundFunctionalTestLibrary
// 0x0000 (0x0030 - 0x0030)
class UHarmonixMetasoundFunctionalTestLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool AddMidiStreamLogger(class UMetasoundGeneratorHandle* GeneratorHandle, class FName OutputName);
	static bool AddOutputLogger(class UMetasoundGeneratorHandle* GeneratorHandle, class FName OutputName, EAudioParameterType Type);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarmonixMetasoundFunctionalTestLibrary">();
	}
	static class UHarmonixMetasoundFunctionalTestLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarmonixMetasoundFunctionalTestLibrary>();
	}
};

// Class HarmonixMetasoundTests.HarmonixMetasoundFunctionalTest
// 0x00E8 (0x0650 - 0x0568)
class AHarmonixMetasoundFunctionalTest final : public AFunctionalTest
{
public:
	class USoundBase*                             TestSound;                                         // 0x0568(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AudioOutName;                                      // 0x0570(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AudioAutoStart;                                    // 0x057C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_57D[0x3];                                      // 0x057D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 WavFilename_Expected;                              // 0x0580(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WavFilename_Output;                                // 0x0590(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UHarmonixFunctionalTestAction*>  FunctionalTestActions;                             // 0x05A0(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	class UAudioComponent*                        AudioComponent;                                    // 0x05B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMetasoundGeneratorHandle*              GeneratorHandle;                                   // 0x05B8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHarmonixFunctionalTestActionSequence*  ActionSequence;                                    // 0x05C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C8[0x88];                                     // 0x05C8(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTestFinishedEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarmonixMetasoundFunctionalTest">();
	}
	static class AHarmonixMetasoundFunctionalTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHarmonixMetasoundFunctionalTest>();
	}
};

// Class HarmonixMetasoundTests.HarmonixMetasoundFunctionalTestActionSetAudioParameter
// 0x00A0 (0x00D8 - 0x0038)
class UHarmonixMetasoundFunctionalTestActionSetAudioParameter final : public UHarmonixFunctionalTestAction
{
public:
	struct FAudioParameter                        AudioParameter;                                    // 0x0038(0x00A0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarmonixMetasoundFunctionalTestActionSetAudioParameter">();
	}
	static class UHarmonixMetasoundFunctionalTestActionSetAudioParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarmonixMetasoundFunctionalTestActionSetAudioParameter>();
	}
};

// Class HarmonixMetasoundTests.HarmonixMetasoundFunctionalTestActionSetWaitForAudioFinished
// 0x0000 (0x0038 - 0x0038)
class UHarmonixMetasoundFunctionalTestActionSetWaitForAudioFinished final : public UHarmonixFunctionalTestAction
{
public:
	void OnAudioFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarmonixMetasoundFunctionalTestActionSetWaitForAudioFinished">();
	}
	static class UHarmonixMetasoundFunctionalTestActionSetWaitForAudioFinished* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarmonixMetasoundFunctionalTestActionSetWaitForAudioFinished>();
	}
};

}

