#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HarmonixDspEditor

#include "Basic.hpp"

#include "HarmonixDsp_structs.hpp"
#include "Engine_structs.hpp"
#include "UnrealEd_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "HarmonixDspEditor_structs.hpp"


namespace SDK
{

// Class HarmonixDspEditor.AssetDefinition_FusionPatch
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_FusionPatch final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_FusionPatch">();
	}
	static class UAssetDefinition_FusionPatch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_FusionPatch>();
	}
};

// Class HarmonixDspEditor.FusionPatchAssetFactory
// 0x0040 (0x00C8 - 0x0088)
class UFusionPatchAssetFactory final : public UFactory
{
public:
	uint8                                         Pad_88[0x40];                                      // 0x0088(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FusionPatchAssetFactory">();
	}
	static class UFusionPatchAssetFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFusionPatchAssetFactory>();
	}
};

// Class HarmonixDspEditor.FusionPatchImportOptions
// 0x0018 (0x0048 - 0x0030)
class UFusionPatchImportOptions final : public UObject
{
public:
	struct FDirectoryPath                         SamplesImportDir;                                  // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESoundWaveLoadingBehavior                     SampleLoadingBehavior;                             // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESoundAssetCompressionType                    SampleCompressionType;                             // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FusionPatchImportOptions">();
	}
	static class UFusionPatchImportOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFusionPatchImportOptions>();
	}
};

// Class HarmonixDspEditor.FusionPatchCreateOptions
// 0x05E0 (0x0610 - 0x0030)
class UFusionPatchCreateOptions final : public UObject
{
public:
	struct FDirectoryPath                         FusionPatchDir;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetName;                                         // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFusionPatchKeyzoneSortOption                 SortOption;                                        // 0x0050(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFusionPatchKeyzoneNoteLayoutOption           LayoutOption;                                      // 0x0051(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFusionPatchKeyzoneNoteScaleOption            ScaleOption;                                       // 0x0052(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFusionPatchKeyzoneRootNoteOption             RootNoteOption;                                    // 0x0053(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          MinNote;                                           // 0x0054(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          MaxNote;                                           // 0x0055(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OctaveAdjust;                                      // 0x0058(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKeyzoneSettings>               Keyzones;                                          // 0x0060(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FFusionPatchSettings                   FusionPatchSettings;                               // 0x0070(0x0588)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5F8[0x10];                                     // 0x05F8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	ELockedNoteFlag                               LockedNotesMask;                                   // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FusionPatchCreateOptions">();
	}
	static class UFusionPatchCreateOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFusionPatchCreateOptions>();
	}
};

}

