#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeadMovementIK_Proc_CtrlRig

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "PBIK_structs.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"
#include "AnimationCore_structs.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass HeadMovementIK_Proc_CtrlRig.HeadMovementIK_Proc_CtrlRig_C
// 0x0008 (0x1530 - 0x1528)
class UHeadMovementIK_Proc_CtrlRig_C final : public UControlRig
{
public:
	bool                                          eyes_aim_rig;                                      // 0x1528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HeadMovementIK_Proc_CtrlRig_C">();
	}
	static class UHeadMovementIK_Proc_CtrlRig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeadMovementIK_Proc_CtrlRig_C>();
	}
};

// RigVMMemoryStorageGeneratorClass HeadMovementIK_Proc_CtrlRig.RigVMMemory_Literal
// 0x0660 (0x0690 - 0x0030)
class HeadMovementIK_Proc_CtrlRig::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         RigVMModel___SpawnControl_1_Parent__Const;         // 0x0030(0x0010)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SpawnControl_1_Name__Const;           // 0x0040(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___SpawnControl_1_OffsetTransform__Const; // 0x0050(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___SpawnControl_1_OffsetSpace__Const;    // 0x00B0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_4_1_Item__Const; // 0x00B4(0x0010)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___RigUnit_GetTransform_4_1_Space__Const; // 0x00C4(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_GetTransform_4_1_bInitial__Const; // 0x00C5(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0xA];                                       // 0x00C6(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___SpawnControl_1_Settings__Const;       // 0x00D0(0x0180)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         RigVMModel___SpawnControl_2_Parent__Const;         // 0x0250(0x0010)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SpawnControl_2_Name__Const;           // 0x0260(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_6_Item__Const;   // 0x026C(0x0010)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___SpawnControl_2_Settings__Const;       // 0x0280(0x0180)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         RigVMModel___SetDefaultParent_Child__Const;        // 0x0400(0x0010)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetDefaultParent_Parent__Const;       // 0x0410(0x0010)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SpawnControl_2_1_Parent__Const;       // 0x0420(0x0010)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SpawnControl_2_1_Name__Const;         // 0x0430(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_6_1_Item__Const; // 0x043C(0x0010)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Add_1_B__Const;                       // 0x0450(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_SetTransform_3_1_2_1_bInitial__Const; // 0x0458(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x3];                                      // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___RigUnit_SetTransform_3_1_2_1_Weight__Const; // 0x045C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___Cast_1_Value__Const;                  // 0x0460(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	class FName                                   RigVMModel___GetCurveValue_1_1_1_1_Curve__Const;   // 0x0478(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_2_1_1_1_Curve__Const;   // 0x0484(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_3_3_1_Curve__Const;     // 0x0490(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_3_1_2_1_Curve__Const;   // 0x049C(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_3_1_1_1_1_Curve__Const; // 0x04A8(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_3_2_1_1_Curve__Const;   // 0x04B4(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Multiply_2_B__Const;                  // 0x04C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Multiply_B__Const;                    // 0x04D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FFilterOptionPerAxis                   RigVMModel___AimConstraintLocalSpaceOffset_1_Filter__Const; // 0x04F0(0x0003)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_4F3[0x5];                                      // 0x04F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___AimConstraintLocalSpaceOffset_1_AimAxis__Const; // 0x04F8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___AimConstraintLocalSpaceOffset_1_UpAxis__Const; // 0x0510(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimConstraint_WorldUp         RigVMModel___AimConstraintLocalSpaceOffset_1_WorldUp__Const; // 0x0528(0x0030)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FConstraintParent>              RigVMModel___AimConstraintLocalSpaceOffset_1_Parents__Const; // 0x0558(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_568[0x8];                                      // 0x0568(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimConstraint_AdvancedSettings RigVMModel___AimConstraintLocalSpaceOffset_1_AdvancedSettings__Const; // 0x0570(0x0080)(Edit, EditConst, NonTransactional, NoDestructor)
	class FName                                   RigVMModel___PBIK_1_Root__Const;                   // 0x05F0(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FC[0x4];                                      // 0x05FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_Effectors__Const;              // 0x0600(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FPBIKBoneSetting>               RigVMModel___PBIK_1_BoneSettings__Const;           // 0x0610(0x0010)(Edit, EditConst, NonTransactional)
	TArray<class FName>                           RigVMModel___PBIK_1_ExcludedBones__Const;          // 0x0620(0x0010)(Edit, EditConst, NonTransactional)
	struct FPBIKSolverSettings                    RigVMModel___PBIK_1_Settings__Const;               // 0x0630(0x0040)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FPBIKDebug                             RigVMModel___PBIK_1_Debug__Const;                  // 0x0670(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	class FName                                   RigVMModel___GetCurveValue_Curve__Const;           // 0x0678(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass HeadMovementIK_Proc_CtrlRig.RigVMMemory_Literal", true>();
	}
	static class HeadMovementIK_Proc_CtrlRig::URigVMMemory_Literal* GetDefaultObj()
	{
		return GetDefaultObjImpl<HeadMovementIK_Proc_CtrlRig::URigVMMemory_Literal>();
	}
};

// ControlRigBlueprintGeneratedClass HeadMovementIK_Proc_CtrlRig.SKEL_HeadMovementIK_Proc_CtrlRig_C
// 0x0010 (0x1538 - 0x1528)
class USKEL_HeadMovementIK_Proc_CtrlRig_C final : public UControlRig
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          eyes_aim_rig;                                      // 0x1530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SKEL_HeadMovementIK_Proc_CtrlRig_C">();
	}
	static class USKEL_HeadMovementIK_Proc_CtrlRig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USKEL_HeadMovementIK_Proc_CtrlRig_C>();
	}
};

// RigVMMemoryStorageGeneratorClass HeadMovementIK_Proc_CtrlRig.RigVMMemory_Work
// 0x0870 (0x08A0 - 0x0030)
class HeadMovementIK_Proc_CtrlRig::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         RigVMModel___SpawnControl_1_Item;                  // 0x0030(0x0010)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_4_1_Transform;   // 0x0040(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_4_1_CachedIndex; // 0x00A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         RigVMModel___SpawnControl_2_Item;                  // 0x00B0(0x0010)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_6_Transform;     // 0x00C0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_6_CachedIndex;   // 0x0120(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         RigVMModel___SpawnControl_2_1_Item;                // 0x0130(0x0010)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_6_1_Transform;   // 0x0140(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_6_1_CachedIndex; // 0x01A0(0x0010)(Edit, EditConst, NonTransactional)
	double                                        RigVMModel___Add_1_Result;                         // 0x01B0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Add_1_A;                              // 0x01B8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___SpawnControl_2_1_InitialValue__IO;    // 0x01C0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___GetTransform_Transform;               // 0x0220(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_CachedIndex;             // 0x0280(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_3_1_2_1_CachedIndex; // 0x0290(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___Make_Absolute_Global;                 // 0x02A0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___Cast_1_Result;                        // 0x0300(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GetCurveValue_1_1_1_1_Value;          // 0x0320(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___GetCurveValue_1_1_1_1_Valid;          // 0x0324(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___GetCurveValue_1_1_1_1_CachedCurveIndex; // 0x0328(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___GetCurveValue_2_1_1_1_Value;          // 0x0338(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___GetCurveValue_2_1_1_1_Valid;          // 0x033C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___GetCurveValue_2_1_1_1_CachedCurveIndex; // 0x0340(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___GetCurveValue_3_3_1_Value;            // 0x0350(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___GetCurveValue_3_3_1_Valid;            // 0x0354(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___GetCurveValue_3_3_1_CachedCurveIndex; // 0x0358(0x0010)(Edit, EditConst, NonTransactional)
	struct FRotator                               RigVMModel___Cast_1_Value__IO;                     // 0x0368(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         RigVMModel___GetCurveValue_3_1_2_1_Value;          // 0x0380(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___GetCurveValue_3_1_2_1_Valid;          // 0x0384(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___GetCurveValue_3_1_2_1_CachedCurveIndex; // 0x0388(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___GetCurveValue_3_1_1_1_1_Value;        // 0x0398(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___GetCurveValue_3_1_1_1_1_Valid;        // 0x039C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___GetCurveValue_3_1_1_1_1_CachedCurveIndex; // 0x03A0(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___GetCurveValue_3_2_1_1_Value;          // 0x03B0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___GetCurveValue_3_2_1_1_Valid;          // 0x03B4(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___GetCurveValue_3_2_1_1_CachedCurveIndex; // 0x03B8(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_3C8[0x8];                                      // 0x03C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___Make_Absolute_Local__IO;              // 0x03D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_Transform;       // 0x0430(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_CachedIndex;     // 0x0490(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___RigUnit_SetTransform_3_1_2_Value__IO; // 0x04A0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_3_1_2_CachedIndex; // 0x0500(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___Multiply_2_Result;                    // 0x0510(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Subtract_3_Result;                    // 0x0528(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_2_2_Transform;   // 0x0540(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_2_2_CachedIndex; // 0x05A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___Subtract_3_A;                         // 0x05B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C8[0x8];                                      // 0x05C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_4_Transform;     // 0x05D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_4_CachedIndex;   // 0x0630(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___Subtract_3_B;                         // 0x0640(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Add_Add_1_Result;                     // 0x0658(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Add_Add_Result;                       // 0x0660(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Absolute_Result;                      // 0x0668(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Multiply_Result;                      // 0x0670(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Absolute_Value;                       // 0x0688(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Absolute_1_Result;                    // 0x0690(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Absolute_1_Value;                     // 0x0698(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Add_Add_1_B;                          // 0x06A0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A8[0x8];                                      // 0x06A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_5_Value__IO;     // 0x06B0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_5_CachedIndex;   // 0x0710(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimConstraintLocalSpaceOffset_1_WorldUpSpaceCache; // 0x0720(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimConstraintLocalSpaceOffset_1_ChildCache; // 0x0730(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<struct FCachedRigElement>>      RigVMModel___AimConstraintLocalSpaceOffset_1_ParentCaches; // 0x0740(0x0010)(Edit, EditConst, NonTransactional)
	TArray<bool>                                  RigVMModel___AimConstraintLocalSpaceOffset_1_bIsInitialized; // 0x0750(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_2_Transform;   // 0x0760(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_2_CachedIndex; // 0x07C0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_Transform;     // 0x07D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_CachedIndex;   // 0x0830(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_Effectors__IO;                 // 0x0840(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         RigVMModel___PBIK_1_EffectorSolverIndices;         // 0x0850(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FPBIKWorkData>                  RigVMModel___PBIK_1_WorkData;                      // 0x0860(0x0010)(Edit, EditConst, NonTransactional)
	int32                                         RigVMModel___RigVMFunction_MathFloatToInt_Result;  // 0x0870(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GetCurveValue_Value;                  // 0x0874(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___GetCurveValue_Valid;                  // 0x0878(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_879[0x7];                                      // 0x0879(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___GetCurveValue_CachedCurveIndex;       // 0x0880(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___DISPATCH_RigVMDispatch_SwitchInt32_BlockToRun; // 0x0890(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass HeadMovementIK_Proc_CtrlRig.RigVMMemory_Work", true>();
	}
	static class HeadMovementIK_Proc_CtrlRig::URigVMMemory_Work* GetDefaultObj()
	{
		return GetDefaultObjImpl<HeadMovementIK_Proc_CtrlRig::URigVMMemory_Work>();
	}
};

}

