#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HealthShieldRegenRuntime

#include "Basic.hpp"

#include "HealthShieldRegenRuntime_structs.hpp"


namespace SDK::Params
{

// Function HealthShieldRegenRuntime.FortHealthShieldRegenComponent.AllowHealthShieldRegen
// 0x0001 (0x0001 - 0x0000)
struct FortHealthShieldRegenComponent_AllowHealthShieldRegen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HealthShieldRegenRuntime.FortHealthShieldRegenComponent.AssignHealthShieldRegen_HealthListenerDelegates
// 0x0030 (0x0030 - 0x0000)
struct FortHealthShieldRegenComponent_AssignHealthShieldRegen_HealthListenerDelegates final
{
public:
	const class UGameplayAbility*                 OwningAbility;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortHealthShieldRegen_HealthDelegateContainer Delegates;                                         // 0x0008(0x0028)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function HealthShieldRegenRuntime.FortHealthShieldRegenComponent.AssignHealthShieldRegen_ShieldListenerDelegates
// 0x0058 (0x0058 - 0x0000)
struct FortHealthShieldRegenComponent_AssignHealthShieldRegen_ShieldListenerDelegates final
{
public:
	const class UGameplayAbility*                 OwningAbility;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortHealthShieldRegen_ShieldDelegateContainer Delegates;                                         // 0x0008(0x0050)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function HealthShieldRegenRuntime.FortHealthShieldRegenComponent.ClearHealthShieldRegen_HealthListenerDelegates
// 0x0008 (0x0008 - 0x0000)
struct FortHealthShieldRegenComponent_ClearHealthShieldRegen_HealthListenerDelegates final
{
public:
	const class UGameplayAbility*                 OwningAbility;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HealthShieldRegenRuntime.FortHealthShieldRegenComponent.ClearHealthShieldRegen_ShieldListenerDelegates
// 0x0008 (0x0008 - 0x0000)
struct FortHealthShieldRegenComponent_ClearHealthShieldRegen_ShieldListenerDelegates final
{
public:
	const class UGameplayAbility*                 OwningAbility;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

