#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HealthShieldRegenRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// ScriptStruct HealthShieldRegenRuntime.FortHealthShieldRegen_ShieldDelegateContainer
// 0x0050 (0x0050 - 0x0000)
struct FFortHealthShieldRegen_ShieldDelegateContainer final
{
public:
	TDelegate<void()>                             OnShieldChanged;                                   // 0x0000(0x0014)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnShieldedDamage;                                  // 0x0014(0x0014)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class AActor* Instigator)>     OnShieldDestroyed;                                 // 0x0028(0x0014)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FGameplayEventData& Payload)> OnDamageReceived;                                  // 0x003C(0x0014)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct HealthShieldRegenRuntime.FortHealthShieldRegen_HealthDelegateContainer
// 0x0028 (0x0028 - 0x0000)
struct FFortHealthShieldRegen_HealthDelegateContainer final
{
public:
	TDelegate<void()>                             OnHealthChanged;                                   // 0x0000(0x0014)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FGameplayEventData& Payload)> OnDamageReceived;                                  // 0x0014(0x0014)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

