#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HighTowerRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class HighTowerRuntime.HighTowerDateLayerAnimInstance
// 0x0000 (0x14A0 - 0x14A0)
class UHighTowerDateLayerAnimInstance final : public UFortPlayerAnimInstanceProxy
{
public:
	bool                                          bIsFiringLeft;                                     // 0x1498(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFiringRight;                                    // 0x1499(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPlayCustomJumpLand;                         // 0x149A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMontageActive;                                    // 0x149B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBoostJumping;                                   // 0x149C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_149D[0x3];                                     // 0x149D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HighTowerDateLayerAnimInstance">();
	}
	static class UHighTowerDateLayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHighTowerDateLayerAnimInstance>();
	}
};

// Class HighTowerRuntime.FortItemLayerAnimInstance_DateGaunlets
// 0x0010 (0x0510 - 0x0500)
class UFortItemLayerAnimInstance_DateGaunlets final : public UFortBaseLayerAnimInstance
{
public:
	bool                                          bIsBoostJumping;                                   // 0x0500(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_501[0xF];                                      // 0x0501(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemLayerAnimInstance_DateGaunlets">();
	}
	static class UFortItemLayerAnimInstance_DateGaunlets* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemLayerAnimInstance_DateGaunlets>();
	}
};

// Class HighTowerRuntime.FortProjectileAthena_HighTowerDateCombo
// 0x0068 (0x0F88 - 0x0F20)
class AFortProjectileAthena_HighTowerDateCombo final : public AFortProjectileAthena
{
public:
	uint8                                         Pad_F20[0x18];                                     // 0x0F20(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CosmeticsContainer;                                // 0x0F38(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CosmeticStartingOffset;                            // 0x0F40(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F44[0x4];                                      // 0x0F44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         CosmeticLerpDuration;                              // 0x0F48(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F80[0x8];                                      // 0x0F80(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortProjectileAthena_HighTowerDateCombo">();
	}
	static class AFortProjectileAthena_HighTowerDateCombo* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortProjectileAthena_HighTowerDateCombo>();
	}
};

// Class HighTowerRuntime.FortAthenaMutator_HighTowerAbilityIntro
// 0x0010 (0x0630 - 0x0620)
class AFortAthenaMutator_HighTowerAbilityIntro final : public AFortAthenaMutator_GameModeBase
{
public:
	struct FGameplayTag                           ShowAbilityIntroTag;                               // 0x0620(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPlayOnlyOnce;                                     // 0x062C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_62D[0x3];                                      // 0x062D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBeginSkydiveFromBus(class AFortPlayerControllerZone* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_HighTowerAbilityIntro">();
	}
	static class AFortAthenaMutator_HighTowerAbilityIntro* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_HighTowerAbilityIntro>();
	}
};

}

