#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoverGameplayRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function HoverGameplayRuntime.FortGameplayCueNotifyLoop_Hover.UpdateAudioParameters
// 0x0008 (0x0008 - 0x0000)
struct FortGameplayCueNotifyLoop_Hover_UpdateAudioParameters final
{
public:
	float                                         HeightMod;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelocityMod;                                       // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortGameplayCueNotifyLoop_Hover.UpdateFuelFlicker
// 0x0004 (0x0004 - 0x0000)
struct FortGameplayCueNotifyLoop_Hover_UpdateFuelFlicker final
{
public:
	float                                         FlickerPercent;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortGameplayCueNotifyLoop_Hover.UpdateGroundFX
// 0x0001 (0x0001 - 0x0000)
struct FortGameplayCueNotifyLoop_Hover_UpdateGroundFX final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortGameplayCueNotifyLoop_Hover.GetFuelAmount
// 0x0004 (0x0004 - 0x0000)
struct FortGameplayCueNotifyLoop_Hover_GetFuelAmount final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortGameplayCueNotifyLoop_Hover.IsAboveAscendFailHeight
// 0x0001 (0x0001 - 0x0000)
struct FortGameplayCueNotifyLoop_Hover_IsAboveAscendFailHeight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortMovementMode_ExtHover.TryActivateHoverMME
// 0x0028 (0x0028 - 0x0000)
struct FortMovementMode_ExtHover_TryActivateHoverMME final
{
public:
	const class AFortPawn*                        TargetPawn;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMovementMode_ExtHover> HoverMME;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortMovementMode_BaseExtCreationData  CreationData;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UFortMovementMode_HoverRuntimeData*     ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortMovementMode_ExtHover.BP_HandleHitResponse
// 0x0178 (0x0178 - 0x0000)
struct FortMovementMode_ExtHover_BP_HandleHitResponse final
{
public:
	struct FMMERuntimeContext                     RuntimeContext;                                    // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InVelocity;                                        // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OldPosition;                                       // 0x0028(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NewLocation;                                       // 0x0040(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Adjustement;                                       // 0x0058(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0070(0x0108)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortMovementMode_ExtHover.BP_PhysUpdate
// 0x0070 (0x0070 - 0x0000)
struct FortMovementMode_ExtHover_BP_PhysUpdate final
{
public:
	struct FVector                                OutVelocity;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutAcceleration;                                   // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMMERuntimeContext                     RuntimeContext;                                    // 0x0030(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InVelocity;                                        // 0x0040(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InAcceleration;                                    // 0x0058(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortMovementMode_ExtHover.BP_UpdateBeforeCharacterMovement
// 0x0014 (0x0014 - 0x0000)
struct FortMovementMode_ExtHover_BP_UpdateBeforeCharacterMovement final
{
public:
	EFortMovementModeExt_UpdateResult             NativeUpdateResult;                                // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMMERuntimeContext                     RuntimeContext;                                    // 0x0004(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EFortMovementModeExt_UpdateResult             ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HoverGameplayRuntime.FortMovementMode_ExtHover.EndHover
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtHover_EndHover final
{
public:
	class UFortMovementMode_HoverRuntimeData*     HoverRuntimeData;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortMovementMode_ExtHover.OnAscendEnd
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtHover_OnAscendEnd final
{
public:
	class UFortMovementMode_HoverRuntimeData*     HoverRuntimeData;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortMovementMode_ExtHover.OnAscendStart
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtHover_OnAscendStart final
{
public:
	class UFortMovementMode_HoverRuntimeData*     HoverRuntimeData;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortMovementMode_ExtHover.OnBoostEnd
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtHover_OnBoostEnd final
{
public:
	class UFortMovementMode_HoverRuntimeData*     HoverRuntimeData;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortMovementMode_ExtHover.OnBoostStart
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtHover_OnBoostStart final
{
public:
	class UFortMovementMode_HoverRuntimeData*     HoverRuntimeData;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortMovementMode_ExtHover.OnHoverEnd
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtHover_OnHoverEnd final
{
public:
	class UFortMovementMode_HoverRuntimeData*     HoverRuntimeData;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortMovementMode_ExtHover.OnHoverStart
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtHover_OnHoverStart final
{
public:
	class UFortMovementMode_HoverRuntimeData*     HoverRuntimeData;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortMovementMode_ExtHover.StartAscending
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtHover_StartAscending final
{
public:
	class UFortMovementMode_HoverRuntimeData*     HoverRuntimeData;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortMovementMode_ExtHover.StartHover
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtHover_StartHover final
{
public:
	class UFortMovementMode_HoverRuntimeData*     HoverRuntimeData;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortMovementMode_ExtHover.StopAscending
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtHover_StopAscending final
{
public:
	class UFortMovementMode_HoverRuntimeData*     HoverRuntimeData;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortMovementMode_ExtHover.TryStartBoost
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtHover_TryStartBoost final
{
public:
	class UFortMovementMode_HoverRuntimeData*     HoverRuntimeData;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.FortMovementMode_ExtHover.CanStartBoosting
// 0x0001 (0x0001 - 0x0000)
struct FortMovementMode_ExtHover_CanStartBoosting final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HoverGameplayRuntime.HoverAttributeSet.OnRep_Fuel
// 0x0028 (0x0028 - 0x0000)
struct HoverAttributeSet_OnRep_Fuel final
{
public:
	struct FFortGameplayAttributeData             OldValue;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

}

