#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoverGameplayRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class HoverGameplayRuntime.FortGameplayCueNotifyLoop_Hover
// 0x02B8 (0x0E98 - 0x0BE0)
class AFortGameplayCueNotifyLoop_Hover final : public AFortGameplayCueNotifyLoop_SoundIndicator
{
public:
	TWeakObjectPtr<class AFortPlayerPawn>         TargetPawn;                                        // 0x0BE0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class USkeletalMeshComponent>  BackpackMesh;                                      // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortMovementMode_HoverRuntimeData> MovementModeRuntimeData;                           // 0x0BF0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayAttribute                     FuelAttribute;                                     // 0x0BF8(0x0048)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   GroundTraceSocketName;                             // 0x0C40(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C4C[0x4];                                      // 0x0C4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                GroundFXLocation;                                  // 0x0C50(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               GroundFXRotation;                                  // 0x0C68(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         GroundFXHeight;                                    // 0x0C80(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsSimulatedProxy;                                 // 0x0C84(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C85[0x3];                                      // 0x0C85(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         FXUpdateRate;                                      // 0x0C88(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxGroundFXDistance;                               // 0x0CC0(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_CF8[0x8];                                      // 0x0CF8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         LowFuelThreshold;                                  // 0x0D00(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D38[0x8];                                      // 0x0D38(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         AscendFailBuffer;                                  // 0x0D40(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D78[0x8];                                      // 0x0D78(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         AscendFailThrusterFXOverride;                      // 0x0D80(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_DB8[0x8];                                      // 0x0DB8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxFuel;                                           // 0x0DC0(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_DF8[0x8];                                      // 0x0DF8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         VelocityAudioInterpSpeed;                          // 0x0E00(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_E38[0x8];                                      // 0x0E38(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         AudioMaxHeight;                                    // 0x0E40(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_E78[0x20];                                     // 0x0E78(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cleanup();
	void OnFuelLow();
	void OnOutOfFuel();
	void UpdateAudioParameters(const float HeightMod, const float VelocityMod);
	void UpdateFuelFlicker(float FlickerPercent);
	void UpdateFX();
	bool UpdateGroundFX();

	float GetFuelAmount() const;
	bool IsAboveAscendFailHeight() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayCueNotifyLoop_Hover">();
	}
	static class AFortGameplayCueNotifyLoop_Hover* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortGameplayCueNotifyLoop_Hover>();
	}
};

// Class HoverGameplayRuntime.FortMovementMode_HoverRuntimeData
// 0x0040 (0x0088 - 0x0048)
class UFortMovementMode_HoverRuntimeData final : public UFortMovementMode_BaseExtRuntimeData
{
public:
	bool                                          bAscend;                                           // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBoosting;                                         // 0x0049(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeInBoost;                                       // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasInteruptedForwardBoost;                        // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TargetHeightLimit;                                 // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentHeightLimit;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeAboveHeightLimit;                              // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bObstacleAboveHead;                                // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopHover;                                        // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLanded;                                           // 0x0062(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bLocalAscending;                                   // 0x0064(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLocalBoosting;                                    // 0x0065(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLocalStopHover;                                   // 0x0066(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PreviousBoostVelocity;                             // 0x0068(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeSinceLaunched;                                 // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_HoverRuntimeData">();
	}
	static class UFortMovementMode_HoverRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_HoverRuntimeData>();
	}
};

// Class HoverGameplayRuntime.FortMovementMode_ExtHover
// 0x07C8 (0x0910 - 0x0148)
class UFortMovementMode_ExtHover final : public UFortMovementMode_BaseExtLogic
{
public:
	struct FScalableFloat                         Row_LateralMovementStrength;                       // 0x0148(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_180[0x8];                                      // 0x0180(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_AscendStrength;                                // 0x0188(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C0[0x8];                                      // 0x01C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_DescendStrength;                               // 0x01C8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_200[0x8];                                      // 0x0200(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_BoostStrength;                                 // 0x0208(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_240[0x8];                                      // 0x0240(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_SustainedBoostStrength;                        // 0x0248(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_LateralBrakingStrength;                        // 0x0288(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C0[0x8];                                      // 0x02C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_VerticalBrakingStrength;                       // 0x02C8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_300[0x8];                                      // 0x0300(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_DirectionalChangeBonus;                        // 0x0308(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_340[0x8];                                      // 0x0340(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_VerticleForceVelocityThreshold;                // 0x0348(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_380[0x8];                                      // 0x0380(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_DescendAtHeightLimitThreshold;                 // 0x0388(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C0[0x8];                                      // 0x03C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_AllowedTimeAboveHeightLimit;                   // 0x03C8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_400[0x8];                                      // 0x0400(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_BoostDuration;                                 // 0x0408(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_440[0x8];                                      // 0x0440(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_BoostingDirectionChangeMax;                    // 0x0448(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_480[0x8];                                      // 0x0480(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_BoostingDirectionChangeMinMultiplier;          // 0x0488(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C0[0x8];                                      // 0x04C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_VelocityBrakeMulitplier;                       // 0x04C8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_500[0x8];                                      // 0x0500(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_HeightLimitZBrakeMultiplier;                   // 0x0508(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_540[0x8];                                      // 0x0540(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_LaunchBrakeMultiplier;                         // 0x0548(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_580[0x8];                                      // 0x0580(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_LateralMaxSpeed;                               // 0x0588(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C0[0x8];                                      // 0x05C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_AscendingMaxSpeed;                             // 0x05C8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_600[0x8];                                      // 0x0600(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_BoostingMaxSpeed;                              // 0x0608(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_640[0x8];                                      // 0x0640(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_BoostingSustainedMaxSpeed;                     // 0x0648(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_680[0x8];                                      // 0x0680(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_MinSpeed;                                      // 0x0688(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_6C0[0x8];                                      // 0x06C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_MinBoostSpeed;                                 // 0x06C8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_700[0x8];                                      // 0x0700(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_MaxBoostVelocityAngleChangeRate;               // 0x0708(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_740[0x8];                                      // 0x0740(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_MaxBoostRotationDelta;                         // 0x0748(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_780[0x8];                                      // 0x0780(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_SoftHeightLimitSize;                           // 0x0788(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C0[0x8];                                      // 0x07C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_HeightLimitMaxInterpDistance;                  // 0x07C8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_800[0x8];                                      // 0x0800(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_HeightLimitRiseSpeed;                          // 0x0808(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_840[0x8];                                      // 0x0840(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_HeightLimitFallSpeed;                          // 0x0848(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_880[0x8];                                      // 0x0880(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_LaunchResponseMaxTime;                         // 0x0888(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C0[0x8];                                      // 0x08C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_LaunchResponseMinTime;                         // 0x08C8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_900[0x8];                                      // 0x0900(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortMovementMode_HoverRuntimeData> RuntimeDataClass;                                  // 0x0908(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UFortMovementMode_HoverRuntimeData* TryActivateHoverMME(const class AFortPawn* TargetPawn, const TSubclassOf<class UFortMovementMode_ExtHover> HoverMME, const struct FFortMovementMode_BaseExtCreationData& CreationData);

	void BP_HandleHitResponse(const struct FMMERuntimeContext& RuntimeContext, const struct FVector& InVelocity, const struct FVector& OldPosition, const struct FVector& NewLocation, const struct FVector& Adjustement, const struct FHitResult& Hit);
	void BP_PhysUpdate(struct FVector* OutVelocity, struct FVector* OutAcceleration, const struct FMMERuntimeContext& RuntimeContext, const struct FVector& InVelocity, const struct FVector& InAcceleration);
	EFortMovementModeExt_UpdateResult BP_UpdateBeforeCharacterMovement(const EFortMovementModeExt_UpdateResult& NativeUpdateResult, const struct FMMERuntimeContext& RuntimeContext);
	void EndHover(class UFortMovementMode_HoverRuntimeData* HoverRuntimeData);
	void OnAscendEnd(class UFortMovementMode_HoverRuntimeData* HoverRuntimeData);
	void OnAscendStart(class UFortMovementMode_HoverRuntimeData* HoverRuntimeData);
	void OnBoostEnd(class UFortMovementMode_HoverRuntimeData* HoverRuntimeData);
	void OnBoostStart(class UFortMovementMode_HoverRuntimeData* HoverRuntimeData);
	void OnHoverEnd(class UFortMovementMode_HoverRuntimeData* HoverRuntimeData);
	void OnHoverStart(class UFortMovementMode_HoverRuntimeData* HoverRuntimeData);
	void StartAscending(class UFortMovementMode_HoverRuntimeData* HoverRuntimeData);
	void StartHover(class UFortMovementMode_HoverRuntimeData* HoverRuntimeData);
	void StopAscending(class UFortMovementMode_HoverRuntimeData* HoverRuntimeData);
	void TryStartBoost(class UFortMovementMode_HoverRuntimeData* HoverRuntimeData);

	bool CanStartBoosting() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ExtHover">();
	}
	static class UFortMovementMode_ExtHover* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ExtHover>();
	}
};

// Class HoverGameplayRuntime.HoverAttributeSet
// 0x0060 (0x0098 - 0x0038)
class UHoverAttributeSet final : public UFortAttributeSet
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayAttributeData             MaxFuel;                                           // 0x0048(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, NativeAccessSpecifierPrivate)
	struct FFortGameplayAttributeData             Fuel;                                              // 0x0070(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPrivate)

public:
	void OnRep_Fuel(const struct FFortGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoverAttributeSet">();
	}
	static class UHoverAttributeSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoverAttributeSet>();
	}
};

}

