#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: hud_message_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass hud_message_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class hud_message_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass hud_message_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class hud_message_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<hud_message_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass hud_message_device.hud_message_device
// 0x0050 (0x0110 - 0x00C0)
class Uhud_message_device final : public UDevices_creative_device_base
{
public:
	class UDevices_device_function*               __verse_0x670B509D_ShowFunction;                   // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC25BB6EA_HideFunction;                   // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type* __verse_0x663540C3_SetDisplayForInfiniteDurationFunction; // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_float*     __verse_0x5995A5EB_SetDisplayForFiniteDurationFunction; // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_float*     __verse_0x1D8860B2_GetFiniteDisplayDurationFunction; // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_logic*     __verse_0x3348A60C_IsDisplayDurationFiniteFunction; // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_message*   __verse_0x9C355EEC_SetTextMessageFunction;         // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_string*    __verse_0x33ED5C00_GetTextFunction;                // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type* __verse_0x4889EA1F_DisplayTextMessageFunction;     // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	double _L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RGetDisplayTime(const struct hud_message_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RGetText(const struct hud_message_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RHide(const struct hud_message_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RHide_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RSetDisplayTime_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RSetText_L_Nmessage_R(class UVerse_message* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RShow(const struct hud_message_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RShow_L_Nagent_M_Nmessage_M_N_QDisplayTime_Nfloat_20_3d_20_2e_2e_2e_R(const struct Ftuple_Lagent_Mmessage_M_QDisplayTime_Nfloat_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RShow_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RShow_L_Nmessage_M_N_QDisplayTime_Nfloat_20_3d_20_2e_2e_2e_R(const struct Ftuple_Lmessage_M_QDisplayTime_Nfloat_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"hud_message_device">();
	}
	static class Uhud_message_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uhud_message_device>();
	}
};

}

