#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: hud_controller_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass hud_controller_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class hud_controller_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass hud_controller_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class hud_controller_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<hud_controller_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass hud_controller_device.hud_controller_device
// 0x0030 (0x00F0 - 0x00C0)
class Uhud_controller_device final : public UDevices_creative_device_base
{
public:
	class UDevices_device_function*               __verse_0x5BDC7A5C_EnableFunction;                 // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC9184E23_DisableFunction;                // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xE7EBAC5C_UpdateAffectedClassFunction;    // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x9B4AC104_UpdateAffectedTeamFunction;     // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xE347FFFA_ResetAffectedClassFunction;     // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xE083AB51_ResetAffectedTeamFunction;      // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fhud__controller__device_N_RDisable(const struct hud_controller_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fhud__controller__device_N_REnable(const struct hud_controller_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fhud__controller__device_N_RResetAffectedClass(const struct hud_controller_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fhud__controller__device_N_RResetAffectedTeam(const struct hud_controller_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fhud__controller__device_N_RUpdateAffectedClass_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fhud__controller__device_N_RUpdateAffectedTeam_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"hud_controller_device">();
	}
	static class Uhud_controller_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uhud_controller_device>();
	}
};

}

