#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: hud_message_device

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "hud_message_device_structs.hpp"


namespace SDK::Params
{

// Function hud_message_device.hud_message_device.$InitCDO
// 0x0450 (0x0450 - 0x0000)
struct hud_message_device__InitCDO final
{
public:
	class UDevices_device_function*               _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_2;                            // 0x0010(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0020(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_4;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_6;                            // 0x0040(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type* _ExprResult_8;                                     // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_9;                                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_10;                           // 0x0070(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x0080(0x0010)(HasGetValueTypeHash)
	TArray<class UClass*>                         _ArchetypeFieldValue_12;                           // 0x0090(0x0010)(ContainsInstancedReference)
	TArray<class UClass*>                         _ExprResult_13;                                    // 0x00A0(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x00B0(0x0010)(ContainsInstancedReference)
	TArray<class UClass*>                         _ForResult_14;                                     // 0x00C0(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_15;                                      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_16;                                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_17 : 1;                                // 0x00E1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function_set_float*     _ExprResult_18;                                    // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_19;                               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_20;                           // 0x00F8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_21;                                    // 0x0108(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_float*     _ExprResult_22;                                    // 0x0118(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_23;                               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_24;                           // 0x0128(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_25;                                    // 0x0138(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_logic*     _ExprResult_26;                                    // 0x0148(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_27;                               // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_28;                           // 0x0158(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_29;                                    // 0x0168(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_message*   _ExprResult_30;                                    // 0x0178(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_31;                               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_32;                           // 0x0188(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_33;                                    // 0x0198(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_string*    _ExprResult_34;                                    // 0x01A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_35;                               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_36;                           // 0x01B8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_37;                                    // 0x01C8(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type* _ExprResult_38;                                    // 0x01D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_39;                               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_40;                           // 0x01E8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_41;                                    // 0x01F8(0x0010)(HasGetValueTypeHash)
	TArray<class UClass*>                         _ArchetypeFieldValue_42;                           // 0x0208(0x0010)(ContainsInstancedReference)
	TArray<class UClass*>                         _ExprResult_43;                                    // 0x0218(0x0010)(ContainsInstancedReference)
	class UDevices_device_function*               _ExprResult_44;                                    // 0x0228(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_45;                               // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_46;                           // 0x0238(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_47;                                    // 0x0248(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_48;                                    // 0x0258(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_49;                               // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_50;                           // 0x0268(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_51;                                    // 0x0278(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type* _ExprResult_52;                                    // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_53;                               // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_54;                           // 0x0298(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_55;                                    // 0x02A8(0x0010)(HasGetValueTypeHash)
	TArray<class UClass*>                         _ArchetypeFieldValue_56;                           // 0x02B8(0x0010)(ContainsInstancedReference)
	TArray<class UClass*>                         _ExprResult_57;                                    // 0x02C8(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x02D8(0x0010)(ContainsInstancedReference)
	TArray<class UClass*>                         _ForResult_58;                                     // 0x02E8(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_59;                                      // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_60;                                     // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_61 : 1;                                // 0x0309(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function_set_float*     _ExprResult_62;                                    // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_63;                               // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_64;                           // 0x0320(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_65;                                    // 0x0330(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_float*     _ExprResult_66;                                    // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_67;                               // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_68;                           // 0x0350(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_69;                                    // 0x0360(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_logic*     _ExprResult_70;                                    // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_71;                               // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_72;                           // 0x0380(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_73;                                    // 0x0390(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_message*   _ExprResult_74;                                    // 0x03A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_75;                               // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_76;                           // 0x03B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_77;                                    // 0x03C0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_string*    _ExprResult_78;                                    // 0x03D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_79;                               // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_80;                           // 0x03E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_81;                                    // 0x03F0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type* _ExprResult_82;                                    // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_83;                               // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_84;                           // 0x0410(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_85;                                    // 0x0420(0x0010)(HasGetValueTypeHash)
	TArray<class UClass*>                         _ArchetypeFieldValue_86;                           // 0x0430(0x0010)(ContainsInstancedReference)
	TArray<class UClass*>                         _ExprResult_87;                                    // 0x0440(0x0010)(ContainsInstancedReference)
};

// Function hud_message_device.hud_message_device._L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RGetDisplayTime
// 0x0060 (0x0060 - 0x0000)
struct hud_message_device__L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RGetDisplayTime final
{
public:
	struct hud_message_device::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_function_get_float*     __verse_0x00000000__1;                             // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct hud_message_device::Ftuple_L_R         _ExprResult_1;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function_get_float*     __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
	struct hud_message_device::Ftuple_L_R         _ExprResult_3;                                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function hud_message_device.hud_message_device._L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RGetText
// 0x0068 (0x0068 - 0x0000)
struct hud_message_device__L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RGetText final
{
public:
	struct hud_message_device::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	class UDevices_device_function_get_string*    __verse_0x00000000__1;                             // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0020(0x0018)(HasGetValueTypeHash)
	struct hud_message_device::Ftuple_L_R         _ExprResult_1;                                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function_get_string*    __verse_0x00000000__2;                             // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct hud_message_device::Ftuple_L_R         _ExprResult_3;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function hud_message_device.hud_message_device._L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RHide
// 0x0068 (0x0068 - 0x0000)
struct hud_message_device__L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RHide final
{
public:
	struct hud_message_device::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct hud_message_device::Ftuple_L_R         _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct hud_message_device::Ftuple_L_R         _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function hud_message_device.hud_message_device._L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RHide_L_Nagent_R
// 0x0058 (0x0058 - 0x0000)
struct hud_message_device__L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RHide_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
};

// Function hud_message_device.hud_message_device._L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RSetDisplayTime_L_Nfloat_R
// 0x00F8 (0x00F8 - 0x0000)
struct hud_message_device__L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RSetDisplayTime_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<double>                             _ExprResultStack_0;                                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type* __verse_0x00000000__3;                             // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UDevices_function_parameter_base*, true> _InvokeSureResultDummy_1;                          // 0x0020(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0028(0x0018)(HasGetValueTypeHash)
	TArray<class UDevices_function_parameter_base*> _ExprResult_3;                                     // 0x0040(0x0010)(ContainsInstancedReference)
	struct hud_message_device::Ftuple_L_R         __verse_0x00000000__4;                             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function_set_float*     __verse_0x00000000__6;                             // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_4;                          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0068(0x0018)(HasGetValueTypeHash)
	TOptional<double>                             _ExprResultStack_6;                                // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type* __verse_0x00000000__9;                             // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UDevices_function_parameter_base*, true> _InvokeSureResultDummy_7;                          // 0x0098(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x00A0(0x0018)(HasGetValueTypeHash)
	TArray<class UDevices_function_parameter_base*> _ExprResult_9;                                     // 0x00B8(0x0010)(ContainsInstancedReference)
	struct hud_message_device::Ftuple_L_R         __verse_0x00000000__10;                            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function_set_float*     __verse_0x00000000__12;                            // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_10;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x00E0(0x0018)(HasGetValueTypeHash)
};

// Function hud_message_device.hud_message_device._L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RSetText_L_Nmessage_R
// 0x0058 (0x0058 - 0x0000)
struct hud_message_device__L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RSetText_L_Nmessage_R final
{
public:
	class UVerse_message*                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_message*   __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	class UDevices_device_function_set_message*   __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
};

// Function hud_message_device.hud_message_device._L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RShow
// 0x0068 (0x0068 - 0x0000)
struct hud_message_device__L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RShow final
{
public:
	struct hud_message_device::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct hud_message_device::Ftuple_L_R         _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct hud_message_device::Ftuple_L_R         _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function hud_message_device.hud_message_device._L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RShow_L_Nagent_M_Nmessage_M_N_QDisplayTime_Nfloat_20_3d_20_2e_2e_2e_R
// 0x0140 (0x0140 - 0x0000)
struct hud_message_device__L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RShow_L_Nagent_M_Nmessage_M_N_QDisplayTime_Nfloat_20_3d_20_2e_2e_2e_R final
{
public:
	struct Ftuple_Lagent_Mmessage_M_QDisplayTime_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type* __verse_0x00000000__2;                             // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UDevices_function_parameter_base*, true> _InvokeSureResultDummy_0;                          // 0x0028(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
	TArray<class UDevices_function_parameter_base*> _ExprResult_2;                                     // 0x0048(0x0010)(ContainsInstancedReference)
	class UDevices_function_parameter_agent*      _ExprResult_3;                                     // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_4;                                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ArchetypeFieldValue_5;                            // 0x0068(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResult_6;                                     // 0x0070(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UDevices_function_parameter_message*    _ExprResult_7;                                     // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_8;                                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UVerse_message*, true>        _ArchetypeFieldValue_9;                            // 0x0088(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVerse_message*, true>        _ExprResult_10;                                    // 0x0090(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UDevices_function_parameter_float*      _ExprResult_11;                                    // 0x0098(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_12;                               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ArchetypeFieldValue_13;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type* __verse_0x00000000__4;                             // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UDevices_function_parameter_base*, true> _InvokeSureResultDummy_14;                         // 0x00B8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_15;                                        // 0x00C0(0x0018)(HasGetValueTypeHash)
	TArray<class UDevices_function_parameter_base*> _ExprResult_16;                                    // 0x00D8(0x0010)(ContainsInstancedReference)
	class UDevices_function_parameter_agent*      _ExprResult_17;                                    // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_18;                               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ArchetypeFieldValue_19;                           // 0x00F8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResult_20;                                    // 0x0100(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UDevices_function_parameter_message*    _ExprResult_21;                                    // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_22;                               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UVerse_message*, true>        _ArchetypeFieldValue_23;                           // 0x0118(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVerse_message*, true>        _ExprResult_24;                                    // 0x0120(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UDevices_function_parameter_float*      _ExprResult_25;                                    // 0x0128(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_26;                               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ArchetypeFieldValue_27;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function hud_message_device.hud_message_device._L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RShow_L_Nagent_R
// 0x00A8 (0x00A8 - 0x0000)
struct hud_message_device__L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RShow_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0010(0x0018)(HasGetValueTypeHash)
	struct hud_message_device::Ftuple_L_R         _ExprResult_2;                                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_5;                          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0060(0x0018)(HasGetValueTypeHash)
	struct hud_message_device::Ftuple_L_R         _ExprResult_7;                                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__4;                             // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_8;                          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x0090(0x0018)(HasGetValueTypeHash)
};

// Function hud_message_device.hud_message_device._L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RShow_L_Nmessage_M_N_QDisplayTime_Nfloat_20_3d_20_2e_2e_2e_R
// 0x0148 (0x0148 - 0x0000)
struct hud_message_device__L_2fFortnite_2ecom_2fDevices_2fhud__message__device_N_RShow_L_Nmessage_M_N_QDisplayTime_Nfloat_20_3d_20_2e_2e_2e_R final
{
public:
	struct Ftuple_Lmessage_M_QDisplayTime_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type* __verse_0x00000000__2;                             // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UDevices_function_parameter_base*, true> _InvokeSureResultDummy_0;                          // 0x0020(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0028(0x0018)(HasGetValueTypeHash)
	TArray<class UDevices_function_parameter_base*> _ExprResult_2;                                     // 0x0040(0x0010)(ContainsInstancedReference)
	class UDevices_function_parameter_agent*      _ExprResult_3;                                     // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_4;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ArchetypeFieldValue_5;                            // 0x0060(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResult_6;                                     // 0x0068(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0070(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_7 : 1;                                 // 0x0072(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_8;                                // 0x0073(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_function_parameter_message*    _ExprResult_9;                                     // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_10;                               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UVerse_message*, true>        _ArchetypeFieldValue_11;                           // 0x0088(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVerse_message*, true>        _ExprResult_12;                                    // 0x0090(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UDevices_function_parameter_float*      _ExprResult_13;                                    // 0x0098(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_14;                               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ArchetypeFieldValue_15;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type* __verse_0x00000000__6;                             // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UDevices_function_parameter_base*, true> _InvokeSureResultDummy_16;                         // 0x00B8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_17;                                        // 0x00C0(0x0018)(HasGetValueTypeHash)
	TArray<class UDevices_function_parameter_base*> _ExprResult_18;                                    // 0x00D8(0x0010)(ContainsInstancedReference)
	class UDevices_function_parameter_agent*      _ExprResult_19;                                    // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_20;                               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ArchetypeFieldValue_21;                           // 0x00F8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResult_22;                                    // 0x0100(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__7;                             // 0x0108(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_23 : 1;                                // 0x010A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_24;                               // 0x010B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_function_parameter_message*    _ExprResult_25;                                    // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_26;                               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UVerse_message*, true>        _ArchetypeFieldValue_27;                           // 0x0120(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVerse_message*, true>        _ExprResult_28;                                    // 0x0128(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UDevices_function_parameter_float*      _ExprResult_29;                                    // 0x0130(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_30;                               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ArchetypeFieldValue_31;                           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

