#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: hud_message_device

#include "Basic.hpp"


namespace SDK
{

// VerseStruct hud_message_device.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct hud_message_device::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct hud_message_device.tuple_Lagent_Mmessage_M_QDisplayTime_Nfloat_20_3d_20_2e_2e_2e_R
// 0x0020 (0x0020 - 0x0000)
struct Ftuple_Lagent_Mmessage_M_QDisplayTime_Nfloat_20_3d_20_2e_2e_2e_R final
{
public:
	class USimulation_agent*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerse_message*                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<double>                             __verse_0x932BF92E_Elem2;                          // 0x0010(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct hud_message_device.tuple_Lmessage_M_QDisplayTime_Nfloat_20_3d_20_2e_2e_2e_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lmessage_M_QDisplayTime_Nfloat_20_3d_20_2e_2e_2e_R final
{
public:
	class UVerse_message*                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<double>                             __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

}

