#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IKRigEditor

#include "Basic.hpp"

#include "AnimGraph_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum IKRigEditor.ERetargetRootLockMode
// NumValues: 0x0004
enum class ERetargetRootLockMode : uint8
{
	FromSourceAnimation                      = 0,
	ForceRootLocked                          = 1,
	ForceRootUnlocked                        = 2,
	ERetargetRootLockMode_MAX                = 3,
};

// Enum IKRigEditor.ERetargetAutoAlignMethod
// NumValues: 0x0003
enum class ERetargetAutoAlignMethod : uint8
{
	ChainToChain                             = 0,
	MeshToMesh                               = 1,
	ERetargetAutoAlignMethod_MAX             = 2,
};

// Enum IKRigEditor.EAutoMapChainType
// NumValues: 0x0004
enum class EAutoMapChainType : uint8
{
	Exact                                    = 0,
	Fuzzy                                    = 1,
	Clear                                    = 2,
	EAutoMapChainType_MAX                    = 3,
};

// ScriptStruct IKRigEditor.AnimNode_PreviewRetargetPose
// 0x0050 (0x00D8 - 0x0088)
struct FAnimNode_PreviewRetargetPose final : public FAnimNode_Base
{
public:
	uint8                                         Pad_88[0x50];                                      // 0x0088(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct IKRigEditor.IKRetargetAnimInstanceProxy
// 0x0020 (0x0E60 - 0x0E40)
struct FIKRetargetAnimInstanceProxy final : public FAnimPreviewInstanceProxy
{
public:
	uint8                                         Pad_E40[0x20];                                     // 0x0E40(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct IKRigEditor.IKRigAnimInstanceProxy
// 0x0010 (0x0E50 - 0x0E40)
struct FIKRigAnimInstanceProxy final : public FAnimPreviewInstanceProxy
{
public:
	uint8                                         Pad_E40[0x10];                                     // 0x0E40(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct IKRigEditor.IKRigRetargetChainSettings
// 0x0024 (0x0024 - 0x0000)
struct FIKRigRetargetChainSettings final
{
public:
	class FName                                   ChainName;                                         // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StartBone;                                         // 0x000C(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EndBone;                                           // 0x0018(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

