#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IKRigEditor

#include "Basic.hpp"

#include "IKRigEditor_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UnrealEd_classes.hpp"
#include "AnimGraph_classes.hpp"
#include "IKRig_structs.hpp"


namespace SDK
{

// Class IKRigEditor.IKRetargetBatchOperation
// 0x0110 (0x0140 - 0x0030)
class UIKRetargetBatchOperation final : public UObject
{
public:
	uint8                                         Pad_30[0x110];                                     // 0x0030(0x0110)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static TArray<struct FAssetData> DuplicateAndRetarget(const TArray<struct FAssetData>& AssetsToRetarget, class USkeletalMesh* SourceMesh, class USkeletalMesh* TargetMesh, class UIKRetargeter* IKRetargetAsset, const class FString& Search, const class FString& Replace, const class FString& Prefix, const class FString& Suffix, const bool bIncludeReferencedAssets);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IKRetargetBatchOperation">();
	}
	static class UIKRetargetBatchOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetBatchOperation>();
	}
};

// Class IKRigEditor.BatchExportOptions
// 0x0008 (0x0038 - 0x0030)
class UBatchExportOptions final : public UObject
{
public:
	bool                                          bOverwriteExistingFiles;                           // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeReferencedAssets;                          // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BatchExportOptions">();
	}
	static class UBatchExportOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBatchExportOptions>();
	}
};

// Class IKRigEditor.BatchRetargetSettings
// 0x0020 (0x0050 - 0x0030)
class UBatchRetargetSettings final : public UObject
{
public:
	class USkeletalMesh*                          SourceSkeletalMesh;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          TargetSkeletalMesh;                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoGenerateRetargeter;                           // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIKRetargeter*                          RetargetAsset;                                     // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BatchRetargetSettings">();
	}
	static class UBatchRetargetSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBatchRetargetSettings>();
	}
};

// Class IKRigEditor.IKRetargetAnimInstance
// 0x0340 (0x0760 - 0x0420)
class UIKRetargetAnimInstance final : public UAnimPreviewInstance
{
public:
	struct FAnimNode_PreviewRetargetPose          PreviewPoseNode;                                   // 0x0420(0x00D8)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FAnimNode_RetargetPoseFromMesh         RetargetNode;                                      // 0x04F8(0x0268)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IKRetargetAnimInstance">();
	}
	static class UIKRetargetAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetAnimInstance>();
	}
};

// Class IKRigEditor.IKRetargetBoneDetails
// 0x01B0 (0x01E0 - 0x0030)
class UIKRetargetBoneDetails final : public UObject
{
public:
	class FName                                   SelectedBone;                                      // 0x0030(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalTransform;                                    // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             OffsetTransform;                                   // 0x00A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             CurrentTransform;                                  // 0x0100(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ReferenceTransform;                                // 0x0160(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C0[0x20];                                     // 0x01C0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IKRetargetBoneDetails">();
	}
	static class UIKRetargetBoneDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetBoneDetails>();
	}
};

// Class IKRigEditor.IKRetargeterController
// 0x0088 (0x00B8 - 0x0030)
class UIKRetargeterController final : public UObject
{
public:
	uint8                                         Pad_30[0x88];                                      // 0x0030(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UIKRetargeterController* GetController(const class UIKRetargeter* InRetargeterAsset);

	void SnapBoneToGround(class FName ReferenceBone, ERetargetSourceOrTarget SourceOrTarget);

	int32 AddRetargetOp(TSubclassOf<class URetargetOpBase> InOpClass) const;
	void AutoAlignAllBones(ERetargetSourceOrTarget SourceOrTarget) const;
	void AutoAlignBones(const TArray<class FName>& BonesToAlign, const ERetargetAutoAlignMethod Method, ERetargetSourceOrTarget SourceOrTarget) const;
	void AutoMapChains(const EAutoMapChainType AutoMapType, const bool bForceRemap) const;
	class FName CreateRetargetPose(const class FName& NewPoseName, const ERetargetSourceOrTarget SourceOrTarget) const;
	class FName DuplicateRetargetPose(const class FName PoseToDuplicate, const class FName NewName, const ERetargetSourceOrTarget SourceOrTarget) const;
	const TArray<class URetargetChainSettings*> GetAllChainSettings() const;
	struct FIKRetargetPose GetCurrentRetargetPose(const ERetargetSourceOrTarget SourceOrTarget) const;
	class FName GetCurrentRetargetPoseName(const ERetargetSourceOrTarget SourceOrTarget) const;
	struct FRetargetGlobalSettings GetGlobalSettings() const;
	const class UIKRigDefinition* GetIKRig(const ERetargetSourceOrTarget SourceOrTarget) const;
	int32 GetIndexOfRetargetOp(class URetargetOpBase* RetargetOp) const;
	int32 GetNumRetargetOps() const;
	class USkeletalMesh* GetPreviewMesh(const ERetargetSourceOrTarget SourceOrTarget) const;
	struct FTargetChainSettings GetRetargetChainSettings(const class FName& TargetChainName) const;
	class URetargetOpBase* GetRetargetOpAtIndex(int32 Index_0) const;
	bool GetRetargetOpEnabled(int32 RetargetOpIndex) const;
	TMap<class FName, struct FIKRetargetPose> GetRetargetPoses(const ERetargetSourceOrTarget SourceOrTarget) const;
	struct FVector GetRootOffsetInRetargetPose(const ERetargetSourceOrTarget SourceOrTarget) const;
	struct FTargetRootSettings GetRootSettings() const;
	struct FQuat GetRotationOffsetForRetargetPoseBone(const class FName& BoneName, const ERetargetSourceOrTarget SourceOrTarget) const;
	class FName GetSourceChain(const class FName& TargetChainName) const;
	bool MoveRetargetOpInStack(int32 OpToMoveIndex, int32 TargetIndex) const;
	bool RemoveAllOps() const;
	bool RemoveRetargetOp(const int32 OpIndex) const;
	bool RemoveRetargetPose(const class FName& PoseToRemove, const ERetargetSourceOrTarget SourceOrTarget) const;
	bool RenameRetargetPose(const class FName OldPoseName, const class FName NewPoseName, const ERetargetSourceOrTarget SourceOrTarget) const;
	void ResetRetargetPose(const class FName& PoseToReset, const TArray<class FName>& BonesToReset, const ERetargetSourceOrTarget SourceOrTarget) const;
	bool SetCurrentRetargetPose(class FName CurrentPose, const ERetargetSourceOrTarget SourceOrTarget) const;
	void SetGlobalSettings(const struct FRetargetGlobalSettings& GlobalSettings) const;
	void SetIKRig(const ERetargetSourceOrTarget SourceOrTarget, class UIKRigDefinition* IKRig) const;
	void SetPreviewMesh(const ERetargetSourceOrTarget SourceOrTarget, class USkeletalMesh* InPreviewMesh) const;
	bool SetRetargetChainSettings(const class FName& TargetChainName, const struct FTargetChainSettings& Settings) const;
	bool SetRetargetOpEnabled(int32 RetargetOpIndex, bool bIsEnabled) const;
	void SetRootOffsetInRetargetPose(const struct FVector& TranslationOffset, const ERetargetSourceOrTarget SourceOrTarget) const;
	void SetRootSettings(const struct FTargetRootSettings& RootSettings) const;
	void SetRotationOffsetForRetargetPoseBone(const class FName& BoneName, const struct FQuat& RotationOffset, const ERetargetSourceOrTarget SkeletonMode) const;
	bool SetSourceChain(class FName SourceChainName, class FName TargetChainName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IKRetargeterController">();
	}
	static class UIKRetargeterController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargeterController>();
	}
};

// Class IKRigEditor.IKRetargeterThumbnailRenderer
// 0x0050 (0x0088 - 0x0038)
class UIKRetargeterThumbnailRenderer final : public UDefaultSizedThumbnailRenderer
{
public:
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IKRetargeterThumbnailRenderer">();
	}
	static class UIKRetargeterThumbnailRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargeterThumbnailRenderer>();
	}
};

// Class IKRigEditor.IKRetargetFactory
// 0x0008 (0x0090 - 0x0088)
class UIKRetargetFactory final : public UFactory
{
public:
	TWeakObjectPtr<class UIKRigDefinition>        SourceIKRig;                                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IKRetargetFactory">();
	}
	static class UIKRetargetFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRetargetFactory>();
	}
};

// Class IKRigEditor.IKRigAnimInstance
// 0x0270 (0x0690 - 0x0420)
class UIKRigAnimInstance final : public UAnimPreviewInstance
{
public:
	struct FAnimNode_IKRig                        IKRigNode;                                         // 0x0420(0x0270)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IKRigAnimInstance">();
	}
	static class UIKRigAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRigAnimInstance>();
	}
};

// Class IKRigEditor.IKRigController
// 0x0080 (0x00B0 - 0x0030)
class UIKRigController final : public UObject
{
public:
	uint8                                         Pad_30[0x78];                                      // 0x0030(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class UIKRigDefinition*                       Asset;                                             // 0x00A8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UIKRigController* GetController(const class UIKRigDefinition* InIKRigDefinition);

	bool ApplyAutoFBIK();
	bool ApplyAutoGeneratedRetargetDefinition();

	bool AddBoneSetting(const class FName BoneName, int32 SolverIndex) const;
	class FName AddNewGoal(const class FName GoalName, const class FName BoneName) const;
	class FName AddRetargetChain(const class FName ChainName, const class FName StartBoneName, const class FName EndBoneName, const class FName GoalName) const;
	int32 AddSolver(TSubclassOf<class UIKRigSolver> InSolverClass) const;
	bool ConnectGoalToSolver(const class FName GoalName, int32 SolverIndex) const;
	bool DisconnectGoalFromSolver(const class FName GoalToRemove, int32 SolverIndex) const;
	const TArray<class UIKRigEffectorGoal*> GetAllGoals() const;
	bool GetBoneExcluded(const class FName BoneName) const;
	class FName GetBoneForGoal(const class FName GoalName) const;
	class UObject* GetBoneSettings(const class FName BoneName, int32 SolverIndex) const;
	class FName GetEndBone(int32 SolverIndex) const;
	class UIKRigEffectorGoal* GetGoal(const class FName GoalName) const;
	class FName GetGoalNameForBone(const class FName BoneName) const;
	class UObject* GetGoalSettingsForSolver(const class FName GoalName, int32 SolverIndex) const;
	int32 GetIndexOfSolver(class UIKRigSolver* Solver) const;
	int32 GetNumSolvers() const;
	struct FTransform GetRefPoseTransformOfBone(const class FName BoneName) const;
	class FName GetRetargetChainEndBone(const class FName ChainName) const;
	class FName GetRetargetChainGoal(const class FName ChainName) const;
	const TArray<struct FBoneChain> GetRetargetChains() const;
	class FName GetRetargetChainStartBone(const class FName ChainName) const;
	class FName GetRetargetRoot() const;
	class FName GetRootBone(int32 SolverIndex) const;
	class USkeletalMesh* GetSkeletalMesh() const;
	class UIKRigSolver* GetSolverAtIndex(int32 Index_0) const;
	bool GetSolverEnabled(int32 SolverIndex) const;
	bool IsGoalConnectedToAnySolver(const class FName GoalName) const;
	bool IsGoalConnectedToSolver(const class FName GoalName, int32 SolverIndex) const;
	bool IsSkeletalMeshCompatible(class USkeletalMesh* SkeletalMeshToCheck) const;
	bool MoveSolverInStack(int32 SolverToMoveIndex, int32 TargetSolverIndex) const;
	bool RemoveBoneSetting(const class FName BoneName, int32 SolverIndex) const;
	bool RemoveGoal(const class FName GoalName) const;
	bool RemoveRetargetChain(const class FName ChainName) const;
	bool RemoveSolver(const int32 SolverIndex) const;
	class FName RenameGoal(const class FName OldName, const class FName PotentialNewName) const;
	class FName RenameRetargetChain(const class FName ChainName, const class FName NewChainName) const;
	bool SetBoneExcluded(const class FName BoneName, const bool bExclude) const;
	bool SetEndBone(const class FName EndBoneName, int32 SolverIndex) const;
	bool SetGoalBone(const class FName GoalName, const class FName NewBoneName) const;
	bool SetRetargetChainEndBone(const class FName ChainName, const class FName EndBoneName) const;
	bool SetRetargetChainGoal(const class FName ChainName, const class FName GoalName) const;
	bool SetRetargetChainStartBone(const class FName ChainName, const class FName StartBoneName) const;
	bool SetRetargetRoot(const class FName RootBoneName) const;
	bool SetRootBone(const class FName RootBoneName, int32 SolverIndex) const;
	bool SetSkeletalMesh(class USkeletalMesh* SkeletalMesh) const;
	bool SetSolverEnabled(int32 SolverIndex, bool bIsEnabled) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IKRigController">();
	}
	static class UIKRigController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRigController>();
	}
};

// Class IKRigEditor.IKRigDefinitionFactory
// 0x0000 (0x0088 - 0x0088)
class UIKRigDefinitionFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IKRigDefinitionFactory">();
	}
	static class UIKRigDefinitionFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRigDefinitionFactory>();
	}
};

// Class IKRigEditor.IKRigBoneDetails
// 0x00E0 (0x0110 - 0x0030)
class UIKRigBoneDetails final : public UObject
{
public:
	class FName                                   SelectedBone;                                      // 0x0030(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CurrentTransform;                                  // 0x0040(0x0060)(Edit, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ReferenceTransform;                                // 0x00A0(0x0060)(Edit, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UAnimInstance>           AnimInstancePtr;                                   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UIKRigDefinition>        AssetPtr;                                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IKRigBoneDetails">();
	}
	static class UIKRigBoneDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRigBoneDetails>();
	}
};

// Class IKRigEditor.IKRigThumbnailRenderer
// 0x0000 (0x0088 - 0x0088)
class UIKRigThumbnailRenderer final : public USkeletalMeshThumbnailRenderer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"IKRigThumbnailRenderer">();
	}
	static class UIKRigThumbnailRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRigThumbnailRenderer>();
	}
};

}

