#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ImagePlate

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ImagePlate_structs.hpp"


namespace SDK
{

// Class ImagePlate.ImagePlate
// 0x0008 (0x0428 - 0x0420)
class AImagePlate final : public AActor
{
public:
	class UImagePlateComponent*                   ImagePlate;                                        // 0x0420(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImagePlate">();
	}
	static class AImagePlate* GetDefaultObj()
	{
		return GetDefaultObjImpl<AImagePlate>();
	}
};

// Class ImagePlate.ImagePlateComponent
// 0x0160 (0x06D0 - 0x0570)
class UImagePlateComponent final : public UPrimitiveComponent
{
public:
	struct FImagePlateParameters                  Plate;                                             // 0x0570(0x0048)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B8[0x110];                                    // 0x05B8(0x0110)(Fixing Size After Last Property [ Dumper-7 ])
	class UImagePlateFrustumComponent*            EditorFrustum;                                     // 0x06C8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnRenderTextureChanged();
	void SetImagePlate(const struct FImagePlateParameters& Plate_0);

	struct FImagePlateParameters GetPlate() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImagePlateComponent">();
	}
	static class UImagePlateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImagePlateComponent>();
	}
};

// Class ImagePlate.ImagePlateSettings
// 0x0010 (0x0040 - 0x0030)
class UImagePlateSettings final : public UObject
{
public:
	class FString                                 ProxyName;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImagePlateSettings">();
	}
	static class UImagePlateSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImagePlateSettings>();
	}
};

// Class ImagePlate.ImagePlateFileSequence
// 0x0028 (0x0058 - 0x0030)
class UImagePlateFileSequence final : public UObject
{
public:
	struct FDirectoryPath                         SequencePath;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FileWildcard;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Framerate;                                         // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImagePlateFileSequence">();
	}
	static class UImagePlateFileSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImagePlateFileSequence>();
	}
};

// Class ImagePlate.ImagePlateFrustumComponent
// 0x0000 (0x0570 - 0x0570)
class UImagePlateFrustumComponent final : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImagePlateFrustumComponent">();
	}
	static class UImagePlateFrustumComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImagePlateFrustumComponent>();
	}
};

}

