#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ImgMediaEditor

#include "Basic.hpp"

#include "UnrealEd_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ImgMediaEditor.ImgMediaSourceFactory
// 0x0000 (0x0088 - 0x0088)
class UImgMediaSourceFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImgMediaSourceFactory">();
	}
	static class UImgMediaSourceFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImgMediaSourceFactory>();
	}
};

// Class ImgMediaEditor.ImgMediaSourceFactoryNew
// 0x0000 (0x0088 - 0x0088)
class UImgMediaSourceFactoryNew final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImgMediaSourceFactoryNew">();
	}
	static class UImgMediaSourceFactoryNew* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImgMediaSourceFactoryNew>();
	}
};

// Class ImgMediaEditor.ImgMediaProcessEXROptions
// 0x0048 (0x0078 - 0x0030)
class UImgMediaProcessEXROptions final : public UObject
{
public:
	struct FFilePath                              InputPath;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         OutputPath;                                        // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMipMapping;                                 // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableTiling;                                     // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TileSizeX;                                         // 0x0054(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TileSizeY;                                         // 0x0058(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumThreads;                                        // 0x005C(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsePlayer;                                        // 0x0060(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveAlphaChannel;                               // 0x0061(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMipLevelTint;                               // 0x0062(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   MipLevelTints;                                     // 0x0068(0x0010)(Edit, ZeroConstructor, Transient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImgMediaProcessEXROptions">();
	}
	static class UImgMediaProcessEXROptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImgMediaProcessEXROptions>();
	}
};

}

