#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InfernoRuntime

#include "Basic.hpp"

#include "InfernoRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Niagara_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class InfernoRuntime.FortCurieElementAttachHandlerVoxelFire
// 0x0000 (0x00A8 - 0x00A8)
class UFortCurieElementAttachHandlerVoxelFire final : public UFortCurieElementAttachHandlerFire
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCurieElementAttachHandlerVoxelFire">();
	}
	static class UFortCurieElementAttachHandlerVoxelFire* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCurieElementAttachHandlerVoxelFire>();
	}
};

// Class InfernoRuntime.FortCurieElementAttachConditionHandlerVoxelFire
// 0x0000 (0x0058 - 0x0058)
class UFortCurieElementAttachConditionHandlerVoxelFire final : public UFortCurieElementAttachConditionHandlerFire
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCurieElementAttachConditionHandlerVoxelFire">();
	}
	static class UFortCurieElementAttachConditionHandlerVoxelFire* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCurieElementAttachConditionHandlerVoxelFire>();
	}
};

// Class InfernoRuntime.FortCurieVoxelFirePropagationManagerConfig
// 0x0050 (0x01B8 - 0x0168)
class UFortCurieVoxelFirePropagationManagerConfig final : public UFortCurieFirePropagationManagerConfig
{
public:
	struct FFortCurieVoxelPropagationProperties   DefaultPropagationProperties;                      // 0x0168(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FName                                   PropagationPropertiesRegistry;                     // 0x0180(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PropagationNoiseMinimum;                           // 0x018C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PropagationNoiseMaximum;                           // 0x0190(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PropagationSpeedNoiseRange;                        // 0x0194(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PropagationMinimumSpeed;                           // 0x0198(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PropagationMinimumTime;                            // 0x019C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VoxelOverlapExpansionFactor;                       // 0x01A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowPerMaterialPropagationProperties;            // 0x01A4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ActorPropagationInteractMagnitude;                 // 0x01A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovedActorGrassIgnitionDelay;                      // 0x01AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovedActorGrassGridCellZExpansion;                 // 0x01B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovedActorGroundTraceZRange;                       // 0x01B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCurieVoxelFirePropagationManagerConfig">();
	}
	static class UFortCurieVoxelFirePropagationManagerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCurieVoxelFirePropagationManagerConfig>();
	}
};

// Class InfernoRuntime.FortCurieVoxelFirePropagationManager
// 0x0668 (0x06A0 - 0x0038)
class alignas(0x10) UFortCurieVoxelFirePropagationManager final : public UFortCurieManagerComponent
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortCurieVoxelFirePropagationManagerTickFunction PrimaryTickFunction;                               // 0x0048(0x0030)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x610];                                     // 0x0078(0x0610)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCurieVoxelFirePropagationManagerConfig* InternalManagerConfig;                             // 0x0688(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_690[0x10];                                     // 0x0690(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCurieVoxelFirePropagationManager">();
	}
	static class UFortCurieVoxelFirePropagationManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCurieVoxelFirePropagationManager>();
	}
};

// Class InfernoRuntime.FortCurieVoxelFireDebugParticleDataInterface
// 0x0000 (0x0030 - 0x0030)
class IFortCurieVoxelFireDebugParticleDataInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCurieVoxelFireDebugParticleDataInterface">();
	}
	static class IFortCurieVoxelFireDebugParticleDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortCurieVoxelFireDebugParticleDataInterface>();
	}
};

// Class InfernoRuntime.FortCurieVoxelFireDebugNiagaraDataInterface
// 0x0000 (0x0080 - 0x0080)
class UFortCurieVoxelFireDebugNiagaraDataInterface final : public UNiagaraDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCurieVoxelFireDebugNiagaraDataInterface">();
	}
	static class UFortCurieVoxelFireDebugNiagaraDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCurieVoxelFireDebugNiagaraDataInterface>();
	}
};

// Class InfernoRuntime.FortCurieVoxelFireNativeFXHandlerConfig
// 0x0070 (0x0200 - 0x0190)
class UFortCurieVoxelFireNativeFXHandlerConfig final : public UFortCurieNativeFXHandlerConfig
{
public:
	class UNiagaraSystem*                         WorldFireSystem;                                   // 0x0190(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UNiagaraSystem*                         WorldFireDebugSystem;                              // 0x0198(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 LandscapeCharRenderTarget;                         // 0x01A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialParameterCollection*           MaterialParameterCollection;                       // 0x01A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   PlayerWorldFireSystemLightScalabilityParamName;    // 0x01B0(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   LandscapeBiasParameterName;                        // 0x01BC(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   LandscapeDivisorParameterName;                     // 0x01C8(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LandscapeFireRandomLocationRadius;                 // 0x01D4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinLandscapeFireSphericalBounds;                   // 0x01D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxLandscapeFireSphericalBounds;                   // 0x01DC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LandscapeCharInterpSpeed;                          // 0x01E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LandscapeIgnitionParticleMovementSpeed;            // 0x01E4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseVoxelFireAmbientAudio;                         // 0x01E8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             StructureFireAmbientSound;                         // 0x01F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundBase*                             GrassFireAmbientSound;                             // 0x01F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCurieVoxelFireNativeFXHandlerConfig">();
	}
	static class UFortCurieVoxelFireNativeFXHandlerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCurieVoxelFireNativeFXHandlerConfig>();
	}
};

// Class InfernoRuntime.FortCurieVoxelFireNativeFXHandler
// 0x0328 (0x0370 - 0x0048)
class UFortCurieVoxelFireNativeFXHandler final : public UFortCurieNativeFXHandler
{
public:
	uint8                                         Pad_48[0x30];                                      // 0x0048(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UFortCurieComponent*>              PendingUpdateComponents;                           // 0x0078(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TSet<class UFortCurieComponent*>              PendingRemoveComponents;                           // 0x00C8(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_118[0x50];                                     // 0x0118(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortCurieWorldNiagaraComponent*> WorldFireNiagaraSystems;                           // 0x0168(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UFortCurieWorldNiagaraComponent*> WorldFireDebugNiagaraSystems;                      // 0x0178(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	float                                         WorldSystemFireParticleSignificanceRequirement;    // 0x0188(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         WorldSystemIgnitionParticleSignificanceRequirement; // 0x018C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AudioGrassFireSignificanceRequirement;             // 0x0190(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AudioActorFireSignificanceRequirement;             // 0x0194(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRandomStream                          RandomStream;                                      // 0x0198(0x0008)(ZeroConstructor, Transient, NoDestructor, NativeAccessSpecifierPrivate)
	struct FBox                                   GrassFireBounds;                                   // 0x01A0(0x0038)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	float                                         LandscapeCharInterpSpeed;                          // 0x01D8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TimeSinceAudioUpdate;                              // 0x01DC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FFortCurieVoxelFireParticleGrassData> CachedFireParticleGrassData;                       // 0x01E0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FFortCurieFireParticleActorData> CachedFireParticleActorData;                       // 0x01F0(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_200[0x60];                                     // 0x0200(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FFortSpatialCellIndex>            CachedBurningGrassGridCells;                       // 0x0260(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<struct FFortSpatialCellIndex, class UAudioComponent*> GrassAudioMap;                                     // 0x02B0(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_300[0x50];                                     // 0x0300(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAudioComponent*>                PreallocatedAudioComponents;                       // 0x0350(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           AudioComponentCleanupTimerHandle;                  // 0x0360(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	double                                        PreviousLandscapeCharTickTime;                     // 0x0368(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnUserSettingsEffectQualityChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCurieVoxelFireNativeFXHandler">();
	}
	static class UFortCurieVoxelFireNativeFXHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCurieVoxelFireNativeFXHandler>();
	}
};

// Class InfernoRuntime.FortCurieVoxelFireParticleDataInterface
// 0x0000 (0x0030 - 0x0030)
class IFortCurieVoxelFireParticleDataInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCurieVoxelFireParticleDataInterface">();
	}
	static class IFortCurieVoxelFireParticleDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortCurieVoxelFireParticleDataInterface>();
	}
};

// Class InfernoRuntime.FortCurieVoxelFireNiagaraDataInterface
// 0x0000 (0x0080 - 0x0080)
class UFortCurieVoxelFireNiagaraDataInterface final : public UNiagaraDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCurieVoxelFireNiagaraDataInterface">();
	}
	static class UFortCurieVoxelFireNiagaraDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCurieVoxelFireNiagaraDataInterface>();
	}
};

// Class InfernoRuntime.InfernoCurieVoxelFireAudioParticleDataInterface
// 0x0000 (0x0030 - 0x0030)
class IInfernoCurieVoxelFireAudioParticleDataInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InfernoCurieVoxelFireAudioParticleDataInterface">();
	}
	static class IInfernoCurieVoxelFireAudioParticleDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInfernoCurieVoxelFireAudioParticleDataInterface>();
	}
};

// Class InfernoRuntime.InfernoCurieVoxelFireAudioNiagaraDataInterface
// 0x0000 (0x0080 - 0x0080)
class UInfernoCurieVoxelFireAudioNiagaraDataInterface final : public UNiagaraDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InfernoCurieVoxelFireAudioNiagaraDataInterface">();
	}
	static class UInfernoCurieVoxelFireAudioNiagaraDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInfernoCurieVoxelFireAudioNiagaraDataInterface>();
	}
};

}

