#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputBlueprintNodes

#include "Basic.hpp"

#include "BlueprintGraph_classes.hpp"
#include "EnhancedInput_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// Class InputBlueprintNodes.K2Node_EnhancedInputAction
// 0x0040 (0x0100 - 0x00C0)
class UK2Node_EnhancedInputAction final : public UK2Node
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           InputAction;                                       // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x30];                                      // 0x00D0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_EnhancedInputAction">();
	}
	static class UK2Node_EnhancedInputAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_EnhancedInputAction>();
	}
};

// Class InputBlueprintNodes.K2Node_EnhancedInputActionEvent
// 0x0010 (0x0170 - 0x0160)
class UK2Node_EnhancedInputActionEvent final : public UK2Node_Event
{
public:
	class UInputAction*                           InputAction;                                       // 0x0160(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETriggerEvent                                 TriggerEvent;                                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_EnhancedInputActionEvent">();
	}
	static class UK2Node_EnhancedInputActionEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_EnhancedInputActionEvent>();
	}
};

// Class InputBlueprintNodes.K2Node_GetInputActionValue
// 0x0038 (0x00F8 - 0x00C0)
class UK2Node_GetInputActionValue final : public UK2Node
{
public:
	class UInputAction*                           InputAction;                                       // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x30];                                      // 0x00C8(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_GetInputActionValue">();
	}
	static class UK2Node_GetInputActionValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_GetInputActionValue>();
	}
};

// Class InputBlueprintNodes.K2Node_InputActionValueAccessor
// 0x0008 (0x0150 - 0x0148)
class UK2Node_InputActionValueAccessor final : public UK2Node_CallFunction
{
public:
	class UInputAction*                           InputAction;                                       // 0x0148(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_InputActionValueAccessor">();
	}
	static class UK2Node_InputActionValueAccessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_InputActionValueAccessor>();
	}
};

// Class InputBlueprintNodes.K2Node_InputDebugKey
// 0x0060 (0x0120 - 0x00C0)
class UK2Node_InputDebugKey final : public UK2Node
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   InputKey;                                          // 0x00C8(0x0020)(Edit, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bExecuteWhenPaused : 1;                            // 0x00E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bControl : 1;                                      // 0x00E8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAlt : 1;                                          // 0x00E8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShift : 1;                                        // 0x00E8(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCommand : 1;                                      // 0x00E8(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_E9[0x37];                                      // 0x00E9(0x0037)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_InputDebugKey">();
	}
	static class UK2Node_InputDebugKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_InputDebugKey>();
	}
};

// Class InputBlueprintNodes.K2Node_InputDebugKeyEvent
// 0x0030 (0x0190 - 0x0160)
class UK2Node_InputDebugKeyEvent final : public UK2Node_Event
{
public:
	struct FInputChord                            InputChord;                                        // 0x0160(0x0028)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputKeyEvent;                                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExecuteWhenPaused;                                // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_InputDebugKeyEvent">();
	}
	static class UK2Node_InputDebugKeyEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_InputDebugKeyEvent>();
	}
};

}

