#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputEditor

#include "Basic.hpp"

#include "EditorSubsystem_classes.hpp"
#include "EnhancedInput_structs.hpp"
#include "EnhancedInput_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "UnrealEd_classes.hpp"
#include "InputEditor_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class InputEditor.EnhancedInputEditorProjectSettings
// 0x0040 (0x00A0 - 0x0060)
class UEnhancedInputEditorProjectSettings final : public UDeveloperSettings
{
public:
	TSoftClassPtr<class UClass>                   DefaultEditorInputClass;                           // 0x0060(0x0030)(Edit, Config, NoClear, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDefaultContextSetting>         DefaultMappingContexts;                            // 0x0090(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnhancedInputEditorProjectSettings">();
	}
	static class UEnhancedInputEditorProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputEditorProjectSettings>();
	}
};

// Class InputEditor.EnhancedInputEditorSettings
// 0x0008 (0x0068 - 0x0060)
class UEnhancedInputEditorSettings final : public UDeveloperSettingsBackedByCVars
{
public:
	uint8                                         bLogAllInput : 1;                                  // 0x0060(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAutomaticallyStartConsumingInput : 1;             // 0x0060(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         VisibleEventPinsByDefault;                         // 0x0061(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnhancedInputEditorSettings">();
	}
	static class UEnhancedInputEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputEditorSettings>();
	}
};

// Class InputEditor.EnhancedInputEditorSubsystem
// 0x01D8 (0x0210 - 0x0038)
class UEnhancedInputEditorSubsystem final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0x158];                                     // 0x0038(0x0158)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnhancedPlayerInput*                   PlayerInput;                                       // 0x0190(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_198[0x18];                                     // 0x0198(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class UInputComponent>> CurrentInputStack;                                 // 0x01B0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class UInputAction*, struct FInjectedInput> ContinuouslyInjectedInputs;                        // 0x01C0(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	bool PopInputComponent(class UInputComponent* InInputComponent);
	void PushInputComponent(class UInputComponent* InInputComponent);
	void StartConsumingInput();
	void StopConsumingInput();

	bool IsConsumingInput() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnhancedInputEditorSubsystem">();
	}
	static class UEnhancedInputEditorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputEditorSubsystem>();
	}
};

// Class InputEditor.TestMappableKeysAction
// 0x0000 (0x00B0 - 0x00B0)
class UTestMappableKeysAction final : public UInputAction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TestMappableKeysAction">();
	}
	static class UTestMappableKeysAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestMappableKeysAction>();
	}
};

// Class InputEditor.InputMappingContext_Factory
// 0x0018 (0x00A0 - 0x0088)
class UInputMappingContext_Factory final : public UFactory
{
public:
	TSubclassOf<class UInputMappingContext>       InputMappingContextClass;                          // 0x0088(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x10];                                      // 0x0090(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputMappingContext_Factory">();
	}
	static class UInputMappingContext_Factory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputMappingContext_Factory>();
	}
};

// Class InputEditor.PlayerMappableInputConfig_Factory
// 0x0000 (0x0088 - 0x0088)
class UPlayerMappableInputConfig_Factory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerMappableInputConfig_Factory">();
	}
	static class UPlayerMappableInputConfig_Factory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerMappableInputConfig_Factory>();
	}
};

// Class InputEditor.InputAction_Factory
// 0x0008 (0x0090 - 0x0088)
class UInputAction_Factory final : public UFactory
{
public:
	TSubclassOf<class UInputAction>               InputActionClass;                                  // 0x0088(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputAction_Factory">();
	}
	static class UInputAction_Factory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputAction_Factory>();
	}
};

// Class InputEditor.InputBindingTarget
// 0x0030 (0x0060 - 0x0030)
class UInputBindingTarget final : public UObject
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputBindingTarget">();
	}
	static class UInputBindingTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputBindingTarget>();
	}
};

// Class InputEditor.MockedEnhancedInputSubsystem
// 0x01B0 (0x01E0 - 0x0030)
class UMockedEnhancedInputSubsystem final : public UObject
{
public:
	uint8                                         Pad_30[0x160];                                     // 0x0030(0x0160)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UInputAction*, struct FInjectedInput> ContinuouslyInjectedInputs;                        // 0x0190(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MockedEnhancedInputSubsystem">();
	}
	static class UMockedEnhancedInputSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMockedEnhancedInputSubsystem>();
	}
};

// Class InputEditor.MockInputUserSettings
// 0x0000 (0x0130 - 0x0130)
class UMockInputUserSettings final : public UEnhancedInputUserSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MockInputUserSettings">();
	}
	static class UMockInputUserSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMockInputUserSettings>();
	}
};

// Class InputEditor.ControllablePlayer
// 0x0168 (0x0198 - 0x0030)
class UControllablePlayer final : public UObject
{
public:
	class APlayerController*                      Player;                                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FBindingTargets>     BindingTargets;                                    // 0x0048(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FName, class UInputMappingContext*> InputContext;                                      // 0x0098(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class FName, class UInputAction*>        InputAction;                                       // 0x00E8(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_138[0x50];                                     // 0x0138(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnhancedInputUserSettings*             UserSettings;                                      // 0x0188(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_190[0x8];                                      // 0x0190(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControllablePlayer">();
	}
	static class UControllablePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControllablePlayer>();
	}
};

}

