#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InstanceDataObjectFixupTool

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "TypedElementFramework_classes.hpp"
#include "InstanceDataObjectFixupTool_structs.hpp"


namespace SDK
{

// Class InstanceDataObjectFixupTool.InstanceDataObjectFixupUndoHandler
// 0x00D8 (0x0108 - 0x0030)
class UInstanceDataObjectFixupUndoHandler final : public UObject
{
public:
	uint8                                         Pad_30[0xD0];                                      // 0x0030(0x00D0)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ChangeNum;                                         // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstanceDataObjectFixupUndoHandler">();
	}
	static class UInstanceDataObjectFixupUndoHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstanceDataObjectFixupUndoHandler>();
	}
};

// Class InstanceDataObjectFixupTool.InstanceDataObjectFixupToolTedsQueryFactory
// 0x0000 (0x0030 - 0x0030)
class UInstanceDataObjectFixupToolTedsQueryFactory final : public UTypedElementDataStorageFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstanceDataObjectFixupToolTedsQueryFactory">();
	}
	static class UInstanceDataObjectFixupToolTedsQueryFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstanceDataObjectFixupToolTedsQueryFactory>();
	}
};

// Class InstanceDataObjectFixupTool.TestReportCardV1
// 0x0020 (0x0050 - 0x0030)
class UTestReportCardV1 final : public UObject
{
public:
	class FString                                 Name_0;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStudentGender                                Gender;                                            // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Age;                                               // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Grade;                                             // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TestReportCardV1">();
	}
	static class UTestReportCardV1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestReportCardV1>();
	}
};

// Class InstanceDataObjectFixupTool.TestReportCardV2
// 0x0078 (0x00A8 - 0x0030)
class UTestReportCardV2 final : public UObject
{
public:
	class FString                                 Name_0;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStudentGender                                Gender;                                            // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Age;                                               // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GPA;                                               // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MathGrade;                                         // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         MathNotes;                                         // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         ScienceGrade;                                      // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ScienceNotes;                                      // 0x0068(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         ArtGrade;                                          // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ArtNotes;                                          // 0x0080(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         EnglishGrade;                                      // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         EnglishNotes;                                      // 0x0098(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TestReportCardV2">();
	}
	static class UTestReportCardV2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestReportCardV2>();
	}
};

// Class InstanceDataObjectFixupTool.TestReportCardV3
// 0x0108 (0x0138 - 0x0030)
class UTestReportCardV3 final : public UObject
{
public:
	class FString                                 StudentName;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Gender;                                            // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Age;                                               // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GPA;                                               // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClassGrade                            MathReport;                                        // 0x0058(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FClassGrade                            ScienceReport;                                     // 0x0090(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FClassGrade                            ArtReport;                                         // 0x00C8(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FClassGrade                            EnglishReport;                                     // 0x0100(0x0038)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TestReportCardV3">();
	}
	static class UTestReportCardV3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestReportCardV3>();
	}
};

// Class InstanceDataObjectFixupTool.TestReportCardV4
// 0x0088 (0x00B8 - 0x0030)
class UTestReportCardV4 final : public UObject
{
public:
	class FString                                 StudentName;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Gender;                                            // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Age;                                               // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GPA;                                               // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FClassGrade>                    ClassGradesArray;                                  // 0x0058(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, struct FClassGrade>       ClassGrades;                                       // 0x0068(0x0050)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TestReportCardV4">();
	}
	static class UTestReportCardV4* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestReportCardV4>();
	}
};

// Class InstanceDataObjectFixupTool.TestReportCardV5
// 0x0088 (0x00B8 - 0x0030)
class UTestReportCardV5 final : public UObject
{
public:
	class FString                                 StudentName;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Gender;                                            // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Age;                                               // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GPA;                                               // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FClassGradeV2>                  ClassGradesArray;                                  // 0x0058(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, struct FClassGradeV2>     ClassGrades;                                       // 0x0068(0x0050)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TestReportCardV5">();
	}
	static class UTestReportCardV5* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestReportCardV5>();
	}
};

// Class InstanceDataObjectFixupTool.StudentInfoV1
// 0x0038 (0x0068 - 0x0030)
class UStudentInfoV1 final : public UObject
{
public:
	class FString                                 StudentName;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Gender;                                            // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Age;                                               // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GradeYear;                                         // 0x0058(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StudentInfoV1">();
	}
	static class UStudentInfoV1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStudentInfoV1>();
	}
};

// Class InstanceDataObjectFixupTool.TestReportCardV6
// 0x0010 (0x0040 - 0x0030)
class UTestReportCardV6 final : public UObject
{
public:
	class UStudentInfoV1*                         StudentInfo;                                       // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Grade;                                             // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TestReportCardV6">();
	}
	static class UTestReportCardV6* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestReportCardV6>();
	}
};

// Class InstanceDataObjectFixupTool.StudentInfoV2
// 0x0038 (0x0068 - 0x0030)
class UStudentInfoV2 final : public UObject
{
public:
	class FString                                 StudentName;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Gender;                                            // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Age;                                               // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GradeName;                                         // 0x0058(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StudentInfoV2">();
	}
	static class UStudentInfoV2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStudentInfoV2>();
	}
};

// Class InstanceDataObjectFixupTool.TestReportCardV7
// 0x0010 (0x0040 - 0x0030)
class UTestReportCardV7 final : public UObject
{
public:
	class UStudentInfoV2*                         StudentInfo;                                       // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GPA;                                               // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TestReportCardV7">();
	}
	static class UTestReportCardV7* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestReportCardV7>();
	}
};

}

