#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InstanceDataObjectFixupTool

#include "Basic.hpp"


namespace SDK
{

// Enum InstanceDataObjectFixupTool.StudentGender
// NumValues: 0x0004
enum class EStudentGender : uint8
{
	Undefined                                = 0,
	Male                                     = 1,
	Female                                   = 2,
	StudentGender_MAX                        = 3,
};

// ScriptStruct InstanceDataObjectFixupTool.ClassGrade
// 0x0038 (0x0038 - 0x0000)
struct FClassGrade final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Grade;                                             // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         TeacherNotes;                                      // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 MainTeacherName;                                   // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct InstanceDataObjectFixupTool.ClassGradeV2
// 0x0028 (0x0028 - 0x0000)
struct FClassGradeV2 final
{
public:
	class FString                                 ClassName;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Grade;                                             // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         TeacherNotes;                                      // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

}

