#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InstancedActors

#include "Basic.hpp"

#include "MassActors_classes.hpp"
#include "GameFeatures_classes.hpp"
#include "InstancedActors_structs.hpp"
#include "MassSpawner_structs.hpp"
#include "MassEntity_structs.hpp"
#include "MassEntity_classes.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "MassRepresentation_classes.hpp"
#include "DataRegistry_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class InstancedActors.ClientInstancedActorsSpawnerSubsystem
// 0x0000 (0x00F8 - 0x00F8)
class UClientInstancedActorsSpawnerSubsystem final : public UMassActorSpawnerSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClientInstancedActorsSpawnerSubsystem">();
	}
	static class UClientInstancedActorsSpawnerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClientInstancedActorsSpawnerSubsystem>();
	}
};

// Class InstancedActors.GameFeatureAction_ConfigureInstancedActors
// 0x0020 (0x0050 - 0x0030)
class UGameFeatureAction_ConfigureInstancedActors final : public UGameFeatureAction
{
public:
	struct FInstancedActorsConfig                 ConfigOverride;                                    // 0x0030(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_ConfigureInstancedActors">();
	}
	static class UGameFeatureAction_ConfigureInstancedActors* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_ConfigureInstancedActors>();
	}
};

// Class InstancedActors.InstancedActorsComponent
// 0x0010 (0x00E8 - 0x00D8)
class UInstancedActorsComponent : public UActorComponent
{
public:
	struct FInstancedActorsInstanceHandle         InstanceHandle;                                    // 0x00D8(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, Transient, RepNotify, NoDestructor, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnRep_InstanceHandle();

	bool HasMassEntity() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedActorsComponent">();
	}
	static class UInstancedActorsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstancedActorsComponent>();
	}
};

// Class InstancedActors.InstancedActorsData
// 0x0330 (0x0360 - 0x0030)
class UInstancedActorsData : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint16                                        ID;                                                // 0x0038(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0040(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInstancedActorsTagSet                 Tags;                                              // 0x0048(0x0028)(Edit, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     InstanceTransforms;                                // 0x0080(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint16                                        NumValidInstances;                                 // 0x0090(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   Bounds;                                            // 0x0098(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint16                                        NumInstances;                                      // 0x00D0(0x0002)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMassEntityHandle>              Entities;                                          // 0x00D8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x30];                                      // 0x00E8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInstancedActorsVisualizationInfo> InstanceVisualizations;                            // 0x0118(0x0010)(Edit, ZeroConstructor, Transient, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_128[0x20];                                     // 0x0128(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInstancedStaticMeshComponent*>  EditorPreviewISMComponents;                        // 0x0148(0x0010)(ExportObject, ZeroConstructor, EditorOnly, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FBox                                   CachedLocalBounds;                                 // 0x0158(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_190[0x10];                                     // 0x0190(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedActorsDeltaList              InstanceDeltas;                                    // 0x01A0(0x0180)(Net, Transient, SaveGame, NativeAccessSpecifierPrivate)
	struct FMassEntityConfig                      EntityConfig;                                      // 0x0320(0x0030)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_350[0x10];                                     // 0x0350(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class AInstancedActorsManager* GetManager() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedActorsData">();
	}
	static class UInstancedActorsData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstancedActorsData>();
	}
};

// Class InstancedActors.InstancedActorsDebugProcessor
// 0x0000 (0x00D0 - 0x00D0)
class UInstancedActorsDebugProcessor final : public UMassProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedActorsDebugProcessor">();
	}
	static class UInstancedActorsDebugProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstancedActorsDebugProcessor>();
	}
};

// Class InstancedActors.InstancedActorsInitializerProcessor
// 0x0320 (0x03F0 - 0x00D0)
class UInstancedActorsInitializerProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_D0[0x320];                                     // 0x00D0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedActorsInitializerProcessor">();
	}
	static class UInstancedActorsInitializerProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstancedActorsInitializerProcessor>();
	}
};

// Class InstancedActors.InstancedActorsManager
// 0x0468 (0x0890 - 0x0428)
class alignas(0x10) AInstancedActorsManager : public APartitionActor
{
public:
	uint8                                         Pad_428[0x10];                                     // 0x0428(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UInstancedActorsSubsystem*              InstancedActorSubsystem;                           // 0x0438(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FInstancedActorsManagerHandle          ManagerHandle;                                     // 0x0440(0x0004)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_444[0x14];                                     // 0x0444(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  SavedActorGuid;                                    // 0x0458(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasSpawnedEntities;                               // 0x0468(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_469[0x1];                                      // 0x0469(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint16                                        NextInstanceDataID;                                // 0x046A(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInstancedActorsData*>           PerActorClassInstanceData;                         // 0x0470(0x0010)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FBox                                   InstanceBounds;                                    // 0x0480(0x0038)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4B8[0x40];                                     // 0x04B8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UInstancedStaticMeshComponent*, int32> ISMComponentToInstanceDataMap;                     // 0x04F8(0x0050)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UInstancedActorsData>       InstancedActorsDataClass;                          // 0x0548(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_550[0x320];                                    // 0x0550(0x0320)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  ManagerGridGuid;                                   // 0x0870(0x0010)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLockInstanceLocation;                             // 0x0880(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_881[0xF];                                      // 0x0881(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedActorsManager">();
	}
	static class AInstancedActorsManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInstancedActorsManager>();
	}
};

// Class InstancedActors.InstancedActorsModifierBase
// 0x0050 (0x0080 - 0x0030)
class UInstancedActorsModifierBase : public UObject
{
public:
	struct FGameplayTagQuery                      InstanceTagsQuery;                                 // 0x0030(0x0048)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedActorsModifierBase">();
	}
	static class UInstancedActorsModifierBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstancedActorsModifierBase>();
	}
};

// Class InstancedActors.RemoveInstancedActorsModifier
// 0x0000 (0x0080 - 0x0080)
class URemoveInstancedActorsModifier final : public UInstancedActorsModifierBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemoveInstancedActorsModifier">();
	}
	static class URemoveInstancedActorsModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoveInstancedActorsModifier>();
	}
};

// Class InstancedActors.InstancedActorsModifierVolume
// 0x0008 (0x0428 - 0x0420)
class AInstancedActorsModifierVolume : public AActor
{
public:
	class UInstancedActorsModifierVolumeComponent* ModifierVolumeComponent;                           // 0x0420(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedActorsModifierVolume">();
	}
	static class AInstancedActorsModifierVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInstancedActorsModifierVolume>();
	}
};

// Class InstancedActors.InstancedActorsRemovalModifierVolume
// 0x0000 (0x0428 - 0x0428)
class AInstancedActorsRemovalModifierVolume final : public AInstancedActorsModifierVolume
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedActorsRemovalModifierVolume">();
	}
	static class AInstancedActorsRemovalModifierVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInstancedActorsRemovalModifierVolume>();
	}
};

// Class InstancedActors.InstancedActorsModifierVolumeComponent
// 0x0070 (0x05E0 - 0x0570)
class UInstancedActorsModifierVolumeComponent : public UPrimitiveComponent
{
public:
	EInstancedActorsVolumeShape                   Shape;                                             // 0x0570(0x0001)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Extent;                                            // 0x0578(0x0018)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0590(0x0004)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_594[0x4];                                      // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInstancedActorsModifierBase*>   Modifiers;                                         // 0x0598(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bIgnoreOwnLevelsInstances;                         // 0x05A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UWorld>>          LevelsToIgnore;                                    // 0x05B0(0x0010)(Edit, Net, ZeroConstructor, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FColor                                 Color;                                             // 0x05C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawOnlyIfSelected;                               // 0x05C4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C5[0x3];                                      // 0x05C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LineThickness;                                     // 0x05C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInstancedActorsModifierVolumeHandle   ModifierVolumeHandle;                              // 0x05CC(0x0004)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AInstancedActorsManager>> ModifiedManagers;                                  // 0x05D0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedActorsModifierVolumeComponent">();
	}
	static class UInstancedActorsModifierVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstancedActorsModifierVolumeComponent>();
	}
};

// Class InstancedActors.RemoveInstancesModifierVolumeComponent
// 0x0000 (0x05E0 - 0x05E0)
class URemoveInstancesModifierVolumeComponent final : public UInstancedActorsModifierVolumeComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemoveInstancesModifierVolumeComponent">();
	}
	static class URemoveInstancesModifierVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoveInstancesModifierVolumeComponent>();
	}
};

// Class InstancedActors.InstancedActorsRepresentationActorManagement
// 0x0000 (0x0030 - 0x0030)
class UInstancedActorsRepresentationActorManagement : public UMassRepresentationActorManagement
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedActorsRepresentationActorManagement">();
	}
	static class UInstancedActorsRepresentationActorManagement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstancedActorsRepresentationActorManagement>();
	}
};

// Class InstancedActors.InstancedActorsRepresentationSubsystem
// 0x0008 (0x0108 - 0x0100)
class UInstancedActorsRepresentationSubsystem final : public UMassRepresentationSubsystem
{
public:
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedActorsRepresentationSubsystem">();
	}
	static class UInstancedActorsRepresentationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstancedActorsRepresentationSubsystem>();
	}
};

// Class InstancedActors.InstancedActorsProjectSettings
// 0x00A0 (0x0100 - 0x0060)
class UInstancedActorsProjectSettings final : public UDeveloperSettings
{
public:
	int32                                         GridSize;                                          // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataRegistryType                      NamedSettingsRegistryType;                         // 0x0064(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataRegistryType                      ActorClassSettingsRegistryType;                    // 0x0070(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DefaultBaseSettingsName;                           // 0x007C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EnforcedSettingsName;                              // 0x0088(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedActorsConfig                 DefaultConfig;                                     // 0x0098(0x0020)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedActorsConfig                 CompiledActiveConfig;                              // 0x00D0(0x0020)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FClassConfigOverrideEntry>      ClassConfigOverrides;                              // 0x00F0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedActorsProjectSettings">();
	}
	static class UInstancedActorsProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstancedActorsProjectSettings>();
	}
};

// Class InstancedActors.InstancedActorsStationaryLODBatchProcessor
// 0x0660 (0x0730 - 0x00D0)
class alignas(0x10) UInstancedActorsStationaryLODBatchProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_D0[0x640];                                     // 0x00D0(0x0640)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DelayPerBulkLOD[0x4];                              // 0x0710(0x0008)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedActorsStationaryLODBatchProcessor">();
	}
	static class UInstancedActorsStationaryLODBatchProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstancedActorsStationaryLODBatchProcessor>();
	}
};

// Class InstancedActors.InstancedActorsSubsystem
// 0x02F0 (0x0338 - 0x0048)
class UInstancedActorsSubsystem : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_48[0x20];                                      // 0x0048(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UInstancedActorsProjectSettings*        ProjectSettings;                                   // 0x0068(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataRegistrySubsystem*                 DataRegistrySubsystem;                             // 0x0070(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UActorPartitionSubsystem*               ActorPartitionSubsystem;                           // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AInstancedActorsManager>    InstancedActorsManagerClass;                       // 0x0080(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x250];                                     // 0x0088(0x0250)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 ExemplarActorWorld;                                // 0x02D8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E0[0x50];                                     // 0x02E0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptStruct*                          SettingsType;                                      // 0x0330(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	struct FInstancedActorsInstanceHandle InstanceActor(TSubclassOf<class AActor> ActorClass, const struct FTransform& InstanceTransform, class ULevel* Level, const struct FGameplayTagContainer& InstanceTags, TSubclassOf<class AInstancedActorsManager> ManagerClass);
	bool RemoveActorInstance(const struct FInstancedActorsInstanceHandle& InstanceHandle, bool bDestroyManagerIfEmpty);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedActorsSubsystem">();
	}
	static class UInstancedActorsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstancedActorsSubsystem>();
	}
};

// Class InstancedActors.InstancedActorsVisualizationSwitcherProcessor
// 0x0320 (0x03F0 - 0x00D0)
class UInstancedActorsVisualizationSwitcherProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_D0[0x320];                                     // 0x00D0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedActorsVisualizationSwitcherProcessor">();
	}
	static class UInstancedActorsVisualizationSwitcherProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstancedActorsVisualizationSwitcherProcessor>();
	}
};

// Class InstancedActors.InstancedActorsVisualizationTrait
// 0x0010 (0x0130 - 0x0120)
class UInstancedActorsVisualizationTrait : public UMassStationaryDistanceVisualizationTrait
{
public:
	TWeakObjectPtr<class UInstancedActorsData>    InstanceData;                                      // 0x0120(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedActorsVisualizationTrait">();
	}
	static class UInstancedActorsVisualizationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstancedActorsVisualizationTrait>();
	}
};

// Class InstancedActors.ServerInstancedActorsSpawnerSubsystem
// 0x0028 (0x0120 - 0x00F8)
class UServerInstancedActorsSpawnerSubsystem : public UMassActorSpawnerSubsystem
{
public:
	uint8                                         Pad_F8[0x10];                                      // 0x00F8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TransientActorBeingSpawned;                        // 0x0108(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FInstancedActorsInstanceHandle         TransientActorSpawningInstance;                    // 0x0110(0x0010)(Transient, NoDestructor, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ServerInstancedActorsSpawnerSubsystem">();
	}
	static class UServerInstancedActorsSpawnerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UServerInstancedActorsSpawnerSubsystem>();
	}
};

}

