#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InterchangeTests

#include "Basic.hpp"

#include "InterchangeTests_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function InterchangeTests.ActorImportTestFunctions.CheckActorClass
// 0x0040 (0x0040 - 0x0000)
struct ActorImportTestFunctions_CheckActorClass final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ExpectedClass;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.ActorImportTestFunctions.CheckActorClassCount
// 0x0050 (0x0050 - 0x0000)
struct ActorImportTestFunctions_CheckActorClassCount final
{
public:
	TArray<class AActor*>                         Actors;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     Class_0;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfActors;                            // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.ActorImportTestFunctions.CheckActorPropertyValue
// 0x0060 (0x0060 - 0x0000)
struct ActorImportTestFunctions_CheckActorPropertyValue final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRegexToMatchValue;                             // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ExpectedValue;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0030(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.ActorImportTestFunctions.CheckComponentPropertyValue
// 0x0070 (0x0070 - 0x0000)
struct ActorImportTestFunctions_CheckComponentPropertyValue final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ComponentName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRegexToMatchValue;                             // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ExpectedValue;                                     // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0040(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.ActorImportTestFunctions.CheckImportedActorCount
// 0x0048 (0x0048 - 0x0000)
struct ActorImportTestFunctions_CheckImportedActorCount final
{
public:
	TArray<class AActor*>                         Actors;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfImportedActors;                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0018(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.LightImportTestFunctions.CheckLightColor
// 0x0048 (0x0048 - 0x0000)
struct LightImportTestFunctions_CheckLightColor final
{
public:
	class ALight*                                 Light;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ExpectedLightColor;                                // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0018(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.LightImportTestFunctions.CheckLightDirection
// 0x0050 (0x0050 - 0x0000)
struct LightImportTestFunctions_CheckLightDirection final
{
public:
	class ALight*                                 Light;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ExpectedLightDirection;                            // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.LightImportTestFunctions.CheckLightIntensity
// 0x0040 (0x0040 - 0x0000)
struct LightImportTestFunctions_CheckLightIntensity final
{
public:
	class ALight*                                 Light;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpectedLightIntensity;                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.LightImportTestFunctions.CheckLightPosition
// 0x0050 (0x0050 - 0x0000)
struct LightImportTestFunctions_CheckLightPosition final
{
public:
	class ALight*                                 Light;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ExpectedLightPosition;                             // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.MaterialXTestFunctions.CheckConnectedInputCount
// 0x0040 (0x0040 - 0x0000)
struct MaterialXTestFunctions_CheckConnectedInputCount final
{
public:
	const class UMaterialInterface*               MaterialInterface;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumber;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.MaterialXTestFunctions.CheckInputConnected
// 0x0050 (0x0050 - 0x0000)
struct MaterialXTestFunctions_CheckInputConnected final
{
public:
	const class UMaterialInterface*               MaterialInterface;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InputName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsConnected;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.PointLightImportTestFunctions.CheckLightFalloffExponent
// 0x0040 (0x0040 - 0x0000)
struct PointLightImportTestFunctions_CheckLightFalloffExponent final
{
public:
	class APointLight*                            Light;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpectedLightFalloff;                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.SpotLightImportTestFunctions.CheckLightInnerConeAngle
// 0x0040 (0x0040 - 0x0000)
struct SpotLightImportTestFunctions_CheckLightInnerConeAngle final
{
public:
	class ASpotLight*                             Light;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpectedLightInnerConeAngle;                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.SpotLightImportTestFunctions.CheckLightOuterConeAngle
// 0x0040 (0x0040 - 0x0000)
struct SpotLightImportTestFunctions_CheckLightOuterConeAngle final
{
public:
	class ASpotLight*                             Light;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpectedLightOuterConeAngle;                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.AnimationImportTestFunctions.CheckAnimationFrameNumber
// 0x0040 (0x0040 - 0x0000)
struct AnimationImportTestFunctions_CheckAnimationFrameNumber final
{
public:
	class UAnimSequence*                          AnimSequence;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedFrameNumber;                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.AnimationImportTestFunctions.CheckAnimationLength
// 0x0040 (0x0040 - 0x0000)
struct AnimationImportTestFunctions_CheckAnimationLength final
{
public:
	class UAnimSequence*                          AnimSequence;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpectedAnimationLength;                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.AnimationImportTestFunctions.CheckCurveKeyArriveTangent
// 0x0050 (0x0050 - 0x0000)
struct AnimationImportTestFunctions_CheckCurveKeyArriveTangent final
{
public:
	class UAnimSequence*                          AnimSequence;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurveName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KeyIndex;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpectedCurveKeyArriveTangent;                     // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.AnimationImportTestFunctions.CheckCurveKeyArriveTangentWeight
// 0x0050 (0x0050 - 0x0000)
struct AnimationImportTestFunctions_CheckCurveKeyArriveTangentWeight final
{
public:
	class UAnimSequence*                          AnimSequence;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurveName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KeyIndex;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpectedCurveKeyArriveTangentWeight;               // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.AnimationImportTestFunctions.CheckCurveKeyLeaveTangent
// 0x0050 (0x0050 - 0x0000)
struct AnimationImportTestFunctions_CheckCurveKeyLeaveTangent final
{
public:
	class UAnimSequence*                          AnimSequence;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurveName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KeyIndex;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpectedCurveKeyLeaveTangent;                      // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.AnimationImportTestFunctions.CheckCurveKeyLeaveTangentWeight
// 0x0050 (0x0050 - 0x0000)
struct AnimationImportTestFunctions_CheckCurveKeyLeaveTangentWeight final
{
public:
	class UAnimSequence*                          AnimSequence;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurveName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KeyIndex;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpectedCurveKeyLeaveTangentWeight;                // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.AnimationImportTestFunctions.CheckCurveKeyTime
// 0x0050 (0x0050 - 0x0000)
struct AnimationImportTestFunctions_CheckCurveKeyTime final
{
public:
	class UAnimSequence*                          AnimSequence;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurveName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KeyIndex;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpectedCurveKeyTime;                              // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.AnimationImportTestFunctions.CheckCurveKeyValue
// 0x0050 (0x0050 - 0x0000)
struct AnimationImportTestFunctions_CheckCurveKeyValue final
{
public:
	class UAnimSequence*                          AnimSequence;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurveName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KeyIndex;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpectedCurveKeyValue;                             // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.AnimationImportTestFunctions.CheckImportedAnimSequenceCount
// 0x0048 (0x0048 - 0x0000)
struct AnimationImportTestFunctions_CheckImportedAnimSequenceCount final
{
public:
	TArray<class UAnimSequence*>                  AnimSequences;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfImportedAnimSequences;             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0018(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.AssetImportTestFunctions.CheckImportedMetadataCount
// 0x0040 (0x0040 - 0x0000)
struct AssetImportTestFunctions_CheckImportedMetadataCount final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfMetadataForThisObject;             // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.AssetImportTestFunctions.CheckMetadataExist
// 0x0048 (0x0048 - 0x0000)
struct AssetImportTestFunctions_CheckMetadataExist final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExpectedMetadataKey;                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0018(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.AssetImportTestFunctions.CheckMetadataValue
// 0x0058 (0x0058 - 0x0000)
struct AssetImportTestFunctions_CheckMetadataValue final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExpectedMetadataKey;                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExpectedMetadataValue;                             // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0028(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.InterchangeResultImportTestFunctions.CheckIfErrorOrWarningWasGenerated
// 0x0040 (0x0040 - 0x0000)
struct InterchangeResultImportTestFunctions_CheckIfErrorOrWarningWasGenerated final
{
public:
	class UInterchangeResultsContainer*           ResultsContainer;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UInterchangeResult>         ErrorOrWarningClass;                               // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.LevelSequenceImportTestFunctions.CheckLevelSequenceCount
// 0x0048 (0x0048 - 0x0000)
struct LevelSequenceImportTestFunctions_CheckLevelSequenceCount final
{
public:
	TArray<class ULevelSequence*>                 LevelSequences;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfLevelSequences;                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0018(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.LevelSequenceImportTestFunctions.CheckSectionCount
// 0x0040 (0x0040 - 0x0000)
struct LevelSequenceImportTestFunctions_CheckSectionCount final
{
public:
	const class ULevelSequence*                   LevelSequence;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfSections;                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.LevelSequenceImportTestFunctions.CheckSectionInterpolationMode
// 0x0040 (0x0040 - 0x0000)
struct LevelSequenceImportTestFunctions_CheckSectionInterpolationMode final
{
public:
	const class ULevelSequence*                   LevelSequence;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIndex;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichCurveInterpMode                          ExpectedInterpolationMode;                         // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.LevelSequenceImportTestFunctions.CheckSequenceLength
// 0x0040 (0x0040 - 0x0000)
struct LevelSequenceImportTestFunctions_CheckSequenceLength final
{
public:
	const class ULevelSequence*                   LevelSequence;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpectedLevelSequenceLength;                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.LevelVariantSetsImportTestFunctions.CheckBindingsCount
// 0x0060 (0x0060 - 0x0000)
struct LevelVariantSetsImportTestFunctions_CheckBindingsCount final
{
public:
	class ULevelVariantSets*                      LevelVariantSets;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VariantSetName;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VariantName;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfBindings;                          // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0030(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.LevelVariantSetsImportTestFunctions.CheckLevelVariantSetsCount
// 0x0048 (0x0048 - 0x0000)
struct LevelVariantSetsImportTestFunctions_CheckLevelVariantSetsCount final
{
public:
	TArray<class ULevelVariantSets*>              LevelVariantSetsAssets;                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfLevelVariantSets;                  // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0018(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.LevelVariantSetsImportTestFunctions.CheckVariantsCount
// 0x0050 (0x0050 - 0x0000)
struct LevelVariantSetsImportTestFunctions_CheckVariantsCount final
{
public:
	class ULevelVariantSets*                      LevelVariantSets;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VariantSetName;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfVariants;                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.LevelVariantSetsImportTestFunctions.CheckVariantSetsCount
// 0x0040 (0x0040 - 0x0000)
struct LevelVariantSetsImportTestFunctions_CheckVariantSetsCount final
{
public:
	class ULevelVariantSets*                      LevelVariantSets;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfVariantSets;                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.MaterialImportTestFunctions.CheckBlendMode
// 0x0040 (0x0040 - 0x0000)
struct MaterialImportTestFunctions_CheckBlendMode final
{
public:
	const class UMaterialInterface*               MaterialInterface;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBlendMode                                    ExpectedBlendMode;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.MaterialImportTestFunctions.CheckImportedMaterialCount
// 0x0048 (0x0048 - 0x0000)
struct MaterialImportTestFunctions_CheckImportedMaterialCount final
{
public:
	TArray<class UMaterialInterface*>             MaterialInterfaces;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfImportedMaterials;                 // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0018(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.MaterialImportTestFunctions.CheckImportedMaterialInstanceCount
// 0x0048 (0x0048 - 0x0000)
struct MaterialImportTestFunctions_CheckImportedMaterialInstanceCount final
{
public:
	TArray<class UMaterialInterface*>             MaterialInterfaces;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfImportedMaterialInstances;         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0018(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.MaterialImportTestFunctions.CheckIsTwoSided
// 0x0040 (0x0040 - 0x0000)
struct MaterialImportTestFunctions_CheckIsTwoSided final
{
public:
	const class UMaterialInterface*               MaterialInterface;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ExpectedIsTwoSided;                                // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.MaterialImportTestFunctions.CheckOpacityMaskClipValue
// 0x0040 (0x0040 - 0x0000)
struct MaterialImportTestFunctions_CheckOpacityMaskClipValue final
{
public:
	const class UMaterialInterface*               MaterialInterface;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpectedOpacityMaskClipValue;                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.MaterialImportTestFunctions.CheckScalarParameter
// 0x0050 (0x0050 - 0x0000)
struct MaterialImportTestFunctions_CheckScalarParameter final
{
public:
	const class UMaterialInterface*               MaterialInterface;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParameterName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpectedParameterValue;                            // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.MaterialImportTestFunctions.CheckShadingModel
// 0x0040 (0x0040 - 0x0000)
struct MaterialImportTestFunctions_CheckShadingModel final
{
public:
	const class UMaterialInterface*               MaterialInterface;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMaterialShadingModel                         ExpectedShadingModel;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.MaterialImportTestFunctions.CheckVectorParameter
// 0x0058 (0x0058 - 0x0000)
struct MaterialImportTestFunctions_CheckVectorParameter final
{
public:
	const class UMaterialInterface*               MaterialInterface;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParameterName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ExpectedParameterValue;                            // 0x0018(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0028(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.SkeletalMeshImportTestFunctions.CheckBoneCount
// 0x0040 (0x0040 - 0x0000)
struct SkeletalMeshImportTestFunctions_CheckBoneCount final
{
public:
	class USkeletalMesh*                          Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfBones;                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.SkeletalMeshImportTestFunctions.CheckBonePosition
// 0x0058 (0x0058 - 0x0000)
struct SkeletalMeshImportTestFunctions_CheckBonePosition final
{
public:
	class USkeletalMesh*                          Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BoneIndex;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ExpectedBonePosition;                              // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0028(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.SkeletalMeshImportTestFunctions.CheckImportedSkeletalMeshCount
// 0x0048 (0x0048 - 0x0000)
struct SkeletalMeshImportTestFunctions_CheckImportedSkeletalMeshCount final
{
public:
	TArray<class USkeletalMesh*>                  Meshes;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfImportedSkeletalMeshes;            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0018(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.SkeletalMeshImportTestFunctions.CheckLodCount
// 0x0040 (0x0040 - 0x0000)
struct SkeletalMeshImportTestFunctions_CheckLodCount final
{
public:
	class USkeletalMesh*                          Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfLods;                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.SkeletalMeshImportTestFunctions.CheckMaterialSlotCount
// 0x0040 (0x0040 - 0x0000)
struct SkeletalMeshImportTestFunctions_CheckMaterialSlotCount final
{
public:
	class USkeletalMesh*                          Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfMaterialSlots;                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.SkeletalMeshImportTestFunctions.CheckRenderTriangleCount
// 0x0040 (0x0040 - 0x0000)
struct SkeletalMeshImportTestFunctions_CheckRenderTriangleCount final
{
public:
	class USkeletalMesh*                          Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LodIndex;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfRenderTriangles;                   // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.SkeletalMeshImportTestFunctions.CheckRenderVertexCount
// 0x0040 (0x0040 - 0x0000)
struct SkeletalMeshImportTestFunctions_CheckRenderVertexCount final
{
public:
	class USkeletalMesh*                          Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LodIndex;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfRenderVertices;                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.SkeletalMeshImportTestFunctions.CheckSectionCount
// 0x0040 (0x0040 - 0x0000)
struct SkeletalMeshImportTestFunctions_CheckSectionCount final
{
public:
	class USkeletalMesh*                          Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LodIndex;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfSections;                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.SkeletalMeshImportTestFunctions.CheckSectionImportedMaterialSlotName
// 0x0050 (0x0050 - 0x0000)
struct SkeletalMeshImportTestFunctions_CheckSectionImportedMaterialSlotName final
{
public:
	class USkeletalMesh*                          Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LodIndex;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIndex;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExpectedImportedMaterialSlotName;                  // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.SkeletalMeshImportTestFunctions.CheckSectionMaterialName
// 0x0050 (0x0050 - 0x0000)
struct SkeletalMeshImportTestFunctions_CheckSectionMaterialName final
{
public:
	class USkeletalMesh*                          Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LodIndex;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIndex;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExpectedMaterialName;                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.SkeletalMeshImportTestFunctions.CheckSkinnedVertexCountForBone
// 0x0050 (0x0050 - 0x0000)
struct SkeletalMeshImportTestFunctions_CheckSkinnedVertexCountForBone final
{
public:
	class USkeletalMesh*                          Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BoneName;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTestFirstAlternateProfile;                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ExpectedSkinnedVertexCount;                        // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.SkeletalMeshImportTestFunctions.CheckTriangleCountInSection
// 0x0048 (0x0048 - 0x0000)
struct SkeletalMeshImportTestFunctions_CheckTriangleCountInSection final
{
public:
	class USkeletalMesh*                          Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LodIndex;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIndex;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfTriangles;                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0018(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.SkeletalMeshImportTestFunctions.CheckUVChannelCount
// 0x0040 (0x0040 - 0x0000)
struct SkeletalMeshImportTestFunctions_CheckUVChannelCount final
{
public:
	class USkeletalMesh*                          Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LodIndex;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumberOfUVChannels;                        // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.SkeletalMeshImportTestFunctions.CheckVertexIndexNormal
// 0x0058 (0x0058 - 0x0000)
struct SkeletalMeshImportTestFunctions_CheckVertexIndexNormal final
{
public:
	class USkeletalMesh*                          Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LodIndex;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VertexIndex;                                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ExpectedVertexNormal;                              // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeTestFunctionResult         ReturnValue;                                       // 0x0028(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function InterchangeTests.SkeletalMeshImportTestFunctions.CheckVertexIndexPosition
// 0x0058 (0x0058 - 0x0000)
struct SkeletalMeshImportTestFunctions_CheckVertexIndexPosition final
{
public:
	class USkeletalMesh*                          Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
