#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InterchangeImport

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "InterchangeCore_classes.hpp"
#include "USDClasses_structs.hpp"
#include "InterchangeImport_structs.hpp"


namespace SDK
{

// Class InterchangeImport.InterchangeAnimationPayloadInterface
// 0x0000 (0x0030 - 0x0030)
class IInterchangeAnimationPayloadInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeAnimationPayloadInterface">();
	}
	static class IInterchangeAnimationPayloadInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInterchangeAnimationPayloadInterface>();
	}
};

// Class InterchangeImport.InterchangeAssetUserData
// 0x0050 (0x0080 - 0x0030)
class UInterchangeAssetUserData final : public UAssetUserData
{
public:
	TMap<class FString, class FString>            MetaData;                                          // 0x0030(0x0050)(Edit, BlueprintVisible, EditConst, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeAssetUserData">();
	}
	static class UInterchangeAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeAssetUserData>();
	}
};

// Class InterchangeImport.InterchangeBlockedTexturePayloadInterface
// 0x0000 (0x0030 - 0x0030)
class IInterchangeBlockedTexturePayloadInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeBlockedTexturePayloadInterface">();
	}
	static class IInterchangeBlockedTexturePayloadInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInterchangeBlockedTexturePayloadInterface>();
	}
};

// Class InterchangeImport.InterchangeActorFactory
// 0x0000 (0x0038 - 0x0038)
class UInterchangeActorFactory : public UInterchangeFactoryBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeActorFactory">();
	}
	static class UInterchangeActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeActorFactory>();
	}
};

// Class InterchangeImport.InterchangeDecalActorFactory
// 0x0000 (0x0038 - 0x0038)
class UInterchangeDecalActorFactory final : public UInterchangeActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeDecalActorFactory">();
	}
	static class UInterchangeDecalActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeDecalActorFactory>();
	}
};

// Class InterchangeImport.InterchangeLevelSequenceFactory
// 0x0008 (0x0040 - 0x0038)
class UInterchangeLevelSequenceFactory final : public UInterchangeFactoryBase
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeLevelSequenceFactory">();
	}
	static class UInterchangeLevelSequenceFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeLevelSequenceFactory>();
	}
};

// Class InterchangeImport.InterchangeLightActorFactory
// 0x0000 (0x0038 - 0x0038)
class UInterchangeLightActorFactory final : public UInterchangeActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeLightActorFactory">();
	}
	static class UInterchangeLightActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeLightActorFactory>();
	}
};

// Class InterchangeImport.InterchangeMeshPayloadInterface
// 0x0000 (0x0030 - 0x0030)
class IInterchangeMeshPayloadInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeMeshPayloadInterface">();
	}
	static class IInterchangeMeshPayloadInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInterchangeMeshPayloadInterface>();
	}
};

// Class InterchangeImport.InterchangeSceneImportAssetFactory
// 0x0000 (0x0038 - 0x0038)
class UInterchangeSceneImportAssetFactory final : public UInterchangeFactoryBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeSceneImportAssetFactory">();
	}
	static class UInterchangeSceneImportAssetFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeSceneImportAssetFactory>();
	}
};

// Class InterchangeImport.InterchangeSceneVariantSetsFactory
// 0x0008 (0x0040 - 0x0038)
class UInterchangeSceneVariantSetsFactory final : public UInterchangeFactoryBase
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeSceneVariantSetsFactory">();
	}
	static class UInterchangeSceneVariantSetsFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeSceneVariantSetsFactory>();
	}
};

// Class InterchangeImport.InterchangeSlicedTexturePayloadInterface
// 0x0000 (0x0030 - 0x0030)
class IInterchangeSlicedTexturePayloadInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeSlicedTexturePayloadInterface">();
	}
	static class IInterchangeSlicedTexturePayloadInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInterchangeSlicedTexturePayloadInterface>();
	}
};

// Class InterchangeImport.InterchangeTextureLightProfilePayloadInterface
// 0x0000 (0x0030 - 0x0030)
class IInterchangeTextureLightProfilePayloadInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeTextureLightProfilePayloadInterface">();
	}
	static class IInterchangeTextureLightProfilePayloadInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInterchangeTextureLightProfilePayloadInterface>();
	}
};

// Class InterchangeImport.InterchangeTexturePayloadInterface
// 0x0000 (0x0030 - 0x0030)
class IInterchangeTexturePayloadInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeTexturePayloadInterface">();
	}
	static class IInterchangeTexturePayloadInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInterchangeTexturePayloadInterface>();
	}
};

// Class InterchangeImport.InterchangeVariantSetPayloadInterface
// 0x0000 (0x0030 - 0x0030)
class IInterchangeVariantSetPayloadInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeVariantSetPayloadInterface">();
	}
	static class IInterchangeVariantSetPayloadInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInterchangeVariantSetPayloadInterface>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXRamp4
// 0x00F8 (0x01C0 - 0x00C8)
class UMaterialExpressionMaterialXRamp4 final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Coordinates;                                       // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       A;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       C;                                                 // 0x0158(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       D;                                                 // 0x0188(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         ConstCoordinate;                                   // 0x01B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXRamp4">();
	}
	static class UMaterialExpressionMaterialXRamp4* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXRamp4>();
	}
};

// Class InterchangeImport.InterchangeAnimSequenceFactory
// 0x0108 (0x0140 - 0x0038)
class UInterchangeAnimSequenceFactory final : public UInterchangeFactoryBase
{
public:
	uint8                                         Pad_38[0x108];                                     // 0x0038(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeAnimSequenceFactory">();
	}
	static class UInterchangeAnimSequenceFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeAnimSequenceFactory>();
	}
};

// Class InterchangeImport.InterchangeFbxTranslatorSettings
// 0x0008 (0x0038 - 0x0030)
class UInterchangeFbxTranslatorSettings final : public UInterchangeTranslatorSettings
{
public:
	bool                                          bConvertScene;                                     // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceFrontXAxis;                                  // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConvertSceneUnit;                                 // 0x0032(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepFbxNamespace;                                 // 0x0033(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeFbxTranslatorSettings">();
	}
	static class UInterchangeFbxTranslatorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeFbxTranslatorSettings>();
	}
};

// Class InterchangeImport.InterchangeFbxTranslator
// 0x00F8 (0x0138 - 0x0040)
class UInterchangeFbxTranslator final : public UInterchangeTranslatorBase
{
public:
	uint8                                         Pad_40[0xF8];                                      // 0x0040(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeFbxTranslator">();
	}
	static class UInterchangeFbxTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeFbxTranslator>();
	}
};

// Class InterchangeImport.InterchangeGLTFTranslator
// 0x0258 (0x0298 - 0x0040)
class UInterchangeGLTFTranslator final : public UInterchangeTranslatorBase
{
public:
	uint8                                         Pad_40[0x258];                                     // 0x0040(0x0258)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeGLTFTranslator">();
	}
	static class UInterchangeGLTFTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeGLTFTranslator>();
	}
};

// Class InterchangeImport.InterchangeMaterialXTranslator
// 0x0008 (0x0048 - 0x0040)
class UInterchangeMaterialXTranslator final : public UInterchangeTranslatorBase
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeMaterialXTranslator">();
	}
	static class UInterchangeMaterialXTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeMaterialXTranslator>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXAppend3Vector
// 0x0090 (0x0158 - 0x00C8)
class UMaterialExpressionMaterialXAppend3Vector final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       C;                                                 // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXAppend3Vector">();
	}
	static class UMaterialExpressionMaterialXAppend3Vector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXAppend3Vector>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXAppend4Vector
// 0x00C0 (0x0188 - 0x00C8)
class UMaterialExpressionMaterialXAppend4Vector final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       C;                                                 // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       D;                                                 // 0x0158(0x0030)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXAppend4Vector">();
	}
	static class UMaterialExpressionMaterialXAppend4Vector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXAppend4Vector>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXBurn
// 0x0098 (0x0160 - 0x00C8)
class UMaterialExpressionMaterialXBurn final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXBurn">();
	}
	static class UMaterialExpressionMaterialXBurn* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXBurn>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXDifference
// 0x0098 (0x0160 - 0x00C8)
class UMaterialExpressionMaterialXDifference final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXDifference">();
	}
	static class UMaterialExpressionMaterialXDifference* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXDifference>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXDisjointOver
// 0x0098 (0x0160 - 0x00C8)
class UMaterialExpressionMaterialXDisjointOver final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXDisjointOver">();
	}
	static class UMaterialExpressionMaterialXDisjointOver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXDisjointOver>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXDodge
// 0x0098 (0x0160 - 0x00C8)
class UMaterialExpressionMaterialXDodge final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXDodge">();
	}
	static class UMaterialExpressionMaterialXDodge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXDodge>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXFractal3D
// 0x0120 (0x01E8 - 0x00C8)
class UMaterialExpressionMaterialXFractal3D final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Position;                                          // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Amplitude;                                         // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAmplitude;                                    // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExpressionInput                       Octaves;                                           // 0x0130(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ConstOctaves;                                      // 0x0160(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExpressionInput                       Lacunarity;                                        // 0x0168(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstLacunarity;                                   // 0x0198(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExpressionInput                       Diminish;                                          // 0x01A0(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstDiminish;                                     // 0x01D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x01D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTurbulence;                                       // 0x01D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Levels;                                            // 0x01DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutputMin;                                         // 0x01E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutputMax;                                         // 0x01E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXFractal3D">();
	}
	static class UMaterialExpressionMaterialXFractal3D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXFractal3D>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXIn
// 0x0098 (0x0160 - 0x00C8)
class UMaterialExpressionMaterialXIn final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXIn">();
	}
	static class UMaterialExpressionMaterialXIn* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXIn>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXLuminance
// 0x0048 (0x0110 - 0x00C8)
class UMaterialExpressionMaterialXLuminance final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Input;                                             // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           LuminanceFactors;                                  // 0x00F8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMaterialXLuminanceMode                       LuminanceMode;                                     // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXLuminance">();
	}
	static class UMaterialExpressionMaterialXLuminance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXLuminance>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXMask
// 0x0098 (0x0160 - 0x00C8)
class UMaterialExpressionMaterialXMask final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXMask">();
	}
	static class UMaterialExpressionMaterialXMask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXMask>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXMatte
// 0x0098 (0x0160 - 0x00C8)
class UMaterialExpressionMaterialXMatte final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXMatte">();
	}
	static class UMaterialExpressionMaterialXMatte* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXMatte>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXMinus
// 0x0098 (0x0160 - 0x00C8)
class UMaterialExpressionMaterialXMinus final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXMinus">();
	}
	static class UMaterialExpressionMaterialXMinus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXMinus>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXOut
// 0x0098 (0x0160 - 0x00C8)
class UMaterialExpressionMaterialXOut final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXOut">();
	}
	static class UMaterialExpressionMaterialXOut* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXOut>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXOver
// 0x0098 (0x0160 - 0x00C8)
class UMaterialExpressionMaterialXOver final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXOver">();
	}
	static class UMaterialExpressionMaterialXOver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXOver>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXOverlay
// 0x0098 (0x0160 - 0x00C8)
class UMaterialExpressionMaterialXOverlay final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXOverlay">();
	}
	static class UMaterialExpressionMaterialXOverlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXOverlay>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXPlace2D
// 0x00F8 (0x01C0 - 0x00C8)
class UMaterialExpressionMaterialXPlace2D final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Coordinates;                                       // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Pivot;                                             // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Scale;                                             // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Offset;                                            // 0x0158(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       RotationAngle;                                     // 0x0188(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstRotationAngle;                                // 0x01B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ConstCoordinate;                                   // 0x01BC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXPlace2D">();
	}
	static class UMaterialExpressionMaterialXPlace2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXPlace2D>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXPlus
// 0x0098 (0x0160 - 0x00C8)
class UMaterialExpressionMaterialXPlus final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXPlus">();
	}
	static class UMaterialExpressionMaterialXPlus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXPlus>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXPremult
// 0x0030 (0x00F8 - 0x00C8)
class UMaterialExpressionMaterialXPremult final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Input;                                             // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXPremult">();
	}
	static class UMaterialExpressionMaterialXPremult* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXPremult>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXRampLeftRight
// 0x0098 (0x0160 - 0x00C8)
class UMaterialExpressionMaterialXRampLeftRight final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Coordinates;                                       // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       A;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         ConstCoordinate;                                   // 0x0158(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXRampLeftRight">();
	}
	static class UMaterialExpressionMaterialXRampLeftRight* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXRampLeftRight>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXRampTopBottom
// 0x0098 (0x0160 - 0x00C8)
class UMaterialExpressionMaterialXRampTopBottom final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Coordinates;                                       // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       A;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         ConstCoordinate;                                   // 0x0158(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXRampTopBottom">();
	}
	static class UMaterialExpressionMaterialXRampTopBottom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXRampTopBottom>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXRemap
// 0x0100 (0x01C8 - 0x00C8)
class UMaterialExpressionMaterialXRemap final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Input;                                             // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       InputLow;                                          // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       InputHigh;                                         // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       TargetLow;                                         // 0x0158(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       TargetHigh;                                        // 0x0188(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         InputLowDefault;                                   // 0x01B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InputHighDefault;                                  // 0x01BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetLowDefault;                                  // 0x01C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetHighDefault;                                 // 0x01C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXRemap">();
	}
	static class UMaterialExpressionMaterialXRemap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXRemap>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXRotate2D
// 0x0068 (0x0130 - 0x00C8)
class UMaterialExpressionMaterialXRotate2D final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Input;                                             // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       RotationAngle;                                     // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstRotationAngle;                                // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXRotate2D">();
	}
	static class UMaterialExpressionMaterialXRotate2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXRotate2D>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXScreen
// 0x0098 (0x0160 - 0x00C8)
class UMaterialExpressionMaterialXScreen final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXScreen">();
	}
	static class UMaterialExpressionMaterialXScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXScreen>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXSplitLeftRight
// 0x00C8 (0x0190 - 0x00C8)
class UMaterialExpressionMaterialXSplitLeftRight final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Coordinates;                                       // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       A;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Center;                                            // 0x0158(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstCenter;                                       // 0x0188(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ConstCoordinate;                                   // 0x018C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXSplitLeftRight">();
	}
	static class UMaterialExpressionMaterialXSplitLeftRight* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXSplitLeftRight>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXSplitTopBottom
// 0x00C8 (0x0190 - 0x00C8)
class UMaterialExpressionMaterialXSplitTopBottom final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Coordinates;                                       // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       A;                                                 // 0x00F8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x0128(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Center;                                            // 0x0158(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstCenter;                                       // 0x0188(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ConstCoordinate;                                   // 0x018C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXSplitTopBottom">();
	}
	static class UMaterialExpressionMaterialXSplitTopBottom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXSplitTopBottom>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXSwizzle
// 0x0040 (0x0108 - 0x00C8)
class UMaterialExpressionMaterialXSwizzle final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Input;                                             // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 Channels;                                          // 0x00F8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXSwizzle">();
	}
	static class UMaterialExpressionMaterialXSwizzle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXSwizzle>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXTextureSampleParameterBlur
// 0x0010 (0x0280 - 0x0270)
class UMaterialExpressionMaterialXTextureSampleParameterBlur final : public UMaterialExpressionTextureSampleParameter2D
{
public:
	EMAterialXTextureSampleBlurKernel             KernelSize;                                        // 0x0270(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FilterSize;                                        // 0x0274(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FilterOffset;                                      // 0x0278(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMaterialXTextureSampleBlurFilter             Filter;                                            // 0x027C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXTextureSampleParameterBlur">();
	}
	static class UMaterialExpressionMaterialXTextureSampleParameterBlur* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXTextureSampleParameterBlur>();
	}
};

// Class InterchangeImport.MaterialExpressionMaterialXUnpremult
// 0x0030 (0x00F8 - 0x00C8)
class UMaterialExpressionMaterialXUnpremult final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Input;                                             // 0x00C8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionMaterialXUnpremult">();
	}
	static class UMaterialExpressionMaterialXUnpremult* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXUnpremult>();
	}
};

// Class InterchangeImport.InterchangeMaterialFactory
// 0x0008 (0x0040 - 0x0038)
class UInterchangeMaterialFactory final : public UInterchangeFactoryBase
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeMaterialFactory">();
	}
	static class UInterchangeMaterialFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeMaterialFactory>();
	}
};

// Class InterchangeImport.InterchangeMaterialFunctionFactory
// 0x0008 (0x0040 - 0x0038)
class UInterchangeMaterialFunctionFactory final : public UInterchangeFactoryBase
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeMaterialFunctionFactory">();
	}
	static class UInterchangeMaterialFunctionFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeMaterialFunctionFactory>();
	}
};

// Class InterchangeImport.InterchangeOBJTranslator
// 0x0018 (0x0058 - 0x0040)
class UInterchangeOBJTranslator final : public UInterchangeTranslatorBase
{
public:
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeOBJTranslator">();
	}
	static class UInterchangeOBJTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeOBJTranslator>();
	}
};

// Class InterchangeImport.InterchangePhysicsAssetFactory
// 0x0000 (0x0038 - 0x0038)
class UInterchangePhysicsAssetFactory final : public UInterchangeFactoryBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangePhysicsAssetFactory">();
	}
	static class UInterchangePhysicsAssetFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangePhysicsAssetFactory>();
	}
};

// Class InterchangeImport.InterchangeSkeletalMeshFactory
// 0x0060 (0x0098 - 0x0038)
class UInterchangeSkeletalMeshFactory final : public UInterchangeFactoryBase
{
public:
	uint8                                         Pad_38[0x60];                                      // 0x0038(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeSkeletalMeshFactory">();
	}
	static class UInterchangeSkeletalMeshFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeSkeletalMeshFactory>();
	}
};

// Class InterchangeImport.InterchangeSkeletonFactory
// 0x0000 (0x0038 - 0x0038)
class UInterchangeSkeletonFactory final : public UInterchangeFactoryBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeSkeletonFactory">();
	}
	static class UInterchangeSkeletonFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeSkeletonFactory>();
	}
};

// Class InterchangeImport.InterchangeStaticMeshFactory
// 0x0018 (0x0050 - 0x0038)
class UInterchangeStaticMeshFactory final : public UInterchangeFactoryBase
{
public:
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeStaticMeshFactory">();
	}
	static class UInterchangeStaticMeshFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeStaticMeshFactory>();
	}
};

// Class InterchangeImport.InterchangeCineCameraActorFactory
// 0x0000 (0x0038 - 0x0038)
class UInterchangeCineCameraActorFactory final : public UInterchangeActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeCineCameraActorFactory">();
	}
	static class UInterchangeCineCameraActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeCineCameraActorFactory>();
	}
};

// Class InterchangeImport.InterchangeCameraActorFactory
// 0x0000 (0x0038 - 0x0038)
class UInterchangeCameraActorFactory final : public UInterchangeActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeCameraActorFactory">();
	}
	static class UInterchangeCameraActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeCameraActorFactory>();
	}
};

// Class InterchangeImport.InterchangeSkeletalMeshActorFactory
// 0x0000 (0x0038 - 0x0038)
class UInterchangeSkeletalMeshActorFactory final : public UInterchangeActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeSkeletalMeshActorFactory">();
	}
	static class UInterchangeSkeletalMeshActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeSkeletalMeshActorFactory>();
	}
};

// Class InterchangeImport.InterchangeStaticMeshActorFactory
// 0x0000 (0x0038 - 0x0038)
class UInterchangeStaticMeshActorFactory final : public UInterchangeActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeStaticMeshActorFactory">();
	}
	static class UInterchangeStaticMeshActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeStaticMeshActorFactory>();
	}
};

// Class InterchangeImport.InterchangeDDSTranslator
// 0x0010 (0x0050 - 0x0040)
class UInterchangeDDSTranslator final : public UInterchangeTranslatorBase
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeDDSTranslator">();
	}
	static class UInterchangeDDSTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeDDSTranslator>();
	}
};

// Class InterchangeImport.InterchangeIESTranslator
// 0x0008 (0x0048 - 0x0040)
class UInterchangeIESTranslator final : public UInterchangeTranslatorBase
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeIESTranslator">();
	}
	static class UInterchangeIESTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeIESTranslator>();
	}
};

// Class InterchangeImport.InterchangeImageWrapperTranslator
// 0x0010 (0x0050 - 0x0040)
class UInterchangeImageWrapperTranslator final : public UInterchangeTranslatorBase
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeImageWrapperTranslator">();
	}
	static class UInterchangeImageWrapperTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeImageWrapperTranslator>();
	}
};

// Class InterchangeImport.InterchangeJPGTranslator
// 0x0008 (0x0048 - 0x0040)
class UInterchangeJPGTranslator final : public UInterchangeTranslatorBase
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeJPGTranslator">();
	}
	static class UInterchangeJPGTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeJPGTranslator>();
	}
};

// Class InterchangeImport.InterchangePSDTranslator
// 0x0008 (0x0048 - 0x0040)
class UInterchangePSDTranslator final : public UInterchangeTranslatorBase
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangePSDTranslator">();
	}
	static class UInterchangePSDTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangePSDTranslator>();
	}
};

// Class InterchangeImport.InterchangeTextureFactory
// 0x00A0 (0x00D8 - 0x0038)
class UInterchangeTextureFactory final : public UInterchangeFactoryBase
{
public:
	uint8                                         Pad_38[0xA0];                                      // 0x0038(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeTextureFactory">();
	}
	static class UInterchangeTextureFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeTextureFactory>();
	}
};

// Class InterchangeImport.InterchangeUEJPEGTranslator
// 0x0008 (0x0048 - 0x0040)
