#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemizationCoreUI

#include "Basic.hpp"

#include "ItemizationCoreUI_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ItemizationCoreUI.InventoryCollectionViewModelsManager.OnInventoryCollectionDestroyed
// 0x0008 (0x0008 - 0x0000)
struct InventoryCollectionViewModelsManager_OnInventoryCollectionDestroyed final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.DropAmount
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_DropAmount final
{
public:
	int64                                         Amount;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.SetEquippableItemActive
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_SetEquippableItemActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.UpdateCanSwap
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_UpdateCanSwap final
{
public:
	const class UInventoryItemEntryViewModel*     SwapInventoryItemEntryViewModel;                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.CanItemBeMadeActive
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_CanItemBeMadeActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.CanItemBeMadeInactive
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_CanItemBeMadeInactive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.CanItemBeStacked
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_CanItemBeStacked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetEquipSlotInputAction
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_GetEquipSlotInputAction final
{
public:
	const class UInputAction*                     ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetInventoryID
// 0x0010 (0x0010 - 0x0000)
struct InventoryItemEntryViewModel_GetInventoryID final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemAmount
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_GetItemAmount final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemDefinition
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_GetItemDefinition final
{
public:
	const class UItemDefinitionBase*              ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemDescription
// 0x0010 (0x0010 - 0x0000)
struct InventoryItemEntryViewModel_GetItemDescription final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemEntryID
// 0x0010 (0x0010 - 0x0000)
struct InventoryItemEntryViewModel_GetItemEntryID final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemIcon
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_GetItemIcon final
{
public:
	class UTexture2D*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemIconDisplayTextType
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_GetItemIconDisplayTextType final
{
public:
	EItemIconDisplayTextType                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemName
// 0x0010 (0x0010 - 0x0000)
struct InventoryItemEntryViewModel_GetItemName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemPrimaryAmmoCount
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_GetItemPrimaryAmmoCount final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemRarity
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_GetItemRarity final
{
public:
	const class UItemRarity*                      ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemSlotNumber
// 0x0004 (0x0004 - 0x0000)
struct InventoryItemEntryViewModel_GetItemSlotNumber final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetItemType
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_GetItemType final
{
public:
	const class UItemType*                        ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetMaxItemAmount
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemEntryViewModel_GetMaxItemAmount final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.GetSoftItemIcon
// 0x0030 (0x0030 - 0x0000)
struct InventoryItemEntryViewModel_GetSoftItemIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.IsEquipSlotInputBindingVisible
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_IsEquipSlotInputBindingVisible final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.IsItemActive
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_IsItemActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.IsItemIconLoading
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_IsItemIconLoading final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemEntryViewModel.IsValidItem
// 0x0001 (0x0001 - 0x0000)
struct InventoryItemEntryViewModel_IsValidItem final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemStreamViewModel.AddItemEntries
// 0x0010 (0x0010 - 0x0000)
struct InventoryItemStreamViewModel_AddItemEntries final
{
public:
	TArray<class UInventoryItemEntryViewModel*>   ItemEntryViewModels;                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemStreamViewModel.AddItemEntry
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemStreamViewModel_AddItemEntry final
{
public:
	class UInventoryItemEntryViewModel*           ItemEntryViewModel;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemStreamViewModel.OnItemEntryAmountChanged
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemStreamViewModel_OnItemEntryAmountChanged final
{
public:
	class UInventoryItemEntryViewModel*           ItemEntryViewModel;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryItemStreamViewModel.RemoveItemEntry
// 0x0008 (0x0008 - 0x0000)
struct InventoryItemStreamViewModel_RemoveItemEntry final
{
public:
	class UInventoryItemEntryViewModel*           ItemEntryViewModel;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryViewModel.GetInventoryDescription
// 0x0010 (0x0010 - 0x0000)
struct InventoryViewModel_GetInventoryDescription final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryViewModel.GetInventoryName
// 0x0010 (0x0010 - 0x0000)
struct InventoryViewModel_GetInventoryName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryViewModel.GetTotalSlots
// 0x0004 (0x0004 - 0x0000)
struct InventoryViewModel_GetTotalSlots final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryViewModelAllowedConversionFunctions.FindInventoryViewModel
// 0x0020 (0x0020 - 0x0000)
struct InventoryViewModelAllowedConversionFunctions_FindInventoryViewModel final
{
public:
	TSubclassOf<class UObject>                    InventoryClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UInventoryViewModel*>            InventoryViewModels;                               // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UInventoryViewModel*                    ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryViewModelAllowedConversionFunctions.FindInventoryViewModelByName
// 0x0028 (0x0028 - 0x0000)
struct InventoryViewModelAllowedConversionFunctions_FindInventoryViewModelByName final
{
public:
	class FString                                 InventoryName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UInventoryViewModel*>            InventoryViewModels;                               // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UInventoryViewModel*                    ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryViewModelAllowedConversionFunctions.GetInventoryItemEntryViewModels
// 0x0028 (0x0028 - 0x0000)
struct InventoryViewModelAllowedConversionFunctions_GetInventoryItemEntryViewModels final
{
public:
	TArray<class UInventoryItemEntryViewModel*>   InventoryItemEntryViewModels;                      // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIncludeEmptySlots;                                // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInventoryItemEntryViewModel*>   ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ItemizationCoreUI.InventoryViewModelAllowedConversionFunctions.GetAllowedInventoryClasses
// 0x0010 (0x0010 - 0x0000)
struct InventoryViewModelAllowedConversionFunctions_GetAllowedInventoryClasses final
{
public:
	TArray<class UClass*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

}

