#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: item_spawner_device

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "base_item_spawner_device_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass item_spawner_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class item_spawner_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass item_spawner_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class item_spawner_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<item_spawner_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass item_spawner_device.item_spawner_device
// 0x0030 (0x0110 - 0x00E0)
class Uitem_spawner_device final : public Ubase_item_spawner_device
{
public:
	class UDevices_device_function*               __verse_0x94999F15_CycleToNextItemFunction;        // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x8FC2D34D_SpawnItemFunction;              // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_logic*     __verse_0x54FD0389_SetEnableRespawnTimerFunction;  // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_logic*     __verse_0x7408E496_GetEnableRespawnTimerFunction;  // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_float*     __verse_0x2C928203_SetTimeBetweenSpawnsFunction;   // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_float*     __verse_0xA25D036D_GetTimeBetweenSpawnsFunction;   // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fitem__spawner__device_N_RCycleToNextItem(const struct item_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fDevices_2fitem__spawner__device_N_RGetEnableRespawnTimer(const struct item_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fDevices_2fitem__spawner__device_N_RGetTimeBetweenSpawns(const struct item_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fitem__spawner__device_N_RSetEnableRespawnTimer_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fitem__spawner__device_N_RSetTimeBetweenSpawns_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fitem__spawner__device_N_RSpawnItem(const struct item_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"item_spawner_device">();
	}
	static class Uitem_spawner_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uitem_spawner_device>();
	}
};

}

