#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemizationCoreRuntime_0

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "ItemizationCoreRuntime_0_structs.hpp"


namespace SDK::Params
{

// Function ItemizationCoreRuntime.inventory_component.$InitCDO
// 0x0120 (0x0120 - 0x0000)
struct inventory_component__InitCDO final
{
public:
	class UVerseEngine_subscribable_event*        _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_4;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x0030(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0040(0x0010)(HasGetValueTypeHash)
	TOptional<class UItemRequirementBase*, true>  _ExprResult_8;                                     // 0x0050(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0058(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_9 : 1;                                 // 0x005A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_10;                               // 0x005B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ExprResult_11;                                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResult_12;                                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTags_tag_container*                    _ExprResult_13;                                    // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_14;                               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Einventory_creation_type                      _ExprResult_15;                                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_16 : 1;                                // 0x0081(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ExprResult_17;                                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_18;                                    // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_19;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_20;                                    // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_21;                               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_22;                                    // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_23;                               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_24;                                    // 0x00C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_25;                                    // 0x00D0(0x0010)(HasGetValueTypeHash)
	TOptional<class UItemRequirementBase*, true>  _ExprResult_26;                                    // 0x00E0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x00E8(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_27 : 1;                                // 0x00EA(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_28;                               // 0x00EB(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ExprResult_29;                                    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResult_30;                                    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTags_tag_container*                    _ExprResult_31;                                    // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_32;                               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Einventory_creation_type                      _ExprResult_33;                                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_34 : 1;                                // 0x0111(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ExprResult_35;                                    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreRuntime.inventory_component._L_2fFortnite_2ecom_2fItemization_2finventory__component_N_RCanAcceptItem_L_Nitem_R
// 0x0010 (0x0010 - 0x0000)
struct inventory_component__L_2fFortnite_2ecom_2fItemization_2finventory__component_N_RCanAcceptItem_L_Nitem_R final
{
public:
	class Uitem*                                  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreRuntime.inventory_component._L_2fFortnite_2ecom_2fItemization_2finventory__component_N_RDisposeAllItems
// 0x0001 (0x0001 - 0x0000)
struct inventory_component__L_2fFortnite_2ecom_2fItemization_2finventory__component_N_RDisposeAllItems final
{
public:
	struct ItemizationCoreRuntime_0::Ftuple_L_R   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreRuntime.inventory_component._L_2fFortnite_2ecom_2fItemization_2finventory__component_N_RDuplicateItem_L_Nitem_M_N_QAmount_Nint_20_3d_20_2e_2e_2e_R
// 0x0038 (0x0038 - 0x0000)
struct inventory_component__L_2fFortnite_2ecom_2fItemization_2finventory__component_N_RDuplicateItem_L_Nitem_M_N_QAmount_Nint_20_3d_20_2e_2e_2e_R final
{
public:
	struct Ftuple_Litem_M_QAmount_Nint_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<struct Finventory_add_result>       RetVal;                                            // 0x0018(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm)
};

// Function ItemizationCoreRuntime.inventory_component._L_2fFortnite_2ecom_2fItemization_2finventory__component_N_RGetItemList
// 0x0018 (0x0018 - 0x0000)
struct inventory_component__L_2fFortnite_2ecom_2fItemization_2finventory__component_N_RGetItemList final
{
public:
	struct ItemizationCoreRuntime_0::Ftuple_L_R   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Uitem*>                          RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function ItemizationCoreRuntime.inventory_component._L_2fFortnite_2ecom_2fItemization_2finventory__component_N_RRemoveItem_L_Nitem_M_N_QAmount_Nint_20_3d_20_2e_2e_2e_R
// 0x0028 (0x0028 - 0x0000)
struct inventory_component__L_2fFortnite_2ecom_2fItemization_2finventory__component_N_RRemoveItem_L_Nitem_M_N_QAmount_Nint_20_3d_20_2e_2e_2e_R final
{
public:
	struct Ftuple_Litem_M_QAmount_Nint_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<int64>                              RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreRuntime.inventory_component._L_2fFortnite_2ecom_2fItemization_2finventory__component_N_RTakeItem_L_Nitem_R
// 0x0018 (0x0018 - 0x0000)
struct inventory_component__L_2fFortnite_2ecom_2fItemization_2finventory__component_N_RTakeItem_L_Nitem_R final
{
public:
	class Uitem*                                  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<int64>                              RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreRuntime.inventory_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct inventory_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient final
{
public:
	struct ItemizationCoreRuntime_0::Ftuple_L_R   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function ItemizationCoreRuntime.equippable_inventory_component.$InitCDO
// 0x0240 (0x0240 - 0x0000)
struct equippable_inventory_component__InitCDO final
{
public:
	TArray<class UEquippableItemRestrictionBase*> _ExprResult_0;                                     // 0x0000(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0010(0x0010)(ContainsInstancedReference)
	TArray<class UEquippableItemRestrictionBase*> _ForResult_1;                                      // 0x0020(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_2;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0041(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UItemRequirementBase*>           _ExprResult_5;                                     // 0x0048(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x0058(0x0010)(ContainsInstancedReference)
	TArray<class UItemRequirementBase*>           _ForResult_6;                                      // 0x0068(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_7;                                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_8;                                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_9 : 1;                                 // 0x0089(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct Ftuple_Lenhanced__input__action_Mint_R> _ExprResult_10;                                    // 0x0090(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_9;                        // 0x00A0(0x0010)(ContainsInstancedReference)
	TArray<struct Ftuple_Lenhanced__input__action_Mint_R> _ForResult_11;                                     // 0x00B0(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_12;                                      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_13;                                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_11;                        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_14 : 1;                                // 0x00D1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Uitem*>                          _ExprResult_15;                                    // 0x00D8(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_13;                       // 0x00E8(0x0010)(ContainsInstancedReference)
	TArray<class Uitem*>                          _ForResult_16;                                     // 0x00F8(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_17;                                      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_18;                                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_15;                        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_19 : 1;                                // 0x0119(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEquippableItemRestrictionBase*> _ExprResult_20;                                    // 0x0120(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_17;                       // 0x0130(0x0010)(ContainsInstancedReference)
	TArray<class UEquippableItemRestrictionBase*> _ForResult_21;                                     // 0x0140(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_22;                                      // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_23;                                     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_19;                        // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_24 : 1;                                // 0x0161(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UItemRequirementBase*>           _ExprResult_25;                                    // 0x0168(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_21;                       // 0x0178(0x0010)(ContainsInstancedReference)
	TArray<class UItemRequirementBase*>           _ForResult_26;                                     // 0x0188(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_27;                                      // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_28;                                     // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_23;                        // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_29 : 1;                                // 0x01A9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct Ftuple_Lenhanced__input__action_Mint_R> _ExprResult_30;                                    // 0x01B0(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_25;                       // 0x01C0(0x0010)(ContainsInstancedReference)
	TArray<struct Ftuple_Lenhanced__input__action_Mint_R> _ForResult_31;                                     // 0x01D0(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_32;                                      // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_33;                                     // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_27;                        // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_34 : 1;                                // 0x01F1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Uitem*>                          _ExprResult_35;                                    // 0x01F8(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_29;                       // 0x0208(0x0010)(ContainsInstancedReference)
	TArray<class Uitem*>                          _ForResult_36;                                     // 0x0218(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_37;                                      // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_38;                                     // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_31;                        // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_39 : 1;                                // 0x0239(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function ItemizationCoreRuntime.equippable_inventory_component._L_2fFortnite_2ecom_2fItemization_2fequippable__inventory__component_N_RCanEquipItem_L_Nitem_R
// 0x0010 (0x0010 - 0x0000)
struct equippable_inventory_component__L_2fFortnite_2ecom_2fItemization_2fequippable__inventory__component_N_RCanEquipItem_L_Nitem_R final
{
public:
	class Uitem*                                  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreRuntime.equippable_inventory_component._L_2fFortnite_2ecom_2fItemization_2fequippable__inventory__component_N_REquipItem_L_Nitem_R
// 0x0010 (0x0010 - 0x0000)
struct equippable_inventory_component__L_2fFortnite_2ecom_2fItemization_2fequippable__inventory__component_N_REquipItem_L_Nitem_R final
{
public:
	class Uitem*                                  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreRuntime.equippable_inventory_component._L_2fFortnite_2ecom_2fItemization_2fequippable__inventory__component_N_RUnequipItem_L_Nitem_R
// 0x0010 (0x0010 - 0x0000)
struct equippable_inventory_component__L_2fFortnite_2ecom_2fItemization_2fequippable__inventory__component_N_RUnequipItem_L_Nitem_R final
{
public:
	class Uitem*                                  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreRuntime.equippable_inventory_slot_component.$InitCDO
// 0x0090 (0x0090 - 0x0000)
struct equippable_inventory_slot_component__InitCDO final
{
public:
	int64                                         _ExprResult_0;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UEquippableItemRestrictionBase*> _ExprResult_1;                                     // 0x0008(0x0010)(ContainsInstancedReference)
	class UEquippableItemRestrictionBase*         _ExprResult_2;                                     // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UItemRequirementBase*>           _ExprResult_4;                                     // 0x0028(0x0010)(ContainsInstancedReference)
	class UItemRequirementBase*                   _ExprResult_5;                                     // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_6;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResult_7;                                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UEquippableItemRestrictionBase*> _ExprResult_8;                                     // 0x0050(0x0010)(ContainsInstancedReference)
	class UEquippableItemRestrictionBase*         _ExprResult_9;                                     // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_10;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UItemRequirementBase*>           _ExprResult_11;                                    // 0x0070(0x0010)(ContainsInstancedReference)
	class UItemRequirementBase*                   _ExprResult_12;                                    // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_13;                               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreRuntime.item_component._L_2fFortnite_2ecom_2fItemization_2fitem__component_N_ROnItemStateChanged_L_Nitem_R
// 0x0010 (0x0010 - 0x0000)
struct item_component__L_2fFortnite_2ecom_2fItemization_2fitem__component_N_ROnItemStateChanged_L_Nitem_R final
{
public:
	class Uitem*                                  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreRuntime.item_component._L_2fFortnite_2ecom_2fItemization_2fitem__component_N_RShouldBeUnique
// 0x0003 (0x0003 - 0x0000)
struct item_component__L_2fFortnite_2ecom_2fItemization_2fitem__component_N_RShouldBeUnique final
{
public:
	struct ItemizationCoreRuntime_0::Ftuple_L_R   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreRuntime.equippable_item_restriction.$InitCDO
// 0x0020 (0x0020 - 0x0000)
struct equippable_item_restriction__InitCDO final
{
public:
	TOptional<class UItemRequirementBase*, true>  _ExprResult_0;                                     // 0x0000(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0008(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x000A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_2;                                // 0x000B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UItemRequirementBase*, true>  _ExprResult_3;                                     // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0018(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x001A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_5;                                // 0x001B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreRuntime.equippable_item_restriction._L_2fFortnite_2ecom_2fItemization_2fequippable__item__restriction_N_RAppliesTo_L_Nitem_R
// 0x0010 (0x0010 - 0x0000)
struct equippable_item_restriction__L_2fFortnite_2ecom_2fItemization_2fequippable__item__restriction_N_RAppliesTo_L_Nitem_R final
{
public:
	class Uitem*                                  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreRuntime.equippable_item_restriction._L_2fFortnite_2ecom_2fItemization_2fequippable__item__restriction_N_RGetActiveLimitBehaviour_L_Nitem_R
// 0x0010 (0x0010 - 0x0000)
struct equippable_item_restriction__L_2fFortnite_2ecom_2fItemization_2fequippable__item__restriction_N_RGetActiveLimitBehaviour_L_Nitem_R final
{
public:
	class Uitem*                                  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<Eactive_item_limit_behavior>        RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreRuntime.equippable_item_restriction._L_2fFortnite_2ecom_2fItemization_2fequippable__item__restriction_N_RGetActiveSlotLimit_L_Nitem_R
// 0x0018 (0x0018 - 0x0000)
struct equippable_item_restriction__L_2fFortnite_2ecom_2fItemization_2fequippable__item__restriction_N_RGetActiveSlotLimit_L_Nitem_R final
{
public:
	class Uitem*                                  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<int64>                              RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreRuntime._Root.add_inventory_result$Factory
// 0x0010 (0x0010 - 0x0000)
struct _Root_add_inventory_result_Factory final
{
public:
	struct Fadd_inventory_result                  RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function ItemizationCoreRuntime._Root.add_inventory_result$OverrideFactory
// 0x0060 (0x0060 - 0x0000)
struct _Root_add_inventory_result_OverrideFactory final
{
public:
	struct Fadd_inventory_result                  RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0010(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function ItemizationCoreRuntime._Root.add_items_result$Factory
// 0x0020 (0x0020 - 0x0000)
struct _Root_add_items_result_Factory final
{
public:
	struct Fadd_items_result                      RetVal;                                            // 0x0000(0x0020)(Parm, OutParm, ReturnParm)
};

// Function ItemizationCoreRuntime._Root.add_items_result$OverrideFactory
// 0x0070 (0x0070 - 0x0000)
struct _Root_add_items_result_OverrideFactory final
{
public:
	struct Fadd_items_result                      RetVal;                                            // 0x0000(0x0020)(Parm, OutParm, ReturnParm)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0020(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function ItemizationCoreRuntime._Root.change_items_slot_result$Factory
// 0x0020 (0x0020 - 0x0000)
struct _Root_change_items_slot_result_Factory final
{
public:
	struct Fchange_items_slot_result              RetVal;                                            // 0x0000(0x0020)(Parm, OutParm, ReturnParm)
};

// Function ItemizationCoreRuntime._Root.change_items_slot_result$OverrideFactory
// 0x0070 (0x0070 - 0x0000)
struct _Root_change_items_slot_result_OverrideFactory final
{
public:
	struct Fchange_items_slot_result              RetVal;                                            // 0x0000(0x0020)(Parm, OutParm, ReturnParm)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0020(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function ItemizationCoreRuntime._Root.inventory_add_items_result$Factory
// 0x0018 (0x0018 - 0x0000)
struct _Root_inventory_add_items_result_Factory final
{
public:
	struct Finventory_add_items_result            RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};

// Function ItemizationCoreRuntime._Root.inventory_add_items_result$OverrideFactory
// 0x0068 (0x0068 - 0x0000)
struct _Root_inventory_add_items_result_OverrideFactory final
{
public:
	struct Finventory_add_items_result            RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0018(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function ItemizationCoreRuntime._Root.inventory_add_result$Factory
// 0x0018 (0x0018 - 0x0000)
struct _Root_inventory_add_result_Factory final
{
public:
	struct Finventory_add_result                  RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};

// Function ItemizationCoreRuntime._Root.inventory_add_result$OverrideFactory
// 0x0068 (0x0068 - 0x0000)
struct _Root_inventory_add_result_OverrideFactory final
{
public:
	struct Finventory_add_result                  RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0018(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function ItemizationCoreRuntime._Root.inventory_setup_data_result$Factory
// 0x0018 (0x0018 - 0x0000)
struct _Root_inventory_setup_data_result_Factory final
{
public:
	struct Finventory_setup_data_result           RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};

// Function ItemizationCoreRuntime._Root.inventory_setup_data_result$OverrideFactory
// 0x0068 (0x0068 - 0x0000)
struct _Root_inventory_setup_data_result_OverrideFactory final
{
public:
	struct Finventory_setup_data_result           RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0018(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function ItemizationCoreRuntime._Root.item_amount_change$Factory
// 0x0018 (0x0018 - 0x0000)
struct _Root_item_amount_change_Factory final
{
public:
	struct Fitem_amount_change                    RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function ItemizationCoreRuntime._Root.item_amount_change$OverrideFactory
// 0x0068 (0x0068 - 0x0000)
struct _Root_item_amount_change_OverrideFactory final
{
public:
	struct Fitem_amount_change                    RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0018(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function ItemizationCoreRuntime._Root.item_slot_change$Factory
// 0x0018 (0x0018 - 0x0000)
struct _Root_item_slot_change_Factory final
{
public:
	struct Fitem_slot_change                      RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function ItemizationCoreRuntime._Root.item_slot_change$OverrideFactory
// 0x0068 (0x0068 - 0x0000)
struct _Root_item_slot_change_OverrideFactory final
{
public:
	struct Fitem_slot_change                      RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0018(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function ItemizationCoreRuntime._Root.item_state_change$Factory
// 0x0010 (0x0010 - 0x0000)
struct _Root_item_state_change_Factory final
{
public:
	struct Fitem_state_change                     RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function ItemizationCoreRuntime._Root.item_state_change$OverrideFactory
// 0x0060 (0x0060 - 0x0000)
struct _Root_item_state_change_OverrideFactory final
{
public:
	struct Fitem_state_change                     RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0010(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function ItemizationCoreRuntime._Root.remove_inventory_result$Factory
// 0x0010 (0x0010 - 0x0000)
struct _Root_remove_inventory_result_Factory final
{
public:
	struct Fremove_inventory_result               RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function ItemizationCoreRuntime._Root.remove_inventory_result$OverrideFactory
// 0x0060 (0x0060 - 0x0000)
struct _Root_remove_inventory_result_OverrideFactory final
{
public:
	struct Fremove_inventory_result               RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0010(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function ItemizationCoreRuntime._Root.remove_items_result$Factory
// 0x0020 (0x0020 - 0x0000)
struct _Root_remove_items_result_Factory final
{
public:
	struct Fremove_items_result                   RetVal;                                            // 0x0000(0x0020)(Parm, OutParm, ReturnParm)
};

// Function ItemizationCoreRuntime._Root.remove_items_result$OverrideFactory
// 0x0070 (0x0070 - 0x0000)
struct _Root_remove_items_result_OverrideFactory final
{
public:
	struct Fremove_items_result                   RetVal;                                            // 0x0000(0x0020)(Parm, OutParm, ReturnParm)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0020(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function ItemizationCoreRuntime.item_type.$InitCDO
// 0x0040 (0x0040 - 0x0000)
struct item_type__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x0010(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0020(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0030(0x0010)(HasGetValueTypeHash)
};

// Function ItemizationCoreRuntime.inventory_collection_component.$InitCDO
// 0x0150 (0x0150 - 0x0000)
struct inventory_collection_component__InitCDO final
{
public:
	class UVerseEngine_subscribable_event*        _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_4;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_6;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_7;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_8;                                     // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_9;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class Uinventory_setup_data*, true> _ExprResult_10;                                    // 0x0050(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0058(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_11 : 1;                                // 0x005A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_12;                               // 0x005B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Uinventory_component*>           _ExprResult_13;                                    // 0x0060(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_3;                        // 0x0070(0x0010)(ContainsInstancedReference)
	TArray<class Uinventory_component*>           _ForResult_14;                                     // 0x0080(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_15;                                      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_16;                                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_5;                         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_17 : 1;                                // 0x00A1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerseEngine_subscribable_event*        _ExprResult_18;                                    // 0x00A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_19;                               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_20;                                    // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_21;                               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_22;                                    // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_23;                               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_24;                                    // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_25;                               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_26;                                    // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_27;                               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class Uinventory_setup_data*, true> _ExprResult_28;                                    // 0x00F8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__7;                             // 0x0100(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_29 : 1;                                // 0x0102(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_30;                               // 0x0103(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Uinventory_component*>           _ExprResult_31;                                    // 0x0108(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_9;                        // 0x0118(0x0010)(ContainsInstancedReference)
	TArray<class Uinventory_component*>           _ForResult_32;                                     // 0x0128(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_33;                                      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_34;                                     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_11;                        // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_35 : 1;                                // 0x0149(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function ItemizationCoreRuntime.inventory_collection_component._L_2fFortnite_2ecom_2fItemization_2finventory__collection__component_N_RAddInventory_L_NInventoryClass_20where_20InventoryClass_R
// 0x0010 (0x0010 - 0x0000)
struct inventory_collection_component__L_2fFortnite_2ecom_2fItemization_2finventory__collection__component_N_RAddInventory_L_NInventoryClass_20where_20InventoryClass_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uinventory_component*, true>  RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function ItemizationCoreRuntime.inventory_collection_component._L_2fFortnite_2ecom_2fItemization_2finventory__collection__component_N_RGetItemList
// 0x01A8 (0x01A8 - 0x0000)
struct inventory_collection_component__L_2fFortnite_2ecom_2fItemization_2finventory__collection__component_N_RGetItemList final
{
public:
	struct ItemizationCoreRuntime_0::Ftuple_L_R   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Uitem*>                          RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class Uitem*>                          __verse_0xA7C5B06B_ItemList_1;                     // 0x0018(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_2;                        // 0x0028(0x0010)(ContainsInstancedReference)
	TArray<class Uitem*>                          _ForResult_0;                                      // 0x0038(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_1;                                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_2;                                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_4;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_3 : 1;                                 // 0x0059(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Uinventory_component*>           _ForIterable_4;                                    // 0x0060(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_5;                                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_6;                                      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Uinventory_component*                   __verse_0x2E1D28B3_Inventory_8;                    // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class Uitem*>                          __verse_0x9A5A8C96_InventoryItemList_10;           // 0x0088(0x0010)(ContainsInstancedReference)
	class Uinventory_component*                   __verse_0x00000000__11;                            // 0x0098(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x00A0(0x0018)(HasGetValueTypeHash)
	struct ItemizationCoreRuntime_0::Ftuple_L_R   _ExprResult_8;                                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Uitem*>                          _AssignmentScratch_9;                              // 0x00C0(0x0010)(ContainsInstancedReference)
	TArray<class Uitem*>                          _ExprResultStack_10;                               // 0x00D0(0x0010)(ContainsInstancedReference)
	TArray<class Uitem*>                          __verse_0xA7C5B06B_ItemList_12;                    // 0x00E0(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_13;                       // 0x00F0(0x0010)(ContainsInstancedReference)
	TArray<class Uitem*>                          _ForResult_11;                                     // 0x0100(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_12;                                      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_13;                                     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_15;                        // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_14 : 1;                                // 0x0121(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Uinventory_component*>           _ForIterable_15;                                   // 0x0128(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_16;                                      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_17;                                     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Uinventory_component*                   __verse_0x2E1D28B3_Inventory_19;                   // 0x0148(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class Uitem*>                          __verse_0x9A5A8C96_InventoryItemList_21;           // 0x0150(0x0010)(ContainsInstancedReference)
	class Uinventory_component*                   __verse_0x00000000__22;                            // 0x0160(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_18;                                        // 0x0168(0x0018)(HasGetValueTypeHash)
	struct ItemizationCoreRuntime_0::Ftuple_L_R   _ExprResult_19;                                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
