#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemizationCoreUI_0

#include "Basic.hpp"

#include "UnrealEngineExperimental_0_structs.hpp"
#include "ItemizationCoreUI_0_structs.hpp"
#include "ItemizationCoreRuntime_0_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function ItemizationCoreUI.InventoryParameterCollection.$InitCDO
// 0x0030 (0x0030 - 0x0000)
struct InventoryParameterCollection__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
	int64                                         _ExprResult_1;                                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0018(0x0010)(HasGetValueTypeHash)
	int64                                         _ExprResult_3;                                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreUI.InventoryParameterCollection._L_2fFortnite_2ecom_2fItemization_2fInventoryParameterCollection_N_R______ParameterCollection__On__InventoryKey__Changed
// 0x0060 (0x0060 - 0x0000)
struct InventoryParameterCollection__L_2fFortnite_2ecom_2fItemization_2fInventoryParameterCollection_N_R______ParameterCollection__On__InventoryKey__Changed final
{
public:
	struct ItemizationCoreUI_0::Ftuple_L_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0020(0x0010)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0038(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
};

// Function ItemizationCoreUI.InventoryParameterCollection._L_2fFortnite_2ecom_2fItemization_2fInventoryParameterCollection_N_R______ParameterCollection__On__InventoryName__Changed
// 0x0060 (0x0060 - 0x0000)
struct InventoryParameterCollection__L_2fFortnite_2ecom_2fItemization_2fInventoryParameterCollection_N_R______ParameterCollection__On__InventoryName__Changed final
{
public:
	struct ItemizationCoreUI_0::Ftuple_L_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0020(0x0010)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0038(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
};

// Function ItemizationCoreUI.InventoryItemParameterCollection.$InitCDO
// 0x0050 (0x0050 - 0x0000)
struct InventoryItemParameterCollection__InitCDO final
{
public:
	uint8                                         _ExprResult_0 : 1;                                 // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ExprResult_1;                                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0010(0x0010)(HasGetValueTypeHash)
	int64                                         _ExprResult_3;                                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ExprResult_5;                                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x0038(0x0010)(HasGetValueTypeHash)
	int64                                         _ExprResult_7;                                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreUI.InventoryItemParameterCollection._L_2fFortnite_2ecom_2fItemization_2fInventoryItemParameterCollection_N_R______ParameterCollection__On__Amount__Changed
// 0x0060 (0x0060 - 0x0000)
struct InventoryItemParameterCollection__L_2fFortnite_2ecom_2fItemization_2fInventoryItemParameterCollection_N_R______ParameterCollection__On__Amount__Changed final
{
public:
	struct ItemizationCoreUI_0::Ftuple_L_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0020(0x0010)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0038(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
};

// Function ItemizationCoreUI.InventoryItemParameterCollection._L_2fFortnite_2ecom_2fItemization_2fInventoryItemParameterCollection_N_R______ParameterCollection__On__IsActive__Changed
// 0x0060 (0x0060 - 0x0000)
struct InventoryItemParameterCollection__L_2fFortnite_2ecom_2fItemization_2fInventoryItemParameterCollection_N_R______ParameterCollection__On__IsActive__Changed final
{
public:
	struct ItemizationCoreUI_0::Ftuple_L_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0020(0x0010)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0038(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
};

// Function ItemizationCoreUI.InventoryItemParameterCollection._L_2fFortnite_2ecom_2fItemization_2fInventoryItemParameterCollection_N_R______ParameterCollection__On__ItemKey__Changed
// 0x0060 (0x0060 - 0x0000)
struct InventoryItemParameterCollection__L_2fFortnite_2ecom_2fItemization_2fInventoryItemParameterCollection_N_R______ParameterCollection__On__ItemKey__Changed final
{
public:
	struct ItemizationCoreUI_0::Ftuple_L_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0020(0x0010)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0038(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
};

// Function ItemizationCoreUI.InventoryItemParameterCollection._L_2fFortnite_2ecom_2fItemization_2fInventoryItemParameterCollection_N_R______ParameterCollection__On__ItemName__Changed
// 0x0060 (0x0060 - 0x0000)
struct InventoryItemParameterCollection__L_2fFortnite_2ecom_2fItemization_2fInventoryItemParameterCollection_N_R______ParameterCollection__On__ItemName__Changed final
{
public:
	struct ItemizationCoreUI_0::Ftuple_L_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0020(0x0010)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0038(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
};

// Function ItemizationCoreUI.inventory_item_entry_view_model.$InitCDO
// 0x0020 (0x0020 - 0x0000)
struct inventory_item_entry_view_model__InitCDO final
{
public:
	class UInventoryItemParameterCollection*      _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventoryItemParameterCollection*      _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreUI.inventory_item_entry_view_model._L_2fFortnite_2ecom_2fItemization_2finventory__item__entry__view__model_N_RInitializeViewModel_L_Nitem_R
// 0x04E8 (0x04E8 - 0x0000)
struct inventory_item_entry_view_model__L_2fFortnite_2ecom_2fItemization_2finventory__item__entry__view__model_N_RInitializeViewModel_L_Nitem_R final
{
public:
	class Uitem*                                  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x63A8D5FA_DebugLog_1;                     // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_0;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 _ArchetypeFieldValue_1;                            // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x00000000__2;                             // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
	struct ItemizationCoreUI_0::Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R _ExprResult_4;                                     // 0x0048(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0060(0x0010)(HasGetValueTypeHash)
	TOptional<EDiagnostics_log_level>             _ExprResult_6;                                     // 0x0070(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class Uitem_state_component*                  __verse_0xAE65285C_ItemStateComponent_3;           // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uitem_state_component*, true> _ExprResultStack_7;                                // 0x0080(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class Uitem_state_component*>          _ExprResult_8;                                     // 0x0088(0x0010)(ContainsInstancedReference)
	class Uitem*                                  __verse_0x00000000__4;                             // 0x0098(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x00A0(0x0018)(HasGetValueTypeHash)
	class UInventoryItemParameterCollection*      __verse_0x0DD08682___dupe_fresh_6;                 // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xB4E8511F___dupe_fresh_6;                 // 0x00C0(0x0010)(HasGetValueTypeHash)
	FReferenceProperty_                           _LeftHandSide_10;                                  // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Uitem_state_component*                  __verse_0x00000000__7;                             // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x00E8(0x0018)(HasGetValueTypeHash)
	struct ItemizationCoreUI_0::Ftuple_L_R        _ExprResult_12;                                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         _ExprResultStack_13;                               // 0x0108(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         VerseClassVarProxySetterRHS_14;                    // 0x0118(0x0010)(HasGetValueTypeHash)
	class UInventoryItemParameterCollection*      __verse_0x00000000__8;                             // 0x0128(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_15;                         // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_16;                                        // 0x0138(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_17;                                    // 0x0150(0x0010)(HasGetValueTypeHash)
	class UInventoryItemParameterCollection*      __verse_0xD18FEDA7___dupe_fresh_9;                 // 0x0160(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0x3F2058B5___dupe_fresh_9;                 // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FReferenceProperty_                           _LeftHandSide_18;                                  // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResultStack_19;                               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         VerseClassVarProxySetterRHS_20;                    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventoryItemParameterCollection*      __verse_0x00000000__10;                            // 0x0190(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_21;                         // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_22;                                        // 0x01A0(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_23;                                    // 0x01B8(0x0010)(HasGetValueTypeHash)
	int64                                         __verse_0x589418B4_Key_11;                         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<int64>                              _ExprResultStack_24;                               // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_25;                                        // 0x01E0(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Litem_Mtuple_L_R_Mtuple_L_R_R   _ExprResult_26;                                    // 0x01F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct ItemizationCoreUI_0::Ftuple_L_R        _ExprResult_27;                                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct ItemizationCoreUI_0::Ftuple_L_R        _ExprResult_28;                                    // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20A[0x6];                                      // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryItemParameterCollection*      __verse_0x5A47E40D___dupe_fresh_13;                // 0x0210(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0x0C578755___dupe_fresh_13;                // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FReferenceProperty_                           _LeftHandSide_29;                                  // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResultStack_30;                               // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         VerseClassVarProxySetterRHS_31;                    // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventoryItemParameterCollection*      __verse_0x00000000__14;                            // 0x0240(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_32;                         // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_33;                                        // 0x0250(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_34;                                    // 0x0268(0x0010)(HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x63A8D5FA_DebugLog_15;                    // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_35;                               // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 _ArchetypeFieldValue_36;                           // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x00000000__16;                            // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_37;                         // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_38;                                        // 0x02A0(0x0018)(HasGetValueTypeHash)
	struct ItemizationCoreUI_0::Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R _ExprResult_39;                                    // 0x02B8(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_40;                                    // 0x02D0(0x0010)(HasGetValueTypeHash)
	TOptional<EDiagnostics_log_level>             _ExprResult_41;                                    // 0x02E0(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class Uitem_state_component*                  __verse_0xAE65285C_ItemStateComponent_17;          // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Uitem_state_component*, true> _ExprResultStack_42;                               // 0x02F0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class Uitem_state_component*>          _ExprResult_43;                                    // 0x02F8(0x0010)(ContainsInstancedReference)
	class Uitem*                                  __verse_0x00000000__18;                            // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_44;                                        // 0x0310(0x0018)(HasGetValueTypeHash)
	class UInventoryItemParameterCollection*      __verse_0x0DD08682___dupe_fresh_20;                // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xB4E8511F___dupe_fresh_20;                // 0x0330(0x0010)(HasGetValueTypeHash)
	FReferenceProperty_                           _LeftHandSide_45;                                  // 0x0340(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Uitem_state_component*                  __verse_0x00000000__21;                            // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_46;                                        // 0x0358(0x0018)(HasGetValueTypeHash)
	struct ItemizationCoreUI_0::Ftuple_L_R        _ExprResult_47;                                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         _ExprResultStack_48;                               // 0x0378(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         VerseClassVarProxySetterRHS_49;                    // 0x0388(0x0010)(HasGetValueTypeHash)
	class UInventoryItemParameterCollection*      __verse_0x00000000__22;                            // 0x0398(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_50;                         // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_51;                                        // 0x03A8(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_52;                                    // 0x03C0(0x0010)(HasGetValueTypeHash)
	class UInventoryItemParameterCollection*      __verse_0xD18FEDA7___dupe_fresh_23;                // 0x03D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0x3F2058B5___dupe_fresh_23;                // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FReferenceProperty_                           _LeftHandSide_53;                                  // 0x03E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResultStack_54;                               // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         VerseClassVarProxySetterRHS_55;                    // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventoryItemParameterCollection*      __verse_0x00000000__24;                            // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_56;                         // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_57;                                        // 0x0410(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_58;                                    // 0x0428(0x0010)(HasGetValueTypeHash)
	int64                                         __verse_0x589418B4_Key_25;                         // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<int64>                              _ExprResultStack_59;                               // 0x0440(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_60;                                        // 0x0450(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Litem_Mtuple_L_R_Mtuple_L_R_R   _ExprResult_61;                                    // 0x0468(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct ItemizationCoreUI_0::Ftuple_L_R        _ExprResult_62;                                    // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct ItemizationCoreUI_0::Ftuple_L_R        _ExprResult_63;                                    // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A[0x6];                                      // 0x047A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryItemParameterCollection*      __verse_0x5A47E40D___dupe_fresh_27;                // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0x0C578755___dupe_fresh_27;                // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FReferenceProperty_                           _LeftHandSide_64;                                  // 0x0490(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResultStack_65;                               // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         VerseClassVarProxySetterRHS_66;                    // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventoryItemParameterCollection*      __verse_0x00000000__28;                            // 0x04B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_67;                         // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_68;                                        // 0x04C0(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_69;                                    // 0x04D8(0x0010)(HasGetValueTypeHash)
};

// Function ItemizationCoreUI._Root._L_2fFortnite_2ecom_2fItemization_N_Roperator_U_2eGetKeyForParameterCollection_U_L_Ninventory__collection__component_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0020 (0x0020 - 0x0000)
struct _Root__L_2fFortnite_2ecom_2fItemization_N_Roperator_U_2eGetKeyForParameterCollection_U_L_Ninventory__collection__component_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct Ftuple_Linventory__collection__component_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<int64>                              RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreUI._Root._L_2fFortnite_2ecom_2fItemization_N_Roperator_U_2eGetKeyForParameterCollection_U_L_Ninventory__component_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0020 (0x0020 - 0x0000)
struct _Root__L_2fFortnite_2ecom_2fItemization_N_Roperator_U_2eGetKeyForParameterCollection_U_L_Ninventory__component_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct Ftuple_Linventory__component_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<int64>                              RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreUI._Root._L_2fFortnite_2ecom_2fItemization_N_Roperator_U_2eGetKeyForParameterCollection_U_L_Nitem_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0020 (0x0020 - 0x0000)
struct _Root__L_2fFortnite_2ecom_2fItemization_N_Roperator_U_2eGetKeyForParameterCollection_U_L_Nitem_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct Ftuple_Litem_Mtuple_L_R_Mtuple_L_R_R   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<int64>                              RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemizationCoreUI._Root.$InitCDO
// 0x0210 (0x0210 - 0x0000)
struct _Root__InitCDO final
{
public:
	class UAssets_parameter_collection_UE5_definition* _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResultStack_1;                                // 0x0008(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Ltype_Lparameter__collection__UE5__definition_M_20parameter__collection__UE5__definition_R_M_Kchar_R _ExprResult_3;                                     // 0x0030(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x0048(0x0010)(HasGetValueTypeHash)
	class UAssets_parameter_collection_UE5_definition* _ExprResult_5;                                     // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResultStack_6;                                // 0x0060(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0070(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Ltype_Lparameter__collection__UE5__definition_M_20parameter__collection__UE5__definition_R_M_Kchar_R _ExprResult_8;                                     // 0x0088(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_9;                                     // 0x00A0(0x0010)(HasGetValueTypeHash)
	class UAssets_parameter_collection_UE5_definition* _ExprResult_10;                                    // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResultStack_11;                               // 0x00B8(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_12;                                        // 0x00C8(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Ltype_Lparameter__collection__UE5__definition_M_20parameter__collection__UE5__definition_R_M_Kchar_R _ExprResult_13;                                    // 0x00E0(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_14;                                    // 0x00F8(0x0010)(HasGetValueTypeHash)
	class UAssets_parameter_collection_UE5_definition* _ExprResult_15;                                    // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResultStack_16;                               // 0x0110(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_17;                                        // 0x0120(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Ltype_Lparameter__collection__UE5__definition_M_20parameter__collection__UE5__definition_R_M_Kchar_R _ExprResult_18;                                    // 0x0138(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_19;                                    // 0x0150(0x0010)(HasGetValueTypeHash)
	class UAssets_parameter_collection_UE5_definition* _ExprResult_20;                                    // 0x0160(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResultStack_21;                               // 0x0168(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_22;                                        // 0x0178(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Ltype_Lparameter__collection__UE5__definition_M_20parameter__collection__UE5__definition_R_M_Kchar_R _ExprResult_23;                                    // 0x0190(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_24;                                    // 0x01A8(0x0010)(HasGetValueTypeHash)
	class UAssets_parameter_collection_UE5_definition* _ExprResult_25;                                    // 0x01B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResultStack_26;                               // 0x01C0(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_27;                                        // 0x01D0(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Ltype_Lparameter__collection__UE5__definition_M_20parameter__collection__UE5__definition_R_M_Kchar_R _ExprResult_28;                                    // 0x01E8(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_29;                                    // 0x0200(0x0010)(HasGetValueTypeHash)
};

// Function ItemizationCoreUI.inventory_collection_view_model_component.$InitCDO
// 0x04E0 (0x04E0 - 0x0000)
struct inventory_collection_view_model_component__InitCDO final
{
public:
	TOptional<class Uinventory_collection_component*, true> _ExprResult_0;                                     // 0x0000(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0008(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x000A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_2;                                // 0x000B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class Uinventory_component*, class Uinventory_view_model*> _ExprResult_3;                                     // 0x0010(0x0050)(ContainsInstancedReference)
	TMap<EVerseFalse, EVerseFalse>                __verse_0xC87067A2_Map_3;                          // 0x0060(0x0050)(ContainsInstancedReference)
	TMap<class Uinventory_component*, class Uinventory_view_model*> _ForResult_4;                                      // 0x00B0(0x0050)(ContainsInstancedReference)
	int64                                         _ForIndex_5;                                       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x589418B4_Key_5;                          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x31A8F10C_Value_5;                        // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_6 : 1;                                 // 0x010A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_10A_1 : 7;                                  // 0x010A(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_7 : 1;                                 // 0x010B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class Uitem*, class Uinventory_item_entry_view_model*> _ExprResult_8;                                     // 0x0110(0x0050)(ContainsInstancedReference)
	TMap<EVerseFalse, EVerseFalse>                __verse_0xC87067A2_Map_8;                          // 0x0160(0x0050)(ContainsInstancedReference)
	TMap<class Uitem*, class Uinventory_item_entry_view_model*> _ForResult_9;                                      // 0x01B0(0x0050)(ContainsInstancedReference)
	int64                                         _ForIndex_10;                                      // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x589418B4_Key_10;                         // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x31A8F10C_Value_10;                       // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_11 : 1;                                // 0x020A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_20A_1 : 7;                                  // 0x020A(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_12 : 1;                                // 0x020B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UObject*, true>               _ExprResult_13;                                    // 0x0210(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__13;                            // 0x0218(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_14 : 1;                                // 0x021A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_15;                               // 0x021B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UObject*, true>               _ExprResult_16;                                    // 0x0220(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__15;                            // 0x0228(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_17 : 1;                                // 0x022A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_18;                               // 0x022B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UObject*, true>               _ExprResult_19;                                    // 0x0230(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__17;                            // 0x0238(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_20 : 1;                                // 0x023A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_21;                               // 0x023B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UObject*, true>               _ExprResult_22;                                    // 0x0240(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__19;                            // 0x0248(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_23 : 1;                                // 0x024A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_24;                               // 0x024B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UObject*, true>               _ExprResult_25;                                    // 0x0250(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__21;                            // 0x0258(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_26 : 1;                                // 0x025A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_27;                               // 0x025B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryCollectionParameterCollection* _ExprResult_28;                                    // 0x0260(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_29;                               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class Uinventory_collection_component*, true> _ExprResult_30;                                    // 0x0270(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__23;                            // 0x0278(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_31 : 1;                                // 0x027A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_32;                               // 0x027B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class Uinventory_component*, class Uinventory_view_model*> _ExprResult_33;                                    // 0x0280(0x0050)(ContainsInstancedReference)
	TMap<EVerseFalse, EVerseFalse>                __verse_0xC87067A2_Map_25;                         // 0x02D0(0x0050)(ContainsInstancedReference)
	TMap<class Uinventory_component*, class Uinventory_view_model*> _ForResult_34;                                     // 0x0320(0x0050)(ContainsInstancedReference)
	int64                                         _ForIndex_35;                                      // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x589418B4_Key_27;                         // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x31A8F10C_Value_27;                       // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_36 : 1;                                // 0x037A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_37A_1 : 7;                                  // 0x037A(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_37 : 1;                                // 0x037B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class Uitem*, class Uinventory_item_entry_view_model*> _ExprResult_38;                                    // 0x0380(0x0050)(ContainsInstancedReference)
	TMap<EVerseFalse, EVerseFalse>                __verse_0xC87067A2_Map_30;                         // 0x03D0(0x0050)(ContainsInstancedReference)
	TMap<class Uitem*, class Uinventory_item_entry_view_model*> _ForResult_39;                                     // 0x0420(0x0050)(ContainsInstancedReference)
	int64                                         _ForIndex_40;                                      // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x589418B4_Key_32;                         // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x31A8F10C_Value_32;                       // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_41 : 1;                                // 0x047A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_47A_1 : 7;                                  // 0x047A(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_42 : 1;                                // 0x047B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UObject*, true>               _ExprResult_43;                                    // 0x0480(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__35;                            // 0x0488(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_44 : 1;                                // 0x048A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_45;                               // 0x048B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48D[0x3];                                      // 0x048D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UObject*, true>               _ExprResult_46;                                    // 0x0490(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__37;                            // 0x0498(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_47 : 1;                                // 0x049A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_48;                               // 0x049B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49D[0x3];                                      // 0x049D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UObject*, true>               _ExprResult_49;                                    // 0x04A0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__39;                            // 0x04A8(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_50 : 1;                                // 0x04AA(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_51;                               // 0x04AB(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AD[0x3];                                      // 0x04AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UObject*, true>               _ExprResult_52;                                    // 0x04B0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__41;                            // 0x04B8(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
