#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemizationCoreUI_0

#include "Basic.hpp"

#include "UnrealEngineExperimental_0_structs.hpp"


namespace SDK
{

// VerseStruct ItemizationCoreUI.tuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R
// 0x0018 (0x0018 - 0x0000)
struct ItemizationCoreUI_0::Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<EDiagnostics_log_level>             __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0002)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct ItemizationCoreUI.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct ItemizationCoreUI_0::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct ItemizationCoreUI.tuple_Linventory__collection__component_Mtuple_L_R_Mtuple_L_R_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Linventory__collection__component_Mtuple_L_R_Mtuple_L_R_R final
{
public:
	class Uinventory_collection_component*        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct ItemizationCoreUI_0::Ftuple_L_R        __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct ItemizationCoreUI_0::Ftuple_L_R        __verse_0x932BF92E_Elem2;                          // 0x0009(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct ItemizationCoreUI.tuple_Linventory__component_Mtuple_L_R_Mtuple_L_R_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Linventory__component_Mtuple_L_R_Mtuple_L_R_R final
{
public:
	class Uinventory_component*                   __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct ItemizationCoreUI_0::Ftuple_L_R        __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct ItemizationCoreUI_0::Ftuple_L_R        __verse_0x932BF92E_Elem2;                          // 0x0009(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct ItemizationCoreUI.tuple_Litem_Mtuple_L_R_Mtuple_L_R_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Litem_Mtuple_L_R_Mtuple_L_R_R final
{
public:
	class Uitem*                                  __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct ItemizationCoreUI_0::Ftuple_L_R        __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct ItemizationCoreUI_0::Ftuple_L_R        __verse_0x932BF92E_Elem2;                          // 0x0009(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct ItemizationCoreUI.tuple_Lsupertype_Lany_R_M_Kchar_R
// 0x0018 (0x0018 - 0x0000)
struct ItemizationCoreUI_0::Ftuple_Lsupertype_Lany_R_M_Kchar_R final
{
public:
	class UClass*                                 __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct ItemizationCoreUI.tuple_Ltype_Lparameter__collection__UE5__definition_M_20parameter__collection__UE5__definition_R_M_Kchar_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Ltype_Lparameter__collection__UE5__definition_M_20parameter__collection__UE5__definition_R_M_Kchar_R final
{
public:
	class UClass*                                 __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, HasGetValueTypeHash)
};

}

