#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoWorldManagement

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum JunoWorldManagement.EJunoWorldOccupantKind
// NumValues: 0x0005
enum class EJunoWorldOccupantKind : uint8
{
	Owner                                    = 0,
	Keyholder                                = 1,
	Guest                                    = 2,
	Count                                    = 3,
	EJunoWorldOccupantKind_MAX               = 4,
};

// Enum JunoWorldManagement.EJunoWorldSettingOptions_BuildMode
// NumValues: 0x0005
enum class EJunoWorldSettingOptions_BuildMode : uint8
{
	Survival                                 = 0,
	Sandbox                                  = 1,
	Hardcore                                 = 2,
	Cozy                                     = 3,
	EJunoWorldSettingOptions_MAX             = 4,
};

// Enum JunoWorldManagement.EJunoWorldSettingOptions_Difficulty
// NumValues: 0x0004
enum class EJunoWorldSettingOptions_Difficulty : uint8
{
	Normal                                   = 0,
	Hardcore                                 = 1,
	Easy                                     = 2,
	EJunoWorldSettingOptions_MAX             = 3,
};

// Enum JunoWorldManagement.EJunoWorldSettingOptions_Death
// NumValues: 0x0004
enum class EJunoWorldSettingOptions_Death : uint8
{
	On                                       = 0,
	Off                                      = 1,
	Permanent                                = 2,
	EJunoWorldSettingOptions_MAX             = 3,
};

// Enum JunoWorldManagement.EJunoWorldSettingOptions_CreatureActivation
// NumValues: 0x0003
enum class EJunoWorldSettingOptions_CreatureActivation : uint8
{
	On                                       = 0,
	Off                                      = 1,
	EJunoWorldSettingOptions_MAX             = 2,
};

// Enum JunoWorldManagement.EJunoWorldSettingOptions_RecruitedCreaturePermaDeath
// NumValues: 0x0003
enum class EJunoWorldSettingOptions_RecruitedCreaturePermaDeath : uint8
{
	On                                       = 0,
	Off                                      = 1,
	EJunoWorldSettingOptions_MAX             = 2,
};

// Enum JunoWorldManagement.EJunoWorldSettingOptions_WorldSwitch
// NumValues: 0x0003
enum class EJunoWorldSettingOptions_WorldSwitch : uint8
{
	On                                       = 0,
	Off                                      = 1,
	EJunoWorldSettingOptions_MAX             = 2,
};

// Enum JunoWorldManagement.EJunoWorldSettingCategory
// NumValues: 0x0004
enum class EJunoWorldSettingCategory : uint8
{
	None                                     = 0,
	Basic                                    = 1,
	Advanced                                 = 2,
	EJunoWorldSettingCategory_MAX            = 3,
};

// ScriptStruct JunoWorldManagement.JunoWorldGameplayProperty
// 0x0020 (0x0020 - 0x0000)
struct FJunoWorldGameplayProperty final
{
public:
	class FString                                 Id;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Value;                                             // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoWorldManagement.JunoWorldGameMetadata
// 0x0060 (0x0060 - 0x0000)
struct FJunoWorldGameMetadata final
{
public:
	int32                                         PersistenceVersion;                                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AdventureSeed;                                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Title;                                             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CustomName;                                        // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              CustomNameChangeAllowedAt;                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FJunoWorldGameplayProperty>     GameplayProperties;                                // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           TaintedGameplayProperties;                         // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoWorldManagement.JunoWorldMetadata
// 0x0070 (0x0070 - 0x0000)
struct FJunoWorldMetadata final
{
public:
	class FString                                 Id;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoWorldGameMetadata                 Game;                                              // 0x0010(0x0060)(NativeAccessSpecifierPublic)
};

// ScriptStruct JunoWorldManagement.JunoWorldQuery
// 0x0078 (0x0078 - 0x0000)
struct FJunoWorldQuery final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoWorldMetadata                     Metadata;                                          // 0x0008(0x0070)(NativeAccessSpecifierPublic)
};

// ScriptStruct JunoWorldManagement.JunoWorldQueryResult
// 0x0008 (0x0008 - 0x0000)
struct FJunoWorldQueryResult final
{
public:
	class UJunoUserWorldView*                     UserWorldView;                                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoWorldManagement.JunoWorldSettingOptionRow
// 0x0040 (0x0040 - 0x0000)
struct FJunoWorldSettingOptionRow final
{
public:
	class FName                                   Id;                                                // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTag                           OptionTag;                                         // 0x0030(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoWorldManagement.JunoWorldSettingRow
// 0x0078 (0x0080 - 0x0008)
struct FJunoWorldSettingRow final : public FTableRowBase
{
public:
	class FText                                   SettingName;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SettingTag;                                        // 0x0018(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoWorldSettingCategory                     Category;                                          // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  CanDefaultBeChangedPerMode;                        // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<bool>                                  CanChangePostCreation;                             // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 DefaultOptionPerMode;                              // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           DefaultWhenMissing;                                // 0x0058(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoWorldSettingOptionRow>     Options;                                           // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bCanBeLocked;                                      // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockQuestProgressIfChanged;                      // 0x0079(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

