#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoCoreUI

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "JunoWorldManagement_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "JunoCoreUI_structs.hpp"
#include "ModelViewViewModel_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class JunoCoreUI.JunoIndexedWidgetInterface
// 0x0000 (0x0030 - 0x0030)
class IJunoIndexedWidgetInterface final : public IInterface
{
public:
	void SetWidgetIndex(int32 InIndex);
	void TriggerWidgetInitialized();
	void TriggerWidgetUpdated();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoIndexedWidgetInterface">();
	}
	static class IJunoIndexedWidgetInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoIndexedWidgetInterface>();
	}
};

// Class JunoCoreUI.JunoPlayerAvatarContainer
// 0x0008 (0x0490 - 0x0488)
class UJunoPlayerAvatarContainer final : public UFortHUDElementWidget
{
public:
	class UFortPlayerAvatarViewModel*             PlayerAvatarViewModel;                             // 0x0488(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void RepresentLocalPlayer(class UFortPlayerAvatarViewModel* InPlayerAvatarViewModel);
	void RepresentRemotePlayer(const struct FUniqueNetIdRepl& UniqueId, class UFortPlayerAvatarViewModel* InPlayerAvatarViewModel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPlayerAvatarContainer">();
	}
	static class UJunoPlayerAvatarContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPlayerAvatarContainer>();
	}
};

// Class JunoCoreUI.JunoPlayerCardViewModel
// 0x00A0 (0x0110 - 0x0070)
class UJunoPlayerCardViewModel final : public UMVVMViewModelBase
{
public:
	class FText                                   PlayerName;                                        // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	EJunoWorldOccupantKind                        PlayerRole;                                        // 0x0080(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EJunoPlayerCardStatus                         PlayerStatus;                                      // 0x0081(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsInParty;                                         // 0x0082(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsViewOnly;                                        // 0x0083(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsFriendsWithWorldOwner;                           // 0x0084(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsEliminated;                                      // 0x0085(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumKeysLeft;                                       // 0x0088(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsLocalSplitscreenPlayer;                          // 0x008C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       UniqueNetId;                                       // 0x0090(0x0030)(BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPlayerControllerAthena*            OwningPlayerController;                            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USocialActionMenu>          OpenProfileActionMenuClass;                        // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D0[0x20];                                      // 0x00D0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnWorldKeyGranted;                                 // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnWorldKeyRevoked;                                 // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void GrantWorldKey();
	void KickWorldUser();
	void OpenSidebarUserProfile(class UCommonActivatableWidget* CurrentStateWidget, class ULocalPlayer* LocalPlayer);
	void RevokeWorldKey();
	void ShowNotificationToast(const class AFortPlayerController* FortPlayerController, const class FText& Title, const class FText& Description, EFortNotificationType NotificationType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPlayerCardViewModel">();
	}
	static class UJunoPlayerCardViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPlayerCardViewModel>();
	}
};

// Class JunoCoreUI.JunoPlayerManagementViewModel
// 0x0078 (0x00E8 - 0x0070)
class UJunoPlayerManagementViewModel final : public UMVVMViewModelBase
{
public:
	TArray<class UJunoPlayerCardViewModel*>       NeedsInvitePlayerCards;                            // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UJunoPlayerCardViewModel*>       InWorldPlayerCards;                                // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UJunoPlayerCardViewModel*>       NotInWorldPlayerCards;                             // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UJunoPlayerCardViewModel*               SelectedPlayerCard;                                // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EJunoWorldSanctionType                        WorldSanctionType;                                 // 0x00A8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumKeysLeft;                                       // 0x00AC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumSpotsLeft;                                      // 0x00B0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   WorldName;                                         // 0x00B8(0x0010)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class FText                                   OwnerName;                                         // 0x00C8(0x0010)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                          IsWorldOwner;                                      // 0x00D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsViewOnly;                                        // 0x00D9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumSurvivingKeyholders;                            // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxNumOfPlayers;                                   // 0x00E0(0x0004)(ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxNumOfKeys;                                      // 0x00E4(0x0004)(ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetupDummyData();
	void UpdateFromData(class APlayerController* WidgetOwner, const class UJunoWorld* JunoWorld);

	bool IsInGame() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPlayerManagementViewModel">();
	}
	static class UJunoPlayerManagementViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPlayerManagementViewModel>();
	}
};

// Class JunoCoreUI.JunoSettingRotator
// 0x0000 (0x1870 - 0x1870)
class UJunoSettingRotator final : public UCommonRotator
{
public:
	void SetAllowNavigationControl(bool InAllowNavigationControl);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoSettingRotator">();
	}
	static class UJunoSettingRotator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoSettingRotator>();
	}
};

// Class JunoCoreUI.JunoUGCViewModel
// 0x0068 (0x00D8 - 0x0070)
class UJunoUGCViewModel final : public UMVVMViewModelBase
{
public:
	class FString                                 ContextId;                                         // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ContextEntity;                                     // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   CurrentText;                                       // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   DefaultText;                                       // 0x00A0(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                          bPendingSave;                                      // 0x00B0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCharLimitReached;                                 // 0x00B1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bContainsSpecialChar;                              // 0x00B2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bContainsProfanity;                                // 0x00B3(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCustomValidationFailed;                           // 0x00B4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTextIsValid;                                      // 0x00B5(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bGenericErrorOccurred;                             // 0x00B6(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B7[0x21];                                      // 0x00B7(0x0021)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTextIfValid(const bool bIsValid, const class FText& ValidText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoUGCViewModel">();
	}
	static class UJunoUGCViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoUGCViewModel>();
	}
};

// Class JunoCoreUI.JunoWorldDataViewModel
// 0x0140 (0x01B0 - 0x0070)
class UJunoWorldDataViewModel final : public UMVVMViewModelBase
{
public:
	class FText                                   WorldName;                                         // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	int32                                         WorldSlotNumber;                                   // 0x0080(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   WorldOwner;                                        // 0x0088(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FUniqueNetIdRepl                       WorldOwnerId;                                      // 0x0098(0x0030)(BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDateTime                              CreationDate;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDateTime                              LastPlayed;                                        // 0x00D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   TimePlayed;                                        // 0x00D8(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsEliminated;                                     // 0x00E8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumSurvivingKeyholders;                            // 0x00EC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsCreateFlow;                                     // 0x00F0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsEmptyWorldSlot;                                 // 0x00F1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsNewInvitation;                                  // 0x00F2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoWorldImageObject*                  WorldImageObj;                                     // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ActivePlayers;                                     // 0x0100(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         GrantedKeys;                                       // 0x0104(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoWorldSettingViewModel*             NameVM;                                            // 0x0108(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoWorldSettingViewModel*             ModeVM;                                            // 0x0110(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoWorldSettingViewModel*             ImageVM;                                           // 0x0118(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoWorldSettingViewModel*             SeedVM;                                            // 0x0120(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSettingsLocked;                                   // 0x0128(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSettingsChangedAfterGeneration;                   // 0x0129(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxPlayersInWorld;                                 // 0x012C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMatchmakingErrorType                         MatchmakingError;                                  // 0x0130(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESanctionType                                 SanctionType;                                      // 0x0131(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsSharedWorld;                                    // 0x0132(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsCustom;                                         // 0x0133(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanBeSaved;                                       // 0x0134(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllowWorldUGCCreation;                            // 0x0135(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsInCabinMode;                                    // 0x0136(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_137[0x29];                                     // 0x0137(0x0029)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJunoWorldSettingViewModel*>     AdvancedSettingsList;                              // 0x0160(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UJunoWorldImageObject*>          WorldImageList;                                    // 0x0170(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_180[0x10];                                     // 0x0180(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 WorldId;                                           // 0x0190(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoWorld*                             OriginalData;                                      // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortPlayerController*                  WidgetOwnerPC;                                     // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void AcknowledgePendingAction();
	void CancelChanges();
	bool CheckWorldMatchmakingAvailability();
	void DeleteWorld(TDelegate<void(bool RequestResult)> CompletedDelegate);
	EJunoUserGeneratedTextErrorType GetNextPendingAction();
	void HandlePlayClicked();
	void RemoveSharedWorld(TDelegate<void(bool RequestResult)> CompletedDelegate);
	void RenameWorld(TDelegate<void(bool RequestResult)> CompletedDelegate);
	void SaveChanges(TDelegate<void(bool RequestResult)> CompletedDelegate);

	class FText GetCreationDateFormatted() const;
	class FText GetLastPlayedFormatted() const;
	int32 GetSelectedWorldImageIndex() const;
	TArray<class FText> GetTagNames() const;
	bool HasChanges() const;
	bool HasPendingActions() const;
	bool WorldCanBeRenamed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWorldDataViewModel">();
	}
	static class UJunoWorldDataViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWorldDataViewModel>();
	}
};

// Class JunoCoreUI.JunoWorldImageObject
// 0x0028 (0x0058 - 0x0030)
class UJunoWorldImageObject final : public UObject
{
public:
	TMulticastInlineDelegate<void(TSoftObjectPtr<class UTexture2D> NewTexture)> OnTextureUpdated;                                  // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    RowHandle;                                         // 0x0040(0x0018)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void UpdateImageReference(const class FName& NewRowName);

	const class FName GetImageReferenceName() const;
	TSoftObjectPtr<class UTexture2D> GetTexture() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWorldImageObject">();
	}
	static class UJunoWorldImageObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWorldImageObject>();
	}
};

// Class JunoCoreUI.JunoWorldSettingViewModel
// 0x00D0 (0x0140 - 0x0070)
class UJunoWorldSettingViewModel final : public UMVVMViewModelBase
{
public:
	class FString                                 SettingId;                                         // 0x0070(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   SettingName;                                       // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	EJunoWorldSettingCategory                     SettingCategory;                                   // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedOption;                                    // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SelectedModeIndex;                                 // 0x0098(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  CanDefaultBeChangedPerMode;                        // 0x00A0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<bool>                                  CanChangePostCreation;                             // 0x00B0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 DefaultOptionPerMode;                              // 0x00C0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         NumericValue;                                      // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoUGCViewModel*                      UGCViewModel;                                      // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsGameMode;                                       // 0x00E0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bContainsUGC;                                      // 0x00E1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoWorldSettingOptionRow>     OptionList;                                        // 0x00E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>              SettingImage;                                      // 0x00F8(0x0030)(BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowDefaultTag;                                   // 0x0128(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsCustom;                                         // 0x0129(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsLocked;                                         // 0x012A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanBeLocked;                                      // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBlockQuestProgressIfChanged;                      // 0x012C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_12D[0x13];                                     // 0x012D(0x0013)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetCurrentDefaultIndex() const;
	const class FText GetOptionDescription() const;
	const class FText GetOptionName() const;
	bool IsDefaultOptionSelected() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWorldSettingViewModel">();
	}
	static class UJunoWorldSettingViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWorldSettingViewModel>();
	}
};

// Class JunoCoreUI.JunoDropSplitModal
// 0x0028 (0x05A0 - 0x0578)
class UJunoDropSplitModal final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x20];                                     // 0x0578(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_Confirm;                                    // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleConfirmOperation(EJunoContextMenuAction InActionType, int32 InDesiredCount);
	void HandleQuantityChanged(EJunoContextMenuAction InActionType, int32 InUpdatedCount);
	void OnOperationSet(EJunoContextMenuAction ActionType, const class FText& ActionText, int32 StackCount, int32 QuantityDisplayMultiplier);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoDropSplitModal">();
	}
	static class UJunoDropSplitModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoDropSplitModal>();
	}
};

// Class JunoCoreUI.JunoContextMenu
// 0x00A8 (0x0620 - 0x0578)
class UJunoContextMenu final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x38];                                     // 0x0578(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EJunoContextMenuAction, class FText>     MenuActionToDisplayText;                           // 0x05B0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UJunoDropSplitModal*                    Widget_QuantitySelector;                           // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    BackAction;                                        // 0x0608(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)

public:
	TSet<EJunoContextMenuAction> GetAllAvailableActions();
	void HandleContextEntrySelected(EJunoContextMenuAction MenuAction);
	void OnAddMenuEntry(EJunoContextMenuAction MenuAction, bool bDisabled);
	void OnShowQuantitySelectorState();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoContextMenu">();
	}
	static class UJunoContextMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoContextMenu>();
	}
};

// Class JunoCoreUI.JunoSanitizedEditableText
// 0x0080 (0x12A0 - 0x1220)
class UJunoSanitizedEditableText final : public UEditableTextBox
{
public:
	TMulticastInlineDelegate<void()>              OnCharacterLimitReached;                           // 0x1218(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsInvalid)> OnInvalidCharacterUsed;                            // 0x1228(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnProfanityDetected;                               // 0x1238(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsValid, class FText& ValidText)> OnTextIsValid;                                     // 0x1248(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         CharacterLimit;                                    // 0x1258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CharacterCount;                                    // 0x125C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ContextId;                                         // 0x1260(0x0010)(BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ContextEntity;                                     // 0x1270(0x0010)(BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1280[0x20];                                    // 0x1280(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCharacterLimit(int32 NewValue);
	void SetPredefinedText(const class FText& InPredefinedText);

	int32 GetCharacterCount() const;
	int32 GetCharacterLimit() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoSanitizedEditableText">();
	}
	static class UJunoSanitizedEditableText* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoSanitizedEditableText>();
	}
};

// Class JunoCoreUI.JunoTouchControlsHelp
// 0x0028 (0x05A0 - 0x0578)
class UJunoTouchControlsHelp final : public UCommonActivatableWidget
{
public:
	class UCommonButtonBase*                      Button_TouchClose;                                 // 0x0578(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    CloseAction;                                       // 0x0580(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_598[0x8];                                      // 0x0598(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoTouchControlsHelp">();
	}
	static class UJunoTouchControlsHelp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoTouchControlsHelp>();
	}
};

// Class JunoCoreUI.JunoWorldSettingsScreenBase
// 0x0010 (0x0588 - 0x0578)
class UJunoWorldSettingsScreenBase final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x10];                                     // 0x0578(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWorldSettingsScreenBase">();
	}
	static class UJunoWorldSettingsScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWorldSettingsScreenBase>();
	}
};

}

