#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoCraftingBaseUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CraftingRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct JunoCraftingBaseUI.JunoCraftingIngredientShopUIData
// 0x0018 (0x0068 - 0x0050)
struct FJunoCraftingIngredientShopUIData final : public FCraftingIngredientUIData
{
public:
	class FText                                   DisplayName;                                       // 0x0050(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EFortRarity                                   Rarity;                                            // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoCraftingBaseUI.JunoBuildingFrontendUIData
// 0x0010 (0x0018 - 0x0008)
struct FJunoBuildingFrontendUIData final : public FTableRowBase
{
public:
	TArray<class FName>                           RequiredRecipes;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoCraftingBaseUI.JunoPropFrontendUIData
// 0x0010 (0x0018 - 0x0008)
struct FJunoPropFrontendUIData final : public FTableRowBase
{
public:
	class FText                                   DisplayName;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

}

