#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoGameNative

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayGraph_structs.hpp"
#include "Engine_structs.hpp"
#include "CraftingRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AnimationLayeringRuntime_structs.hpp"
#include "JunoGameNative_structs.hpp"
#include "BuilderTool_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SmartObjectsModule_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GeometryCollectionEngine_structs.hpp"
#include "DataRegistry_structs.hpp"


namespace SDK::Params
{

// Function JunoGameNative.JunoInputMappingComponentData.SetEventTag
// 0x000C (0x000C - 0x0000)
struct JunoInputMappingComponentData_SetEventTag final
{
public:
	struct FGameplayTag                           InTag;                                             // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoInputMappingComponentData.GetEventTag
// 0x000C (0x000C - 0x0000)
struct JunoInputMappingComponentData_GetEventTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingTrackedActorInterface.GetNetRelevanceDistanceOverride
// 0x0004 (0x0004 - 0x0000)
struct JunoBuildingTrackedActorInterface_GetNetRelevanceDistanceOverride final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingTrackedActorInterface.GetNumberOfRelevantActors
// 0x0004 (0x0004 - 0x0000)
struct JunoBuildingTrackedActorInterface_GetNumberOfRelevantActors final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingTrackedActorInterface.ShouldBeTrackedByMetrics
// 0x0001 (0x0001 - 0x0000)
struct JunoBuildingTrackedActorInterface_ShouldBeTrackedByMetrics final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAbility_PlayerPushPhysicsObject.OnEnergyDrained
// 0x0008 (0x0008 - 0x0000)
struct JunoAbility_PlayerPushPhysicsObject_OnEnergyDrained final
{
public:
	class UFortComponent_Energy*                  EnergyComponentDrained;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAbility_PlayerPushPhysicsObject.OnEnergyFullyRecharged
// 0x0008 (0x0008 - 0x0000)
struct JunoAbility_PlayerPushPhysicsObject_OnEnergyFullyRecharged final
{
public:
	class UFortComponent_Energy*                  EnergyComponentRecharged;                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAbility_PlayerPushPhysicsObject.OnPlayerHit
// 0x0130 (0x0130 - 0x0000)
struct JunoAbility_PlayerPushPhysicsObject_OnPlayerHit final
{
public:
	class AActor*                                 HitPlayer;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 HitActor;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0028(0x0108)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAbility_PlayerPushPhysicsObject.GetMontageToPlay
// 0x0008 (0x0008 - 0x0000)
struct JunoAbility_PlayerPushPhysicsObject_GetMontageToPlay final
{
public:
	class UAnimMontage*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingPreviewComponent.GetOwningPreviewRef
// 0x0160 (0x0160 - 0x0000)
struct JunoBuildingPreviewComponent_GetOwningPreviewRef final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoBuildingSelectionPreview          ReturnValue;                                       // 0x0010(0x0150)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingPreviewComponent.GetPreviewer
// 0x0008 (0x0008 - 0x0000)
struct JunoBuildingPreviewComponent_GetPreviewer final
{
public:
	const class AJunoBuildingPreviewer*           ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingPreviewComponent.GetSourceActorClass
// 0x0008 (0x0008 - 0x0000)
struct JunoBuildingPreviewComponent_GetSourceActorClass final
{
public:
	TSubclassOf<class AActor>                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingPreviewComponent.IsSet
// 0x0001 (0x0001 - 0x0000)
struct JunoBuildingPreviewComponent_IsSet final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoGuidedBuildingPreviewComponent.GetBuildableCollision
// 0x0008 (0x0008 - 0x0000)
struct JunoGuidedBuildingPreviewComponent_GetBuildableCollision final
{
public:
	class UBoxComponent*                          ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoGuidedBuildingPreviewComponent.GetFoundationCollision
// 0x0008 (0x0008 - 0x0000)
struct JunoGuidedBuildingPreviewComponent_GetFoundationCollision final
{
public:
	class UBoxComponent*                          ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAthenaCharacterItemOverrideDefinition.DoesDetailsLevelVariantChannelExistOnBaseCID
// 0x0001 (0x0001 - 0x0000)
struct JunoAthenaCharacterItemOverrideDefinition_DoesDetailsLevelVariantChannelExistOnBaseCID final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAthenaCharacterItemOverrideDefinition.SetBaseAthenaCharacterItemDefinition
// 0x0030 (0x0030 - 0x0000)
struct JunoAthenaCharacterItemOverrideDefinition_SetBaseAthenaCharacterItemDefinition final
{
public:
	TSoftObjectPtr<class UAthenaCharacterItemDefinition> InBaseAthenaCharacterItemDefinition;               // 0x0000(0x0030)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAthenaDanceItemOverrideDefinition.SetBaseAthenaDanceItemDefinition
// 0x0030 (0x0030 - 0x0000)
struct JunoAthenaDanceItemOverrideDefinition_SetBaseAthenaDanceItemDefinition final
{
public:
	TSoftObjectPtr<class UAthenaDanceItemDefinition> InBaseAthenaDanceItemDefinition;                   // 0x0000(0x0030)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoActorAttributeOverrideComponent.GetPrimaryLootTier
// 0x000C (0x000C - 0x0000)
struct JunoActorAttributeOverrideComponent_GetPrimaryLootTier final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoActorAttributeOverrideComponent.GetSecondaryLootTier
// 0x000C (0x000C - 0x0000)
struct JunoActorAttributeOverrideComponent_GetSecondaryLootTier final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoMarkerRefinementComponent.ClientPlaceMarker
// 0x0020 (0x0020 - 0x0000)
struct JunoMarkerRefinementComponent_ClientPlaceMarker final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedsRefinement;                                  // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoGameNative.JunoMarkerRefinementComponent.ServerPlaceMarker
// 0x0010 (0x0010 - 0x0000)
struct JunoMarkerRefinementComponent_ServerPlaceMarker final
{
public:
	struct FVector2D                              InLocation;                                        // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAlterationCraftingComponent.HandleCraftingStateChanged
// 0x0028 (0x0028 - 0x0000)
struct JunoAlterationCraftingComponent_HandleCraftingStateChanged final
{
public:
	struct FCraftingObjectStateChangedEvent       Event;                                             // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAlterationCraftingComponent.OnCheckValidItemType
// 0x0020 (0x0020 - 0x0000)
struct JunoAlterationCraftingComponent_OnCheckValidItemType final
{
public:
	struct FCraftingObjectAdditionalValidationEvent Payload;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoGameNative.JunoAlterationCraftingComponent.OnCraftingSuccess
// 0x0038 (0x0038 - 0x0000)
struct JunoAlterationCraftingComponent_OnCraftingSuccess final
{
public:
	struct FCraftingObjectSuccessEvent            Event;                                             // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAsyncAction_WaitForEventRouter.WaitForEventRouter
// 0x0010 (0x0010 - 0x0000)
struct JunoAsyncAction_WaitForEventRouter_WaitForEventRouter final
{
public:
	class AActor*                                 ContextActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoAsyncAction_WaitForEventRouter*    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAsyncAction_WaitForRootPlayspace.RootPlayspaceReadyAsync
// 0x0010 (0x0010 - 0x0000)
struct JunoAsyncAction_WaitForRootPlayspace_RootPlayspaceReadyAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoAsyncAction_WaitForRootPlayspace*  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.DebugDrawConnectionLocations
// 0x01E0 (0x01E0 - 0x0000)
struct JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnectionLocations final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoBuildingConnection                Connection;                                        // 0x0010(0x01D0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.DebugDrawConnections
// 0x0290 (0x0290 - 0x0000)
struct JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnections final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoBuildingConnectionPointsResult    Candidates;                                        // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FJunoBuildingConnectionPointsResult    Targets;                                           // 0x0058(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoBuildingConnection                ChosenConnection;                                  // 0x00B0(0x01D0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FJunoBuildingConnection>        Connections;                                       // 0x0280(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.GetAtomModelAssetUserData
// 0x0018 (0x0018 - 0x0000)
struct JunoBuildingConnectivityBlueprintLibrary_GetAtomModelAssetUserData final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAtomModelAssetUserData*>        ReturnValue;                                       // 0x0008(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.GetKnobs
// 0x0060 (0x0060 - 0x0000)
struct JunoBuildingConnectivityBlueprintLibrary_GetKnobs final
{
public:
	struct FJunoBuildingConnectionPointsResult    Result;                                            // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FJunoBuildingConnectionPoint>   ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPassiveResourcesGatheringComponent.OverrideGatheringRow
// 0x0020 (0x0020 - 0x0000)
struct JunoPassiveResourcesGatheringComponent_OverrideGatheringRow final
{
public:
	struct FDataTableRowHandle                    GatheringRow;                                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoGameNative.JunoPlayerCampPawnComponent.HandleAwesomeLevelChanged
// 0x0018 (0x0018 - 0x0000)
struct JunoPlayerCampPawnComponent_HandleAwesomeLevelChanged final
{
public:
	struct FJunoAwesomeLevelChangeData            ChangeData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingProp.GetAssociatedItem
// 0x0008 (0x0008 - 0x0000)
struct JunoBuildingProp_GetAssociatedItem final
{
public:
	const class UItemDefinitionBase*              ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingPropTree.BlueprintCanDieInLifecyclePhase
// 0x0002 (0x0002 - 0x0000)
struct JunoBuildingPropTree_BlueprintCanDieInLifecyclePhase final
{
public:
	uint8                                         CurrentPhaseIndex;                                 // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.CheckViewTargetTags
// 0x0010 (0x0010 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_CheckViewTargetTags final
{
public:
	const class AActor*                           InViewTargetActor;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutIsTargetBuilding;                              // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutIsTargetFalling;                               // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutIsTargetInConversation;                        // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutIsTargetAttackingMelee;                        // 0x000B(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutIsTargetStrafing;                              // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.ComputeBasePlatformVelocity
// 0x0020 (0x0020 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_ComputeBasePlatformVelocity final
{
public:
	class UCharacterMovementComponent*            CharacterMovementComponent;                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.ComputeBuildingPreviewSizeScalar
// 0x0038 (0x0038 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_ComputeBuildingPreviewSizeScalar final
{
public:
	double                                        InBuildingPreviewSizeScalar;                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InViewTargetActor;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInIsTargetBuilding;                               // 0x0010(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialParameterCollection*           InCollection;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InBuildingSizeMin;                                 // 0x0020(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InBuildingSizeMax;                                 // 0x0028(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutBuildingPreviewSizeScalar;                      // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.ComputeCameraOriginInterpSpeed
// 0x0050 (0x0050 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_ComputeCameraOriginInterpSpeed final
{
public:
	bool                                          bIsTargetAttackingMelee;                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsTargetFalling;                                   // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NonAttackingFollowInterp;                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        AttackingFollowInterp;                             // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        CurFollowBlendInterp;                              // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        NonGroundedZInterp;                                // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        GroundedZInterp;                                   // 0x0028(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        CurGroundedBlendInterp;                            // 0x0030(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.ComputeCameraSpaceForwardDistance
// 0x0020 (0x0020 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_ComputeCameraSpaceForwardDistance final
{
public:
	double                                        CameraSpaceForwardDistance;                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DesiredForwardDistance;                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DeltaTime;                                         // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.ComputeCameraSpaceViewOffset
// 0x00A8 (0x00A8 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_ComputeCameraSpaceViewOffset final
{
public:
	struct FInterpOffset                          CameraSpaceViewOffset;                             // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                CurCamSpaceViewOffset;                             // 0x0048(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpOffset                          ReturnValue;                                       // 0x0060(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.ComputeCurCamSpaceViewOffset
// 0x0088 (0x0088 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_ComputeCurCamSpaceViewOffset final
{
public:
	struct FVector                                CurCamSpaceViewOffset;                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTargetInConversation;                           // 0x001C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterpOffset                          CameraSpaceViewOffset;                             // 0x0020(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         InteriorCamZOffset;                                // 0x0068(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConfinedWieghtSpace;                               // 0x006C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0070(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.ComputeCurFollowBlendInterp
// 0x0020 (0x0020 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_ComputeCurFollowBlendInterp final
{
public:
	bool                                          bIsTargetAttackingMelee;                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurFollowBlendInterp;                              // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DeltaTime;                                         // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.ComputeCurGroundedBlendInterp
// 0x0020 (0x0020 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_ComputeCurGroundedBlendInterp final
{
public:
	bool                                          bIsTargetFalling;                                  // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurGroundedBlendInterp;                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DeltaTime;                                         // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.ComputeCurrentFOV
// 0x0028 (0x0028 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_ComputeCurrentFOV final
{
public:
	double                                        CurrentFOV;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DesiredFOV;                                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DeltaTime;                                         // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        FOVAndDistanceInterpSpeed;                         // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.ComputeCurVelOffset
// 0x08F0 (0x08F0 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_ComputeCurVelOffset final
{
public:
	bool                                          bUseVelocityViewTargetLeading;                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTargetStrafing;                                 // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTargetAttackingMelee;                           // 0x0002(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CurVelOffset;                                      // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DeltaTime;                                         // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        MaxVelocityCamOffset;                              // 0x0028(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        VTVelocityDotWithCam;                              // 0x0030(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DotParallelThreshold;                              // 0x0038(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        VelOffsetSpeed;                                    // 0x0040(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VTVelDir;                                          // 0x0048(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTViewTarget                           OutVT;                                             // 0x0060(0x0860)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	const class UCurveFloat*                      Curve_VelocityInterpSpeed;                         // 0x08C0(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        VTVelocity;                                        // 0x08C8(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x08D0(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8E8[0x8];                                      // 0x08E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.ComputeFOV
// 0x0040 (0x0040 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_ComputeFOV final
{
public:
	bool                                          bCameraAdjustsWhenStrafing;                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FOV;                                               // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ExteriorFOV;                                       // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        StrafingFOV;                                       // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DeltaTime;                                         // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        StrafingTransitionInterpSpeed;                     // 0x0028(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTargetStrafing;                                 // 0x0030(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.ComputeHidePawnPenetrationPercent
// 0x0038 (0x0038 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_ComputeHidePawnPenetrationPercent final
{
public:
	double                                        StartingHidePawnPenetrationPercent;                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowChangingHidePercentByPitch;                  // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ChangingHideDefaultValue;                          // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ChangingHidePitchedValue;                          // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        NormalizedCameraPitch;                             // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ChangingHidePitchedThreshold;                      // 0x0028(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.ComputeVelocityBasedCameraSpaceViewOffset
// 0x00B0 (0x00B0 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_ComputeVelocityBasedCameraSpaceViewOffset final
{
public:
	bool                                          bUseVelocityViewTargetLeading;                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterpOffset                          CameraSpaceViewOffset;                             // 0x0008(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                CurVelOffset;                                      // 0x0050(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpOffset                          ReturnValue;                                       // 0x0068(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.ComputeViewTargetSpaceViewOffset
// 0x0940 (0x0940 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_ComputeViewTargetSpaceViewOffset final
{
public:
	bool                                          bIsTargetInConversation;                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterpOffset                          ViewTargetSpaceViewOffset;                         // 0x0008(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UMaterialParameterCollection*           Collection;                                        // 0x0050(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DeltaTime;                                         // 0x0058(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ViewTargetOffsetInterpSpeed;                       // 0x0060(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DefaultTargetViewOffset;                           // 0x0068(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ViewTarget;                                        // 0x0080(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTViewTarget                           OutVT;                                             // 0x0090(0x0860)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FInterpOffset                          ReturnValue;                                       // 0x08F0(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_938[0x8];                                      // 0x0938(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.GetConfinedSpaceWeight
// 0x0038 (0x0038 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_GetConfinedSpaceWeight final
{
public:
	double                                        InVerticalHitDistance;                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InVerticalProbeLength;                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInVerticalProbeBlocked;                           // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InFrontalHitDistance;                              // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InFrontalProbeLength;                              // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInFrontalProbeBlocked;                            // 0x0028(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.GetDesiredForwardDistance
// 0x00F8 (0x00F8 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_GetDesiredForwardDistance final
{
public:
	const class UObject*                          InWorldContextObject;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InBuildingPreviewHeightAdditionalZoom;             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InBuildingPreviewSizeScalar;                       // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatRange                            InPitchCameraForwardDistanceManager;               // 0x0018(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInIsTargetInConversation;                         // 0x0028(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UCurveFloat*                      InCurvePitchDistance;                              // 0x0030(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InNormalizedCameraPitch;                           // 0x0038(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InCameraPitch;                                     // 0x0040(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InCameraPitchMax;                                  // 0x0048(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInIsTargetStrafing;                               // 0x0050(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInIsTargetBuilding;                               // 0x0051(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InExteriorCameraSpaceForwardDistance;              // 0x0058(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InExteriorCameraSpaceForwardDistanceStrafing;      // 0x0060(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInCameraAdjustsWhenStrafing;                      // 0x0068(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBuildPreviewMode;                               // 0x0069(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UCurveFloat*                      InBuildPreviewBoundsToForwardDistanceScale;        // 0x0070(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   InBuildPreviewLocalBounds;                         // 0x0078(0x0038)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	double                                        InConfinedSpaceWeight;                             // 0x00B0(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        bInteriorCameraSpaceForwardDistance;               // 0x00B8(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InVelocityAddMaxDistance;                          // 0x00C0(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InFastVelocityThreshold;                           // 0x00C8(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InVTVelocity;                                      // 0x00D0(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InVelocityAddDistanceThreshold;                    // 0x00D8(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InCurrentBuildingScalarDistanceOffset;             // 0x00E0(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutCurrentBuildingScalarDistanceOffset;            // 0x00E8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x00F0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.GetDesiredFOV
// 0x0030 (0x0030 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_GetDesiredFOV final
{
public:
	double                                        InVelocityWeight;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InConfinedSpaceWeight;                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InVelocityAddMaxFOV;                               // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InExteriorFOV;                                     // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InInteriorFOV;                                     // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.GetFOVAndDistanceInterpSpeed
// 0x0020 (0x0020 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_GetFOVAndDistanceInterpSpeed final
{
public:
	double                                        InConfinedSpaceWeight;                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InMinInterpSpeed;                                  // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InMaxInterpSpeed;                                  // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.GetProbeWeight
// 0x0020 (0x0020 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_GetProbeWeight final
{
public:
	double                                        InHitDistance;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InProbeLength;                                     // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInProbeBlocked;                                   // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.GetVelocityDistanceAdd
// 0x0018 (0x0018 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_GetVelocityDistanceAdd final
{
public:
	double                                        InWeight;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
