#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoMusicRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Enum JunoMusicRuntime.EJunoActiveMusicElementState
// NumValues: 0x0005
enum class EJunoActiveMusicElementState : uint8
{
	Inactive                                 = 0,
	Scheduled                                = 1,
	Active                                   = 2,
	CoolingDown                              = 3,
	EJunoActiveMusicElementState_MAX         = 4,
};

// Enum JunoMusicRuntime.EJunoMusicCueSelectionBehavior
// NumValues: 0x0005
enum class EJunoMusicCueSelectionBehavior : uint8
{
	Sequential                               = 0,
	Shuffle                                  = 1,
	Random                                   = 2,
	Count                                    = 3,
	EJunoMusicCueSelectionBehavior_MAX       = 4,
};

// Enum JunoMusicRuntime.EMusicScheduleMode
// NumValues: 0x0006
enum class EMusicScheduleMode : uint8
{
	RelativeToDayPhaseChange                 = 0,
	RandomTimeDuringDayPhase                 = 1,
	PlayAtSpecificTimesOfDay                 = 2,
	OnlyBlueprintPlaybackConditions          = 3,
	Count                                    = 4,
	EMusicScheduleMode_MAX                   = 5,
};

// ScriptStruct JunoMusicRuntime.JunoClientCustomMusicPlayerData
// 0x0018 (0x0018 - 0x0000)
struct FJunoClientCustomMusicPlayerData final
{
public:
	class AController*                            OwnerController;                                   // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoMusicRuntime.JunoCustomMusicPlayerComponentRepData
// 0x0048 (0x0048 - 0x0000)
struct FJunoCustomMusicPlayerComponentRepData final
{
public:
	class AController*                            OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       OwningPlayerId;                                    // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           Setlist;                                           // 0x0038(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoMusicRuntime.ElementControllerArray
// 0x0010 (0x0010 - 0x0000)
struct FElementControllerArray final
{
public:
	TArray<class UJunoActiveMusicElementController_Base*> ElementControllerArray;                            // 0x0000(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoMusicRuntime.JunoMusicDataAggregatorSettings
// 0x0010 (0x0010 - 0x0000)
struct FJunoMusicDataAggregatorSettings final
{
public:
	TArray<TSubclassOf<class UJunoMusicDataCollector>> JunoMusicDataCollectors;                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoMusicRuntime.JunoActiveMusicElement
// 0x0028 (0x0028 - 0x0000)
struct FJunoActiveMusicElement final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoActiveMusicCue*                    MusicCue;                                          // 0x0020(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoMusicRuntime.JunoMusicElementData
// 0x0138 (0x0140 - 0x0008)
struct FJunoMusicElementData final : public FTableRowBase
{
public:
	bool                                          bEnabled;                                          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ElementName;                                       // 0x000C(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      ElementConditions;                                 // 0x0018(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      StatePushConditions;                               // 0x0060(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                MusicCues;                                         // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	EJunoMusicCueSelectionBehavior                CueSelectionBehavior;                              // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              FadeInOutValues;                                   // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlaybackPriority;                                  // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlaybackProbabilityPercent;                        // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopOnInvalidConditions;                          // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      ElementStopConditions;                             // 0x00E0(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FVector2D                              ElementCooldownInSeconds;                          // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReceiveAggregatedData;                            // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoMusicRuntime.JunoWorldMusicSystem
// 0x0018 (0x0018 - 0x0000)
struct FJunoWorldMusicSystem final
{
public:
	class UActiveJunoMusicPlayer*                 ActiveJunoMusicPlayer;                             // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoMusicDataAggregator*               JunoMusicDataAggregator;                           // 0x0008(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoMusicRuntime.ActiveJunoMusicManagerData
// 0x0010 (0x0010 - 0x0000)
struct FActiveJunoMusicManagerData final
{
public:
	struct FVector2D                              MainCooldownTimeInSeconds;                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoMusicRuntime.JunoMusicPlaylistElement
// 0x00C8 (0x00C8 - 0x0000)
struct FJunoMusicPlaylistElement final
{
public:
	struct FSoftObjectPath                        Music;                                             // 0x0000(0x0028)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              FadeInOutValues;                                   // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMusicScheduleMode                            MusicScheduleMode;                                 // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              RangeInSeconds;                                    // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortDayPhase                                 DayPhase;                                          // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              RangeInGameHours;                                  // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateAtTickRate;                                 // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              UpdatePeriodRange;                                 // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UJunoMusicPlaybackCondition>> CustomPlaybackConditions;                          // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bFlipPlaybackConditions;                           // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaybackProbabilityPercent;                        // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlaybackPriority;                                  // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterruptible;                                    // 0x009C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              PlaybackCooldownInSeconds;                         // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetCooldownOnFalseConditions;                   // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CooldownGroupNames;                                // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoMusicRuntime.JunoMusicPlaylist
// 0x0080 (0x0080 - 0x0000)
struct FJunoMusicPlaylist final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoMusicPlaylistElement>      MusicPlaylist;                                     // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FVector2D>           CooldownGroups;                                    // 0x0020(0x0050)(Edit, NativeAccessSpecifierPublic)
	struct FJunoMusicDataAggregatorSettings       DataAggregatorSettings;                            // 0x0070(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoMusicRuntime.JunoMusicPlayspaceProbeData
// 0x0010 (0x0010 - 0x0000)
struct FJunoMusicPlayspaceProbeData final
{
public:
	TArray<TSubclassOf<class UJunoMusicPlayspaceProbe>> JunoMusicPlayspaceProbes;                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoMusicRuntime.JunoServerCustomMusicPlayerData
// 0x0010 (0x0010 - 0x0000)
struct FJunoServerCustomMusicPlayerData final
{
public:
	class AController*                            OwnerController;                                   // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

