#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoProceduralWorld

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "InstancedActors_structs.hpp"
#include "InstancedActors_classes.hpp"
#include "JunoGameNative_structs.hpp"
#include "JunoGameNative_classes.hpp"
#include "DataRegistry_structs.hpp"
#include "JunoProceduralWorld_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "PCG_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "LagerRuntime_structs.hpp"
#include "LagerRuntime_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MassEntity_classes.hpp"
#include "MassSignals_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "JunoProceduralLandscape_classes.hpp"
#include "GameFeatures_classes.hpp"


namespace SDK
{

// Class JunoProceduralWorld.PCGJunoStreamingGameplayVolumePersistenceMigration
// 0x0000 (0x0030 - 0x0030)
class UPCGJunoStreamingGameplayVolumePersistenceMigration : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGJunoStreamingGameplayVolumePersistenceMigration">();
	}
	static class UPCGJunoStreamingGameplayVolumePersistenceMigration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGJunoStreamingGameplayVolumePersistenceMigration>();
	}
};

// Class JunoProceduralWorld.JunoResetPlayspacePersistenceMigration
// 0x0000 (0x0030 - 0x0030)
class UJunoResetPlayspacePersistenceMigration final : public UPCGJunoStreamingGameplayVolumePersistenceMigration
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoResetPlayspacePersistenceMigration">();
	}
	static class UJunoResetPlayspacePersistenceMigration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoResetPlayspacePersistenceMigration>();
	}
};

// Class JunoProceduralWorld.JunoLivingWorldCaveSpawnLimiterComponent
// 0x00A8 (0x0180 - 0x00D8)
class UJunoLivingWorldCaveSpawnLimiterComponent final : public UActorComponent
{
public:
	struct FCaveShellSpawnLimitData               SpawnLimitData;                                    // 0x00D8(0x00A8)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoLivingWorldCaveSpawnLimiterComponent">();
	}
	static class UJunoLivingWorldCaveSpawnLimiterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLivingWorldCaveSpawnLimiterComponent>();
	}
};

// Class JunoProceduralWorld.InstancedActorSmartObjectComponent
// 0x0010 (0x00F8 - 0x00E8)
class UInstancedActorSmartObjectComponent final : public UInstancedActorsComponent
{
public:
	TSubclassOf<class USmartObjectComponent>      ComponentClass;                                    // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USmartObjectDefinition*                 DefinitionAsset;                                   // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedActorSmartObjectComponent">();
	}
	static class UInstancedActorSmartObjectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstancedActorSmartObjectComponent>();
	}
};

// Class JunoProceduralWorld.JunoBridgePOISelectorComponent
// 0x0030 (0x0108 - 0x00D8)
class UJunoBridgePOISelectorComponent final : public UGameFrameworkComponent
{
public:
	struct FJunoBridgePOISelectorParams           Params_0;                                          // 0x00D8(0x0018)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataRegistryType                      DataRegistryType;                                  // 0x00F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FC[0xC];                                       // 0x00FC(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginBridgeSelection(const struct FJunoBridgePOISelectorParams& Param_Params_0);
	void DoSelection();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBridgePOISelectorComponent">();
	}
	static class UJunoBridgePOISelectorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBridgePOISelectorComponent>();
	}
};

// Class JunoProceduralWorld.JunoCaveGeneratorInterface
// 0x0000 (0x0030 - 0x0030)
class IJunoCaveGeneratorInterface final : public IInterface
{
public:
	void GenerateCave(const struct FJunoCaveSurfaceData& CaveSurfaceData, EJunoBiome Biome, int32 CaveIndex, const struct FBox& Bounds);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCaveGeneratorInterface">();
	}
	static class IJunoCaveGeneratorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoCaveGeneratorInterface>();
	}
};

// Class JunoProceduralWorld.JunoPOISlot
// 0x0068 (0x0488 - 0x0420)
class AJunoPOISlot final : public AActor
{
public:
	TSoftObjectPtr<class UDataTable>              PotentialPOIs;                                     // 0x0420(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoPOISize                                  SlotSize;                                          // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              TerrainHeightTexture;                              // 0x0458(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPOISlot">();
	}
	static class AJunoPOISlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoPOISlot>();
	}
};

// Class JunoProceduralWorld.JunoCaveGeneratorDataMergerInterface
// 0x0000 (0x0030 - 0x0030)
class IJunoCaveGeneratorDataMergerInterface final : public IInterface
{
public:
	void MergeCaveData(struct FJunoCaveGeneratorData* CaveData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCaveGeneratorDataMergerInterface">();
	}
	static class IJunoCaveGeneratorDataMergerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoCaveGeneratorDataMergerInterface>();
	}
};

// Class JunoProceduralWorld.JunoCaveGeneratorPlayspaceComponent
// 0x00E0 (0x0210 - 0x0130)
class UJunoCaveGeneratorPlayspaceComponent final : public UFortPlayspaceComponent
{
public:
	struct FDataRegistryType                      CaveGeneratorRegistry;                             // 0x0130(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataRegistryType                      CaveGeneratorShellsRegistry;                       // 0x013C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataRegistryType                      CaveGeneratorRulesRegistry;                        // 0x0148(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataRegistryType                      CaveGeneratorThemesRegistry;                       // 0x0154(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataRegistryType                      CaveGeneratorTypesRegistry;                        // 0x0160(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseSplitDataRegistries;                           // 0x016C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataRegistryType                      POIDataRegistry;                                   // 0x0170(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoCaveGeneratorData                 MergedData;                                        // 0x0180(0x0038)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B8[0x50];                                     // 0x01B8(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bWasDataMerged;                                    // 0x0208(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool GenerateCaveData(const struct FJunoCaveGeneratorData& ResourceData, const struct FDataRegistryType& POIDataRegistry_0, const struct FRandomStream& RandomStream, const struct FJunoCaveSurfaceData& CaveSurfaceData, EJunoBiome Biome, const struct FBox& Bounds, const TSubclassOf<class AJunoTeleporter>& SurfaceTeleporterClass, TArray<struct FJunoGeneratedCaveShellData>* Shells, TArray<struct FJunoPOIData>* POIs);
	static bool GenerateCaveDataWithExtendedResults(const struct FJunoCaveGeneratorData& ResourceData, const struct FDataRegistryType& POIDataRegistry_0, const struct FRandomStream& RandomStream, const struct FJunoCaveSurfaceData& CaveSurfaceData, EJunoBiome Biome, const struct FGameplayTagContainer& SlotTags, const struct FBox& Bounds, const TSubclassOf<class AJunoTeleporter>& SurfaceTeleporterClass, struct FJunoCaveGeneratorResult* Results, class FName CaveTypeName, class FName CaveRuleName);
	static bool GenerateCaveDataWithSlotTags(const struct FJunoCaveGeneratorData& ResourceData, const struct FDataRegistryType& POIDataRegistry_0, const struct FRandomStream& RandomStream, const struct FJunoCaveSurfaceData& CaveSurfaceData, EJunoBiome Biome, const struct FGameplayTagContainer& SlotTags, const struct FBox& Bounds, const TSubclassOf<class AJunoTeleporter>& SurfaceTeleporterClass, TArray<struct FJunoGeneratedCaveShellData>* Shells, TArray<struct FJunoPOIData>* POIs, class FName CaveTypeName, class FName CaveRuleName);
	static void GetMergedCaveDataRegistryData(const struct FDataRegistryType& CaveGeneratorDataRegistry, struct FJunoCaveGeneratorData* ResourceData, EJunoGetMergedCaveDataRegistryDataResult* Result);
	static void GetMergedMultiCaveDataRegistryData(const struct FDataRegistryType& ShellRegistry, const struct FDataRegistryType& ThemeRegistry, const struct FDataRegistryType& TypeRegistry, const struct FDataRegistryType& RuleRegistry, struct FJunoCaveGeneratorData* ResourceData, EJunoGetMergedCaveDataRegistryDataResult* Result);
	static class UJunoCaveGeneratorPlayspaceComponent* GetRootCaveGeneratorComponent(class UObject* WorldContextObject);
	static bool IsNativeCaveGeneratorEnabled();
	static void SortCaveGeneratorRules(const TArray<struct FJunoCaveGeneratorRule>& Rules, TArray<struct FJunoCaveGeneratorRule>* SortedRules);
	static void SortCaveGeneratorShells(const TArray<struct FJunoCaveGeneratorShellData>& Shells, TArray<struct FJunoCaveGeneratorShellData>* SortedShells);
	static void SortCaveGeneratorThemes(const TArray<struct FJunoCaveGeneratorThemeEntry>& Themes, TArray<struct FJunoCaveGeneratorThemeEntry>* SortedThemes);
	static void SortCaveGeneratorTypes(const TArray<struct FJunoCaveGeneratorTypeData>& Types, TArray<struct FJunoCaveGeneratorTypeData>* SortedTypes);

	void GenerateCave(class AActor* WorldActor, const struct FRandomStream& RandomStream, const struct FJunoCaveSurfaceData& CaveSurfaceData, EJunoBiome Biome, const struct FBox& Bounds, const TSubclassOf<class AJunoTeleporter>& SurfaceTeleporterClass, class FName LayerName);
	void GenerateCaveWithSlotTags(class AActor* WorldActor, const struct FRandomStream& RandomStream, const struct FJunoCaveSurfaceData& CaveSurfaceData, EJunoBiome Biome, const struct FGameplayTagContainer& SlotTags, const struct FBox& Bounds, const TSubclassOf<class AJunoTeleporter>& SurfaceTeleporterClass, class FName LayerName, class FName CaveTypeName, class FName CaveRuleName);
	void SetMergedData(const struct FJunoCaveGeneratorData& Data);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCaveGeneratorPlayspaceComponent">();
	}
	static class UJunoCaveGeneratorPlayspaceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCaveGeneratorPlayspaceComponent>();
	}
};

// Class JunoProceduralWorld.JunoSurfaceTargetTeleporterComponent
// 0x0008 (0x00E0 - 0x00D8)
class UJunoSurfaceTargetTeleporterComponent final : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoSurfaceTargetTeleporterComponent">();
	}
	static class UJunoSurfaceTargetTeleporterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoSurfaceTargetTeleporterComponent>();
	}
};

// Class JunoProceduralWorld.JunoRoadAINavigationClusterRenderComponent
// 0x0000 (0x05C0 - 0x05C0)
class UJunoRoadAINavigationClusterRenderComponent final : public UDebugDrawComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoRoadAINavigationClusterRenderComponent">();
	}
	static class UJunoRoadAINavigationClusterRenderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoRoadAINavigationClusterRenderComponent>();
	}
};

// Class JunoProceduralWorld.JunoCaveInternalTeleporterComponent
// 0x0018 (0x00F0 - 0x00D8)
class UJunoCaveInternalTeleporterComponent final : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MatchID;                                           // 0x00E0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCaveInternalTeleporterComponent">();
	}
	static class UJunoCaveInternalTeleporterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCaveInternalTeleporterComponent>();
	}
};

// Class JunoProceduralWorld.JunoLivingWorldStaticPointProvider
// 0x0058 (0x05E8 - 0x0590)
class AJunoLivingWorldStaticPointProvider : public AFortAthenaLivingWorldStaticPointProvider
{
public:
	uint8                                         Pad_590[0x10];                                     // 0x0590(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoLivingWorldPointProviderEventLimiter EventLimiter;                                      // 0x05A0(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGuid                                  SavedActorGuid;                                    // 0x05C0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D0[0x18];                                     // 0x05D0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AppendFiltersTags(const struct FGameplayTagContainer& Container);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoLivingWorldStaticPointProvider">();
	}
	static class AJunoLivingWorldStaticPointProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoLivingWorldStaticPointProvider>();
	}
};

// Class JunoProceduralWorld.ProceduralRouteDefinition
// 0x0008 (0x0038 - 0x0030)
class UProceduralRouteDefinition : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector FindLocationClosestToWorldLocation(const struct FVector& WorldLocation, float* OutDistanceSqr) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralRouteDefinition">();
	}
	static class UProceduralRouteDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralRouteDefinition>();
	}
};

// Class JunoProceduralWorld.ProceduralRoadDefinition
// 0x00A8 (0x00E0 - 0x0038)
class UProceduralRoadDefinition final : public UProceduralRouteDefinition
{
public:
	class ULandmassProceduralRoadGenRules*        GenRulesAsset;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELandmassRoadTier                             RoadTier;                                          // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0xF];                                       // 0x0041(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0050(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FInterpSegment>                 OutInterpSegments;                                 // 0x00B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x00C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LUTGridSize;                                       // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 LUT;                                               // 0x00C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         LUTResolution;                                     // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralRoadDefinition">();
	}
	static class UProceduralRoadDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralRoadDefinition>();
	}
};

// Class JunoProceduralWorld.JunoCaveLivingWorldStaticPointProvider
// 0x0068 (0x0650 - 0x05E8)
class AJunoCaveLivingWorldStaticPointProvider final : public AJunoLivingWorldStaticPointProvider
{
public:
	class FName                                   CaveShellID;                                       // 0x05E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5F4[0x4];                                      // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoCaveConditionalTags>       ConditionalTags;                                   // 0x05F8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FScalableFloat                         AssignLeashVolume;                                 // 0x0608(0x0038)(Edit, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UCaveShellSpawnEntry>    CaveShellEntry;                                    // 0x0640(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bNeverEnable;                                      // 0x0648(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetCaveShellInstanceData(struct FJunoCaveShellInstanceData* Data, EJunoGetCaveShellInstanceDataResult* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCaveLivingWorldStaticPointProvider">();
	}
	static class AJunoCaveLivingWorldStaticPointProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoCaveLivingWorldStaticPointProvider>();
	}
};

// Class JunoProceduralWorld.JunoCaveReturnToEntranceTeleporter
// 0x0008 (0x00E0 - 0x00D8)
class UJunoCaveReturnToEntranceTeleporter final : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCaveReturnToEntranceTeleporter">();
	}
	static class UJunoCaveReturnToEntranceTeleporter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCaveReturnToEntranceTeleporter>();
	}
};

// Class JunoProceduralWorld.LandmassFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class ULandmassFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool CreateSplineComponentsFromGuideSetAndAddToActor(class AActor* InActor, const struct FPathfinderGuideSet& GuideSet);
	static float GetControlPointLayerWidthRatio(class ULandscapeSplineControlPoint* InControlPoint);
	static struct FVector GetControlPointLocation(class ULandscapeSplineControlPoint* InControlPoint);
	static struct FRotator GetControlPointRotation(class ULandscapeSplineControlPoint* InControlPoint);
	static float GetControlPointSideFalloff(class ULandscapeSplineControlPoint* InControlPoint);
	static float GetControlPointWidth(class ULandscapeSplineControlPoint* InControlPoint);
	static struct FVector2D GetLandscapeGradientAtLocation(class ALandscapeProxy* LandscapeProxy, const struct FVector& Location);
	static float GetLandscapeHeightAtLocation(class ALandscapeProxy* LandscapeProxy, const struct FVector& Location, bool* bIsValidLocation);
	static void LevelInstanceSetAndUpdateWorldAsset(class ALevelInstance* LevelInstance, const TSoftObjectPtr<class UWorld>& WorldAsset);
	static struct FVector ProjectLocationOnLandscape(class ALandscapeProxy* LandscapeProxy, const struct FVector& Location, bool* bIsValidLocation);
	static void SetControlPointLayerWidthRatio(class ULandscapeSplineControlPoint* InControlPoint, float InLayerWidthRatio);
	static void SetControlPointLocation(class ULandscapeSplineControlPoint* InControlPoint, const struct FVector& InLocation);
	static void SetControlPointRotation(class ULandscapeSplineControlPoint* InControlPoint, const struct FRotator& InRotation);
	static void SetControlPointSideFalloff(class ULandscapeSplineControlPoint* InControlPoint, float InSideFalloff);
	static void SetControlPointWidth(class ULandscapeSplineControlPoint* InControlPoint, float InWidth);
	static void SetStaticMeshAffectDistanceField(class UStaticMeshComponent* Mesh, bool bNewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandmassFunctionLibrary">();
	}
	static class ULandmassFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandmassFunctionLibrary>();
	}
};

// Class JunoProceduralWorld.JunoStreamingGameplayVolume
// 0x0080 (0x0550 - 0x04D0)
class AJunoStreamingGameplayVolume : public AGameplayVolume
{
public:
	uint8                                         Pad_4D0[0x20];                                     // 0x04D0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  SavedActorGuid;                                    // 0x04F0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSpawnedByLevelSaveRecord;                         // 0x0500(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoundsExtent;                                      // 0x0508(0x0018)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                BoundsOffset;                                      // 0x0520(0x0018)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_538[0x8];                                      // 0x0538(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UWorld>>          LevelsToLoad;                                      // 0x0540(0x0010)(Edit, Net, ZeroConstructor, SaveGame, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void Load();
	void SetBounds(const struct FVector& Offset, const struct FVector& Extent);
	void Unload();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoStreamingGameplayVolume">();
	}
	static class AJunoStreamingGameplayVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoStreamingGameplayVolume>();
	}
};

// Class JunoProceduralWorld.JunoCaveShellGameplayVolume
// 0x0150 (0x06A0 - 0x0550)
class AJunoCaveShellGameplayVolume final : public AJunoStreamingGameplayVolume
{
public:
	struct FJunoCaveShellInstanceData             InstanceData;                                      // 0x0550(0x0080)(SaveGame, NativeAccessSpecifierPublic)
	class FName                                   ShellID;                                           // 0x05D0(0x000C)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  CaveGuid;                                          // 0x05DC(0x0010)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5EC[0x4];                                      // 0x05EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoCaveShellGameplayVolumeTeleporterLink> Teleporters;                                       // 0x05F0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FJunoWorldTileStreamingLevel>   LevelsToInject;                                    // 0x0600(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	int32                                         PersistenceVersion;                                // 0x0610(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_614[0x8C];                                     // 0x0614(0x008C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCaveShellGameplayVolume">();
	}
	static class AJunoCaveShellGameplayVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoCaveShellGameplayVolume>();
	}
};

// Class JunoProceduralWorld.JunoStaticMeshPoolSubsystem
// 0x0008 (0x0040 - 0x0038)
class UJunoStaticMeshPoolSubsystem final : public UWorldSubsystem
{
public:
	class AJunoStaticMeshPoolActor*               StaticMeshPoolActor;                               // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoStaticMeshPoolSubsystem">();
	}
	static class UJunoStaticMeshPoolSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoStaticMeshPoolSubsystem>();
	}
};

// Class JunoProceduralWorld.JunoLivingWorldCaveSpawnManager
// 0x00A0 (0x0178 - 0x00D8)
class UJunoLivingWorldCaveSpawnManager final : public UGameStateComponent
{
public:
	TMap<struct FCaveShellID, struct FJunoLWMCaveShellInfo> ShellInfos;                                        // 0x00D8(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<struct FCaveShellID, struct FJunoLWMCaveShellPointProviders> UnprocessedPointProviders;                         // 0x0128(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoLivingWorldCaveSpawnManager">();
	}
	static class UJunoLivingWorldCaveSpawnManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLivingWorldCaveSpawnManager>();
	}
};

// Class JunoProceduralWorld.JunoStreamingPlayspace
// 0x0000 (0x09B8 - 0x09B8)
class AJunoStreamingPlayspace : public AJunoPersistentPlayspace
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoStreamingPlayspace">();
	}
	static class AJunoStreamingPlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoStreamingPlayspace>();
	}
};

// Class JunoProceduralWorld.JunoCaveShellPlayspace
// 0x0000 (0x09B8 - 0x09B8)
class AJunoCaveShellPlayspace final : public AJunoStreamingPlayspace
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCaveShellPlayspace">();
	}
	static class AJunoCaveShellPlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoCaveShellPlayspace>();
	}
};

// Class JunoProceduralWorld.ProceduralRiverDefinition
// 0x0018 (0x0050 - 0x0038)
class UProceduralRiverDefinition final : public UProceduralRouteDefinition
{
public:
	class UProceduralRiverGenRulesAsset*          GenRulesAsset;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELandmassRiverTier                            RiverTier;                                         // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterBody*                             WaterBody;                                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class AWaterBody* GetWaterBodyActor() const;
	class UWaterSplineComponent* GetWaterSpline() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralRiverDefinition">();
	}
	static class UProceduralRiverDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralRiverDefinition>();
	}
};

// Class JunoProceduralWorld.JunoCaveBlueprintLibrary
// 0x0000 (0x0030 - 0x0030)
class UJunoCaveBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddCaveStateTag(const class AActor* ActorInCave, const struct FGameplayTag& StateTag);
	static void AddCaveStateTagQuery(const class AActor* ActorInCave, const TDelegate<void(struct FGameplayTagContainer& CaveStateTags)>& CaveStateQuery, bool bFireImmediately);
	static void CalculateCaveShellDistance(const struct FJunoCave& Cave, const class FName ShellID_A, const class FName ShellID_B, int32* Distance, EJunoCalculateCaveDistanceResult* Result);
	static void CreateCaveInstanceData(const class AActor* CaveSlotActor, const struct FGuid& CaveSlotGuid, const TArray<struct FJunoGeneratedCaveShellData>& CaveShellData, EJunoCreateCaveResult* Result, const class FName LayerName);
	static void CreateCaveInstanceDataForSurfaceData(const class AActor* POISlotActor, const struct FJunoCaveSurfaceData& SurfaceData, const TArray<struct FJunoGeneratedCaveShellData>& CaveShellData, EJunoCreateCaveResult* Result, const class FName LayerName);
	static int32 CreateExitsUsedMaskFromArray(const TArray<int32>& ExitsUsed);
	static TArray<int32> ExitsUsedMaskToArray(int32 ExitsUsedMask);
	static void GetBestCaveShellFromArea(const class UObject* WorldContextObject, const struct FBox& Area, struct FJunoCave* Cave, struct FGuid* CaveGuid, class FName* ShellID, EJunoGetBestCaveResult* Result);
	static void GetCaveDataCollectionsFromRegistry(const struct FDataRegistryType& DataRegistry, TArray<TSoftObjectPtr<class UJunoCaveDataCollectionBase>>* Array, EJunoGetCaveDataCollectionsFromRegistryResult* Result);
	static void GetCaveShellGateActors(const class AActor* ActorInShell, TArray<class AActor*>* GateActors);
	static struct FJunoCaveShellInstanceData GetCaveShellInstanceData(const class AActor* CaveShellChildActor, class FName ShellID, bool* Success);
	static void GetCaveShellInstanceDataFromActor(const class AActor* CaveShellChildActor, class FName ShellID, struct FJunoCaveShellInstanceData* Data, EJunoGetCaveShellInstanceDataResult* Result);
	static void GetCaveShellInstanceDataFromArea(const class UObject* WorldContextObject, const struct FBox& Area, class FName ShellID, struct FJunoCaveShellInstanceData* Data, EJunoGetCaveShellInstanceDataResult* Result);
	static class AJunoCaveShellGameplayVolume* GetCaveShellVolumeFromArea(const class UObject* WorldContextObject, const struct FBox& Area, class FName ShellID);
	static void GetCaveSurfaceDataForEntrance(const class AActor* Actor, const struct FGuid& EntranceGuid, struct FJunoCaveSurfaceData* CaveSurfaceData, int32* CaveIndex, EJunoGetCaveSurfaceDataForEntranceResult* Result, bool bWorldTeleporterTransforms, const class FName LayerName);
	static bool IsBitSet(int32 Bitmask, int32 Bit);
	static bool NeedsCaveShellInstanceData(const class AActor* CaveSlotActor, const struct FGuid& CaveSlotGuid);
	static void QueryCaveDataStateFromActor(const class AActor* CaveSlotActor, const struct FGuid& CaveSlotGuid, EJunoQueryCaveDataResult* Result, struct FBox* WorldTileBounds, TArray<struct FJunoCaveTeleporterLink>* Teleporters);
	static void QueryCaveDataStateFromSurfaceData(const class AActor* POISlotActor, const struct FJunoCaveSurfaceData& SurfaceData, EJunoQueryCaveDataResult* Result, struct FBox* WorldTileBounds, TArray<struct FJunoCaveTeleporterLink>* Teleporters);
	static EJunoQueryCaveDataResult QueryCaveShellInstanceDataState(const class AActor* CaveSlotActor, const struct FGuid& CaveSlotGuid);
	static void QueryCaveSurfaceDataState(const class AActor* Actor, EJunoQueryCaveSurfaceDataStateResult* Result, const class FName LayerName);
	static void SetCaveShellGateActors(const class AActor* ActorInShell, const class FName& ShellID, const TArray<class AActor*>& GateActors);
	static void SetCaveSurfaceData(const class AActor* Actor, const TArray<struct FJunoCaveSurfaceData>& CaveSurfaceData, const class FName LayerName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCaveBlueprintLibrary">();
	}
	static class UJunoCaveBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCaveBlueprintLibrary>();
	}
};

// Class JunoProceduralWorld.JunoCaveShellGateComponent
// 0x0010 (0x0140 - 0x0130)
class UJunoCaveShellGateComponent final : public UFortPlayspaceComponent
{
public:
	TArray<TWeakObjectPtr<class AActor>>          GateActors;                                        // 0x0130(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCaveShellGateComponent">();
	}
	static class UJunoCaveShellGateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCaveShellGateComponent>();
	}
};

// Class JunoProceduralWorld.PCGJunoRoadAINavigationSettings
// 0x0140 (0x0318 - 0x01D8)
class UPCGJunoRoadAINavigationSettings final : public UPCGSettings
{
public:
	TSoftClassPtr<class UClass>                   RoadClusterClass;                                  // 0x01D8(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   PatrolPathClass;                                   // 0x0208(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   PatrolPointClass;                                  // 0x0238(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoRoadGraphGeneratorSettings        GraphSettings;                                     // 0x0268(0x00B0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGJunoRoadAINavigationSettings">();
	}
	static class UPCGJunoRoadAINavigationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGJunoRoadAINavigationSettings>();
	}
};

// Class JunoProceduralWorld.JunoCaveVolumePlayspaceComponent
// 0x0000 (0x0130 - 0x0130)
class UJunoCaveVolumePlayspaceComponent final : public UFortPlayspaceComponent
{
public:
	void NotifyActorBeginOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void NotifyActorEndOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnPlayerEnteringCaveVolume(class AFortPlayerPawnAthena* PlayerPawn);
	void OnPlayerLeavingCaveVolume(class AFortPlayerPawnAthena* PlayerPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCaveVolumePlayspaceComponent">();
	}
	static class UJunoCaveVolumePlayspaceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCaveVolumePlayspaceComponent>();
	}
};

// Class JunoProceduralWorld.JunoCheatManager_ProceduralWorld
// 0x0000 (0x0030 - 0x0030)
class UJunoCheatManager_ProceduralWorld final : public UChildCheatManager
{
public:
	void JunoDumpMapTileImages();
	void JunoGoActor(const class FString& ActorClassName);
	void JunoGoBiome(class FName Biome);
	void JunoGoEvent(class FName EventName);
	void JunoGoNearActor(const class FString& ActorClassName);
	void JunoGoPOI(class FName Name_0);
	void JunoLogStreamingVolumesDebugInfo();
	void JunoMarkWorldTilePersistenceDirty();
	void JunoPOIForceRerollEncounter(bool bForceSuccess);
	void JunoPOIRerollEncounter();
	void JunoPOIVolumeDump();
	void JunoPOIVolumeDumpAll();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCheatManager_ProceduralWorld">();
	}
	static class UJunoCheatManager_ProceduralWorld* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCheatManager_ProceduralWorld>();
	}
};

// Class JunoProceduralWorld.PCGAddLandscapeLayerWeightsSettings
// 0x0000 (0x01D8 - 0x01D8)
class UPCGAddLandscapeLayerWeightsSettings final : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAddLandscapeLayerWeightsSettings">();
	}
	static class UPCGAddLandscapeLayerWeightsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAddLandscapeLayerWeightsSettings>();
	}
};

// Class JunoProceduralWorld.JunoGenerateTileInterface
// 0x0000 (0x0030 - 0x0030)
class IJunoGenerateTileInterface final : public IInterface
{
public:
	void GenerateTile(const struct FJunoGenerateTileParams& Params_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoGenerateTileInterface">();
	}
	static class IJunoGenerateTileInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoGenerateTileInterface>();
	}
};

// Class JunoProceduralWorld.JunoGenerateTileCommandlet
// 0x0038 (0x00C0 - 0x0088)
class UJunoGenerateTileCommandlet final : public UCommandlet
{
public:
	uint8                                         Pad_88[0x18];                                      // 0x0088(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        GeneratorScripts;                                  // 0x00A0(0x0010)(ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UTypedElementSelectionSet*              SelectedElements;                                  // 0x00B0(0x0008)(ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FinishedGenerating();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoGenerateTileCommandlet">();
	}
	static class UJunoGenerateTileCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoGenerateTileCommandlet>();
	}
};

// Class JunoProceduralWorld.JunoHLODMapActorRedirectors
// 0x0060 (0x0090 - 0x0030)
class UJunoHLODMapActorRedirectors final : public UObject
{
public:
	TArray<struct FJunoHLODMapActorRedirectorsEntry> DefaultMapActorRedirectors;                        // 0x0030(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FJunoActorRedirectors> MapActorRedirectorsLookup;                         // 0x0040(0x0050)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoHLODMapActorRedirectors">();
	}
	static class UJunoHLODMapActorRedirectors* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoHLODMapActorRedirectors>();
	}
};

// Class JunoProceduralWorld.JunoWorldTilePlayspaceComponent
// 0x0000 (0x0130 - 0x0130)
class UJunoWorldTilePlayspaceComponent final : public UFortPlayspaceComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWorldTilePlayspaceComponent">();
	}
	static class UJunoWorldTilePlayspaceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWorldTilePlayspaceComponent>();
	}
};

// Class JunoProceduralWorld.JunoHLODMapActorsPersistenceMigration
// 0x0018 (0x0048 - 0x0030)
class UJunoHLODMapActorsPersistenceMigration : public UPCGJunoStreamingGameplayVolumePersistenceMigration
{
public:
	TArray<TSubclassOf<class AActor>>             Classes;                                           // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	EJunoHLODMapActorsPersistenceMigrationLevel   TargetLevel;                                       // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoHLODMapActorsPersistenceMigration">();
	}
	static class UJunoHLODMapActorsPersistenceMigration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoHLODMapActorsPersistenceMigration>();
	}
};

// Class JunoProceduralWorld.JunoPOIIAMMigrationToHLOD
// 0x0000 (0x0048 - 0x0048)
class UJunoPOIIAMMigrationToHLOD final : public UJunoHLODMapActorsPersistenceMigration
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPOIIAMMigrationToHLOD">();
	}
	static class UJunoPOIIAMMigrationToHLOD* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPOIIAMMigrationToHLOD>();
	}
};

// Class JunoProceduralWorld.PCGSetFoundationLevelSettings
// 0x0018 (0x01F0 - 0x01D8)
class UPCGSetFoundationLevelSettings final : public UPCGSettings
{
public:
	class FName                                   AttributeNameForResolvedPOIPath;                   // 0x01D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttributeNameForSpawnedActorPtr;                   // 0x01E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSetFoundationLevelSettings">();
	}
	static class UPCGSetFoundationLevelSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSetFoundationLevelSettings>();
	}
};

// Class JunoProceduralWorld.JunoPOIIAMMigrationToNonHLOD
// 0x0000 (0x0048 - 0x0048)
class UJunoPOIIAMMigrationToNonHLOD final : public UJunoHLODMapActorsPersistenceMigration
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPOIIAMMigrationToNonHLOD">();
	}
	static class UJunoPOIIAMMigrationToNonHLOD* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPOIIAMMigrationToNonHLOD>();
	}
};

// Class JunoProceduralWorld.JunoPOIIAMDuplicatedInvalidInstancesFix
// 0x0020 (0x0050 - 0x0030)
class UJunoPOIIAMDuplicatedInvalidInstancesFix final : public UPCGJunoStreamingGameplayVolumePersistenceMigration
{
public:
	class FString                                 MapNameFilter;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FString>                         ActorsToMigrateNames;                              // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPOIIAMDuplicatedInvalidInstancesFix">();
	}
	static class UJunoPOIIAMDuplicatedInvalidInstancesFix* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPOIIAMDuplicatedInvalidInstancesFix>();
	}
};

// Class JunoProceduralWorld.JunoWorldTileControllerComponent
// 0x0000 (0x00E0 - 0x00E0)
class UJunoWorldTileControllerComponent final : public UFortControllerComponent
{
public:
	void ClientCheckWorldTileState(const TArray<struct FJunoDebugWorldTileState>& WorldTileState);
	void ServerCheckWorldTileState();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWorldTileControllerComponent">();
	}
	static class UJunoWorldTileControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWorldTileControllerComponent>();
	}
};

// Class JunoProceduralWorld.JunoInstancedActorData
// 0x0240 (0x05A0 - 0x0360)
class UJunoInstancedActorData final : public UInstancedActorsData
{
public:
	struct FJunoCompressedTransforms              CompressedInstanceTransforms;                      // 0x0360(0x0230)(NativeAccessSpecifierPrivate)
	TArray<int32>                                 FreeIndices;                                       // 0x0590(0x0010)(ZeroConstructor, Deprecated, EditorOnly, NativeAccessSpecifierPrivate)

public:
	class AJunoInstancedActorManager* GetJunoManager() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoInstancedActorData">();
	}
	static class UJunoInstancedActorData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoInstancedActorData>();
	}
};

// Class JunoProceduralWorld.JunoInstancedActorManager
// 0x0030 (0x08C0 - 0x0890)
class AJunoInstancedActorManager final : public AInstancedActorsManager
{
public:
	uint8                                         Pad_890[0x20];                                     // 0x0890(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bPersistentDataRestored;                           // 0x08B0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8B1[0xF];                                      // 0x08B1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoInstancedActorManager">();
	}
	static class AJunoInstancedActorManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoInstancedActorManager>();
	}
};

// Class JunoProceduralWorld.JunoWaterSplineInjector
// 0x0000 (0x00D8 - 0x00D8)
class UJunoWaterSplineInjector final : public UActorComponent
{
public:
	void ForceWaterUpdate();
	void InjectSplineGuideIntoWaterBody(const struct FJunoWaterSplineInjectorParams& Params_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWaterSplineInjector">();
	}
	static class UJunoWaterSplineInjector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWaterSplineInjector>();
	}
};

// Class JunoProceduralWorld.JunoInstancedActorManagerHLODClonerComponent
// 0x0008 (0x00E0 - 0x00D8)
class UJunoInstancedActorManagerHLODClonerComponent final : public UActorComponent
{
public:
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoInstancedActorManagerHLODClonerComponent">();
	}
	static class UJunoInstancedActorManagerHLODClonerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoInstancedActorManagerHLODClonerComponent>();
	}
};

// Class JunoProceduralWorld.JunoInstancedActorRemovalModifierVolume
// 0x0000 (0x0428 - 0x0428)
class AJunoInstancedActorRemovalModifierVolume final : public AInstancedActorsModifierVolume
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoInstancedActorRemovalModifierVolume">();
	}
	static class AJunoInstancedActorRemovalModifierVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoInstancedActorRemovalModifierVolume>();
	}
};

// Class JunoProceduralWorld.PCGResolvePOISlotsSettings
// 0x0048 (0x0220 - 0x01D8)
class UPCGResolvePOISlotsSettings final : public UPCGSettings
{
public:
	class FName                                   AttributeNameForBiomeDataTable;                    // 0x01D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttributeNameForPotentialPIOsDataTable;            // 0x01E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttributeNameForResolvedActorPath;                 // 0x01F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttributeNameForResolvedPOIPath;                   // 0x01FC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttributeNameForResolvedSlotSize;                  // 0x0208(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttributeNameForResolvedTerrainHeightPatch;        // 0x0214(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGResolvePOISlotsSettings">();
	}
	static class UPCGResolvePOISlotsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGResolvePOISlotsSettings>();
	}
};

// Class JunoProceduralWorld.JunoInstancedActorModifierVolumeComponent
// 0x0010 (0x05F0 - 0x05E0)
class UJunoInstancedActorModifierVolumeComponent : public UInstancedActorsModifierVolumeComponent
{
public:
	uint8                                         Pad_5E0[0x10];                                     // 0x05E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoInstancedActorModifierVolumeComponent">();
	}
	static class UJunoInstancedActorModifierVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoInstancedActorModifierVolumeComponent>();
	}
};

// Class JunoProceduralWorld.JunoRemoveInstancesModifierVolumeComponent
// 0x0000 (0x05F0 - 0x05F0)
class UJunoRemoveInstancesModifierVolumeComponent final : public UJunoInstancedActorModifierVolumeComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoRemoveInstancesModifierVolumeComponent">();
	}
	static class UJunoRemoveInstancesModifierVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoRemoveInstancesModifierVolumeComponent>();
	}
};

// Class JunoProceduralWorld.JunoProfileGo
// 0x0018 (0x0628 - 0x0610)
class UJunoProfileGo final : public UFortProfileGo
{
public:
	uint8                                         Pad_610[0x18];                                     // 0x0610(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoProfileGo">();
	}
	static class UJunoProfileGo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoProfileGo>();
	}
};

// Class JunoProceduralWorld.JunoInstancedActorRepresentationActorManagement
// 0x0000 (0x0030 - 0x0030)
class UJunoInstancedActorRepresentationActorManagement final : public UInstancedActorsRepresentationActorManagement
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoInstancedActorRepresentationActorManagement">();
	}
	static class UJunoInstancedActorRepresentationActorManagement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoInstancedActorRepresentationActorManagement>();
	}
};

// Class JunoProceduralWorld.JunoInstancedActorSubsystem
// 0x0000 (0x0338 - 0x0338)
class UJunoInstancedActorSubsystem final : public UInstancedActorsSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoInstancedActorSubsystem">();
	}
	static class UJunoInstancedActorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoInstancedActorSubsystem>();
	}
};

// Class JunoProceduralWorld.PCGSetPOISlotPropertiesSettings
// 0x0040 (0x0218 - 0x01D8)
class UPCGSetPOISlotPropertiesSettings final : public UPCGSettings
{
public:
	class FName                                   AttributeNameForSpawnedActorPtr;                   // 0x01D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttributeNameForPotentialPIOsDataTable;            // 0x01E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttributeNameForResolvedPOIPath;                   // 0x01F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttributeNameForResolvedSlotSize;                  // 0x01FC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttributeNameForResolvedTerrainHeightPatch;        // 0x0208(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSetPOISlotPropertiesSettings">();
	}
	static class UPCGSetPOISlotPropertiesSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSetPOISlotPropertiesSettings>();
	}
};

// Class JunoProceduralWorld.JunoInstancedActorVisualizationTrait
// 0x0000 (0x0130 - 0x0130)
class UJunoInstancedActorVisualizationTrait final : public UInstancedActorsVisualizationTrait
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoInstancedActorVisualizationTrait">();
	}
	static class UJunoInstancedActorVisualizationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoInstancedActorVisualizationTrait>();
	}
};

// Class JunoProceduralWorld.JunoLifecycleComponent
// 0x0078 (0x0160 - 0x00E8)
class UJunoLifecycleComponent final : public UInstancedActorsComponent
{
public:
	uint8                                         Pad_E8[0x10];                                      // 0x00E8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoLifecyclePhase>            LifecyclePhases;                                   // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bAutoAddFinalLifecyclePhase;                       // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRepeatLifecyclePhases;                            // 0x0109(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(uint8 PreviousLifecyclePhase, uint8 NewLifecyclePhase)> OnLifecyclePhaseChangedDelegate;                   // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnLifecycleCompletedDelegate;                      // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   MeshComponent;                                     // 0x0130(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FinalLifecycleScale;                               // 0x0138(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
