#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoEncountersPOIRuntime

#include "Basic.hpp"

#include "DataRegistry_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "WorldConditions_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "EncountersRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JunoGameNative_structs.hpp"


namespace SDK
{

// Enum JunoEncountersPOIRuntime.EJunoPOIEncounterState
// NumValues: 0x0007
enum class EJunoPOIEncounterState : uint8
{
	Invalid                                  = 0,
	Initialized                              = 1,
	PersistentDataReady                      = 2,
	Idle                                     = 3,
	Ready                                    = 4,
	Active                                   = 5,
	EJunoPOIEncounterState_MAX               = 6,
};

// Enum JunoEncountersPOIRuntime.EHLODActorDestructionScope
// NumValues: 0x0004
enum class EHLODActorDestructionScope : uint8
{
	Visit                                    = 0,
	EncounterFinished                        = 1,
	Never                                    = 2,
	EHLODActorDestructionScope_MAX           = 3,
};

// ScriptStruct JunoEncountersPOIRuntime.JunoCampApplyPersistentTagsStateTreeTaskInstanceData
// 0x0028 (0x0028 - 0x0000)
struct FJunoCampApplyPersistentTagsStateTreeTaskInstanceData final
{
public:
	struct FGameplayTagContainer                  Tags;                                              // 0x0000(0x0020)(Edit, NativeAccessSpecifierPublic)
	class AActor*                                 UserActor;                                         // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoEncountersPOIRuntime.JunoCampApplyPersistentTagsStateTreeTask
// 0x0000 (0x0030 - 0x0030)
struct FJunoCampApplyPersistentTagsStateTreeTask final : public FFortStateTreeEncounterTaskBase
{
};

// ScriptStruct JunoEncountersPOIRuntime.JunoCampGetPersistentTagsStateTreeTaskInstanceData
// 0x0028 (0x0028 - 0x0000)
struct FJunoCampGetPersistentTagsStateTreeTaskInstanceData final
{
public:
	struct FGameplayTagContainer                  Value;                                             // 0x0000(0x0020)(Edit, NativeAccessSpecifierPublic)
	class AActor*                                 UserActor;                                         // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoEncountersPOIRuntime.JunoCampGetPersistentTagsStateTreeTask
// 0x0000 (0x0030 - 0x0030)
struct FJunoCampGetPersistentTagsStateTreeTask final : public FStateTreeTaskCommonBase
{
};

// ScriptStruct JunoEncountersPOIRuntime.JunoEnableCaveExitGateStateTreeTaskInstanceData
// 0x0018 (0x0018 - 0x0000)
struct FJunoEnableCaveExitGateStateTreeTaskInstanceData final
{
public:
	class AActor*                                 UserActor;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class UFortActorComponent_ToggleState>> GateActors;                                        // 0x0008(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
};

// ScriptStruct JunoEncountersPOIRuntime.JunoEnableCaveExitGateStateTreeTask
// 0x0000 (0x0030 - 0x0030)
struct FJunoEnableCaveExitGateStateTreeTask final : public FFortStateTreeEncounterTaskBase
{
};

// ScriptStruct JunoEncountersPOIRuntime.JunoEnableVillagerProviderStateTreeTaskInstanceData
// 0x0018 (0x0018 - 0x0000)
struct FJunoEnableVillagerProviderStateTreeTaskInstanceData final
{
public:
	TWeakObjectPtr<class AJunoEncounterStaticPointProvider> VillagerProvider;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProvider;                                   // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UserActor;                                         // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoEncountersPOIRuntime.JunoEnableVillagerProviderStateTreeTask
// 0x0000 (0x0030 - 0x0030)
struct FJunoEnableVillagerProviderStateTreeTask final : public FFortStateTreeEncounterTaskBase
{
};

// ScriptStruct JunoEncountersPOIRuntime.JunoGetCampLevelStateTreeTaskInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FJunoGetCampLevelStateTreeTaskInstanceData final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UserActor;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoEncountersPOIRuntime.JunoGetCampLevelStateTreeTask
// 0x0000 (0x0030 - 0x0030)
struct FJunoGetCampLevelStateTreeTask final : public FFortStateTreeEncounterTaskBase
{
};

// ScriptStruct JunoEncountersPOIRuntime.JunoGetVillagerProviderStateTreeTaskInstanceData
// 0x0058 (0x0058 - 0x0000)
struct FJunoGetVillagerProviderStateTreeTaskInstanceData final
{
public:
	struct FGameplayTagQuery                      ProviderTagQuery;                                  // 0x0000(0x0048)(Edit, NativeAccessSpecifierPublic)
	class AActor*                                 UserActor;                                         // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AJunoEncounterStaticPointProvider> VillagerProvider;                                  // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoEncountersPOIRuntime.JunoGetVillagerProviderStateTreeTask
// 0x0000 (0x0030 - 0x0030)
struct FJunoGetVillagerProviderStateTreeTask final : public FFortStateTreeEncounterTaskBase
{
};

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIEncounterCategoryRow
// 0x0140 (0x0148 - 0x0008)
struct FJunoPOIEncounterCategoryRow final : public FTableRowBase
{
public:
	struct FSoftDataRegistryOrTable               POIEncounterRegistry;                              // 0x0008(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      RequiredCapabilities;                              // 0x0050(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FWorldConditionQueryDefinition         WorldConditionDefinition;                          // 0x0098(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      RepeatWeightMitigationIdentityQuery;               // 0x00C0(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         RepeatWeightMitigationFactor;                      // 0x0108(0x0038)(Edit, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0140(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoEncountersPOIRuntime.POIPersistenceValueEntry
// 0x0008 (0x0008 - 0x0000)
struct FPOIPersistenceValueEntry final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPersistentValueScope                         Scope;                                             // 0x0004(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIEncounterSaveData
// 0x01A0 (0x01A0 - 0x0000)
struct FJunoPOIEncounterSaveData final
{
public:
	bool                                          bEncounterChosen;                                  // 0x0000(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UEncounterItemDefinition> ChosenEncounterDefinition;                         // 0x0008(0x0030)(SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UEncounterFactionData>   ChosenFaction;                                     // 0x0038(0x0030)(SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChosenVariant;                                     // 0x0068(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPersistenceFrameworkDataRegistryOrTableRowHandle SelectedEncounterRow;                              // 0x0070(0x0050)(SaveGame, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, struct FPersistenceFrameworkDataRegistryOrTableRowHandle> Variables;                                         // 0x00C0(0x0050)(SaveGame, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, struct FPOIPersistenceValueEntry> PersistentValues;                                  // 0x0110(0x0050)(SaveGame, NativeAccessSpecifierPublic)
	bool                                          bIsPOISetup;                                       // 0x0160(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEncounterVisited;                                 // 0x0161(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEncounterFinished;                                // 0x0162(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_163[0x5];                                      // 0x0163(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LastFinishTime;                                    // 0x0168(0x0008)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFactionChosen;                                    // 0x0170(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEncounterSuccess;                                 // 0x0171(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EncounterCount;                                    // 0x0174(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  DynamicPOICapabitities;                            // 0x0178(0x0020)(SaveGame, NativeAccessSpecifierPublic)
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIEncounterPersistenceFeatureData_InGameClass_PersistentInfo
// 0x01A0 (0x01A0 - 0x0000)
struct FJunoPOIEncounterPersistenceFeatureData_InGameClass_PersistentInfo final
{
public:
	struct FJunoPOIEncounterSaveData              SavedEncounterState;                               // 0x0000(0x01A0)(NativeAccessSpecifierPublic)
};

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIEncounterSaveData_v1
// 0x0188 (0x0188 - 0x0000)
struct FJunoPOIEncounterSaveData_v1 final
{
public:
	bool                                          bEncounterChosen;                                  // 0x0000(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UEncounterItemDefinition> ChosenEncounterDefinition;                         // 0x0008(0x0030)(SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UEncounterFactionData>   ChosenFaction;                                     // 0x0038(0x0030)(SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChosenVariant;                                     // 0x0068(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataRegistryOrTableRow                SelectedEncounterRow;                              // 0x0070(0x0038)(SaveGame, NoDestructor, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, struct FPersistenceFrameworkDataTableRowHandle> Variables;                                         // 0x00A8(0x0050)(SaveGame, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, int32>              PersistentValues;                                  // 0x00F8(0x0050)(SaveGame, NativeAccessSpecifierPublic)
	bool                                          bIsPOISetup;                                       // 0x0148(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEncounterFinished;                                // 0x0149(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         LastFinishTime;                                    // 0x0150(0x0008)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFactionChosen;                                    // 0x0158(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEncounterSuccess;                                 // 0x0159(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EncounterCount;                                    // 0x015C(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  DynamicPOICapabitities;                            // 0x0160(0x0020)(SaveGame, NativeAccessSpecifierPublic)
	uint8                                         Pad_180[0x8];                                      // 0x0180(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIEncounterPersistenceFeatureData_InGameClass_PersistentInfo_v1
// 0x0188 (0x0188 - 0x0000)
struct FJunoPOIEncounterPersistenceFeatureData_InGameClass_PersistentInfo_v1 final
{
public:
	struct FJunoPOIEncounterSaveData_v1           SavedEncounterState;                               // 0x0000(0x0188)(NativeAccessSpecifierPublic)
};

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIEncounterSaveData_v0
// 0x0130 (0x0130 - 0x0000)
struct FJunoPOIEncounterSaveData_v0 final
{
public:
	bool                                          bEncounterChosen;                                  // 0x0000(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UEncounterItemDefinition> ChosenEncounterDefinition;                         // 0x0008(0x0030)(SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UEncounterFactionData>   ChosenFaction;                                     // 0x0038(0x0030)(SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChosenVariant;                                     // 0x0068(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataRegistryId                        EncounterRow;                                      // 0x006C(0x0018)(ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FPersistenceFrameworkDataTableRowHandle> Variables;                                         // 0x0088(0x0050)(SaveGame, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, int32>              PersistentValues;                                  // 0x00D8(0x0050)(SaveGame, NativeAccessSpecifierPublic)
	bool                                          bIsPOISetup;                                       // 0x0128(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEncounterFinished;                                // 0x0129(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFactionChosen;                                    // 0x012A(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIEncounterPersistenceFeatureData_InGameClass_PersistentInfo_v0
// 0x0130 (0x0130 - 0x0000)
struct FJunoPOIEncounterPersistenceFeatureData_InGameClass_PersistentInfo_v0 final
{
public:
	struct FJunoPOIEncounterSaveData_v0           SavedEncounterState;                               // 0x0000(0x0130)(NativeAccessSpecifierPublic)
};

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIEncounterFollowupEntry
// 0x00B0 (0x00B0 - 0x0000)
struct FJunoPOIEncounterFollowupEntry final
{
public:
	struct FDataRegistryOrTableRow                FollowupChain;                                     // 0x0000(0x0038)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      RequiredCapabilities;                              // 0x0038(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FWorldConditionQueryDefinition         WorldConditionDefinition;                          // 0x0080(0x0028)(Edit, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIDestroyActorRetainmentEntry
// 0x0008 (0x0008 - 0x0000)
struct FJunoPOIDestroyActorRetainmentEntry final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIDestroyActorInfo
// 0x0058 (0x0058 - 0x0000)
struct FJunoPOIDestroyActorInfo final
{
public:
	struct FGameplayTagQuery                      DestroyActorQuery;                                 // 0x0000(0x0048)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FJunoPOIDestroyActorRetainmentEntry> RetainmentEntries;                                 // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIHLODActorInfo
// 0x0080 (0x0080 - 0x0000)
struct FJunoPOIHLODActorInfo final
{
public:
	TSoftClassPtr<class UClass>                   HLODActorClass;                                    // 0x0000(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      HLODActorAnchorQuery;                              // 0x0030(0x0048)(Edit, NativeAccessSpecifierPublic)
	EHLODActorDestructionScope                    DestructionScope;                                  // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoEncountersPOIRuntime.JunoPOIEncounterRow
// 0x0228 (0x0230 - 0x0008)
struct FJunoPOIEncounterRow final : public FTableRowBase
{
public:
	class UEncounterItemDefinition*               EncounterDefinition;                               // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataRegistryType                      FactionRegistry;                                   // 0x0010(0x000C)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      FactionRequirements;                               // 0x0020(0x0048)(Edit, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  IdentityTags;                                      // 0x0068(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      RequiredCapabilities;                              // 0x0088(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FWorldConditionQueryDefinition         WorldConditionDefinition;                          // 0x00D0(0x0028)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FJunoPOIHLODActorInfo>          HLODActorsEntries;                                 // 0x00F8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FJunoPOIDestroyActorInfo>       DestroyActorsEntries;                              // 0x0108(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               POIFixedVariables;                                 // 0x0118(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               POIVariables;                                      // 0x0128(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FEncounterVariableCollectionSelection> POIVariableCollectionSelections;                   // 0x0138(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      RepeatWeightMitigationIdentityQuery;               // 0x0148(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         RepeatWeightMitigationFactor;                      // 0x0190(0x0038)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FJunoPOIEncounterFollowupEntry> SuccessFollowupEncounters;                         // 0x01C8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FJunoPOIEncounterFollowupEntry> FailureFollowupEncounters;                         // 0x01D8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AddToPOITags;                                      // 0x01E8(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  RemoveFromPOITags;                                 // 0x0208(0x0020)(Edit, NativeAccessSpecifierPublic)
	bool                                          bWaitForVolumeOccupied;                            // 0x0228(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Weight;                                            // 0x022C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoEncountersPOIRuntime.JunoSpawnActorStateTreeTaskInstanceData
// 0x0110 (0x0110 - 0x0000)
struct FJunoSpawnActorStateTreeTaskInstanceData final
{
public:
	TSoftClassPtr<class UClass>                   ActorClass;                                        // 0x0000(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      AnchorQuery;                                       // 0x0030(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FVector                                AnchorOffset;                                      // 0x0078(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnablePhysics;                                    // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachEncounterVolume;                            // 0x0091(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ActorTags;                                         // 0x0098(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ActorIdentifierTags;                               // 0x00B8(0x0020)(Edit, NativeAccessSpecifierPublic)
	ESpawnActorPersistenceBehavior                PersistenceBehavior;                               // 0x00D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           PersistenceId;                                     // 0x00DC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWaitForSpawnedActor;                              // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  SpawnedActor;                                      // 0x00EC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UserActor;                                         // 0x00F8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoSpawnActorTaskHelper*              JunoSpawnActorHelper;                              // 0x0100(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoEncountersPOIRuntime.JunoSpawnActorStateTreeTask
// 0x0000 (0x0030 - 0x0030)
struct FJunoSpawnActorStateTreeTask final : public FFortStateTreeEncounterTaskBase
{
};

// ScriptStruct JunoEncountersPOIRuntime.JunoSpawnedActorMakePersistentStateTreeTaskInstanceData
// 0x0058 (0x0058 - 0x0000)
struct FJunoSpawnedActorMakePersistentStateTreeTaskInstanceData final
{
public:
	struct FGameplayTagQuery                      ActorQuery;                                        // 0x0000(0x0048)(Edit, NativeAccessSpecifierPublic)
	bool                                          bMakeTransient;                                    // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 UserActor;                                         // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoEncountersPOIRuntime.JunoSpawnedActorMakePersistentStateTreeTask
// 0x0000 (0x0030 - 0x0030)
struct FJunoSpawnedActorMakePersistentStateTreeTask final : public FFortStateTreeEncounterTaskBase
{
};

// ScriptStruct JunoEncountersPOIRuntime.JunoWaitForCampActorStateTreeTaskInstanceData
// 0x0060 (0x0060 - 0x0000)
struct FJunoWaitForCampActorStateTreeTaskInstanceData final
{
public:
	struct FGameplayTagQuery                      CampTagQuery;                                      // 0x0000(0x0048)(Edit, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  CampActor;                                         // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 UserActor;                                         // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoWaitForCampActorTaskHelper*        JunoWaitForCampActorHelper;                        // 0x0058(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoEncountersPOIRuntime.JunoWaitForCampActorStateTreeTask
// 0x0000 (0x0030 - 0x0030)
struct FJunoWaitForCampActorStateTreeTask final : public FStateTreeTaskCommonBase
{
};

// ScriptStruct JunoEncountersPOIRuntime.JunoEncounterConditionalTags
// 0x0028 (0x0028 - 0x0000)
struct FJunoEncounterConditionalTags final
{
public:
	EJunoBiome                                    Biome;                                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TagsToApply;                                       // 0x0008(0x0020)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoEncountersPOIRuntime.FindPrefabSpawnedActorStateTreeTaskInstanceData
// 0x0020 (0x0020 - 0x0000)
struct FFindPrefabSpawnedActorStateTreeTaskInstanceData final
{
public:
	TSubclassOf<class AActor>                     MustBeOfClass;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 UserActor;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  Actor;                                             // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoEncountersPOIRuntime.FindPrefabSpawnedActorStateTreeTask
// 0x0020 (0x0050 - 0x0030)
struct FFindPrefabSpawnedActorStateTreeTask final : public FFortStateTreeEncounterTaskBase
{
public:
	struct FStateTreeStateLink                    TransitionTo;                                      // 0x0030(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct JunoEncountersPOIRuntime.JunoActorIsValidTransitionStateTreeTaskInstanceData
// 0x000C (0x000C - 0x0000)
struct FJunoActorIsValidTransitionStateTreeTaskInstanceData final
{
public:
	TWeakObjectPtr<class AActor>                  ActorToValidate;                                   // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActorWasValidOnEnterState;                        // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoEncountersPOIRuntime.JunoActorIsValidTransitionStateTreeTask
// 0x0048 (0x0078 - 0x0030)
struct FJunoActorIsValidTransitionStateTreeTask final : public FStateTreeTaskCommonBase
{
public:
	struct FStateTreeStateLink                    ActorValidTransitionTo;                            // 0x0030(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bTransitionWhenActorIsValid;                       // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeStateLink                    ActorNotValidTransitionTo;                         // 0x0054(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bTransitionWhenActorIsNotValid;                    // 0x0074(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bTransitionWhenActorValidityChanges;               // 0x0075(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoEncountersPOIRuntime.JunoVillagerProviderSpawnTransitionStateTreeTaskInstanceData
// 0x0058 (0x0058 - 0x0000)
struct FJunoVillagerProviderSpawnTransitionStateTreeTaskInstanceData final
{
public:
	TWeakObjectPtr<class AJunoEncounterStaticPointProvider> VillagerProvider;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         SpawnTimeout;                                      // 0x0008(0x0038)(Edit, NativeAccessSpecifierPublic)
	class AActor*                                 UserActor;                                         // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  Villager;                                          // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoEncountersPOIRuntime.JunoVillagerProviderSpawnTransitionStateTreeTask
// 0x0040 (0x0070 - 0x0030)
struct FJunoVillagerProviderSpawnTransitionStateTreeTask final : public FFortStateTreeEncounterTaskBase
{
public:
	struct FStateTreeStateLink                    TransitionTo;                                      // 0x0030(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FStateTreeStateLink                    TimeoutTransitionTo;                               // 0x0050(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
};

}

