#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoQuestsRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function JunoQuestsRuntime.JunoQuestCheatManager.SetJunoFTUEQuestTrackingEnabled
// 0x0002 (0x0002 - 0x0000)
struct JunoQuestCheatManager_SetJunoFTUEQuestTrackingEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSaveSetting;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoQuestsRuntime.JunoControllerComponent_QuestEventTracker.OnQuestCompleted
// 0x0010 (0x0010 - 0x0000)
struct JunoControllerComponent_QuestEventTracker_OnQuestCompleted final
{
public:
	TScriptInterface<class IQuestInstanceInterface> QuestInstance;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoQuestsRuntime.JunoControllerComponent_QuestEventTracker.SetTrackingEnabled
// 0x0002 (0x0002 - 0x0000)
struct JunoControllerComponent_QuestEventTracker_SetTrackingEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSaveSetting;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoQuestsRuntime.JunoControllerComponent_QuestEventTracker.GetNumTrackedFTUEQuests
// 0x0004 (0x0004 - 0x0000)
struct JunoControllerComponent_QuestEventTracker_GetNumTrackedFTUEQuests final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoQuestsRuntime.JunoControllerComponent_QuestEventTracker.IsTrackingEnabled
// 0x0001 (0x0001 - 0x0000)
struct JunoControllerComponent_QuestEventTracker_IsTrackingEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

