#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoCraftingBaseRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "JunoCraftingBaseRuntime_structs.hpp"


namespace SDK
{

// Class JunoCraftingBaseRuntime.JunoCraftingBaseSettings
// 0x0020 (0x0068 - 0x0048)
class UJunoCraftingBaseSettings final : public UPrimaryDataAsset
{
public:
	class UDataTable*                             JunoCraftingIngredientsShopUIDataTable;            // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             JunoBuildingFrontendUIDataTable;                   // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             JunoPropFrontendUIDataTable;                       // 0x0058(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoCraftingCategoryUIData*            CraftingCategoryUIData;                            // 0x0060(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static const class UJunoCraftingBaseSettings* Get();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCraftingBaseSettings">();
	}
	static class UJunoCraftingBaseSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCraftingBaseSettings>();
	}
};

// Class JunoCraftingBaseRuntime.JunoCraftingCategoryUIData
// 0x0018 (0x0050 - 0x0038)
class UJunoCraftingCategoryUIData final : public UDataAsset
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoCraftingCategoryUIDataEntry> Entries;                                           // 0x0040(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCraftingCategoryUIData">();
	}
	static class UJunoCraftingCategoryUIData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCraftingCategoryUIData>();
	}
};

}

