#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoAIRuntime

#include "Basic.hpp"

#include "JunoGameNative_classes.hpp"
#include "FortniteAIServer_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "JunoAIRuntime_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "FortniteAI_structs.hpp"
#include "FortniteAI_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "LagerRuntime_structs.hpp"
#include "LagerRuntime_classes.hpp"
#include "WorldConditions_classes.hpp"
#include "DataRegistry_structs.hpp"


namespace SDK
{

// Class JunoAIRuntime.JunoAIBotController
// 0x0240 (0x1B70 - 0x1930)
class AJunoAIBotController final : public AFortAthenaAIBotController
{
public:
	class UJunoAIInventoryComponent*              JunoAIInventoryComponent;                          // 0x1930(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FItemAndCount>                  DefaultItemsToAdd;                                 // 0x1938(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1948[0x90];                                    // 0x1948(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         EnableDurabilityOnInventory;                       // 0x19D8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         UseRoleCheckForDurability;                         // 0x1A10(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      RequiredRoleForDurability;                         // 0x1A48(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bUseFocusedActorEyeLocationForFocalPoint;          // 0x1A90(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseValidItemsPerType;                             // 0x1A91(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A92[0x6];                                     // 0x1A92(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         EffectivenessMultiplierForWeaponSelectionOnPickedOrAddedItem; // 0x1A98(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, struct FValidItemSlotConfiguration> ValidItemsTablePerType;                            // 0x1AD0(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UFortItemDefinition*                    AutomaticallyEquippedWeaponOnDurabilityBreak;      // 0x1B20(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DurabilityMultiplier;                              // 0x1B28(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           TagToApplyWhenAddingFallbackItemForDurabilityBreak; // 0x1B60(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B6C[0x4];                                     // 0x1B6C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIBotController">();
	}
	static class AJunoAIBotController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoAIBotController>();
	}
};

// Class JunoAIRuntime.JunoAIBotEvaluator_FallbackBehavior
// 0x0098 (0x02C0 - 0x0228)
class UJunoAIBotEvaluator_FallbackBehavior final : public UFortAthenaAIBotEvaluator_Movement
{
public:
	uint8                                         Pad_228[0x18];                                     // 0x0228(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEQSParametrizedQueryExecutionRequest  EQSRequest;                                        // 0x0240(0x0050)(Edit, NativeAccessSpecifierPrivate)
	TSubclassOf<class UNavigationQueryFilter>     NavigationQueryFilterClass;                        // 0x0290(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bFallbackToPointWithNoCustomNavigationQueryFilter; // 0x0298(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BestTargetActorName;                               // 0x029C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A8[0x4];                                      // 0x02A8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EnableKeyName;                                     // 0x02AC(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIBotEvaluator_FallbackBehavior">();
	}
	static class UJunoAIBotEvaluator_FallbackBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIBotEvaluator_FallbackBehavior>();
	}
};

// Class JunoAIRuntime.JunoAIBotEvaluator_FTUENPC
// 0x0100 (0x01C0 - 0x00C0)
class UJunoAIBotEvaluator_FTUENPC final : public UFortAthenaAIBotEvaluator
{
public:
	uint8                                         Pad_C0[0x24];                                      // 0x00C0(0x0024)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TeleportDestinationKeyName;                        // 0x00E4(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x4];                                       // 0x00F0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ShouldTeleportKeyName;                             // 0x00F4(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoAIFTUERuntimeConfiguration        FTUERuntimeConfiguration;                          // 0x0108(0x00B8)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIBotEvaluator_FTUENPC">();
	}
	static class UJunoAIBotEvaluator_FTUENPC* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIBotEvaluator_FTUENPC>();
	}
};

// Class JunoAIRuntime.JunoAIBotEvaluator_HardRemovalStart
// 0x00A0 (0x02C8 - 0x0228)
class UJunoAIBotEvaluator_HardRemovalStart final : public UFortAthenaAIBotEvaluator_Movement
{
public:
	uint8                                         Pad_228[0x18];                                     // 0x0228(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEQSParametrizedQueryExecutionRequest  EQSRequest;                                        // 0x0240(0x0050)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         RequestHardRemovalOnSuccess;                       // 0x0290(0x0038)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIBotEvaluator_HardRemovalStart">();
	}
	static class UJunoAIBotEvaluator_HardRemovalStart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIBotEvaluator_HardRemovalStart>();
	}
};

// Class JunoAIRuntime.JunoAIBotEvaluator_UnderThunderBehavior
// 0x0168 (0x0390 - 0x0228)
class UJunoAIBotEvaluator_UnderThunderBehavior final : public UFortAthenaAIBotEvaluator_Movement
{
public:
	uint8                                         Pad_228[0x30];                                     // 0x0228(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         IsEnabled;                                         // 0x0258(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         UseTagForShelterCheck;                             // 0x0290(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TagToCheckForSheltered;                            // 0x02C8(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      ShelterQueryTypes;                                 // 0x02D8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxShelterDistance;                                // 0x02E8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinDistanceFromShelterLocationToKeepItValid;       // 0x0320(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ShelterCollidingActorRequiresAnyTag;               // 0x0358(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TagToApplyForShelteredNPC;                         // 0x0378(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TagToApplyForNonShelteredNPC;                      // 0x0384(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIBotEvaluator_UnderThunderBehavior">();
	}
	static class UJunoAIBotEvaluator_UnderThunderBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIBotEvaluator_UnderThunderBehavior>();
	}
};

// Class JunoAIRuntime.JunoAIBotEvaluator_UnstuckFailsafe
// 0x0170 (0x0230 - 0x00C0)
class UJunoAIBotEvaluator_UnstuckFailsafe final : public UFortAthenaAIBotEvaluator
{
public:
	uint8                                         Pad_C0[0x18];                                      // 0x00C0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TeleportDestinationKeyName;                        // 0x00D8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ShouldTeleportKeyName;                             // 0x00E4(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoAIUnstuckFailsafeConfiguration    Configuration;                                     // 0x00F8(0x0138)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIBotEvaluator_UnstuckFailsafe">();
	}
	static class UJunoAIBotEvaluator_UnstuckFailsafe* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIBotEvaluator_UnstuckFailsafe>();
	}
};

// Class JunoAIRuntime.JunoAIEvaluator_RequestedMoodReaction
// 0x0008 (0x00C0 - 0x00B8)
class UJunoAIEvaluator_RequestedMoodReaction final : public UFortAthenaAIEvaluator
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIEvaluator_RequestedMoodReaction">();
	}
	static class UJunoAIEvaluator_RequestedMoodReaction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIEvaluator_RequestedMoodReaction>();
	}
};

// Class JunoAIRuntime.JunoAIFriendshipPawnComponent
// 0x0380 (0x0460 - 0x00E0)
class alignas(0x10) UJunoAIFriendshipPawnComponent final : public UFortPawnComponent
{
public:
	bool                                          bAutoEnableFriendshipChanges;                      // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoDisableFriendshipChangesWhenConverted;        // 0x00E1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             VerbsDatatable;                                    // 0x00E8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxDistanceFromPlayerToReact;                      // 0x00F0(0x0038)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinimumFriendship;                                 // 0x0128(0x0038)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaximumFriendship;                                 // 0x0160(0x0038)(Edit, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FGameplayTag> MoodReactionOnFriendshipStateIncrease;             // 0x0198(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FGameplayTag> MoodReactionOnFriendshipStateDecrease;             // 0x01E8(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_238[0x1B0];                                    // 0x0238(0x01B0)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(float RequestedValue, float UnclampedDelta, class FName& TriggeringRowName, struct FGameplayTag& ContinuousChangeName)> OnFriendshipValueRequestedChangeDelegate;          // 0x03E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F8[0x18];                                     // 0x03F8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(float NewValue, float Delta, class FName& TriggeringRowName, struct FGameplayTag& ContinuousChangeName)> OnFriendshipValueChangedDelegate;                  // 0x0410(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_420[0x18];                                     // 0x0420(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(struct FGameplayTag& OldState, struct FGameplayTag& NewState, float FriendshipValueDelta, class FName& TriggeringRowName, struct FGameplayTag& ContinuousChangeName)> OnFriendshipStateChangedDelegate;                  // 0x0438(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_448[0x4];                                      // 0x0448(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FriendshipValue;                                   // 0x044C(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           FriendshipState;                                   // 0x0450(0x000C)(Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool DisableFriendshipChanges();
	bool EnableFriendshipChanges();
	void HandleConverted(const class AFortPawn* InstigatorPawn, const class AFortPawn* ConvertedPawn);
	void HandleUnconverted(const class AFortPawn* UnconvertedPawn, const EUnconvertReason UnconvertReason);

	bool AreFriendshipChangesEnabled() const;
	const struct FGameplayTag GetFriendshipState() const;
	float GetFriendshipValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIFriendshipPawnComponent">();
	}
	static class UJunoAIFriendshipPawnComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIFriendshipPawnComponent>();
	}
};

// Class JunoAIRuntime.JunoAIInventoryComponent
// 0x0010 (0x0388 - 0x0378)
class UJunoAIInventoryComponent final : public UJunoInventoryComponent
{
public:
	uint8                                         Pad_378[0x10];                                     // 0x0378(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIInventoryComponent">();
	}
	static class UJunoAIInventoryComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIInventoryComponent>();
	}
};

// Class JunoAIRuntime.JunoAIMerchantComponent
// 0x0068 (0x0148 - 0x00E0)
class UJunoAIMerchantComponent final : public UFortPawnComponent
{
public:
	uint8                                         Pad_E0[0x68];                                      // 0x00E0(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIMerchantComponent">();
	}
	static class UJunoAIMerchantComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIMerchantComponent>();
	}
};

// Class JunoAIRuntime.JunoAIRuntimeAnalytics
// 0x0000 (0x0030 - 0x0030)
class UJunoAIRuntimeAnalytics final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIRuntimeAnalytics">();
	}
	static class UJunoAIRuntimeAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIRuntimeAnalytics>();
	}
};

// Class JunoAIRuntime.JunoBTTask_FTUENPC
// 0x0018 (0x0140 - 0x0128)
class UJunoBTTask_FTUENPC final : public UFortBTTask_ExecuteGameplayAbility
{
public:
	class FName                                   FTUENPCStatusKeyName;                              // 0x0128(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ShouldTeleportKeyName;                             // 0x0134(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBTTask_FTUENPC">();
	}
	static class UJunoBTTask_FTUENPC* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBTTask_FTUENPC>();
	}
};

// Class JunoAIRuntime.JunoBTTask_ReactToVerb
// 0x0010 (0x00B0 - 0x00A0)
class UJunoBTTask_ReactToVerb final : public UFortAthenaBTTask_ReactToVerb
{
public:
	class FName                                   MoodReactionTagKeyName;                            // 0x00A0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBTTask_ReactToVerb">();
	}
	static class UJunoBTTask_ReactToVerb* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBTTask_ReactToVerb>();
	}
};

// Class JunoAIRuntime.JunoBTTask_RunMoodReaction
// 0x0060 (0x00E0 - 0x0080)
class UJunoBTTask_RunMoodReaction final : public UBTTaskNode
{
public:
	bool                                          bRunMoodComponentRequest;                          // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRandomizedMoodReactionConfig>  PossibleMoodReactions;                             // 0x0088(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaximumDuration;                                   // 0x0098(0x0038)(Edit, NativeAccessSpecifierPrivate)
	class FName                                   ExecutionStatusKeyName;                            // 0x00D0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBTTask_RunMoodReaction">();
	}
	static class UJunoBTTask_RunMoodReaction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBTTask_RunMoodReaction>();
	}
};

// Class JunoAIRuntime.FJunoAICampManagementVisitorWorldConditionSchema
// 0x0000 (0x0050 - 0x0050)
class UFJunoAICampManagementVisitorWorldConditionSchema final : public UJunoCampWorldConditionSchema
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FJunoAICampManagementVisitorWorldConditionSchema">();
	}
	static class UFJunoAICampManagementVisitorWorldConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFJunoAICampManagementVisitorWorldConditionSchema>();
	}
};

// Class JunoAIRuntime.JunoAICampManagementRewardsWorldConditionSchema
// 0x0010 (0x0060 - 0x0050)
class UJunoAICampManagementRewardsWorldConditionSchema final : public UJunoCampWorldConditionSchema
{
public:
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAICampManagementRewardsWorldConditionSchema">();
	}
	static class UJunoAICampManagementRewardsWorldConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAICampManagementRewardsWorldConditionSchema>();
	}
};

// Class JunoAIRuntime.JunoCampAIManagementComponent
// 0x0EB8 (0x0F90 - 0x00D8)
class UJunoCampAIManagementComponent final : public UJunoCampComponentBase
{
public:
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoCampAICachedRecruitmentData       CachedAndReplicatedRecruitmentData;                // 0x00F0(0x0030)(Net, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_120[0x68];                                     // 0x0120(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, TWeakObjectPtr<class AFortPawn>> UniqueAIIdentifierToSpawnedAIs;                    // 0x0188(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D8[0x100];                                    // 0x01D8(0x0100)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> NPCPointProviders;                                 // 0x02D8(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UFortAthenaLivingWorldEncounterInstance* NPCEncounter;                                      // 0x02E8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> CreaturePointProviders;                            // 0x02F0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UFortAthenaLivingWorldEncounterInstance* CreatureEncounter;                                 // 0x0300(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FJunoAICampManagementVisitorsConfigurationDigested VisitorsConfigurationDigested;                     // 0x0308(0x0018)(Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJunoAICampManagementFixedNPCsPickingConfiguration> CachedFixedNPCsConfigurationAtCurrentAwesomenessLevel; // 0x0320(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	struct FJunoAICampManagementVisitorsPickingConfiguration CachedVisitorsPickingConfigurationAtCurrentAwesomenessLevel; // 0x0330(0x0028)(Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FGameplayTag>                   NonSpawnedCreaturesIdentifiersWaitingForSpawnCondition; // 0x0358(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoAICampManagementLWMConfiguration  NPCLWMConfiguration;                               // 0x0370(0x0440)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FJunoAICampManagementLWMConfiguration  CreaturesLWMConfiguration;                         // 0x07B0(0x0440)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FJunoAICampManagementVisitorsConfiguration VisitorsConfiguration;                             // 0x0BF0(0x0040)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<int32, class UDataTable*>                AwesomenessLevelToFixedNPCsConfiguration;          // 0x0C30(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<int32, struct FDataTableRowHandle>       AwesomenessLevelToVisitorsPickingConfiguration;    // 0x0C80(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<int32, class UDataTable*>                AwesomenessLevelToNPCRewards;                      // 0x0CD0(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FScalableFloat                         InitialIngameHoursDelayBeforeFirstRewardRoll;      // 0x0D20(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinimumIngameHoursBetweenRewardRolls;              // 0x0D58(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ResetDelayBetweenRollsOnLevelChange;               // 0x0D90(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PassiveResourceGatheringTime;                      // 0x0DC8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MultiplierForSimulatedGeneration;                  // 0x0E00(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaximumAllocableSOPerAIForSimulation;              // 0x0E38(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FNavAgentSelector                      SupportedAgents;                                   // 0x0E70(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_E74[0x4];                                      // 0x0E74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         ShouldCheckWCForRemoteRecruitment;                 // 0x0E78(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RequireNPCToBeInVisitorsListForRemoteRecruitment;  // 0x0EB0(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SpawnDelayFromCampSpawn;                           // 0x0EE8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinDistanceFromPlayersToAddVisitors;               // 0x0F20(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinDistanceFromPlayersToAddFixedNPCs;              // 0x0F58(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void HandleAIControllerChanged(class APawn* Pawn, class AController* OldController, class AController* NewController);
	void HandleAIControllerFullySpawned(const class AAIController* Controller, const class AFortPawn* Pawn);
	void HandleAIDespawned(const class AActor* DespawnedAIPawn, const class UFortAthenaLivingWorldEventData* EventData);
	void HandleAISpawned(const class AActor* SpawnedAIPawn, const class UFortAthenaLivingWorldEventData* EventData);
	void HandleAwesomeLevelChanged(const struct FJunoAwesomeLevelChangeData& ChangeData);
	void HandleAwesomeLevelReady(const struct FJunoCampAwesomeStatsData& AwesomeData);
	bool RequestCreatureTemporaryDespawn(const struct FGameplayTag& UniqueAIIdentifier);

	const struct FJunoCampAICachedRecruitmentData GetCachedAndReplicatedRecruitmentData() const;
	class AFortPawn* GetSpawnedAIFromUniqueAIIdentifier(const struct FGameplayTag& UniqueAIIdentifier) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCampAIManagementComponent">();
	}
	static class UJunoCampAIManagementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCampAIManagementComponent>();
	}
};

// Class JunoAIRuntime.JunoCaveLivingWorldEventData
// 0x0078 (0x0208 - 0x0190)
class UJunoCaveLivingWorldEventData final : public UFortAthenaLivingWorldEventData
{
public:
	uint8                                         Pad_190[0x8];                                      // 0x0190(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         CaveRoomDistanceMin;                               // 0x0198(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         CaveRoomDistanceMax;                               // 0x01D0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCaveLivingWorldEventData">();
	}
	static class UJunoCaveLivingWorldEventData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCaveLivingWorldEventData>();
	}
};

// Class JunoAIRuntime.JunoCreatureInCampLivingWorldStaticPointProvider
// 0x0008 (0x0598 - 0x0590)
class AJunoCreatureInCampLivingWorldStaticPointProvider final : public AFortAthenaLivingWorldStaticPointProvider
{
public:
	uint8                                         Pad_590[0x8];                                      // 0x0590(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCreatureInCampLivingWorldStaticPointProvider">();
	}
	static class AJunoCreatureInCampLivingWorldStaticPointProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoCreatureInCampLivingWorldStaticPointProvider>();
	}
};

// Class JunoAIRuntime.JunoCreaturePawnComponent
// 0x0278 (0x0358 - 0x00E0)
class UJunoCreaturePawnComponent final : public UFortPawnComponent
{
public:
	struct FGameplayTag                           HUDKeyTag;                                         // 0x00E0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAIFriendshipContinuousChangeConfiguration ContinuousFriendshipChangeConfigurationWhenNoInteractions; // 0x00EC(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxNoInteractionTimeForNPCBeforeFriendshipChangeInJunoGameTimeHours; // 0x0100(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FAIFriendshipContinuousChangeConfiguration ContinuousFriendshipChangeConfigurationWithNoRecruitmentObject; // 0x0138(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FAIFriendshipContinuousChangeConfiguration ContinuousFriendshipChangeConfigurationWithSoftRemovedCamp; // 0x014C(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ConvertedOverrideTileGenerationRadius;             // 0x0160(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ConvertedOverrideTileRemovalRadius;                // 0x0198(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         AutomaticFriendshipResetDelay;                     // 0x01D0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      ValidFriendshipStateQueryForAutomaticReset;        // 0x0208(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(class AJunoCampActor* Camp)> OnJunoCreatureRecruitedToCampDelegate;             // 0x0250(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(class FText& NewName)> OnJunoCreatureCustomNameChangedDelegate;           // 0x0260(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	class FText                                   CachedAndReplicatedCustomName;                     // 0x0270(0x0010)(Net, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_280[0xD8];                                     // 0x0280(0x00D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AssignNewCustomName(const struct FJunoRecruitmentObjectAssignedData& AssignedData, const class AFortPlayerController* InstigatorController, const struct FGameplayTag& CreatureDescriptorTag);
	void HandleConverted(const class AFortPawn* InstigatorPawn, const class AFortPawn* ConvertedPawn);
	void HandleDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void HandleUnconverted(const class AFortPawn* UnconvertedPawn, const EUnconvertReason UnconvertReason);
	void NotifyFeeding(const class AFortPawn* Instigator, const class UItemDefinitionBase* ItemBeingFed);
	void NotifyPetting(const class AFortPawn* Instigator);

	class UJunoCampRecruitmentObjectComponent* GetAssignedAndSpawnedRecruitmentObject() const;
	const struct FGuid GetAssignedRecruitmentObjectId() const;
	const class FText GetCustomName() const;
	void OnRep_CachedCustomName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCreaturePawnComponent">();
	}
	static class UJunoCreaturePawnComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCreaturePawnComponent>();
	}
};

// Class JunoAIRuntime.JunoNPCPawnComponent
// 0x0300 (0x03E0 - 0x00E0)
class UJunoNPCPawnComponent final : public UFortPawnComponent
{
public:
	TMulticastInlineDelegate<void(struct FGameplayTagContainer& NewSoftRemovedReason)> OnJunoNPCPawnComponentChangedSoftRemovedReason;    // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F0[0x120];                                     // 0x00F0(0x0120)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UFortAthenaAIBotSkillSet>> PreFTUESkillSetClasses;                            // 0x0210(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UFortAthenaAIRuntimeParameters_AIBotConvert* CachedAIBotConvertParameters;                      // 0x0220(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_228[0x58];                                     // 0x0228(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, class FText>        AIRoleToDisplayText;                               // 0x0280(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class UFortAthenaAIBotSkillSet>> FTUESkillSetClasses;                               // 0x02D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  FTUETagsToAdd;                                     // 0x02E0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         FTUEOverrideTileGenerationRadius;                  // 0x0300(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         FTUEOverrideTileRemovalRadius;                     // 0x0338(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeToGoInHardRemovalStartStateBeforeHardRemovalInRealSeconds; // 0x0370(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeForVisitorsToGoInHardRemovalStartStateBeforeHardRemovalInRealSeconds; // 0x03A8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	void HandleDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void HandlePlayerSpawn(const class AFortPlayerPawn* NewlySpawnedPlayerPawn);

	const class FText ConvertAIRoleToDisplayText(const struct FGameplayTag& AIRole) const;
	const struct FGameplayTag GetAIRole() const;
	const class FText GetAIRoleDisplayText() const;
	const struct FGameplayTagContainer GetSoftRemovedReasons() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoNPCPawnComponent">();
	}
	static class UJunoNPCPawnComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoNPCPawnComponent>();
	}
};

// Class JunoAIRuntime.JunoQueryContext_AICamp_AssignedRecruitmentObject
// 0x0000 (0x0030 - 0x0030)
class UJunoQueryContext_AICamp_AssignedRecruitmentObject final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoQueryContext_AICamp_AssignedRecruitmentObject">();
	}
	static class UJunoQueryContext_AICamp_AssignedRecruitmentObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoQueryContext_AICamp_AssignedRecruitmentObject>();
	}
};

// Class JunoAIRuntime.JunoQueryContext_AICamp_LastOrCurrentAssignedRecruitmentObject_Location
// 0x0000 (0x0030 - 0x0030)
class UJunoQueryContext_AICamp_LastOrCurrentAssignedRecruitmentObject_Location final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoQueryContext_AICamp_LastOrCurrentAssignedRecruitmentObject_Location">();
	}
	static class UJunoQueryContext_AICamp_LastOrCurrentAssignedRecruitmentObject_Location* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoQueryContext_AICamp_LastOrCurrentAssignedRecruitmentObject_Location>();
	}
};

// Class JunoAIRuntime.JunoAIFTUEEndWorldConditionSchema
// 0x0000 (0x0040 - 0x0040)
class UJunoAIFTUEEndWorldConditionSchema final : public UWorldConditionSchema
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIFTUEEndWorldConditionSchema">();
	}
	static class UJunoAIFTUEEndWorldConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIFTUEEndWorldConditionSchema>();
	}
};

// Class JunoAIRuntime.PlayspaceComponent_Root_JunoAIManagement
// 0x0C88 (0x0DB8 - 0x0130)
class UPlayspaceComponent_Root_JunoAIManagement final : public UFortPlayspaceComponent
{
public:
	struct FJunoAIFollowerLWMConfiguration        LWMConfiguration;                                  // 0x0130(0x0440)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FJunoAITemporaryGlobalEncounterLWMConfiguration TemporaryGlobalEncounterLWMConfiguration;          // 0x0570(0x0438)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FSoftDataRegistryOrTable               FTUEConfigurationsTable;                           // 0x09A8(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxNoInteractionTimeForNPCBeforeSoftRemovalInJunoGameTimeHours; // 0x09F0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeBeforeSoftRemovedNPCBecomesHardRemovedInJunoGameTimeHours; // 0x0A28(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeToRemoveStaleFollowersFromDisconnectedPlayersInRealHours; // 0x0A60(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SecondsToWaitBeforeRemovingStaleFollowers;         // 0x0A98(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeBeforeSoftRemovedCreatureBecomesHardRemovedInJunoGameTimeHours; // 0x0AD0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinFriendshipValueBeforeSoftRemoval;               // 0x0B08(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         GlobalRecruitableNPCsCap;                          // 0x0B40(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         GlobalRecruitableCreaturesCap;                     // 0x0B78(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UDataTable*                             BannedDescriptorTagsTable;                         // 0x0BB0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BB8[0x30];                                     // 0x0BB8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoAIFollowerManagedData>     ManagedFollowers;                                  // 0x0BE8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface> TemporaryGlobalEncounterPointProvider;             // 0x0BF8(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAthenaLivingWorldEncounterInstance* TemporaryGlobalEncounter;                          // 0x0C08(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, struct FJunoAIFTUEConfiguration> DigestedFTUEConfigurations;                        // 0x0C10(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, struct FFTUERuntimeData> FTUERuntimeDatas;                                  // 0x0C60(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_CB0[0x70];                                     // 0x0CB0(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FJunoAIWorldNPCSpawningData> WorldAssignedNPCs;                                 // 0x0D20(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D70[0x48];                                     // 0x0D70(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleFTUENPCSpawned(const class AActor* FTUENPC, const class UFortAthenaLivingWorldEventData* EventData);
	void HandlePlayerSpawn(const class AFortPlayerPawn* NewlySpawnedPlayerPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayspaceComponent_Root_JunoAIManagement">();
	}
	static class UPlayspaceComponent_Root_JunoAIManagement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceComponent_Root_JunoAIManagement>();
	}
};

// Class JunoAIRuntime.JunoAISafetyBubbleComponent
// 0x00C8 (0x01A0 - 0x00D8)
class UJunoAISafetyBubbleComponent final : public UActorComponent
{
public:
	TArray<struct FFortAthenaLivingWorldEventTagDensityRegistration> TagsData;                                          // 0x00D8(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         InGameHoursDuration;                               // 0x00E8(0x0038)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SafetyBubbleRadius;                                // 0x0120(0x0038)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_158[0x48];                                     // 0x0158(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTimeOfDayPhaseChanged(EFortDayPhase CurrentDayPhase, EFortDayPhase PreviousDayPhase, bool bAtCreation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAISafetyBubbleComponent">();
	}
	static class UJunoAISafetyBubbleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAISafetyBubbleComponent>();
	}
};

// Class JunoAIRuntime.EnvQueryTest_JunoIsNearBuilding
// 0x00B0 (0x0310 - 0x0260)
class UEnvQueryTest_JunoIsNearBuilding final : public UEnvQueryTest
{
public:
	struct FEnvOverlapData                        OverlapData;                                       // 0x0260(0x0030)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAIDataProviderBoolValue               GenerateOnlyInsideClusterBounds;                   // 0x0290(0x0040)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              MinimumBuildingClusterVolume;                      // 0x02D0(0x0040)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryTest_JunoIsNearBuilding">();
	}
	static class UEnvQueryTest_JunoIsNearBuilding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_JunoIsNearBuilding>();
	}
};

// Class JunoAIRuntime.EnvQueryTest_JunoIsUnderCeiling
// 0x0070 (0x02D0 - 0x0260)
class UEnvQueryTest_JunoIsUnderCeiling final : public UEnvQueryTest
{
public:
	struct FEnvOverlapData                        SweepData;                                         // 0x0260(0x0030)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              SweepHeight;                                       // 0x0290(0x0040)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryTest_JunoIsUnderCeiling">();
	}
	static class UEnvQueryTest_JunoIsUnderCeiling* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_JunoIsUnderCeiling>();
	}
};

// Class JunoAIRuntime.JunoAIBotEvaluator_ReactToVerb
// 0x0010 (0x04E0 - 0x04D0)
class UJunoAIBotEvaluator_ReactToVerb final : public UFortAthenaAIBotEvaluator_ReactToVerb
{
public:
	class FName                                   MoodReactionTagKeyName;                            // 0x04C8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4D4[0xC];                                      // 0x04D4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIBotEvaluator_ReactToVerb">();
	}
	static class UJunoAIBotEvaluator_ReactToVerb* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIBotEvaluator_ReactToVerb>();
	}
};

// Class JunoAIRuntime.JunoAICheatManager
// 0x0000 (0x0030 - 0x0030)
class UJunoAICheatManager final : public UChildCheatManager
{
public:
	void JunoPauseTargetAI(bool bPause);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAICheatManager">();
	}
	static class UJunoAICheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAICheatManager>();
	}
};

// Class JunoAIRuntime.PlayspaceComponent_JunoAISafetyBubble
// 0x0010 (0x0140 - 0x0130)
class UPlayspaceComponent_JunoAISafetyBubble final : public UFortPlayspaceComponent
{
public:
	TSubclassOf<class UJunoAISafetyBubbleComponent> SafetyBubbleComponent;                             // 0x0130(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPreventSafetyBubbleInCamp;                        // 0x0138(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayspaceComponent_JunoAISafetyBubble">();
	}
	static class UPlayspaceComponent_JunoAISafetyBubble* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceComponent_JunoAISafetyBubble>();
	}
};

// Class JunoAIRuntime.AITask_JunoMoveTo
// 0x0018 (0x0150 - 0x0138)
class UAITask_JunoMoveTo final : public UAITask_MoveTo
{
public:
	struct FJunoMoveConfig                        MoveConfig;                                        // 0x0138(0x000C)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  BlockedByActor;                                    // 0x0144(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AITask_JunoMoveTo">();
	}
	static class UAITask_JunoMoveTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAITask_JunoMoveTo>();
	}
};

// Class JunoAIRuntime.BTTask_JunoMoveTo
// 0x00E8 (0x0328 - 0x0240)
class UBTTask_JunoMoveTo final : public UFortAthenaBTTask_MoveTo
{
public:
	uint8                                         bOnUnreachableGoalFindBlockingBuilding : 1;        // 0x0240(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAssignFoundBlockingBuildingAsTarget : 1;          // 0x0240(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         BlockingBuildingTraceDistance;                     // 0x0248(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         BlockingBuildingTraceCooldown;                     // 0x0280(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 BlockedByBuildingKeySelector;                      // 0x02B8(0x0030)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 LastBlockingBuildingTraceTimeKeySelector;          // 0x02E8(0x0030)(Edit, NativeAccessSpecifierPublic)
	EPathObstacleAction                           PathObstacleAction;                                // 0x0318(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bApplyCostLimit : 1;                               // 0x031C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PathingCostLimitFactor;                            // 0x0320(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PathingMinimumCostLimit;                           // 0x0324(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTTask_JunoMoveTo">();
	}
	static class UBTTask_JunoMoveTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_JunoMoveTo>();
	}
};

// Class JunoAIRuntime.JunoWorldCondition_AIWorldSettings_State
// 0x0038 (0x0068 - 0x0030)
class UJunoWorldCondition_AIWorldSettings_State final : public UObject
{
public:
	uint8                                         Pad_30[0x38];                                      // 0x0030(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWorldCondition_AIWorldSettings_State">();
	}
	static class UJunoWorldCondition_AIWorldSettings_State* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWorldCondition_AIWorldSettings_State>();
	}
};

}

