#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoGameNative

#include "Basic.hpp"

#include "BuilderTool_structs.hpp"
#include "BuilderTool_classes.hpp"
#include "JunoWorldManagement_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "SoundLibrary_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "FortniteVersion_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "JunoGameNative_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ContextualAnimation_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "FortniteAI_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "DeltaFileSystem_structs.hpp"
#include "MeshNetwork_classes.hpp"
#include "GameFeatures_classes.hpp"
#include "TacticalSprintRuntime_classes.hpp"
#include "WorldConditions_classes.hpp"
#include "GameplayEventRouter_structs.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "SpatialMetricsCore_classes.hpp"
#include "GameplayStateMachine_classes.hpp"
#include "GeometryScriptingCore_structs.hpp"
#include "CraftingRuntime_classes.hpp"
#include "GameplayGraph_structs.hpp"
#include "FortGameplayGraph_structs.hpp"
#include "FortImGuiCore_classes.hpp"


namespace SDK
{

// Class JunoGameNative.JunoInputMappingComponentData
// 0x0030 (0x0068 - 0x0038)
class UJunoInputMappingComponentData final : public UDataAsset
{
public:
	TArray<struct FJunoInputMapping>              DesiredInputMappings;                              // 0x0038(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJunoInputAlternateDisplayText> DisplayTexts;                                      // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           EventTag;                                          // 0x0058(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPopDefaultContext;                                // 0x0064(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetEventTag(const struct FGameplayTag& InTag);

	const struct FGameplayTag GetEventTag() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoInputMappingComponentData">();
	}
	static class UJunoInputMappingComponentData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoInputMappingComponentData>();
	}
};

// Class JunoGameNative.FortAutomationRpcManager_Juno
// 0x0050 (0x00C0 - 0x0070)
class UFortAutomationRpcManager_Juno final : public UFortAutomationRpcManager
{
public:
	uint8                                         Pad_70[0x50];                                      // 0x0070(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAutomationRpcManager_Juno">();
	}
	static class UFortAutomationRpcManager_Juno* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAutomationRpcManager_Juno>();
	}
};

// Class JunoGameNative.FortQueryGenerator_PointsOutsideVolume
// 0x0088 (0x0120 - 0x0098)
class UFortQueryGenerator_PointsOutsideVolume final : public UEnvQueryGenerator_ProjectedPoints
{
public:
	struct FAIDataProviderFloatValue              SpaceBetween;                                      // 0x0098(0x0040)(Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FAIDataProviderFloatValue              NumberOfRingsAroundVolume;                         // 0x00D8(0x0040)(Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UEnvQueryContext>           GenerateInVolume;                                  // 0x0118(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryGenerator_PointsOutsideVolume">();
	}
	static class UFortQueryGenerator_PointsOutsideVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryGenerator_PointsOutsideVolume>();
	}
};

// Class JunoGameNative.JunoKnowledgePersistenceFeatureModule
// 0x0000 (0x00E8 - 0x00E8)
class UJunoKnowledgePersistenceFeatureModule final : public UPersistenceFrameworkModule
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoKnowledgePersistenceFeatureModule">();
	}
	static class UJunoKnowledgePersistenceFeatureModule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoKnowledgePersistenceFeatureModule>();
	}
};

// Class JunoGameNative.JunoBuildingTrackedActorInterface
// 0x0000 (0x0030 - 0x0030)
class IJunoBuildingTrackedActorInterface final : public IInterface
{
public:
	float GetNetRelevanceDistanceOverride() const;
	int32 GetNumberOfRelevantActors() const;
	bool ShouldBeTrackedByMetrics() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBuildingTrackedActorInterface">();
	}
	static class IJunoBuildingTrackedActorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoBuildingTrackedActorInterface>();
	}
};

// Class JunoGameNative.JunoAbility_Gear
// 0x0000 (0x0BC8 - 0x0BC8)
class UJunoAbility_Gear : public UFortGameplayAbility
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAbility_Gear">();
	}
	static class UJunoAbility_Gear* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAbility_Gear>();
	}
};

// Class JunoGameNative.JunoBasePFWContainer
// 0x00A8 (0x0208 - 0x0160)
class UJunoBasePFWContainer : public UPersistenceFrameworkContainer
{
public:
	uint8                                         Pad_160[0xA8];                                     // 0x0160(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBasePFWContainer">();
	}
	static class UJunoBasePFWContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBasePFWContainer>();
	}
};

// Class JunoGameNative.JunoBasePFWPersistenceFeatureDataContainer
// 0x0000 (0x0208 - 0x0208)
class UJunoBasePFWPersistenceFeatureDataContainer : public UJunoBasePFWContainer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBasePFWPersistenceFeatureDataContainer">();
	}
	static class UJunoBasePFWPersistenceFeatureDataContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBasePFWPersistenceFeatureDataContainer>();
	}
};

// Class JunoGameNative.JunoInventoryPersistenceFeatureData_Container
// 0x0000 (0x0208 - 0x0208)
class UJunoInventoryPersistenceFeatureData_Container final : public UJunoBasePFWPersistenceFeatureDataContainer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoInventoryPersistenceFeatureData_Container">();
	}
	static class UJunoInventoryPersistenceFeatureData_Container* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoInventoryPersistenceFeatureData_Container>();
	}
};

// Class JunoGameNative.JunoAbility_Gear_Resurrect
// 0x0000 (0x0BC8 - 0x0BC8)
class UJunoAbility_Gear_Resurrect final : public UJunoAbility_Gear
{
public:
	void OnResurrectTriggered();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAbility_Gear_Resurrect">();
	}
	static class UJunoAbility_Gear_Resurrect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAbility_Gear_Resurrect>();
	}
};

// Class JunoGameNative.JunoAbility_PlayerPushPhysicsObject
// 0x0150 (0x0D18 - 0x0BC8)
class UJunoAbility_PlayerPushPhysicsObject final : public UFortGameplayAbility
{
public:
	EFortPhysicsSimSize                           MaxPhysicsObjectSizeToPush;                        // 0x0BC8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFortPhysicsSimSize                           MinPhysicsObjectSizeToPush;                        // 0x0BC9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BCA[0x6];                                      // 0x0BCA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  NoTagsPusher;                                      // 0x0BD0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  NoTagsPushedObject;                                // 0x0BF0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           DefaultPushMontage;                                // 0x0C10(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FPushMontageData>               SpecializedPushMontages;                           // 0x0C18(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      EnergyComponentQuery;                              // 0x0C28(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         EnergyInitialCost;                                 // 0x0C70(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         EnergyDrainPerSecond;                              // 0x0CA8(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bEnergyExhausted;                                  // 0x0CE0(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_CE1[0x3];                                      // 0x0CE1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UFortComponent_Energy>   CachedEnergyComponent;                             // 0x0CE4(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_CEC[0xC];                                      // 0x0CEC(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  TrackedObjectToPush;                               // 0x0CF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFortPhysicsSimSize                           TrackedObjectSimSize;                              // 0x0D00(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D01[0x17];                                     // 0x0D01(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CancelPushingPhysicsObject();
	void OnEnergyDrained(class UFortComponent_Energy* EnergyComponentDrained);
	void OnEnergyFullyRecharged(class UFortComponent_Energy* EnergyComponentRecharged);
	void OnPlayerHit(class AActor* HitPlayer, class AActor* HitActor, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void PotentiallyStartUsingEnergy();
	void StopUsingEnergy();

	class UAnimMontage* GetMontageToPlay() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAbility_PlayerPushPhysicsObject">();
	}
	static class UJunoAbility_PlayerPushPhysicsObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAbility_PlayerPushPhysicsObject>();
	}
};

// Class JunoGameNative.JunoBuildingPreviewComponent
// 0x0010 (0x00E8 - 0x00D8)
class UJunoBuildingPreviewComponent : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_D8[0x10];                                      // 0x00D8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceiveCleared();
	void ReceiveCreated();
	void ReceiveDisabled();
	void ReceiveEnabled();
	void ReceivePlacementStarted();
	void ReceiveSet();

	const struct FJunoBuildingSelectionPreview GetOwningPreviewRef(bool* bSuccess) const;
	const class AJunoBuildingPreviewer* GetPreviewer() const;
	TSubclassOf<class AActor> GetSourceActorClass() const;
	bool IsSet() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBuildingPreviewComponent">();
	}
	static class UJunoBuildingPreviewComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingPreviewComponent>();
	}
};

// Class JunoGameNative.JunoGuidedBuildingPreviewComponent
// 0x0010 (0x00F8 - 0x00E8)
class UJunoGuidedBuildingPreviewComponent final : public UJunoBuildingPreviewComponent
{
public:
	uint8                                         Pad_E8[0x10];                                      // 0x00E8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UBoxComponent* GetBuildableCollision() const;
	class UBoxComponent* GetFoundationCollision() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoGuidedBuildingPreviewComponent">();
	}
	static class UJunoGuidedBuildingPreviewComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoGuidedBuildingPreviewComponent>();
	}
};

// Class JunoGameNative.JunoAccountItemDefinitionOverrideManager
// 0x0208 (0x0238 - 0x0030)
class UJunoAccountItemDefinitionOverrideManager final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHeroType*                          JunoHeroDefinition;                                // 0x0038(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             DefaultCharacters;                                 // 0x0040(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<TSoftClassPtr<class UClass>, TSoftClassPtr<class UClass>> PreviewActorClasses;                               // 0x0048(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<TSoftClassPtr<class UClass>, struct FGameplayTagContainer> GameplayTagParentsToRemoveFromOverrides;           // 0x0098(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<TSoftClassPtr<class UClass>, struct FGameplayTagContainer> GameplayTagsToAdd;                                 // 0x00E8(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<TSoftClassPtr<class UClass>, struct FGameplayTagContainer> CosmeticsMarkupGameplayTagsToAllow;                // 0x0138(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSet<class FString>                           CosmeticsProhibitedByHotfix;                       // 0x0188(0x0050)(Config, Protected, NativeAccessSpecifierProtected)
	TMap<struct FPrimaryAssetId, struct FJunoAccountItemDefinitionOverride> Overrides;                                         // 0x01D8(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_228[0x10];                                     // 0x0228(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAccountItemDefinitionOverrideManager">();
	}
	static class UJunoAccountItemDefinitionOverrideManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAccountItemDefinitionOverrideManager>();
	}
};

// Class JunoGameNative.JunoAccountItemOverrideDefinition
// 0x00C0 (0x0108 - 0x0048)
class UJunoAccountItemOverrideDefinition : public UPrimaryDataAsset
{
public:
	struct FGameplayTagContainer                  GameplayTagsToAdd;                                 // 0x0048(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortCosmeticVariant*>           ItemVariantsOverride;                              // 0x0068(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                          bOverrideFrontendTransform;                        // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FrontendPreviewScale;                              // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                FrontendPreviewPivotOffset;                        // 0x0080(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               FrontendPreviewInitialRotation;                    // 0x0098(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FRotator                               FrontendPreviewPawnRotationOffset;                 // 0x00B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   PreviewActorClass;                                 // 0x00C8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortReleaseVersion                    FortReleaseVersion;                                // 0x00F8(0x000C)(Edit, BlueprintVisible, DuplicateTransient, EditorOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAccountItemOverrideDefinition">();
	}
	static class UJunoAccountItemOverrideDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAccountItemOverrideDefinition>();
	}
};

// Class JunoGameNative.JunoKnowledgeBundle
// 0x0088 (0x00D0 - 0x0048)
class UJunoKnowledgeBundle final : public UPrimaryDataAsset
{
public:
	class UDataTable*                             RecipeTable;                                       // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   BundleName;                                        // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   BundleDescription;                                 // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UObject>                 BundleImage;                                       // 0x0070(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           BundleIdentifier;                                  // 0x00A0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  BundleTags;                                        // 0x00B0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoKnowledgeBundle">();
	}
	static class UJunoKnowledgeBundle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoKnowledgeBundle>();
	}
};

// Class JunoGameNative.JunoAthenaCharacterItemOverrideDefinition
// 0x00D8 (0x01E0 - 0x0108)
class UJunoAthenaCharacterItemOverrideDefinition final : public UJunoAccountItemOverrideDefinition
{
public:
	uint8                                         Pad_108[0x10];                                     // 0x0108(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAthenaCharacterItemDefinition> BaseAthenaCharacterItemDefinition;                 // 0x0118(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAssembledMeshSchema>    AssembledMeshSchema;                               // 0x0148(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAssembledMeshSchema>    LowDetailsAssembledMeshSchema;                     // 0x0178(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            FrontendAnimMontageIdleOverride;                   // 0x01A8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PreviewPawnScale;                                  // 0x01D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CreateDetailsLevelVariantChannelOnBaseCID();
	bool DoesDetailsLevelVariantChannelExistOnBaseCID();
	void RemoveDetailsLevelVariantChannelOnBaseCID();
	void SetBaseAthenaCharacterItemDefinition(TSoftObjectPtr<class UAthenaCharacterItemDefinition> InBaseAthenaCharacterItemDefinition);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAthenaCharacterItemOverrideDefinition">();
	}
	static class UJunoAthenaCharacterItemOverrideDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAthenaCharacterItemOverrideDefinition>();
	}
};

// Class JunoGameNative.JunoAthenaDanceItemOverrideDefinition
// 0x01D8 (0x02E0 - 0x0108)
class UJunoAthenaDanceItemOverrideDefinition final : public UJunoAccountItemOverrideDefinition
{
public:
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAthenaDanceItemDefinition> BaseAthenaDanceItemDefinition;                     // 0x0110(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            Animation;                                         // 0x0140(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            AnimationFemaleOverride;                           // 0x0170(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortEmoteMapping>              AnimationOverrides;                                // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bOverridePlayRandomSectionByName;                  // 0x01B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSectionNameAndWeight>          PlayRandomSectionByName;                           // 0x01B8(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            FrontEndAnimation;                                 // 0x01C8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            FrontEndAnimationFemaleOverride;                   // 0x01F8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortEmoteMapping>              FrontEndAnimationOverrides;                        // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bOverridePreviewDuration;                          // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PreviewLoops;                                      // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PreviewLength;                                     // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                GroupEmotePositionOffset;                          // 0x0248(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GroupEmotePositionOffsetTolerance;                 // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GroupEmoteFollowDistance;                          // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WalkForwardSpeed;                                  // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableGroupEmoteFollowerPreview;                  // 0x026C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideGroupEmotePreviewSettings;                // 0x026D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_26E[0x2];                                      // 0x026E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGroupEmotePreviewSettings             GroupEmotePreviewSettings;                         // 0x0270(0x0070)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	void SetBaseAthenaDanceItemDefinition(TSoftObjectPtr<class UAthenaDanceItemDefinition> InBaseAthenaDanceItemDefinition);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAthenaDanceItemOverrideDefinition">();
	}
	static class UJunoAthenaDanceItemOverrideDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAthenaDanceItemOverrideDefinition>();
	}
};

// Class JunoGameNative.JunoLostAndFoundInventoryFeatureModule
// 0x0000 (0x00E8 - 0x00E8)
class UJunoLostAndFoundInventoryFeatureModule final : public UPersistenceFrameworkModule
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoLostAndFoundInventoryFeatureModule">();
	}
	static class UJunoLostAndFoundInventoryFeatureModule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLostAndFoundInventoryFeatureModule>();
	}
};

// Class JunoGameNative.JunoActionConfig
// 0x0010 (0x0040 - 0x0030)
class UJunoActionConfig : public UObject
{
public:
	TSubclassOf<class UJunoAction>                JunoActionClass;                                   // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EJunoActionExecutionConfig                    JunoActionExecutionConfig;                         // 0x0038(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActionConfig">();
	}
	static class UJunoActionConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActionConfig>();
	}
};

// Class JunoGameNative.JunoActionConfig_LoadAndSetStaticMesh
// 0x0040 (0x0080 - 0x0040)
class UJunoActionConfig_LoadAndSetStaticMesh final : public UJunoActionConfig
{
public:
	TSoftObjectPtr<class UStaticMesh>             SoftStaticMesh;                                    // 0x0040(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActionConfig_LoadAndSetStaticMesh">();
	}
	static class UJunoActionConfig_LoadAndSetStaticMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActionConfig_LoadAndSetStaticMesh>();
	}
};

// Class JunoGameNative.JunoLevelProviderInterface
// 0x0000 (0x0030 - 0x0030)
class IJunoLevelProviderInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoLevelProviderInterface">();
	}
	static class IJunoLevelProviderInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoLevelProviderInterface>();
	}
};

// Class JunoGameNative.JunoActionConfig_StaticMesh
// 0x0008 (0x0048 - 0x0040)
class UJunoActionConfig_StaticMesh final : public UJunoActionConfig
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActionConfig_StaticMesh">();
	}
	static class UJunoActionConfig_StaticMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActionConfig_StaticMesh>();
	}
};

// Class JunoGameNative.JunoActorAttributeOverrideComponent
// 0x0030 (0x0108 - 0x00D8)
class UJunoActorAttributeOverrideComponent final : public UFortBuildingActorTagComponent
{
public:
	struct FDataRegistryType                      AttributeOverrideDataRegistry;                     // 0x00D8(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E4[0x24];                                      // 0x00E4(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FName GetPrimaryLootTier();
	class FName GetSecondaryLootTier();
	void SetupHealthAttributeSet();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActorAttributeOverrideComponent">();
	}
	static class UJunoActorAttributeOverrideComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActorAttributeOverrideComponent>();
	}
};

// Class JunoGameNative.JunoPFWContainer_LevelDelta
// 0x0038 (0x0198 - 0x0160)
class UJunoPFWContainer_LevelDelta final : public UPersistenceFrameworkContainer
{
public:
	uint8                                         Pad_160[0x38];                                     // 0x0160(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPFWContainer_LevelDelta">();
	}
	static class UJunoPFWContainer_LevelDelta* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPFWContainer_LevelDelta>();
	}
};

// Class JunoGameNative.JunoInventoryUIPersistenceFeatureData_Container
// 0x0000 (0x0208 - 0x0208)
class UJunoInventoryUIPersistenceFeatureData_Container final : public UJunoBasePFWPersistenceFeatureDataContainer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoInventoryUIPersistenceFeatureData_Container">();
	}
	static class UJunoInventoryUIPersistenceFeatureData_Container* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoInventoryUIPersistenceFeatureData_Container>();
	}
};

// Class JunoGameNative.JunoActorInstancesReportHandler
// 0x0028 (0x0058 - 0x0030)
class UJunoActorInstancesReportHandler final : public UObject
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActorInstancesReportHandler">();
	}
	static class UJunoActorInstancesReportHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActorInstancesReportHandler>();
	}
};

// Class JunoGameNative.JunoBasePFWPersistenceFeatureData
// 0x0030 (0x0060 - 0x0030)
class UJunoBasePFWPersistenceFeatureData : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bTriggerErrorOnSetDirtyAfterCheckIn;               // 0x0040(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_41[0x17];                                      // 0x0041(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDirty;                                            // 0x0058(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPersistentDataModified();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBasePFWPersistenceFeatureData">();
	}
	static class UJunoBasePFWPersistenceFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBasePFWPersistenceFeatureData>();
	}
};

// Class JunoGameNative.JunoActorWorldLocationPersistenceFeatureData
// 0x0050 (0x00B0 - 0x0060)
class UJunoActorWorldLocationPersistenceFeatureData final : public UJunoBasePFWPersistenceFeatureData
{
public:
	struct FJunoActorLocationSaveData             ActorWorldLocationSaveData;                        // 0x0060(0x0050)(SaveGame, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActorWorldLocationPersistenceFeatureData">();
	}
	static class UJunoActorWorldLocationPersistenceFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActorWorldLocationPersistenceFeatureData>();
	}
};

// Class JunoGameNative.JunoActorWorldLocationPersistenceFeatureModule
// 0x0000 (0x00E8 - 0x00E8)
class UJunoActorWorldLocationPersistenceFeatureModule final : public UPersistenceFrameworkModule
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActorWorldLocationPersistenceFeatureModule">();
	}
	static class UJunoActorWorldLocationPersistenceFeatureModule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActorWorldLocationPersistenceFeatureModule>();
	}
};

// Class JunoGameNative.JunoBuildLimitGetter
// 0x0000 (0x0030 - 0x0030)
class UJunoBuildLimitGetter : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBuildLimitGetter">();
	}
	static class UJunoBuildLimitGetter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildLimitGetter>();
	}
};

// Class JunoGameNative.JunoMarkersLimitPool
// 0x0010 (0x0040 - 0x0030)
class UJunoMarkersLimitPool final : public UJunoBuildLimitGetter
{
public:
	class FName                                   PhysicalMarkerSettingName;                         // 0x0030(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMarkersLimitPool">();
	}
	static class UJunoMarkersLimitPool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMarkersLimitPool>();
	}
};

// Class JunoGameNative.JunoActorWorldLocationPersistenceFeatureData_Container
// 0x0000 (0x0208 - 0x0208)
class UJunoActorWorldLocationPersistenceFeatureData_Container final : public UJunoBasePFWPersistenceFeatureDataContainer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActorWorldLocationPersistenceFeatureData_Container">();
	}
	static class UJunoActorWorldLocationPersistenceFeatureData_Container* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActorWorldLocationPersistenceFeatureData_Container>();
	}
};

// Class JunoGameNative.JunoAIBotEvaluator_Leash
// 0x0208 (0x02C8 - 0x00C0)
class UJunoAIBotEvaluator_Leash final : public UFortAthenaAIBotEvaluator
{
public:
	struct FGameplayTagQuery                      DisengageTokenQuery;                               // 0x00C0(0x0048)(Edit, NativeAccessSpecifierPrivate)
	struct FValueOrBBKey_Float                    DisengageTimeOutsideLeashMin;                      // 0x0108(0x0020)(Edit, NativeAccessSpecifierPrivate)
	struct FValueOrBBKey_Float                    DisengageTimeOutsideLeashMax;                      // 0x0128(0x0020)(Edit, NativeAccessSpecifierPrivate)
	struct FValueOrBBKey_Float                    DisengageTimeSinceLastRangedWeaponFireOnTarget;    // 0x0148(0x0020)(Edit, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      CombatPositionQuery;                               // 0x0168(0x0048)(Edit, NativeAccessSpecifierPrivate)
	struct FValueOrBBKey_Float                    ReengageDistance;                                  // 0x01B0(0x0020)(Edit, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      KitingTokenQuery;                                  // 0x01D0(0x0048)(Edit, NativeAccessSpecifierPrivate)
	struct FValueOrBBKey_Float                    GiveUpWaitTime;                                    // 0x0218(0x0020)(Edit, NativeAccessSpecifierPrivate)
	class FName                                   TargetActorKeyName;                                // 0x0238(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   TargetInsideLeashKeyName;                          // 0x0244(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   TargetLeashExitTimeKeyName;                        // 0x0250(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   LastRangedWeaponFireAbilityTimeKeyName;            // 0x025C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   HasLoSOnThreatKeyName;                             // 0x0268(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   BehaviorStartTimeKeyName;                          // 0x0274(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   TokenMovementStateKeyName;                         // 0x0280(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   FallbackMovementStateKeyName;                      // 0x028C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_298[0x18];                                     // 0x0298(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CachedPawnPtr;                                     // 0x02B0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B8[0x10];                                     // 0x02B8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIBotEvaluator_Leash">();
	}
	static class UJunoAIBotEvaluator_Leash* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIBotEvaluator_Leash>();
	}
};

// Class JunoGameNative.JunoAIBotEvaluator_OffhandWeapon
// 0x0078 (0x0138 - 0x00C0)
class UJunoAIBotEvaluator_OffhandWeapon final : public UFortAthenaAIBotEvaluator
{
public:
	uint8                                         Pad_C0[0x20];                                      // 0x00C0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           TorchWeaponTag;                                    // 0x00E0(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           OffhandWeaponToEquipTag;                           // 0x00EC(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FName>                           ExecutionStatusesToCheckedToHolsterKeyNames;       // 0x00F8(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPrivate)
	uint8                                         Pad_108[0x10];                                     // 0x0108(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           BoolsToCheckToHolsterKeyNames;                     // 0x0118(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPrivate)
	uint8                                         Pad_128[0x10];                                     // 0x0128(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIBotEvaluator_OffhandWeapon">();
	}
	static class UJunoAIBotEvaluator_OffhandWeapon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIBotEvaluator_OffhandWeapon>();
	}
};

// Class JunoGameNative.JunoAIPersistenceFeatureModule
// 0x0000 (0x00E8 - 0x00E8)
class UJunoAIPersistenceFeatureModule final : public UPersistenceFrameworkModule
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIPersistenceFeatureModule">();
	}
	static class UJunoAIPersistenceFeatureModule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIPersistenceFeatureModule>();
	}
};

// Class JunoGameNative.JunoMarkerRefinementComponent
// 0x0000 (0x00E0 - 0x00E0)
class UJunoMarkerRefinementComponent final : public UFortControllerComponent
{
public:
	void ClientPlaceMarker(const struct FVector& InLocation, const bool bNeedsRefinement);
	void ServerPlaceMarker(const struct FVector2D& InLocation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMarkerRefinementComponent">();
	}
	static class UJunoMarkerRefinementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMarkerRefinementComponent>();
	}
};

// Class JunoGameNative.JunoAIPersistenceFeatureData_Container
// 0x0000 (0x0208 - 0x0208)
class UJunoAIPersistenceFeatureData_Container final : public UJunoBasePFWPersistenceFeatureDataContainer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIPersistenceFeatureData_Container">();
	}
	static class UJunoAIPersistenceFeatureData_Container* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIPersistenceFeatureData_Container>();
	}
};

// Class JunoGameNative.JunoAlterationCraftingComponent
// 0x0030 (0x0108 - 0x00D8)
class UJunoAlterationCraftingComponent final : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UCraftingObjectComponent> CachedCraftingObjectComponent;                     // 0x00F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataRegistryType                      WeaponEssenceDataRegistryType;                     // 0x00F8(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCraftingStateChanged(const struct FCraftingObjectStateChangedEvent& Event);
	bool OnCheckValidItemType(const struct FCraftingObjectAdditionalValidationEvent& Payload);
	void OnCraftingSuccess(const struct FCraftingObjectSuccessEvent& Event);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAlterationCraftingComponent">();
	}
	static class UJunoAlterationCraftingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAlterationCraftingComponent>();
	}
};

// Class JunoGameNative.JunoMutator_AutoPickup
// 0x0020 (0x04F0 - 0x04D0)
class AJunoMutator_AutoPickup final : public AFortAthenaMutator
{
public:
	struct FGameplayTagContainer                  DoNotAutoPickupGameplayTags;                       // 0x04D0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMutator_AutoPickup">();
	}
	static class AJunoMutator_AutoPickup* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoMutator_AutoPickup>();
	}
};

// Class JunoGameNative.JunoAnalytics
// 0x0000 (0x0030 - 0x0030)
class UJunoAnalytics final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAnalytics">();
	}
	static class UJunoAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAnalytics>();
	}
};

// Class JunoGameNative.JunoAnimNotifyState_QueueInput
// 0x0068 (0x00A0 - 0x0038)
class UJunoAnimNotifyState_QueueInput final : public UAnimNotifyState
{
public:
	bool                                          bQueueMantisInput;                                 // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  GameplayEventTagsToQueue;                          // 0x0040(0x0020)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AbilityTagsToRemove;                               // 0x0060(0x0020)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AbilityTagsToAdd;                                  // 0x0080(0x0020)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAnimNotifyState_QueueInput">();
	}
	static class UJunoAnimNotifyState_QueueInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAnimNotifyState_QueueInput>();
	}
};

// Class JunoGameNative.JunoMarkersPersistenceFeatureData_Container
// 0x0000 (0x0208 - 0x0208)
class UJunoMarkersPersistenceFeatureData_Container final : public UJunoBasePFWPersistenceFeatureDataContainer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMarkersPersistenceFeatureData_Container">();
	}
	static class UJunoMarkersPersistenceFeatureData_Container* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMarkersPersistenceFeatureData_Container>();
	}
};

// Class JunoGameNative.JunoAnimNotifyState_MakeInterruptible
// 0x0040 (0x0078 - 0x0038)
class UJunoAnimNotifyState_MakeInterruptible final : public UAnimNotifyState
{
public:
	struct FGameplayTagContainer                  AbilityTagsToRemove;                               // 0x0038(0x0020)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AbilityTagsToAdd;                                  // 0x0058(0x0020)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAnimNotifyState_MakeInterruptible">();
	}
	static class UJunoAnimNotifyState_MakeInterruptible* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAnimNotifyState_MakeInterruptible>();
	}
};

// Class JunoGameNative.JunoAsyncAction_WaitForEventRouter
// 0x0030 (0x0068 - 0x0038)
class UJunoAsyncAction_WaitForEventRouter final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class UGameplayEventRouterComponent* EventRouter)> OnGameplayEventRouterAvailable;                    // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x20];                                      // 0x0048(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UJunoAsyncAction_WaitForEventRouter* WaitForEventRouter(class AActor* ContextActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAsyncAction_WaitForEventRouter">();
	}
	static class UJunoAsyncAction_WaitForEventRouter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAsyncAction_WaitForEventRouter>();
	}
};

// Class JunoGameNative.JunoMapManager
// 0x01E8 (0x0608 - 0x0420)
class AJunoMapManager final : public AActor
{
public:
	float                                         ExploredRadius;                                    // 0x0420(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              OceanTileTexture;                                  // 0x0428(0x0030)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMapExplorationData                    MapExplorationData;                                // 0x0458(0x0178)(Net, Transient, RepNotify, NativeAccessSpecifierPrivate)
	float                                         TileSize;                                          // 0x05D0(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsExplorationDataInitialized;                     // 0x05D4(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D5[0xB];                                      // 0x05D5(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDisplayableTile*>               DisplayableTiles;                                  // 0x05E0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UTexture2D*                             ClearedFogMask;                                    // 0x05F0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5F8[0x10];                                     // 0x05F8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_MapExplorationData();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMapManager">();
	}
	static class AJunoMapManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoMapManager>();
	}
};

// Class JunoGameNative.JunoAsyncAction_WaitForRootPlayspace
// 0x0078 (0x00B0 - 0x0038)
class UJunoAsyncAction_WaitForRootPlayspace final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class AJunoRootPlayspace* Playspace)> OnReady;                                           // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x68];                                      // 0x0048(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UJunoAsyncAction_WaitForRootPlayspace* RootPlayspaceReadyAsync(class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAsyncAction_WaitForRootPlayspace">();
	}
	static class UJunoAsyncAction_WaitForRootPlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAsyncAction_WaitForRootPlayspace>();
	}
};

// Class JunoGameNative.JunoPersistenceAssetType
// 0x0008 (0x0038 - 0x0030)
class UJunoPersistenceAssetType : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPersistenceAssetType">();
	}
	static class UJunoPersistenceAssetType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPersistenceAssetType>();
	}
};

// Class JunoGameNative.JunoMovementMode_ELTacSprint
// 0x0000 (0x0518 - 0x0518)
class UJunoMovementMode_ELTacSprint final : public UFortMovementMode_ELTacSprint
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMovementMode_ELTacSprint">();
	}
	static class UJunoMovementMode_ELTacSprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMovementMode_ELTacSprint>();
	}
};

// Class JunoGameNative.JunoBlueprintPersistenceAssetType
// 0x0000 (0x0038 - 0x0038)
class UJunoBlueprintPersistenceAssetType final : public UJunoPersistenceAssetType
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBlueprintPersistenceAssetType">();
	}
	static class UJunoBlueprintPersistenceAssetType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBlueprintPersistenceAssetType>();
	}
};

// Class JunoGameNative.JunoBoneMaskInstanceDataAsset
// 0x0018 (0x0050 - 0x0038)
class UJunoBoneMaskInstanceDataAsset final : public UDataAsset
{
public:
	class UBoneMaskDefinitionDataAsset*           BodyPartsDefinition;                               // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FJunoBoneMaskInstanceEntry>     Data;                                              // 0x0040(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBoneMaskInstanceDataAsset">();
	}
	static class UJunoBoneMaskInstanceDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBoneMaskInstanceDataAsset>();
	}
};

// Class JunoGameNative.JunoPersistenceAnalytics
// 0x0000 (0x0030 - 0x0030)
class UJunoPersistenceAnalytics final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPersistenceAnalytics">();
	}
	static class UJunoPersistenceAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPersistenceAnalytics>();
	}
};

// Class JunoGameNative.JunoBTService_Leash
// 0x00B0 (0x0130 - 0x0080)
class UJunoBTService_Leash final : public UBTService
{
public:
	struct FGameplayTagQuery                      KitingTokenQuery;                                  // 0x0080(0x0048)(Edit, NativeAccessSpecifierPrivate)
