#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Kismet

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Kismet_structs.hpp"


namespace SDK
{

// Class Kismet.BlueprintCompilerExtension
// 0x0000 (0x0030 - 0x0030)
class UBlueprintCompilerExtension : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintCompilerExtension">();
	}
	static class UBlueprintCompilerExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintCompilerExtension>();
	}
};

// Class Kismet.BlueprintEditorToolMenuContext
// 0x0010 (0x0040 - 0x0030)
class UBlueprintEditorToolMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UBlueprint* GetBlueprintObj() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintEditorToolMenuContext">();
	}
	static class UBlueprintEditorToolMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintEditorToolMenuContext>();
	}
};

// Class Kismet.BlueprintPaletteFavorites
// 0x0048 (0x0078 - 0x0030)
class UBlueprintPaletteFavorites final : public UObject
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CustomFavorites;                                   // 0x0048(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FFavoritedBlueprintPaletteItem> CurrentFavorites;                                  // 0x0058(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class FString                                 CurrentProfile;                                    // 0x0068(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintPaletteFavorites">();
	}
	static class UBlueprintPaletteFavorites* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintPaletteFavorites>();
	}
};

// Class Kismet.SCSEditorExtensionContext
// 0x0020 (0x0050 - 0x0030)
class USCSEditorExtensionContext final : public UObject
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SCSEditorExtensionContext">();
	}
	static class USCSEditorExtensionContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCSEditorExtensionContext>();
	}
};

// Class Kismet.SSCSEditorMenuContext
// 0x0028 (0x0058 - 0x0030)
class USSCSEditorMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SSCSEditorMenuContext">();
	}
	static class USSCSEditorMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<USSCSEditorMenuContext>();
	}
};

// Class Kismet.SubobjectEditorExtensionContext
// 0x0010 (0x0040 - 0x0030)
class USubobjectEditorExtensionContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SubobjectEditorExtensionContext">();
	}
	static class USubobjectEditorExtensionContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubobjectEditorExtensionContext>();
	}
};

}

