#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Kismet

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum Kismet.EContextTargetFlags
// NumValues: 0x0009
enum class EContextTargetFlags : uint8
{
	TARGET_Blueprint                         = 1,
	TARGET_SubComponents                     = 2,
	TARGET_NodeTarget                        = 4,
	TARGET_PinObject                         = 8,
	TARGET_SiblingPinObjects                 = 16,
	TARGET_BlueprintLibraries                = 32,
	TARGET_NonImportedTypes                  = 64,
	ContextTargetFlagsEnd                    = 65,
	EContextTargetFlags_MAX                  = 66,
};

// Enum Kismet.EFiBVersion
// NumValues: 0x0008
enum class EFiBVersion : uint64
{
	FIB_VER_NONE                             = 18446744073709551615,
	FIB_VER_BASE                             = 0,
	FIB_VER_VARIABLE_REFERENCE               = 1,
	FIB_VER_INTERFACE_GRAPHS                 = 2,
	FIB_VER_FUNC_CALL_SITES                  = 3,
	FIB_VER_PLUS_ONE                         = 4,
	FIB_VER_LATEST                           = 3,
	FIB_VER_MAX                              = 5,
};

// Enum Kismet.EFiBIndexAllPermission
// NumValues: 0x0004
enum class EFiBIndexAllPermission : uint32
{
	None                                     = 0,
	LoadOnly                                 = 1,
	CheckoutAndResave                        = 2,
	EFiBIndexAllPermission_MAX               = 3,
};

// Enum Kismet.EReviewCommentTaskState
// NumValues: 0x0005
enum class EReviewCommentTaskState : uint8
{
	Comment                                  = 0,
	Open                                     = 1,
	Addressed                                = 2,
	Verified                                 = 3,
	EReviewCommentTaskState_MAX              = 4,
};

// Enum Kismet.EReviewTopicType
// NumValues: 0x0004
enum class EReviewTopicType : uint8
{
	Review                                   = 0,
	Change                                   = 1,
	Unrecognised                             = 2,
	EReviewTopicType_MAX                     = 3,
};

// ScriptStruct Kismet.BlueprintActionMenuItem
// 0x0098 (0x0188 - 0x00F0)
struct FBlueprintActionMenuItem final : public FEdGraphSchemaAction
{
public:
	uint8                                         Pad_F0[0x98];                                      // 0x00F0(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Kismet.BlueprintCompiledData
// 0x0010 (0x0010 - 0x0000)
struct FBlueprintCompiledData final
{
public:
	TArray<class UEdGraph*>                       IntermediateGraphs;                                // 0x0000(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct Kismet.BlueprintDragDropMenuItem
// 0x0050 (0x0140 - 0x00F0)
struct FBlueprintDragDropMenuItem final : public FEdGraphSchemaAction
{
public:
	uint8                                         Pad_F0[0x50];                                      // 0x00F0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Kismet.FavoritedBlueprintPaletteItem
// 0x0070 (0x0070 - 0x0000)
struct alignas(0x08) FFavoritedBlueprintPaletteItem final
{
public:
	uint8                                         Pad_0[0x70];                                       // 0x0000(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Kismet.BPGraphClipboardData
// 0x0028 (0x0028 - 0x0000)
struct FBPGraphClipboardData final
{
public:
	class FName                                   GraphName;                                         // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EGraphType                                    GraphType;                                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UBlueprint>              OriginalBlueprint;                                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 NodesString;                                       // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

}

