#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LagerRuntime

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "LagerRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "WorldConditions_structs.hpp"
#include "WorldConditions_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "GameFeatures_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// Class LagerRuntime.FortAthenaLivingWorldPointProvidersEnabler
// 0x00D8 (0x04F8 - 0x0420)
class AFortAthenaLivingWorldPointProvidersEnabler : public AActor
{
public:
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> EnabledLinkedPointProviders;                       // 0x0420(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> AvailableLinkedPointProviders;                     // 0x0430(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  EnablerTags;                                       // 0x0440(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPrivate)
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> LinkedPointProviders;                              // 0x0460(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         PointProvidersToEnable;                            // 0x0470(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         EvaluateAutomatically;                             // 0x04A8(0x0038)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4E0[0x8];                                      // 0x04E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>>& EnabledPointProviders)> OnCompletedEvaluationDelegate;                     // 0x04E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)

public:
	void EvaluateAndEnablePointProviders();
	void OnCurrentPlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);
	void RemoveClosestPointProvidersToPoint(const struct FVector& Point, const float MaximumDistance, const int32 PointsToDisable);

	bool DoesStartEnabled() const;
	const TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> GetEnabledLinkedPointProviders() const;
	const struct FGameplayTagContainer GetEnablerTags() const;
	bool HasCompletedEvaluation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldPointProvidersEnabler">();
	}
	static class AFortAthenaLivingWorldPointProvidersEnabler* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaLivingWorldPointProvidersEnabler>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldPointProvidersEnabler_MiniMapDataOverride
// 0x0000 (0x04F8 - 0x04F8)
class AFortAthenaLivingWorldPointProvidersEnabler_MiniMapDataOverride final : public AFortAthenaLivingWorldPointProvidersEnabler
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldPointProvidersEnabler_MiniMapDataOverride">();
	}
	static class AFortAthenaLivingWorldPointProvidersEnabler_MiniMapDataOverride* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaLivingWorldPointProvidersEnabler_MiniMapDataOverride>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldRuntimePointProviderComponent
// 0x0000 (0x00D8 - 0x00D8)
class UFortAthenaLivingWorldRuntimePointProviderComponent : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldRuntimePointProviderComponent">();
	}
	static class UFortAthenaLivingWorldRuntimePointProviderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldRuntimePointProviderComponent>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldRuntimePatrolPathPointProviderComponent
// 0x00C0 (0x0198 - 0x00D8)
class UFortAthenaLivingWorldRuntimePatrolPathPointProviderComponent final : public UFortAthenaLivingWorldRuntimePointProviderComponent
{
public:
	TSubclassOf<class AFortAthenaPatrolPathPointProvider> SourcePointProviderClass;                          // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAIRuntimePatrolPathPointProviderAttributeSource TagSource;                                         // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Tags;                                              // 0x00E8(0x0020)(Edit, NativeAccessSpecifierPublic)
	EAIRuntimePatrolPathPointProviderAttributeSource SpawnLimitSource;                                  // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortAthenaLivingWorldPointProviderSpawnLimiter SpawnLimiter;                                      // 0x0110(0x0088)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldRuntimePatrolPathPointProviderComponent">();
	}
	static class UFortAthenaLivingWorldRuntimePatrolPathPointProviderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldRuntimePatrolPathPointProviderComponent>();
	}
};

// Class LagerRuntime.FortGameFeatureAction_AddTaggedSpawnActions
// 0x0010 (0x0050 - 0x0040)
class UFortGameFeatureAction_AddTaggedSpawnActions final : public UFortGameInstanceGameFeatureAction
{
public:
	TArray<struct FFortAthenaLivingWorldSoftTaggedSpawnActionClass> SoftTaggedSpawnActions;                            // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameFeatureAction_AddTaggedSpawnActions">();
	}
	static class UFortGameFeatureAction_AddTaggedSpawnActions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameFeatureAction_AddTaggedSpawnActions>();
	}
};

// Class LagerRuntime.FortAthenaLinearEncounterAnalyticComponent
// 0x0058 (0x0130 - 0x00D8)
class UFortAthenaLinearEncounterAnalyticComponent final : public UActorComponent
{
public:
	uint8                                         Pad_D8[0x58];                                      // 0x00D8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAttackerSpawned(class AActor* SpawnedAttacker, const class UFortAthenaLivingWorldEventData* EventData);
	void OnDefenderDamaged(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnDefenderDidDamage(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnDefenderDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnDefenderSpawned(class AActor* SpawnedDefender, const class UFortAthenaLivingWorldEventData* EventData);
	void OnEncounterEnd();
	void OnEncounterStart(class UFortAthenaLivingWorldEncounterInstance* InAttackerEncounter, class UFortAthenaLivingWorldEncounterInstance* InDefenderEncounter);
	void OnStageCompleted(const TArray<class AFortPickup*>& SpawnedRewards);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLinearEncounterAnalyticComponent">();
	}
	static class UFortAthenaLinearEncounterAnalyticComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLinearEncounterAnalyticComponent>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldConditionSchema
// 0x0000 (0x0040 - 0x0040)
class UFortAthenaLivingWorldConditionSchema : public UWorldConditionSchema
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldConditionSchema">();
	}
	static class UFortAthenaLivingWorldConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldConditionSchema>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldEventDataConditionSchema
// 0x0010 (0x0050 - 0x0040)
class UFortAthenaLivingWorldEventDataConditionSchema final : public UFortAthenaLivingWorldConditionSchema
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldEventDataConditionSchema">();
	}
	static class UFortAthenaLivingWorldEventDataConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldEventDataConditionSchema>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldConfigData
// 0x03D8 (0x0410 - 0x0038)
class UFortAthenaLivingWorldConfigData final : public UDataAsset
{
public:
	TArray<struct FFortAthenaLivingWorldCategoryTableData> CategoryTableDatas;                                // 0x0038(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxActorCount;                                     // 0x0048(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxEventSpawnPerTick;                              // 0x0080(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxActorDespawnPerTick;                            // 0x00B8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinimumEventGenerationInterval;                    // 0x00F0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxActorDensity;                                   // 0x0128(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxActorUpdatesPerTick;                            // 0x0160(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxPointProviderUpdatesPerTick;                    // 0x0198(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ActorDensityGridCellSize;                          // 0x01D0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ActorDensitySparseToDenseRatio;                    // 0x0208(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         PointClusterSize;                                  // 0x0240(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinNumberOfPlayerForAggressiveSpawning;            // 0x0278(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FFortAthenaLivingWorldTagDensityGridData> TagDensityGridData;                                // 0x02B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      SingleUseSpawnerDataQuery;                         // 0x02C0(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      ConcurrentSingleUseSpawnerDataQuery;               // 0x0308(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSubclassOf<class AFortAthenaLivingWorldEQSHelper> EQSActorHelperClass;                               // 0x0350(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DelayEventGeneration;                              // 0x0358(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         RestrictDensityReservationForReservoirs;           // 0x0390(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TrackDeadPlayers;                                  // 0x03C8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FScalableFloat>                 DensityGridVerticalCutHeights;                     // 0x0400(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldConfigData">();
	}
	static class UFortAthenaLivingWorldConfigData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldConfigData>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldDebugDensityMiniMapIndicator
// 0x0068 (0x01B8 - 0x0150)
class UFortAthenaLivingWorldDebugDensityMiniMapIndicator final : public UFortMiniMapIndicator
{
public:
	uint8                                         Pad_150[0x8];                                      // 0x0150(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortAthenaActorDensityDebugInfo> ActorDebugInfos;                                   // 0x0158(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<float>                                 DensityGridValues;                                 // 0x0168(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FVector                                GridOrigin;                                        // 0x0178(0x0018)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FIntVector                             MaxGridSize;                                       // 0x0190(0x000C)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CellSize;                                          // 0x019C(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxDensity;                                        // 0x01A0(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DisplayName;                                       // 0x01A8(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldDebugDensityMiniMapIndicator">();
	}
	static class UFortAthenaLivingWorldDebugDensityMiniMapIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldDebugDensityMiniMapIndicator>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldDespawnConditionSchema
// 0x0010 (0x0050 - 0x0040)
class UFortAthenaLivingWorldDespawnConditionSchema final : public UFortAthenaLivingWorldConditionSchema
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldDespawnConditionSchema">();
	}
	static class UFortAthenaLivingWorldDespawnConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldDespawnConditionSchema>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldEncounter
// 0x0080 (0x00B8 - 0x0038)
class UFortAthenaLivingWorldEncounter final : public UDataAsset
{
public:
	struct FScalableFloat                         IntervalBetweenEventGeneration;                    // 0x0038(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         bCanUseGlobalBudgetAfterDensityReservoir;          // 0x0070(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FFortAthenaLivingWorldEncounterStage> Stages;                                            // 0x00A8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldEncounter">();
	}
	static class UFortAthenaLivingWorldEncounter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldEncounter>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldEncounterInstance
// 0x0188 (0x01B8 - 0x0030)
class UFortAthenaLivingWorldEncounterInstance final : public UObject
{
public:
	TMulticastInlineDelegate<void(class AActor* SpawnedActor, class UFortAthenaLivingWorldEventData* EventData)> OnActorSpawned;                                    // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* SpawnedActor, class UFortAthenaLivingWorldEventData* EventData)> OnFirstActorSpawned;                               // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* DestroyedActor, class UFortAthenaLivingWorldEventData* EventData)> OnActorDestroyed;                                  // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* DestroyedActor, class UFortAthenaLivingWorldEventData* EventData)> OnLastActorDestroyed;                              // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* DiedActor)> OnActorDied;                                       // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnLastActorDied;                                   // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TArray<class AActor*>& SpawnedActors)> OnEventSpawned;                                    // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x50];                                      // 0x00A0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortAthenaLivingWorldConditionContainer ConditionContainer;                                // 0x00F0(0x0018)(Transient, NativeAccessSpecifierPrivate)
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> AllowedPointProviders;                             // 0x0108(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> RegisteredPointProviders;                          // 0x0118(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UFortAthenaLivingWorldEventData*> RuntimeCreatedEventDatas;                          // 0x0128(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_138[0x20];                                     // 0x0138(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UFortAthenaLivingWorldEncounter> EncounterDefinition;                               // 0x0158(0x0030)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 ActorDensityReservoir;                             // 0x0188(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         SpawnedActors;                                     // 0x0190(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A0[0x8];                                      // 0x01A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentStageIndex;                                 // 0x01A8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CurrentStageMaxActorCount;                         // 0x01AC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B0[0x4];                                      // 0x01B0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsPaused;                                         // 0x01B4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddAllowedPointProvider(const TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>& PointProvider);
	void AdvanceEncounterStage();
	void OnEncounterActorDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void PauseEncounter();
	void RemoveAllowedPointProvider(const TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>& PointProvider);
	void RequestEventGeneration();
	void Reset();
	void ResumeEncounter();
	void StartEncounterStage(const int32 StageIndex);

	int32 GetAliveSpawnedActorCount() const;
	int32 GetTotalActorCount() const;
	bool HasPendingSpawnRequest() const;
	bool HasReachedMaxSpawnedCount() const;
	bool OwnsActor(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldEncounterInstance">();
	}
	static class UFortAthenaLivingWorldEncounterInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldEncounterInstance>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldEventData
// 0x0158 (0x0190 - 0x0038)
class UFortAthenaLivingWorldEventData : public UDataAsset
{
public:
	int32                                         TimeOfDayFilters;                                  // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         WaterLevelIndexMin;                                // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         WaterLevelIndexMax;                                // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWorldConditionQueryDefinition         CanSpawnCondition;                                 // 0x0048(0x0028)(Edit, NativeAccessSpecifierPrivate)
	TArray<struct FFortAthenaLivingWorldDespawnCondition> DespawnConditions;                                 // 0x0070(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bRequirePointProviders;                            // 0x0080(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      ProviderFiltersTagQuery;                           // 0x0088(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FPointProviderFilterEntry>      ProviderFiltersEntries;                            // 0x00D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FInstancedStruct                       PointProviderSelector;                             // 0x00E0(0x0010)(Edit, NativeAccessSpecifierPrivate)
	struct FInstancedStruct                       SpawnerDataSelector;                               // 0x00F0(0x0010)(Edit, NativeAccessSpecifierPrivate)
	TArray<struct FFortAthenaLivingWorldTaggedSpawnActionClass> SpawnActions;                                      // 0x0100(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinActorCountToSpawn;                              // 0x0110(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxActorCountToSpawn;                              // 0x0148(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FFortAthenaLivingWorldEventDataActorSpawnDescription> ActorDescriptions;                                 // 0x0180(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static bool GetLivingWorldEventDataAssetsFromTag(const struct FGameplayTag& GameplayTag, TArray<class FName>* OutLivingWorldEventData);

	void SetupSimpleActorDescription(const struct FGameplayTag& SpawnerDataTag);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldEventData">();
	}
	static class UFortAthenaLivingWorldEventData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldEventData>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldManager
// 0x0C78 (0x0D50 - 0x00D8)
class UFortAthenaLivingWorldManager final : public UGameStateComponent
{
public:
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UFortAthenaLivingWorldConfigData> DefaultLagerConfig;                                // 0x00E0(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FFortLivingWorldConfigOverride> LagerConfigOverrides;                              // 0x0110(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FFortLivingWorldConfigOverride> EditorOnlyLagerConfigOverrides;                    // 0x0120(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, EditorOnly, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LagerEnabled;                                      // 0x0130(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, TSubclassOf<class UFortAthenaLivingWorldSpawnAction>> TaggedSpawnActionClassMap;                         // 0x0168(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> PointProviders;                                    // 0x01B8(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	int32                                         RegisteredPointProvidersCount;                     // 0x01C8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SpecialActorMinimapIconBrush;                      // 0x01D0(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FVector2D                              SpecialActorMinimapIconScale;                      // 0x02A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSlateBrush                            SpecialActorCompassIconBrush;                      // 0x02B0(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FVector2D                              SpecialActorCompassIconScale;                      // 0x0380(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortAthenaLivingWorldSpawnerDataLimiter SpawnerDataLimiter;                                // 0x0390(0x00B0)(Transient, NativeAccessSpecifierPrivate)
	class UWorld*                                 CachedWorld;                                       // 0x0440(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAthenaLivingWorldConfigData*       CachedConfig;                                      // 0x0448(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortAthenaLivingWorldEncounterInstance*> RunningEncounterInstances;                         // 0x0450(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UFortSeasonalEventManager*              CachedSeasonalEventManager;                        // 0x0460(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TSoftClassPtr<class UClass>>           ActorClassToPreloadOnClient;                       // 0x0468(0x0010)(Net, ZeroConstructor, RepNotify, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FFortAthenaLivingWorldActorUpdateHandler ActorUpdateHandler;                                // 0x0478(0x00B0)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FFortAthenaLivingWorldPointProviderUpdateHandler PointProviderUpdateHandler;                        // 0x0528(0x0098)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FFortAthenaLivingWorldRuntimePointProviderHandler RuntimePointProviderHandler;                       // 0x05C0(0x0060)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FFortAthenaLivingWorldPlayerTracker    PlayerTracker;                                     // 0x0620(0x00C0)(Transient, NativeAccessSpecifierPrivate)
	struct FFortAthenaLivingWorldPreloader        Preloader;                                         // 0x06E0(0x00E0)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FFortAthenaLivingWorldConditionContainer GlobalConditionContainer;                          // 0x07C0(0x0018)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7D8[0x4B8];                                    // 0x07D8(0x04B8)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<TSubclassOf<class UFortAthenaLivingWorldSpawnAction>, class UFortAthenaLivingWorldSpawnAction*> SpawnActionCache;                                  // 0x0C90(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class AFortAthenaLivingWorldEQSHelper*        EQSHelper;                                         // 0x0CE0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAthenaLivingWorldDebugDensityMiniMapIndicator* DebugDensityMinimapIndicator;                      // 0x0CE8(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_CF0[0x60];                                     // 0x0CF0(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFortAthenaLivingWorldManager* GetLivingWorldManager(const class UObject* WorldContextObject);
	static void LivingWorldManagerDisablePointProvider(class AActor* PointProvider);
	static void LivingWorldManagerEnablePointProvider(class AActor* PointProvider);
	static void LivingWorldManagerRegisterPointProvider(class AActor* PointProvider);
	static void LivingWorldManagerUnregisterPointProvider(class AActor* PointProvider);

	void CancelSpawnRequest(const int32 RequestId);
	void EndEncounter(class UFortAthenaLivingWorldEncounterInstance* EncounterInstance);
	void LivingWorldManagerDebugEvent(const class FString& EventName, int32 DebugIndex, const class FString& RuntimeSpawnDataName, const class FString& EncounterName);
	void LivingWorldManagerDumpEventInstances();
	void LivingWorldManagerDumpPrefabLevelBounds();
	void LivingWorldManagerDumpSpawnCount();
	void LivingWorldManagerFlush();
	void LivingWorldManagerGenerateEvents();
	void LivingWorldManagerProviderDebugActor(int32 ProviderIndex);
	void LivingWorldManagerSetEventGenerationEnabled(const bool bInGenerateEvents);
	void LivingWorldManagerSwitchDensityDisplay(int32 DensityMapIndex);
	void LivingWorldManagerToggleActorMinimap(const class FString& Name_0);
	void LivingWorldManagerToggleDensityDisplay();
	void LivingWorldManagerToggleGenerateEvents();
	void LivingWorldManagerToggleVerboseLogging();
	void LWMF();
	void LWMTAM(const class FString& Name_0);
	void OnActorSpawned(class AActor* Actor, int32 RequestId);
	void OnCurrentPlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnDebugSpawnEventSpawned(const TArray<class AActor*>& SpawnedActors, bool bSuccess);
	void OnPatrolPathAdded(class AFortAthenaPatrolPath* PatrolPath);
	void OnPatrolPathDestroyed(class AActor* Actor);
	void OnRep_ActorClassToPreloadOnClient();
	void OnRep_DebugDensityMinimapIndicator(class UFortAthenaLivingWorldDebugDensityMiniMapIndicator* OldMapIndicator);
	void OnSpawnedActorDestroy(class AActor* DestroyedActor);
	void OnUnmanagedDensityReservoirActorDestroy(class AActor* DestroyedActor);
	void OnWorldFinishedInitialization(const struct FGameplayTagContainer& ContextTags);
	bool RegisterDensityReservoir(class AActor* ActorDensityReservoir, float Density, float Range);
	bool RegisterTagDensityReservoir(class AActor* ActorDensityReservoir, const TArray<struct FFortAthenaLivingWorldEventTagDensityRegistration>& TagsDensity);
	void RequestEventGeneration();
	void ResetEncounter(class UFortAthenaLivingWorldEncounterInstance* EncounterInstance);
	class UFortAthenaLivingWorldEncounterInstance* StartEncounter(const TSoftObjectPtr<class UFortAthenaLivingWorldEncounter> EncounterType, const TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>>& EncounterPointProviders, class AActor* ActorDensityReservoir, const bool bTakeOwnershipOfDensityReservoir);
	bool TrySpawnEvent(const struct FDataTableRowHandle& EventEntry, const struct FTransform& SpawnLocation, const TDelegate<void(TArray<class AActor*>& SpawnedActors, bool bSuccess)>& OnRequestFinished, int32* RequestId);
	bool TrySpawnEventForRegistry(const struct FDataRegistryId& EventId, const struct FTransform& SpawnLocation, const TDelegate<void(TArray<class AActor*>& SpawnedActors, bool bSuccess)>& OnRequestFinished, int32* RequestId);
	bool TrySpawnEventWithPreDespawn(const struct FDataTableRowHandle& EventEntry, const struct FTransform& SpawnLocation, const TDelegate<void(TArray<class AActor*>& SpawnedActors, bool bSuccess)>& OnRequestFinished, const struct FGameplayTag& DespawnDensityTag, float MaxAllowedDensityValue, int32* RequestId);
	bool TrySpawnEventWithPreDespawnForRegistry(const struct FDataRegistryId& EventId, const struct FTransform& SpawnLocation, const TDelegate<void(TArray<class AActor*>& SpawnedActors, bool bSuccess)>& OnRequestFinished, const struct FGameplayTag& DespawnDensityTag, float MaxAllowedDensityValue, int32* RequestId);
	void UnregisterDensityReservoir(class AActor* ActorDensityReservoir);

	bool BuildDataRegistryResolverScope_Implementation(TArray<class FName>* InOutResolverScopes, int32* InOutPriority) const;
	class UFortAthenaLivingWorldEncounterInstance* GetOwningEncounter(class AActor* Actor) const;
	bool HasPendingSpawnRequestForEncounter(const class UFortAthenaLivingWorldEncounterInstance* EncounterInstance) const;
	bool IsEncounterCategoryActive(const TSoftObjectPtr<class UFortAthenaLivingWorldEncounter> EncounterType) const;
	float QueryActorDensityBudget(class AActor* ReferenceActor, float Range) const;
	int32 QueryEventBudget(const struct FDataTableRowHandle& EventEntry, const class AActor* SpawnLocation) const;
	int32 QueryEventBudgetForRegistry(const struct FDataRegistryId& EventId, const class AActor* SpawnLocation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldManager">();
	}
	static class UFortAthenaLivingWorldManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldManager>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldNavigationInvokerComponent
// 0x0150 (0x0228 - 0x00D8)
class UFortAthenaLivingWorldNavigationInvokerComponent final : public UActorComponent
{
public:
	struct FScalableFloat                         GenerationRadius;                                  // 0x00D8(0x0038)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FNavAgentSelector                      SupportedAgents;                                   // 0x0110(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DistanceToPlayer;                                  // 0x0118(0x0038)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DistanceToPlayerHysteresis;                        // 0x0150(0x0038)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RegistrationDistanceToPlayer;                      // 0x0188(0x0038)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RegistrationDistanceToPlayerHysteresis;            // 0x01C0(0x0038)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FortAthenaLivingWorldNavigationInvokerSettingsOverride> SettingsOverride;                                  // 0x01F8(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortAthenaLivingWorldManager> LivingWorldManager;                                // 0x0208(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_210[0x18];                                     // 0x0210(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCurrentPlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldNavigationInvokerComponent">();
	}
	static class UFortAthenaLivingWorldNavigationInvokerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldNavigationInvokerComponent>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldPrefabLevelStreaming
// 0x0000 (0x02F0 - 0x02F0)
class UFortAthenaLivingWorldPrefabLevelStreaming final : public ULevelStreamingLevelInstance
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldPrefabLevelStreaming">();
	}
	static class UFortAthenaLivingWorldPrefabLevelStreaming* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldPrefabLevelStreaming>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldPrefab
// 0x01B8 (0x0D70 - 0x0BB8)
class AFortAthenaLivingWorldPrefab : public AFortLevelInstancePrefab
{
public:
	TArray<struct FFortAthenaLivingWorldPrefabActorSpawnerData> ActorSpawnerDatas;                                 // 0x0BB8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FBox                                   LocalLevelBounds;                                  // 0x0BC8(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBox                                   LocalGrassRemovalBox;                              // 0x0C00(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(TArray<class AActor*>& SpawnedActors)> OnAllActorSpawnedDelegate;                         // 0x0C38(0x0010)(ZeroConstructor, Transient, InstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_C48[0x18];                                     // 0x0C48(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class ABuildingActor>>  BuildingsToKill;                                   // 0x0C60(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AActor>>          SpawnedActors;                                     // 0x0C70(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TDelegate<void()>                             FinishedDestroyingBuildingCallback;                // 0x0C80(0x0014)(ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasFinishedSpawn;                                 // 0x0C94(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasRemovedFoliage;                                // 0x0C95(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C96[0x2];                                      // 0x0C96(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         bIsEnabled;                                        // 0x0C98(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         Weight;                                            // 0x0CD0(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bShouldLevelBeVisible;                             // 0x0D08(0x0001)(Edit, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldSpawnerBeAllowedToSpawn;                    // 0x0D09(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldAlwaysSnapAboveLandscape;                   // 0x0D0A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D0B[0x5];                                      // 0x0D0B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWorldConditionQueryDefinition         CanSpawnCondition;                                 // 0x0D10(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D38[0x8];                                      // 0x0D38(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  PrefabTags;                                        // 0x0D40(0x0020)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D60[0x8];                                      // 0x0D60(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSnapOnSurfaceComponent*            SnapOnSurfaceTemplate;                             // 0x0D68(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, EditorOnly, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class AFortAthenaLivingWorldPrefab* GetOwningLivingWorldPrefab(const class UObject* WorldContextObject);

	void AllowSpawnerToSpawn();
	void ApplyTemplateToActorsWithoutComponent();
	void ApplyTemplateToAllActors();
	void CallWhenAllActorHaveSpawned(const TDelegate<void(TArray<class AActor*>& SpawnedActors)>& DelegateToCall);
	void DestroyBuildingsInLevelBounds(const TDelegate<void()>& FinishedDelegate);
	void MakeLevelVisible();
	void OnActorSpawnedInWorldEditor(class AActor* SpawnedActor);
	void OnRep_ShouldLevelBeVisible();
	void RemoveFoliageInsideLevelBound();

	struct FBox GetLevelBounds() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldPrefab">();
	}
	static class AFortAthenaLivingWorldPrefab* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaLivingWorldPrefab>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldPrefabActorSpawner
// 0x0180 (0x05A0 - 0x0420)
class AFortAthenaLivingWorldPrefabActorSpawner final : public AActor
{
public:
	struct FFortAthenaLivingWorldActorSpawnDescription ActorDescription;                                  // 0x0420(0x0140)(Edit, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class AActor* SpawnedActor)> OnActorSpawnedDelegate;                            // 0x0560(0x0010)(ZeroConstructor, Transient, InstancedReference, Protected, NativeAccessSpecifierProtected)
	class AFortAthenaPatrolPath*                  PatrolPath;                                        // 0x0570(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  Guid;                                              // 0x0578(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, TextExportTransient, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  SpawnedActor;                                      // 0x0588(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBillboardComponent*                    SpriteComponent;                                   // 0x0590(0x0008)(ExportObject, ZeroConstructor, InstancedReference, EditorOnly, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UArrowComponent*                        ArrowComponent;                                    // 0x0598(0x0008)(ExportObject, ZeroConstructor, InstancedReference, EditorOnly, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void CallWhenActorSpawned(const TDelegate<void(class AActor* SpawnedActor)>& DelegateToCall);
	void OnSnapCompleted(class UFortSnapOnSurfaceComponent* Component, const struct FTransform& OldTransform, const struct FTransform& NewTransfom);

	class AActor* GetSpawnedActor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldPrefabActorSpawner">();
	}
	static class AFortAthenaLivingWorldPrefabActorSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaLivingWorldPrefabActorSpawner>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldSpawnAction
// 0x0000 (0x0030 - 0x0030)
class UFortAthenaLivingWorldSpawnAction : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldSpawnAction">();
	}
	static class UFortAthenaLivingWorldSpawnAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldSpawnAction>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldSpawnActionBlueprint
// 0x0000 (0x0030 - 0x0030)
class UFortAthenaLivingWorldSpawnActionBlueprint final : public UFortAthenaLivingWorldSpawnAction
{
public:
	void K2_ModifySpawnComponentList(class UFortAthenaAISpawnerDataComponentList* ComponentList, class UObject* ComponentOuter) const;
	void K2_OnAllActorSpawned(const TArray<class AActor*>& SpawnedActor, const TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>& SourcePointProvider) const;
	void K2_OnSpawnedActor(const class AActor* SpawnedActor, const TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>& SourcePointProvider) const;
	void K2_OnSpawnedActorFailed(const TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>& SourcePointProvider) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldSpawnActionBlueprint">();
	}
	static class UFortAthenaLivingWorldSpawnActionBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldSpawnActionBlueprint>();
	}
};

// Class LagerRuntime.FortAthenaLivingWorldWardComponent
// 0x0010 (0x00E8 - 0x00D8)
class UFortAthenaLivingWorldWardComponent final : public UActorComponent
{
public:
	float                                         DefaultRadius;                                     // 0x00D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DC[0xC];                                       // 0x00DC(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCurrentPlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnWorldFinishedInitialization(const struct FGameplayTagContainer& ContextTags);
	void SetWardRadius(float Radius);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaLivingWorldWardComponent">();
	}
	static class UFortAthenaLivingWorldWardComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldWardComponent>();
	}
};

// Class LagerRuntime.FortCheatManager_LivingWorldManager_EnhancedInputBindingInfo
// 0x0018 (0x0048 - 0x0030)
class UFortCheatManager_LivingWorldManager_EnhancedInputBindingInfo final : public UObject
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_LivingWorldManager_EnhancedInputBindingInfo">();
	}
	static class UFortCheatManager_LivingWorldManager_EnhancedInputBindingInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_LivingWorldManager_EnhancedInputBindingInfo>();
	}
};

// Class LagerRuntime.FortCheatManager_LivingWorldManager
// 0x0068 (0x0098 - 0x0030)
class UFortCheatManager_LivingWorldManager final : public UChildCheatManager
{
public:
	int32                                         CheatTeleportToCount;                              // 0x0030(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CheatTeleportLastEventDataName;                    // 0x0038(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CheatSpawnEventCount;                              // 0x0048(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CheatSpawnEventName;                               // 0x0050(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CheatTriggerEventCount;                            // 0x0060(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CheatTriggerEventName;                             // 0x0068(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortCheatManager_LivingWorldManager_EnhancedInputBindingInfo*> InputBindings;                                     // 0x0078(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UEnhancedInputComponent*                InputComponent;                                    // 0x0088(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void LivingWorldManagerDisplaySpawnPoints(float MaxDisplayDistance);
	void LivingWorldManagerEndCapture();
	void LivingWorldManagerGDTNextDensityGrid();
	void LivingWorldManagerSpawn(const class FString& EventDataName);
	void LivingWorldManagerSpawnAtLocation(const class FString& EventDataName, const struct FVector& Location, const struct FRotator& Rotation);
	void LivingWorldManagerSpawnEvent(const class FString& EventDataName, const class FString& SpawnerDataNames);
	void LivingWorldManagerSpawnEventAtLocation(const class FString& EventDataName, const struct FVector& Location, const struct FRotator& Rotation, const class FString& SpawnerDataNames);
	void LivingWorldManagerSpawnTrackedAtLocation(const class FString& EventDataName, const class FString& TrackedActorName, const struct FVector& Location, const struct FRotator& Rotation);
	void LivingWorldManagerStartCapture();
	void LivingWorldManagerTeleportTo(const class FString& EventDataName);
	void LivingWorldManagerTeleportToSpawnPosition(const class FString& EventDataName);
	void LivingWorldManagerToggleCapture();
	void LivingWorldManagerTriggerEvent(const class FString& EventDataName);
	void LWMEC();
	void LWMS(const class FString& EventDataName);
	void LWMSC();
	void LWMSE(const class FString& EventDataName, const class FString& SpawnerDataNames);
	void LWMTC();
	void LWMTE(const class FString& EventDataName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_LivingWorldManager">();
	}
	static class UFortCheatManager_LivingWorldManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_LivingWorldManager>();
	}
};

// Class LagerRuntime.FortGameFeatureAction_AddCategoryTableToConfig
// 0x0050 (0x0080 - 0x0030)
class UFortGameFeatureAction_AddCategoryTableToConfig final : public UGameFeatureAction
{
public:
	TMap<TSoftObjectPtr<class UFortAthenaLivingWorldConfigData>, struct FFortAthenaLivingWorldCategoryTableDataList> ConfigToCategoryTableDatas;                        // 0x0030(0x0050)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameFeatureAction_AddCategoryTableToConfig">();
	}
	static class UFortGameFeatureAction_AddCategoryTableToConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameFeatureAction_AddCategoryTableToConfig>();
	}
};

// Class LagerRuntime.FortGameFeatureAction_AddLagerConfig
// 0x0010 (0x0040 - 0x0030)
class UFortGameFeatureAction_AddLagerConfig final : public UGameFeatureAction
{
public:
	TArray<struct FFortLivingWorldConfigOverride> LagerConfigOverrides;                              // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameFeatureAction_AddLagerConfig">();
	}
	static class UFortGameFeatureAction_AddLagerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameFeatureAction_AddLagerConfig>();
	}
};

// Class LagerRuntime.FortGameFeatureAction_MapMarkerTagsProvider_PatrolPath
// 0x0018 (0x0048 - 0x0030)
class UFortGameFeatureAction_MapMarkerTagsProvider_PatrolPath final : public UFortGameFeatureAction_MapMarkerTagsProvider
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDataTable*>                     LivingWorldEventTables;                            // 0x0038(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameFeatureAction_MapMarkerTagsProvider_PatrolPath">();
	}
	static class UFortGameFeatureAction_MapMarkerTagsProvider_PatrolPath* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameFeatureAction_MapMarkerTagsProvider_PatrolPath>();
	}
};

// Class LagerRuntime.FortPawnComponent_LivingWorldSpawnAroundPlayer
// 0x0020 (0x0100 - 0x00E0)
