#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LagerDebuggerRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "LagerRuntime_structs.hpp"
#include "LagerDebuggerRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LagerDebuggerRuntime.LagerDebuggerDensityGridMenu.Server_ChangeDensityGridToDisplay
// 0x000C (0x000C - 0x0000)
struct LagerDebuggerDensityGridMenu_Server_ChangeDensityGridToDisplay final
{
public:
	struct FGameplayTag                           NewSelectedDensityGrid;                            // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerDensityGridMenu.Server_ChangeVerticalCutIndex
// 0x0004 (0x0004 - 0x0000)
struct LagerDebuggerDensityGridMenu_Server_ChangeVerticalCutIndex final
{
public:
	float                                         NewVerticalCutIndex;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerDensityGridMenu.Server_ChangeViewExtent
// 0x0004 (0x0004 - 0x0000)
struct LagerDebuggerDensityGridMenu_Server_ChangeViewExtent final
{
public:
	float                                         NewViewExtent;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerEncounterInstanceMenu.Server_LWMDebugEvent
// 0x0038 (0x0038 - 0x0000)
struct LagerDebuggerEncounterInstanceMenu_Server_LWMDebugEvent final
{
public:
	struct FLagerEventID                          EventID;                                           // 0x0000(0x0038)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerEncounterInstanceMenu.Server_LWMRequestEventLogging
// 0x0040 (0x0040 - 0x0000)
struct LagerDebuggerEncounterInstanceMenu_Server_LWMRequestEventLogging final
{
public:
	struct FLagerEventID                          EventID;                                           // 0x0000(0x0038)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	EFortAthenaLivingWorldEventToDebugStopBehavior Behavior;                                          // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LagerDebuggerRuntime.LagerDebuggerEncounterInstanceMenu.Server_OnEventSelectionChanged
// 0x0038 (0x0038 - 0x0000)
struct LagerDebuggerEncounterInstanceMenu_Server_OnEventSelectionChanged final
{
public:
	struct FLagerEventID                          NewSelectedEventID;                                // 0x0000(0x0038)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerEncounterInstanceMenu.Server_OnSelectionChanged
// 0x0010 (0x0010 - 0x0000)
struct LagerDebuggerEncounterInstanceMenu_Server_OnSelectionChanged final
{
public:
	class FString                                 NewEncounterSelection;                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerEventLoggingMenu.Server_ChangeAllowGathering
// 0x0001 (0x0001 - 0x0000)
struct LagerDebuggerEventLoggingMenu_Server_ChangeAllowGathering final
{
public:
	bool                                          bNewValue;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerEventMenu.Server_LWMDebugEvent
// 0x0038 (0x0038 - 0x0000)
struct LagerDebuggerEventMenu_Server_LWMDebugEvent final
{
public:
	struct FLagerEventID                          EventID;                                           // 0x0000(0x0038)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerEventMenu.Server_LWMForceSpawnActor
// 0x00A0 (0x00A0 - 0x0000)
struct LagerDebuggerEventMenu_Server_LWMForceSpawnActor final
{
public:
	struct FLagerEventID                          EventID;                                           // 0x0000(0x0038)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         RuntimeSpawnDataIndex;                             // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0040(0x0060)(ConstParm, Parm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerEventMenu.Server_LWMForceSpawnEvent
// 0x00A0 (0x00A0 - 0x0000)
struct LagerDebuggerEventMenu_Server_LWMForceSpawnEvent final
{
public:
	struct FLagerEventID                          EventID;                                           // 0x0000(0x0038)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         RuntimeSpawnDataIndex;                             // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0040(0x0060)(ConstParm, Parm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerEventMenu.Server_LWMRequestEventLogging
// 0x0040 (0x0040 - 0x0000)
struct LagerDebuggerEventMenu_Server_LWMRequestEventLogging final
{
public:
	struct FLagerEventID                          EventID;                                           // 0x0000(0x0038)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	EFortAthenaLivingWorldEventToDebugStopBehavior StopBehavior;                                      // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LagerDebuggerRuntime.LagerDebuggerEventMenu.Server_LWMTriggerSpawnEvent
// 0x0040 (0x0040 - 0x0000)
struct LagerDebuggerEventMenu_Server_LWMTriggerSpawnEvent final
{
public:
	struct FLagerEventID                          EventID;                                           // 0x0000(0x0038)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         RuntimeSpawnDataIndex;                             // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LagerDebuggerRuntime.LagerDebuggerEventMenu.Server_OnSelectionChanged
// 0x0038 (0x0038 - 0x0000)
struct LagerDebuggerEventMenu_Server_OnSelectionChanged final
{
public:
	struct FLagerEventID                          NewSelectedEventID;                                // 0x0000(0x0038)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerMenu.Server_LWMSetEventGenerationEnabled
// 0x0001 (0x0001 - 0x0000)
struct LagerDebuggerMenu_Server_LWMSetEventGenerationEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerPointProviderMenu.ServerTeleportToPointProvider
// 0x0010 (0x0010 - 0x0000)
struct LagerDebuggerPointProviderMenu_ServerTeleportToPointProvider final
{
public:
	class FString                                 PointProviderName;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerPointProviderMenu.ServerUpdateGatherDistance
// 0x0004 (0x0004 - 0x0000)
struct LagerDebuggerPointProviderMenu_ServerUpdateGatherDistance final
{
public:
	float                                         NewGatherDistance;                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerSpawnerDataMenu.Server_LWMForceSpawnActor
// 0x0070 (0x0070 - 0x0000)
struct LagerDebuggerSpawnerDataMenu_Server_LWMForceSpawnActor final
{
public:
	int32                                         SpawnerDataIndex;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(ConstParm, Parm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerCheatManager.LagerDebuggerActorMenuEnable
// 0x0001 (0x0001 - 0x0000)
struct LagerDebuggerCheatManager_LagerDebuggerActorMenuEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerCheatManager.LagerDebuggerDensityGridMenuEnable
// 0x0001 (0x0001 - 0x0000)
struct LagerDebuggerCheatManager_LagerDebuggerDensityGridMenuEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerCheatManager.LagerDebuggerEncounterInstanceMenuEnable
// 0x0001 (0x0001 - 0x0000)
struct LagerDebuggerCheatManager_LagerDebuggerEncounterInstanceMenuEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerCheatManager.LagerDebuggerEventInstanceMenuEnable
// 0x0001 (0x0001 - 0x0000)
struct LagerDebuggerCheatManager_LagerDebuggerEventInstanceMenuEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerCheatManager.LagerDebuggerEventLoggingMenuEnable
// 0x0001 (0x0001 - 0x0000)
struct LagerDebuggerCheatManager_LagerDebuggerEventLoggingMenuEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerCheatManager.LagerDebuggerEventMenuEnable
// 0x0001 (0x0001 - 0x0000)
struct LagerDebuggerCheatManager_LagerDebuggerEventMenuEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerCheatManager.LagerDebuggerMenuEnable
// 0x0001 (0x0001 - 0x0000)
struct LagerDebuggerCheatManager_LagerDebuggerMenuEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerCheatManager.LagerDebuggerPointProviderMenuEnable
// 0x0001 (0x0001 - 0x0000)
struct LagerDebuggerCheatManager_LagerDebuggerPointProviderMenuEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LagerDebuggerRuntime.LagerDebuggerCheatManager.LagerDebuggerSpawnerDataMenuEnable
// 0x0001 (0x0001 - 0x0000)
struct LagerDebuggerCheatManager_LagerDebuggerSpawnerDataMenuEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

