#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LauncherSocialDefaults

#include "Basic.hpp"

#include "LauncherSocialTypes_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Class LauncherSocialDefaults.ChatColorSchemeDataAsset
// 0x0120 (0x0158 - 0x0038)
class UChatColorSchemeDataAsset final : public UDataAsset
{
public:
	struct FChatColorScheme                       ChatColorData;                                     // 0x0038(0x0120)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatColorSchemeDataAsset">();
	}
	static class UChatColorSchemeDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatColorSchemeDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialActionButtonStyleDataAsset
// 0x0428 (0x0460 - 0x0038)
class USocialActionButtonStyleDataAsset final : public UDataAsset
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           Style;                                             // 0x0040(0x0420)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialActionButtonStyleDataAsset">();
	}
	static class USocialActionButtonStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialActionButtonStyleDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialChatChromeColorSchemeDataAsset
// 0x0050 (0x0088 - 0x0038)
class USocialChatChromeColorSchemeDataAsset final : public UDataAsset
{
public:
	struct FChatChromeColorScheme                 Style;                                             // 0x0038(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatChromeColorSchemeDataAsset">();
	}
	static class USocialChatChromeColorSchemeDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatChromeColorSchemeDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialChatChromeMarginsDataAsset
// 0x0068 (0x00A0 - 0x0038)
class USocialChatChromeMarginsDataAsset final : public UDataAsset
{
public:
	struct FChatChromeMargins                     Style;                                             // 0x0038(0x0064)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatChromeMarginsDataAsset">();
	}
	static class USocialChatChromeMarginsDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatChromeMarginsDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialChatChromeStyleDataAsset
// 0x0C88 (0x0CC0 - 0x0038)
class USocialChatChromeStyleDataAsset final : public UDataAsset
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChatChromeStyle                       Style;                                             // 0x0040(0x0C80)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatChromeStyleDataAsset">();
	}
	static class USocialChatChromeStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatChromeStyleDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialChatMarkupStyleDataAsset
// 0x0988 (0x09C0 - 0x0038)
class USocialChatMarkupStyleDataAsset final : public UDataAsset
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChatMarkupStyle                       Style;                                             // 0x0040(0x0980)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatMarkupStyleDataAsset">();
	}
	static class USocialChatMarkupStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatMarkupStyleDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialChatStyleDataAsset
// 0x2368 (0x23A0 - 0x0038)
class USocialChatStyleDataAsset final : public UDataAsset
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChatStyle                             Style;                                             // 0x0040(0x2360)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatStyleDataAsset">();
	}
	static class USocialChatStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatStyleDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialCheckBoxStyleDataAsset
// 0x0B18 (0x0B50 - 0x0038)
class USocialCheckBoxStyleDataAsset final : public UDataAsset
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCheckBoxStyle                         Style;                                             // 0x0040(0x0B10)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialCheckBoxStyleDataAsset">();
	}
	static class USocialCheckBoxStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialCheckBoxStyleDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialFontStyleDataAsset
// 0x02D0 (0x0308 - 0x0038)
class USocialFontStyleDataAsset final : public UDataAsset
{
public:
	struct FSocialFontStyle                       Style;                                             // 0x0038(0x02D0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialFontStyleDataAsset">();
	}
	static class USocialFontStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialFontStyleDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialListMarginsDataAsset
// 0x0210 (0x0248 - 0x0038)
class USocialListMarginsDataAsset final : public UDataAsset
{
public:
	struct FSocialListMargins                     Style;                                             // 0x0038(0x0210)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialListMarginsDataAsset">();
	}
	static class USocialListMarginsDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListMarginsDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialListStyleDataAsset
// 0x4088 (0x40C0 - 0x0038)
class USocialListStyleDataAsset final : public UDataAsset
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSocialListStyle                       Style;                                             // 0x0040(0x4080)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialListStyleDataAsset">();
	}
	static class USocialListStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListStyleDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialProfanityDataAsset
// 0x0010 (0x0048 - 0x0038)
class USocialProfanityDataAsset final : public UDataAsset
{
public:
	TArray<struct FProfanityData>                 ProfanityData;                                     // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialProfanityDataAsset">();
	}
	static class USocialProfanityDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialProfanityDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialRadioBoxStyleDataAsset
// 0x0B18 (0x0B50 - 0x0038)
class USocialRadioBoxStyleDataAsset final : public UDataAsset
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCheckBoxStyle                         Style;                                             // 0x0040(0x0B10)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialRadioBoxStyleDataAsset">();
	}
	static class USocialRadioBoxStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialRadioBoxStyleDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialScrollBarStyleDataAsset
// 0x0778 (0x07B0 - 0x0038)
class USocialScrollBarStyleDataAsset final : public UDataAsset
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScrollBarStyle                        Style;                                             // 0x0040(0x0770)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialScrollBarStyleDataAsset">();
	}
	static class USocialScrollBarStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialScrollBarStyleDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialSoundSchemaDataAsset
// 0x0060 (0x0098 - 0x0038)
class USocialSoundSchemaDataAsset final : public UDataAsset
{
public:
	struct FSocialSoundSchema                     SoundSchema;                                       // 0x0038(0x0060)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialSoundSchemaDataAsset">();
	}
	static class USocialSoundSchemaDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialSoundSchemaDataAsset>();
	}
};

// Class LauncherSocialDefaults.SocialStyleDataAsset
// 0xABB8 (0xABF0 - 0x0038)
class alignas(0x10) USocialStyleDataAsset final : public UDataAsset
{
public:
	class USocialFontStyleDataAsset*              SmallFontStyle;                                    // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialFontStyleDataAsset*              NormalFontStyle;                                   // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialFontStyleDataAsset*              LargeFontStyle;                                    // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialFontStyleDataAsset*              ChatFontStyle;                                     // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialListStyleDataAsset*              SocialListStyle;                                   // 0x0058(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialListMarginsDataAsset*            SocialListMargins;                                 // 0x0060(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialChatStyleDataAsset*              ChatStyle;                                         // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialChatChromeStyleDataAsset*        ChatChromeStyle;                                   // 0x0070(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialChatChromeMarginsDataAsset*      ChatChromeMargins;                                 // 0x0078(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialChatChromeColorSchemeDataAsset*  ChatChromeColorScheme;                             // 0x0080(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChatColorSchemeDataAsset*              ChatColorScheme;                                   // 0x0088(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialSoundSchemaDataAsset*            SoundSchema;                                       // 0x0090(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialActionButtonStyleDataAsset*      ActionButtonStyle;                                 // 0x0098(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialCheckBoxStyleDataAsset*          CheckBoxStyle;                                     // 0x00A0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialRadioBoxStyleDataAsset*          RadioBoxStyle;                                     // 0x00A8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialScrollBarStyleDataAsset*         ScrollBoxStyle;                                    // 0x00B0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialChatMarkupStyleDataAsset*        MarkupStyle;                                       // 0x00B8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialProfanityDataAsset*              ProfanityDataAsset;                                // 0x00C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0xAB28];                                    // 0x00C8(0xAB28)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialStyleDataAsset">();
	}
	static class USocialStyleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialStyleDataAsset>();
	}
};

}

