#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LauncherSocialTypes

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// ScriptStruct LauncherSocialTypes.SocialListMargins
// 0x0210 (0x0210 - 0x0000)
struct FSocialListMargins final
{
public:
	struct FVector2D                              UserPresenceImageSize;                             // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                HeaderButtonMargin;                                // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListMargin;                                 // 0x0020(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListNoFriendsMargin;                        // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListHeaderMargin;                           // 0x0040(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListHeaderCountMargin;                      // 0x0050(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                HeaderButtonContentMargin;                         // 0x0060(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemMargin;                                  // 0x0070(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemStatusMargin;                            // 0x0080(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipStatusMargin;                             // 0x0090(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemPresenceMargin;                          // 0x00A0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemPlatformMargin;                          // 0x00B0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemTextScrollerMargin;                      // 0x00C0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ConfirmationBorderMargin;                          // 0x00D0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ConfirmationButtonMargin;                          // 0x00E0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ConfirmationButtonContentMargin;                   // 0x00F0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                NoneFriendContentMargin;                           // 0x0100(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         NoneFriendContentHeight;                           // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoneFriendIconWidth;                               // 0x0114(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuBackIconMargin;                             // 0x0118(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuPageIconMargin;                             // 0x0128(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                RadioSettingTitleMargin;                           // 0x0138(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuSearchIconMargin;                           // 0x0148(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuSearchTextMargin;                           // 0x0158(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuBackButtonMargin;                           // 0x0168(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuSettingButtonMargin;                        // 0x0178(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuListMargin;                                 // 0x0188(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SubMenuSeperatorThickness;                         // 0x0198(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PresenceSeperatorThickness;                        // 0x019C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipMargin;                                   // 0x01A0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipPresenceMargin;                           // 0x01B0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipSeperatorMargin;                          // 0x01C0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ToolTipMargin;                                     // 0x01D0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                TipStatusMargin;                                   // 0x01E0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                AddButtonMargin;                                   // 0x01F0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              AddButtonSpacing;                                  // 0x0200(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct LauncherSocialTypes.ChatChromeColorScheme
// 0x0050 (0x0050 - 0x0000)
struct FChatChromeColorScheme final
{
public:
	struct FLinearColor                           ChatEntryBackgroundColor;                          // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NoneActiveTabColor;                                // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TabFontColor;                                      // 0x0020(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TabFontColorInverted;                              // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ChatBackgroundColor;                               // 0x0040(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct LauncherSocialTypes.ChatChromeMargins
// 0x0064 (0x0064 - 0x0000)
struct FChatChromeMargins final
{
public:
	float                                         TabWidth;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                TabPadding;                                        // 0x0004(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ChatWindowPadding;                                 // 0x0014(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ChatWindowToEntryMargin;                           // 0x0024(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ChatChannelPadding;                                // 0x0034(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                UserListButtonPadding;                             // 0x0044(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                UserListIconPadding;                               // 0x0054(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct LauncherSocialTypes.ChatChromeStyle
// 0x0C80 (0x0C80 - 0x0000)
struct FChatChromeStyle final
{
public:
	struct FSlateBrush                            UserListBrush;                                     // 0x0000(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ChatBackgroundBrush;                               // 0x00D0(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ChatEntryBackgroundBrush;                          // 0x01A0(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ChannelBackgroundBrush;                            // 0x0270(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            TabBackgroundBrush;                                // 0x0340(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           TabSelectorButtonStyle;                            // 0x0410(0x0420)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                TabOptionPadding;                                  // 0x0830(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                TabContentPadding;                                 // 0x0840(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                TabClosePadding;                                   // 0x0850(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FButtonStyle                           UserListButtonStyle;                               // 0x0860(0x0420)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct LauncherSocialTypes.ChatColorScheme
// 0x0120 (0x0120 - 0x0000)
struct FChatColorScheme final
{
public:
	struct FLinearColor                           TimeStampColor;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultChatColor;                                  // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           WhisperChatColor;                                  // 0x0020(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GlobalChatColor;                                   // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FounderChatColor;                                  // 0x0040(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GameChatColor;                                     // 0x0050(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TeamChatColor;                                     // 0x0060(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           PartyChatColor;                                    // 0x0070(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           AdminChatColor;                                    // 0x0080(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GameAdminChatColor;                                // 0x0090(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           WhisperHyperlinkChatColor;                         // 0x00A0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GlobalHyperlinkChatColor;                          // 0x00B0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FounderHyperlinkChatColor;                         // 0x00C0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GameHyperlinkChatColor;                            // 0x00D0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TeamHyperlinkChatColor;                            // 0x00E0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           PartyHyperlinkChatColor;                           // 0x00F0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           EnemyColor;                                        // 0x0100(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FriendlyColor;                                     // 0x0110(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct LauncherSocialTypes.ChatMarkupStyle
// 0x0980 (0x0980 - 0x0000)
struct FChatMarkupStyle final
{
public:
	struct FButtonStyle                           MarkupButtonStyle;                                 // 0x0000(0x0420)(Edit, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        MarkupTextStyle;                                   // 0x0420(0x0350)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            MarkupBackground;                                  // 0x0770(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonColor;                                       // 0x0840(0x0014)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonHoverColor;                                  // 0x0854(0x0014)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            TipColor;                                          // 0x0868(0x0014)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_87C[0x4];                                      // 0x087C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SeperatorBrush;                                    // 0x0880(0x00D0)(Edit, NativeAccessSpecifierPublic)
	float                                         SeperatorThickness;                                // 0x0950(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                MarkupPadding;                                     // 0x0954(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ButtonPadding;                                     // 0x0964(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_974[0xC];                                      // 0x0974(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LauncherSocialTypes.ChatStyle
// 0x2360 (0x2360 - 0x0000)
struct FChatStyle final
{
public:
	struct FEditableTextBoxStyle                  ChatEntryTextStyle;                                // 0x0000(0x0F00)(Edit, NativeAccessSpecifierPublic)
	struct FEditableTextBoxStyle                  ChatDisplayTextStyle;                              // 0x0F00(0x0F00)(Edit, NativeAccessSpecifierPublic)
	struct FScrollBoxStyle                        ScrollBorderStyle;                                 // 0x1E00(0x0370)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            MessageNotificationBrush;                          // 0x2170(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                ChatEntryPadding;                                  // 0x2240(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ChatEntryHeight;                                   // 0x2250(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2254[0xC];                                     // 0x2254(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ChatMenuBackgroundBrush;                           // 0x2260(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                FriendActionPadding;                               // 0x2330(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendActionHeaderPadding;                         // 0x2340(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendActionStatusMargin;                          // 0x2350(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct LauncherSocialTypes.SocialFontStyle
// 0x02D0 (0x02D0 - 0x0000)
struct FSocialFontStyle final
{
public:
	struct FSlateFontInfo                         FontSmall;                                         // 0x0000(0x0070)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontSmallBold;                                     // 0x0070(0x0070)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontNormal;                                        // 0x00E0(0x0070)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontNormalBold;                                    // 0x0150(0x0070)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontLarge;                                         // 0x01C0(0x0070)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontLargeBold;                                     // 0x0230(0x0070)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultFontColor;                                  // 0x02A0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           InvertedFontColor;                                 // 0x02B0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultDullFontColor;                              // 0x02C0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct LauncherSocialTypes.SocialListStyle
// 0x4080 (0x4080 - 0x0000)
struct FSocialListStyle final
{
public:
	struct FButtonStyle                           GlobalChatButtonStyle;                             // 0x0000(0x0420)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            GlobalChatIcon;                                    // 0x0420(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           FriendItemButtonStyle;                             // 0x04F0(0x0420)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           ConfirmButtonStyle;                                // 0x0910(0x0420)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           CancelButtonStyle;                                 // 0x0D30(0x0420)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonContentColor;                                // 0x1150(0x0014)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonHoverContentColor;                           // 0x1164(0x0014)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_1178[0x8];                                     // 0x1178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ActionMenuArrowBrush;                              // 0x1180(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ActionMenuArrowRightBrush;                         // 0x1250(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ActionMenuBackgroundColor;                         // 0x1320(0x0014)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_1334[0xC];                                     // 0x1334(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ToolTipArrowBrush;                                 // 0x1340(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           BackButtonStyle;                                   // 0x1410(0x0420)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           HeaderButtonStyle;                                 // 0x1830(0x0420)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           FriendListActionButtonStyle;                       // 0x1C50(0x0420)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            AddFriendButtonContentBrush;                       // 0x2070(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            StatusIconBrush;                                   // 0x2140(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            PCIconBrush;                                       // 0x2210(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ConsoleIconBrush;                                  // 0x22E0(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            MobileIconBrush;                                   // 0x23B0(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FacebookIconBrush;                                 // 0x2480(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            EpicIconBrush;                                     // 0x2550(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendImageBrush;                                  // 0x2620(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            OfflineBrush;                                      // 0x26F0(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            OnlineBrush;                                       // 0x27C0(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            AwayBrush;                                         // 0x2890(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SpectateBrush;                                     // 0x2960(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendsContainerBackground;                        // 0x2A30(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendsListBackground;                             // 0x2B00(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FEditableTextBoxStyle                  AddFriendEditableTextStyle;                        // 0x2BD0(0x0F00)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackBrush;                                         // 0x3AD0(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SelectedOptionBrush;                               // 0x3BA0(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SettingsBrush;                                     // 0x3C70(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SeperatorBrush;                                    // 0x3D40(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            PresenceSeperatorBrush;                            // 0x3E10(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FontSizeBrush;                                     // 0x3EE0(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SearchBrush;                                       // 0x3FB0(0x00D0)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct LauncherSocialTypes.ProfanityData
// 0x0038 (0x0038 - 0x0000)
struct FProfanityData final
{
public:
	class FString                                 CountryCode;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProfanityList;                                     // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WhiteList;                                         // 0x0020(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoAdd;                                          // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LauncherSocialTypes.SocialSoundSchema
// 0x0060 (0x0060 - 0x0000)
struct FSocialSoundSchema final
{
public:
	struct FSlateSound                            MessageReceivedSound;                              // 0x0000(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            PartyInviteReceivedSound;                          // 0x0020(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            FriendInviteReceivedSound;                         // 0x0040(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct LauncherSocialTypes.SocialStyle
// 0xAB20 (0xAB20 - 0x0000)
struct FSocialStyle final
{
public:
	struct FScrollBarStyle                        ScrollBarStyle;                                    // 0x0000(0x0770)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           ActionButtonStyle;                                 // 0x0770(0x0420)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       SmallFontStyle;                                    // 0x0B90(0x02D0)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       NormalFontStyle;                                   // 0x0E60(0x02D0)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       LargeFontStyle;                                    // 0x1130(0x02D0)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       ChatFontStyle;                                     // 0x1400(0x02D0)(Edit, NativeAccessSpecifierPublic)
	struct FCheckBoxStyle                         CheckBoxStyle;                                     // 0x16D0(0x0B10)(Edit, NativeAccessSpecifierPublic)
	struct FCheckBoxStyle                         RadioBoxStyle;                                     // 0x21E0(0x0B10)(Edit, NativeAccessSpecifierPublic)
	struct FSocialListStyle                       SocialListStyle;                                   // 0x2CF0(0x4080)(Edit, NativeAccessSpecifierPublic)
	struct FSocialListMargins                     SocialListMargins;                                 // 0x6D70(0x0210)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FChatStyle                             ChatStyle;                                         // 0x6F80(0x2360)(Edit, NativeAccessSpecifierPublic)
	struct FChatColorScheme                       ChatColorScheme;                                   // 0x92E0(0x0120)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FChatChromeStyle                       ChatChromeStyle;                                   // 0x9400(0x0C80)(Edit, NativeAccessSpecifierPublic)
	struct FChatChromeMargins                     ChatChromeMargins;                                 // 0xA080(0x0064)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FChatChromeColorScheme                 ChatChromeColorScheme;                             // 0xA0E4(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A134[0xC];                                     // 0xA134(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChatMarkupStyle                       ChatMarkupStyle;                                   // 0xA140(0x0980)(Edit, NativeAccessSpecifierPublic)
	struct FSocialSoundSchema                     SoundSchema;                                       // 0xAAC0(0x0060)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

}

