#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Learning

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class Learning.LearningNeuralNetworkData
// 0x0038 (0x0068 - 0x0030)
class ULearningNeuralNetworkData final : public UObject
{
public:
	int32                                         InputSize;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         OutputSize;                                        // 0x0034(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CompatibilityHash;                                 // 0x0038(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 FileData;                                          // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UNNEModelData*                          ModelData;                                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LearningNeuralNetworkData">();
	}
	static class ULearningNeuralNetworkData* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULearningNeuralNetworkData>();
	}
};

}

