#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LensComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CameraCalibrationCore_structs.hpp"
#include "CinematicCamera_structs.hpp"
#include "LensComponent_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class LensComponent.LensComponent
// 0x0238 (0x0310 - 0x00D8)
class ULensComponent final : public UActorComponent
{
public:
	struct FLensFilePicker                        LensFilePicker;                                    // 0x00D8(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	EFIZEvaluationMode                            EvaluationMode;                                    // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FComponentReference                    TargetCameraComponent;                             // 0x00F0(0x0030)(Edit, DisableEditOnTemplate, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLensFileEvaluationInputs              EvalInputs;                                        // 0x0120(0x001C)(Edit, EditConst, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	EDistortionSource                             DistortionStateSource;                             // 0x013C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bApplyDistortion;                                  // 0x013D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ULensModel>                 LensModel;                                         // 0x0140(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLensDistortionState                   DistortionState;                                   // 0x0148(0x0030)(Edit, BlueprintVisible, Interp, Protected, NativeAccessSpecifierProtected)
	bool                                          bScaleOverscan;                                    // 0x0178(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverscanMultiplier;                                // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFilmbackOverrideSource                       FilmbackOverride;                                  // 0x0180(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraFilmbackSettings                CroppedFilmback;                                   // 0x0184(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bApplyNodalOffsetOnTick;                           // 0x0190(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_191[0xF];                                      // 0x0191(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OriginalTrackedComponentTransform;                 // 0x01A0(0x0060)(Edit, BlueprintVisible, EditConst, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsDistortionSetup;                                // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OriginalFocalLength;                               // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               LastDistortionMID;                                 // 0x0208(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCineCameraComponent*                   LastCameraComponent;                               // 0x0210(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class ULensModel>, class ULensDistortionModelHandlerBase*> LensDistortionHandlerMap;                          // 0x0218(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class USceneComponent>         TrackedComponent;                                  // 0x0268(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 TrackedComponentName;                              // 0x0270(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               OriginalCameraRotation;                            // 0x0288(0x0018)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                OriginalCameraLocation;                            // 0x02A0(0x0018)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDistortionHandlerPicker               DistortionSource;                                  // 0x02B8(0x0028)(Deprecated, EditorOnly, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E0[0x30];                                     // 0x02E0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyNodalOffset(class USceneComponent* ComponentToOffset, bool bUseManualInputs, float ManualFocusInput, float ManualZoomInput);
	void ClearDistortionState();
	void SetApplyDistortion(bool bApply);
	void SetApplyNodalOffsetOnTick(bool bApplyNodalOffset);
	void SetCroppedFilmback(const struct FCameraFilmbackSettings& Filmback);
	void SetDistortionSource(EDistortionSource Source);
	void SetDistortionState(const struct FLensDistortionState& State);
	void SetFilmbackOverrideSetting(EFilmbackOverrideSource Setting);
	void SetFIZEvaluationMode(EFIZEvaluationMode Mode);
	void SetLensFile(class ULensFile* LensFile);
	void SetLensFilePicker(const struct FLensFilePicker& LensFile);
	void SetLensModel(TSubclassOf<class ULensModel> Model);
	void SetOverscanMultiplier(float Multiplier);

	struct FCameraFilmbackSettings GetCroppedFilmback() const;
	EDistortionSource GetDistortionSource() const;
	struct FLensDistortionState GetDistortionState() const;
	EFilmbackOverrideSource GetFilmbackOverrideSetting() const;
	EFIZEvaluationMode GetFIZEvaluationMode() const;
	class ULensDistortionModelHandlerBase* GetLensDistortionHandler() const;
	class ULensFile* GetLensFile() const;
	const struct FLensFileEvaluationInputs GetLensFileEvaluationInputs() const;
	struct FLensFilePicker GetLensFilePicker() const;
	TSubclassOf<class ULensModel> GetLensModel() const;
	float GetOriginalFocalLength() const;
	float GetOverscanMultiplier() const;
	bool ShouldApplyDistortion() const;
	bool ShouldApplyNodalOffsetOnTick() const;
	bool WasDistortionEvaluated() const;
	bool WasNodalOffsetAppliedThisTick() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LensComponent">();
	}
	static class ULensComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULensComponent>();
	}
};

}

