#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LensComponentEditor

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "TakeTrackRecorders_classes.hpp"


namespace SDK
{

// Class LensComponentEditor.MovieSceneLensComponentSection
// 0x0058 (0x01B8 - 0x0160)
class UMovieSceneLensComponentSection final : public UMovieSceneHookSection
{
public:
	bool                                          bReapplyNodalOffset;                               // 0x0160(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULensFile*                              OverrideLensFile;                                  // 0x0168(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULensFile*                              CachedLensFile;                                    // 0x0170(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneFloatChannel>        DistortionParameterChannels;                       // 0x0178(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneFloatChannel>        FxFyChannels;                                      // 0x0188(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneFloatChannel>        ImageCenterChannels;                               // 0x0198(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TSubclassOf<class ULensModel>                 LensModelClass;                                    // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B0[0x8];                                      // 0x01B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneLensComponentSection">();
	}
	static class UMovieSceneLensComponentSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLensComponentSection>();
	}
};

// Class LensComponentEditor.MovieSceneLensComponentTrack
// 0x0010 (0x0100 - 0x00F0)
class UMovieSceneLensComponentTrack final : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x00F0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneLensComponentTrack">();
	}
	static class UMovieSceneLensComponentTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLensComponentTrack>();
	}
};

// Class LensComponentEditor.MovieSceneLensComponentTrackRecorder
// 0x0008 (0x0090 - 0x0088)
class UMovieSceneLensComponentTrackRecorder final : public UMovieSceneTrackRecorder
{
public:
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneLensComponentTrackRecorder">();
	}
	static class UMovieSceneLensComponentTrackRecorder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLensComponentTrackRecorder>();
	}
};

}

