#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelInstanceEditor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnrealEd_structs.hpp"
#include "UnrealEd_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class LevelInstanceEditor.LevelInstanceActorFactory
// 0x0000 (0x0090 - 0x0090)
class ULevelInstanceActorFactory final : public UActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelInstanceActorFactory">();
	}
	static class ULevelInstanceActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelInstanceActorFactory>();
	}
};

// Class LevelInstanceEditor.LevelInstanceEditorBehaviorSource
// 0x0018 (0x0048 - 0x0030)
class ULevelInstanceEditorBehaviorSource final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputBehaviorSet*                      InputBehaviorSet;                                  // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelInstanceEditorBehaviorSource">();
	}
	static class ULevelInstanceEditorBehaviorSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelInstanceEditorBehaviorSource>();
	}
};

// Class LevelInstanceEditor.LevelInstanceEditorMode
// 0x0018 (0x0148 - 0x0130)
class ULevelInstanceEditorMode final : public UEdMode
{
public:
	uint8                                         Pad_130[0x8];                                      // 0x0130(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInputBehaviorSource>  ModeBehaviorSource;                                // 0x0138(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelInstanceEditorMode">();
	}
	static class ULevelInstanceEditorMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelInstanceEditorMode>();
	}
};

// Class LevelInstanceEditor.LevelInstanceEditorSettings
// 0x0028 (0x0088 - 0x0060)
class ULevelInstanceEditorSettings final : public UDeveloperSettings
{
public:
	TArray<struct FTemplateMapInfo>               TemplateMapInfos;                                  // 0x0060(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	class FString                                 LevelInstanceClassName;                            // 0x0070(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableStreaming;                                  // 0x0080(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEditInPlaceStreamingEnabled;                    // 0x0081(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelInstanceEditorSettings">();
	}
	static class ULevelInstanceEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelInstanceEditorSettings>();
	}
};

// Class LevelInstanceEditor.LevelInstanceEditorPerProjectUserSettings
// 0x0008 (0x0068 - 0x0060)
class ULevelInstanceEditorPerProjectUserSettings final : public UDeveloperSettings
{
public:
	bool                                          bAlwaysShowDialog;                                 // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELevelInstancePivotType                       PivotType;                                         // 0x0061(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSubSelectionEnabled;                            // 0x0062(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsViewportSubSelectionEnabled;                    // 0x0063(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepFoldersDuringBreak;                           // 0x0064(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelInstanceEditorPerProjectUserSettings">();
	}
	static class ULevelInstanceEditorPerProjectUserSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelInstanceEditorPerProjectUserSettings>();
	}
};

}

