#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelSequenceEditor

#include "Basic.hpp"

#include "LevelSequenceEditor_structs.hpp"
#include "Sequencer_structs.hpp"
#include "MovieSceneTools_structs.hpp"
#include "MovieScene_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SequencerScriptingEditor_structs.hpp"


namespace SDK::Params
{

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.DeleteColorForChannels
// 0x0018 (0x0018 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_DeleteColorForChannels final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Identifier;                                        // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.FocusLevelSequence
// 0x0008 (0x0008 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_FocusLevelSequence final
{
public:
	class UMovieSceneSubSection*                  SubSection;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetBoundObjects
// 0x0030 (0x0030 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetBoundObjects final
{
public:
	struct FMovieSceneObjectBindingID             ObjectBinding;                                     // 0x0000(0x001C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetChannelsWithSelectedKeys
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetChannelsWithSelectedKeys final
{
public:
	TArray<struct FSequencerChannelProxy>         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetCurrentLevelSequence
// 0x0008 (0x0008 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetCurrentLevelSequence final
{
public:
	class ULevelSequence*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetCurrentLocalTime
// 0x0004 (0x0004 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetCurrentLocalTime final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetCurrentTime
// 0x0004 (0x0004 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetCurrentTime final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetCustomColorForChannel
// 0x0028 (0x0028 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetCustomColorForChannel final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Identifier;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetFocusedLevelSequence
// 0x0008 (0x0008 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetFocusedLevelSequence final
{
public:
	class ULevelSequence*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetGlobalPosition
// 0x0048 (0x0048 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetGlobalPosition final
{
public:
	EMovieSceneTimeUnit                           TimeUnit;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequencePlaybackParams      ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetLocalPosition
// 0x0048 (0x0048 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetLocalPosition final
{
public:
	EMovieSceneTimeUnit                           TimeUnit;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequencePlaybackParams      ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetLoopMode
// 0x0001 (0x0001 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetLoopMode final
{
public:
	ESequencerLoopMode                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetPlaybackSpeed
// 0x0004 (0x0004 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetPlaybackSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetSelectedBindings
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetSelectedBindings final
{
public:
	TArray<struct FMovieSceneBindingProxy>        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetSelectedChannels
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetSelectedChannels final
{
public:
	TArray<struct FSequencerChannelProxy>         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetSelectedFolders
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetSelectedFolders final
{
public:
	TArray<class UMovieSceneFolder*>              ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetSelectedKeys
// 0x0028 (0x0028 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetSelectedKeys final
{
public:
	struct FSequencerChannelProxy                 ChannelProxy;                                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<int32>                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetSelectedSections
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetSelectedSections final
{
public:
	TArray<class UMovieSceneSection*>             ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetSelectedTracks
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetSelectedTracks final
{
public:
	TArray<class UMovieSceneTrack*>               ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetSelectionRangeEnd
// 0x0004 (0x0004 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetSelectionRangeEnd final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetSelectionRangeStart
// 0x0004 (0x0004 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetSelectionRangeStart final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetSubSequenceHierarchy
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetSubSequenceHierarchy final
{
public:
	TArray<class UMovieSceneSubSection*>          ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.GetTrackFilterNames
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_GetTrackFilterNames final
{
public:
	TArray<class FText>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.HasCustomColorForChannel
// 0x0020 (0x0020 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_HasCustomColorForChannel final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Identifier;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.IsCameraCutLockedToViewport
// 0x0001 (0x0001 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_IsCameraCutLockedToViewport final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.IsLevelSequenceLocked
// 0x0001 (0x0001 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_IsLevelSequenceLocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.IsTrackFilterEnabled
// 0x0018 (0x0018 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_IsTrackFilterEnabled final
{
public:
	class FText                                   TrackFilterName;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.OpenLevelSequence
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_OpenLevelSequence final
{
public:
	class ULevelSequence*                         LevelSequence;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.PlayTo
// 0x0048 (0x0048 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_PlayTo final
{
public:
	struct FMovieSceneSequencePlaybackParams      PlaybackParams;                                    // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
	EMovieSceneTimeUnit                           TimeUnit;                                          // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SelectBindings
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SelectBindings final
{
public:
	TArray<struct FMovieSceneBindingProxy>        ObjectBindings;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SelectChannels
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SelectChannels final
{
public:
	TArray<struct FSequencerChannelProxy>         Channels;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SelectFolders
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SelectFolders final
{
public:
	TArray<class UMovieSceneFolder*>              Folders;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SelectKeys
// 0x0028 (0x0028 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SelectKeys final
{
public:
	struct FSequencerChannelProxy                 Channel;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<int32>                                 Indices;                                           // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SelectSections
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SelectSections final
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SelectTracks
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SelectTracks final
{
public:
	TArray<class UMovieSceneTrack*>               Tracks;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SetCurrentLocalTime
// 0x0004 (0x0004 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SetCurrentLocalTime final
{
public:
	int32                                         NewFrame;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SetCurrentTime
// 0x0004 (0x0004 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SetCurrentTime final
{
public:
	int32                                         NewFrame;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SetCustomColorForChannel
// 0x0028 (0x0028 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SetCustomColorForChannel final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Identifier;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NewColor;                                          // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SetCustomColorForChannels
// 0x0028 (0x0028 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SetCustomColorForChannels final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Identifiers;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   NewColors;                                         // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SetGlobalPosition
// 0x0048 (0x0048 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SetGlobalPosition final
{
public:
	struct FMovieSceneSequencePlaybackParams      PlaybackParams;                                    // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
	EMovieSceneTimeUnit                           TimeUnit;                                          // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SetLocalPosition
// 0x0048 (0x0048 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SetLocalPosition final
{
public:
	struct FMovieSceneSequencePlaybackParams      PlaybackParams;                                    // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
	EMovieSceneTimeUnit                           TimeUnit;                                          // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SetLockCameraCutToViewport
// 0x0001 (0x0001 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SetLockCameraCutToViewport final
{
public:
	bool                                          bLock;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SetLockLevelSequence
// 0x0001 (0x0001 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SetLockLevelSequence final
{
public:
	bool                                          bLock;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SetLoopMode
// 0x0001 (0x0001 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SetLoopMode final
{
public:
	ESequencerLoopMode                            NewLoopMode;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SetPlaybackSpeed
// 0x0004 (0x0004 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SetPlaybackSpeed final
{
public:
	float                                         NewPlaybackSpeed;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SetRandomColorForChannels
// 0x0018 (0x0018 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SetRandomColorForChannels final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Identifiers;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SetSelectionRangeEnd
// 0x0004 (0x0004 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SetSelectionRangeEnd final
{
public:
	int32                                         NewFrame;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SetSelectionRangeStart
// 0x0004 (0x0004 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SetSelectionRangeStart final
{
public:
	int32                                         NewFrame;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorBlueprintLibrary.SetTrackFilterEnabled
// 0x0018 (0x0018 - 0x0000)
struct LevelSequenceEditorBlueprintLibrary_SetTrackFilterEnabled final
{
public:
	class FText                                   TrackFilterName;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.AddActors
// 0x0020 (0x0020 - 0x0000)
struct LevelSequenceEditorSubsystem_AddActors final
{
public:
	TArray<class AActor*>                         Actors;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FMovieSceneBindingProxy>        ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.AddActorsToBinding
// 0x0028 (0x0028 - 0x0000)
struct LevelSequenceEditorSubsystem_AddActorsToBinding final
{
public:
	TArray<class AActor*>                         Actors;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMovieSceneBindingProxy                ObjectBinding;                                     // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.BakeTransform
// 0x0030 (0x0030 - 0x0000)
struct LevelSequenceEditorSubsystem_BakeTransform final
{
public:
	TArray<struct FMovieSceneBindingProxy>        ObjectBindings;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FFrameTime                             BakeInTime;                                        // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameTime                             BakeOutTime;                                       // 0x0018(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameTime                             BakeInterval;                                      // 0x0020(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneScriptingParams             Params_0;                                          // 0x0028(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.BakeTransformWithSettings
// 0x0030 (0x0030 - 0x0000)
struct LevelSequenceEditorSubsystem_BakeTransformWithSettings final
{
public:
	TArray<struct FMovieSceneBindingProxy>        ObjectBindings;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBakingAnimationKeySettings            InSettings;                                        // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMovieSceneScriptingParams             Params_0;                                          // 0x0028(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.ChangeActorTemplateClass
// 0x0028 (0x0028 - 0x0000)
struct LevelSequenceEditorSubsystem_ChangeActorTemplateClass final
{
public:
	struct FMovieSceneBindingProxy                ObjectBinding;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.ConvertToCustomBinding
// 0x0038 (0x0038 - 0x0000)
struct LevelSequenceEditorSubsystem_ConvertToCustomBinding final
{
public:
	struct FMovieSceneBindingProxy                ObjectBinding;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMovieSceneCustomBinding>   BindingType;                                       // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneBindingProxy                ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.ConvertToPossessable
// 0x0030 (0x0030 - 0x0000)
struct LevelSequenceEditorSubsystem_ConvertToPossessable final
{
public:
	struct FMovieSceneBindingProxy                ObjectBinding;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneBindingProxy                ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.ConvertToSpawnable
// 0x0028 (0x0028 - 0x0000)
struct LevelSequenceEditorSubsystem_ConvertToSpawnable final
{
public:
	struct FMovieSceneBindingProxy                ObjectBinding;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMovieSceneBindingProxy>        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.CopyBindings
// 0x0020 (0x0020 - 0x0000)
struct LevelSequenceEditorSubsystem_CopyBindings final
{
public:
	TArray<struct FMovieSceneBindingProxy>        Bindings;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ExportedText;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.CopyFolders
// 0x0020 (0x0020 - 0x0000)
struct LevelSequenceEditorSubsystem_CopyFolders final
{
public:
	TArray<class UMovieSceneFolder*>              Folders;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FString                                 ExportedText;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.CopySections
// 0x0020 (0x0020 - 0x0000)
struct LevelSequenceEditorSubsystem_CopySections final
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FString                                 ExportedText;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.CopyTracks
// 0x0020 (0x0020 - 0x0000)
struct LevelSequenceEditorSubsystem_CopyTracks final
{
public:
	TArray<class UMovieSceneTrack*>               Tracks;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FString                                 ExportedText;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.CreateCamera
// 0x0028 (0x0028 - 0x0000)
struct LevelSequenceEditorSubsystem_CreateCamera final
{
public:
	bool                                          bSpawnable;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACineCameraActor*                       OutActor;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneBindingProxy                ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.GetCurveEditor
// 0x0008 (0x0008 - 0x0000)
struct LevelSequenceEditorSubsystem_GetCurveEditor final
{
public:
	class USequencerCurveEditorObject*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.GetCustomBindingObjects
// 0x0028 (0x0028 - 0x0000)
struct LevelSequenceEditorSubsystem_GetCustomBindingObjects final
{
public:
	struct FMovieSceneBindingProxy                ObjectBinding;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMovieSceneCustomBinding*>       ReturnValue;                                       // 0x0018(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.GetCustomBindingsOfType
// 0x0018 (0x0018 - 0x0000)
struct LevelSequenceEditorSubsystem_GetCustomBindingsOfType final
{
public:
	TSubclassOf<class UMovieSceneCustomBinding>   CustomBindingType;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMovieSceneBindingProxy>        ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.GetCustomBindingType
// 0x0020 (0x0020 - 0x0000)
struct LevelSequenceEditorSubsystem_GetCustomBindingType final
{
public:
	struct FMovieSceneBindingProxy                ObjectBinding;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMovieSceneCustomBinding>   ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.GetScriptingLayer
// 0x0008 (0x0008 - 0x0000)
struct LevelSequenceEditorSubsystem_GetScriptingLayer final
{
public:
	class USequencerModuleScriptingLayer*         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.PasteBindings
// 0x00A8 (0x00A8 - 0x0000)
struct LevelSequenceEditorSubsystem_PasteBindings final
{
public:
	class FString                                 TextToImport;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieScenePasteBindingsParams         PasteBindingsParams;                               // 0x0010(0x0080)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FMovieSceneBindingProxy>        OutObjectBindings;                                 // 0x0090(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00A0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.PasteFolders
// 0x0038 (0x0038 - 0x0000)
struct LevelSequenceEditorSubsystem_PasteFolders final
{
public:
	class FString                                 TextToImport;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieScenePasteFoldersParams          PasteFoldersParams;                                // 0x0010(0x0010)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UMovieSceneFolder*>              OutFolders;                                        // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.PasteSections
// 0x0050 (0x0050 - 0x0000)
struct LevelSequenceEditorSubsystem_PasteSections final
{
public:
	class FString                                 TextToImport;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieScenePasteSectionsParams         PasteSectionsParams;                               // 0x0010(0x0028)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UMovieSceneSection*>             OutSections;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.PasteTracks
// 0x0058 (0x0058 - 0x0000)
struct LevelSequenceEditorSubsystem_PasteTracks final
{
public:
	class FString                                 TextToImport;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieScenePasteTracksParams           PasteTracksParams;                                 // 0x0010(0x0030)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UMovieSceneTrack*>               OutTracks;                                         // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.RebindComponent
// 0x0020 (0x0020 - 0x0000)
struct LevelSequenceEditorSubsystem_RebindComponent final
{
public:
	TArray<struct FMovieSceneBindingProxy>        ComponentBindings;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ComponentName;                                     // 0x0010(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.RemoveActorsFromBinding
// 0x0028 (0x0028 - 0x0000)
struct LevelSequenceEditorSubsystem_RemoveActorsFromBinding final
{
public:
	TArray<class AActor*>                         Actors;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMovieSceneBindingProxy                ObjectBinding;                                     // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.RemoveAllBindings
// 0x0018 (0x0018 - 0x0000)
struct LevelSequenceEditorSubsystem_RemoveAllBindings final
{
public:
	struct FMovieSceneBindingProxy                ObjectBinding;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.RemoveInvalidBindings
// 0x0018 (0x0018 - 0x0000)
struct LevelSequenceEditorSubsystem_RemoveInvalidBindings final
{
public:
	struct FMovieSceneBindingProxy                ObjectBinding;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.ReplaceBindingWithActors
// 0x0028 (0x0028 - 0x0000)
struct LevelSequenceEditorSubsystem_ReplaceBindingWithActors final
{
public:
	TArray<class AActor*>                         Actors;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMovieSceneBindingProxy                ObjectBinding;                                     // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.SnapSectionsToTimelineUsingSourceTimecode
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceEditorSubsystem_SnapSectionsToTimelineUsingSourceTimecode final
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function LevelSequenceEditor.LevelSequenceEditorSubsystem.SyncSectionsUsingSourceTimecode
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceEditorSubsystem_SyncSectionsUsingSourceTimecode final
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

}

