#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelSequenceEditor

#include "Basic.hpp"

#include "UniversalObjectLocator_structs.hpp"
#include "MovieScene_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct LevelSequenceEditor.MovieSceneScriptingParams
// 0x0001 (0x0001 - 0x0000)
struct FMovieSceneScriptingParams final
{
public:
	EMovieSceneTimeUnit                           TimeUnit;                                          // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct LevelSequenceEditor.MovieSceneBindingPropertyInfo
// 0x0020 (0x0020 - 0x0000)
struct FMovieSceneBindingPropertyInfo final
{
public:
	struct FUniversalObjectLocator                Locator;                                           // 0x0000(0x0010)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELocatorResolveFlags                          ResolveFlags;                                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieSceneCustomBinding*               CustomBinding;                                     // 0x0018(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct LevelSequenceEditor.LevelSequencePropertyTrackSettings
// 0x0020 (0x0020 - 0x0000)
struct FLevelSequencePropertyTrackSettings final
{
public:
	class FString                                 ComponentPath;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyPath;                                      // 0x0010(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct LevelSequenceEditor.LevelSequenceTrackSettings
// 0x0068 (0x0068 - 0x0000)
struct FLevelSequenceTrackSettings final
{
public:
	struct FSoftClassPath                         MatchingActorClass;                                // 0x0000(0x0028)(Edit, ZeroConstructor, Config, NoClear, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftClassPath>                 DefaultTracks;                                     // 0x0028(0x0010)(Edit, ZeroConstructor, Config, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FSoftClassPath>                 ExcludeDefaultTracks;                              // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FLevelSequencePropertyTrackSettings> DefaultPropertyTracks;                             // 0x0048(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FLevelSequencePropertyTrackSettings> ExcludeDefaultPropertyTracks;                      // 0x0058(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
};

}

