#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelEditor

#include "Basic.hpp"

#include "TypedElementFramework_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LevelEditor.LevelEditorContextMenuContext.GetScriptHitProxyElement
// 0x0008 (0x0008 - 0x0000)
struct LevelEditorContextMenuContext_GetScriptHitProxyElement final
{
public:
	struct FScriptTypedElementHandle              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LevelEditor.LevelEditorSubsystem.BuildLightMaps
// 0x0003 (0x0003 - 0x0000)
struct LevelEditorSubsystem_BuildLightMaps final
{
public:
	ELightingBuildQuality                         Quality;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWithReflectionCaptures;                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelEditor.LevelEditorSubsystem.EditorGetGameView
// 0x0010 (0x0010 - 0x0000)
struct LevelEditorSubsystem_EditorGetGameView final
{
public:
	class FName                                   ViewportConfigKey;                                 // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelEditor.LevelEditorSubsystem.EditorSetGameView
// 0x0010 (0x0010 - 0x0000)
struct LevelEditorSubsystem_EditorSetGameView final
{
public:
	bool                                          bGameView;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ViewportConfigKey;                                 // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelEditor.LevelEditorSubsystem.EditorSetViewportRealtime
// 0x0010 (0x0010 - 0x0000)
struct LevelEditorSubsystem_EditorSetViewportRealtime final
{
public:
	bool                                          bInRealtime;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ViewportConfigKey;                                 // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelEditor.LevelEditorSubsystem.EjectPilotLevelActor
// 0x000C (0x000C - 0x0000)
struct LevelEditorSubsystem_EjectPilotLevelActor final
{
public:
	class FName                                   ViewportConfigKey;                                 // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelEditor.LevelEditorSubsystem.GetActiveViewportConfigKey
// 0x000C (0x000C - 0x0000)
struct LevelEditorSubsystem_GetActiveViewportConfigKey final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelEditor.LevelEditorSubsystem.GetAllowsCinematicControl
// 0x0010 (0x0010 - 0x0000)
struct LevelEditorSubsystem_GetAllowsCinematicControl final
{
public:
	class FName                                   ViewportConfigKey;                                 // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelEditor.LevelEditorSubsystem.GetCurrentLevel
// 0x0008 (0x0008 - 0x0000)
struct LevelEditorSubsystem_GetCurrentLevel final
{
public:
	class ULevel*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelEditor.LevelEditorSubsystem.GetPilotLevelActor
// 0x0018 (0x0018 - 0x0000)
struct LevelEditorSubsystem_GetPilotLevelActor final
{
public:
	class FName                                   ViewportConfigKey;                                 // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelEditor.LevelEditorSubsystem.GetSelectionSet
// 0x0008 (0x0008 - 0x0000)
struct LevelEditorSubsystem_GetSelectionSet final
{
public:
	class UTypedElementSelectionSet*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelEditor.LevelEditorSubsystem.GetViewportConfigKeys
// 0x0010 (0x0010 - 0x0000)
struct LevelEditorSubsystem_GetViewportConfigKeys final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function LevelEditor.LevelEditorSubsystem.LoadLevel
// 0x0018 (0x0018 - 0x0000)
struct LevelEditorSubsystem_LoadLevel final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelEditor.LevelEditorSubsystem.NewLevel
// 0x0018 (0x0018 - 0x0000)
struct LevelEditorSubsystem_NewLevel final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPartitionedWorld;                               // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelEditor.LevelEditorSubsystem.NewLevelFromTemplate
// 0x0028 (0x0028 - 0x0000)
struct LevelEditorSubsystem_NewLevelFromTemplate final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TemplateAssetPath;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelEditor.LevelEditorSubsystem.PilotLevelActor
// 0x0018 (0x0018 - 0x0000)
struct LevelEditorSubsystem_PilotLevelActor final
{
public:
	class AActor*                                 ActorToPilot;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ViewportConfigKey;                                 // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelEditor.LevelEditorSubsystem.SaveAllDirtyLevels
// 0x0001 (0x0001 - 0x0000)
struct LevelEditorSubsystem_SaveAllDirtyLevels final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelEditor.LevelEditorSubsystem.SaveCurrentLevel
// 0x0001 (0x0001 - 0x0000)
struct LevelEditorSubsystem_SaveCurrentLevel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelEditor.LevelEditorSubsystem.SetAllowsCinematicControl
// 0x0010 (0x0010 - 0x0000)
struct LevelEditorSubsystem_SetAllowsCinematicControl final
{
public:
	bool                                          bAllow;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ViewportConfigKey;                                 // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LevelEditor.LevelEditorSubsystem.SetCurrentLevelByName
// 0x0010 (0x0010 - 0x0000)
struct LevelEditorSubsystem_SetCurrentLevelByName final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LevelEditor.LevelEditorSubsystem.IsInPlayInEditor
// 0x0001 (0x0001 - 0x0000)
struct LevelEditorSubsystem_IsInPlayInEditor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

