#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelEditor

#include "Basic.hpp"

#include "EditorFramework_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "LevelEditor_structs.hpp"
#include "Engine_structs.hpp"
#include "UnrealEd_structs.hpp"
#include "EditorSubsystem_classes.hpp"


namespace SDK
{

// Class LevelEditor.LevelEditorMenuContext
// 0x0010 (0x0040 - 0x0030)
class ULevelEditorMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelEditorMenuContext">();
	}
	static class ULevelEditorMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelEditorMenuContext>();
	}
};

// Class LevelEditor.LevelEditorContextMenuContext
// 0x0060 (0x0090 - 0x0030)
class ULevelEditorContextMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	ELevelEditorMenuContext                       ContextType;                                       // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTypedElementSelectionSet*              CurrentSelection;                                  // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CursorWorldLocation;                               // 0x0060(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UActorComponent*>                SelectedComponents;                                // 0x0078(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  HitProxyActor;                                     // 0x0088(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	struct FScriptTypedElementHandle GetScriptHitProxyElement();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelEditorContextMenuContext">();
	}
	static class ULevelEditorContextMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelEditorContextMenuContext>();
	}
};

// Class LevelEditor.LevelViewportToolBarContext
// 0x0010 (0x0040 - 0x0030)
class ULevelViewportToolBarContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelViewportToolBarContext">();
	}
	static class ULevelViewportToolBarContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelViewportToolBarContext>();
	}
};

// Class LevelEditor.QuickActionMenuContext
// 0x0008 (0x0038 - 0x0030)
class UQuickActionMenuContext final : public UObject
{
public:
	class UTypedElementSelectionSet*              CurrentSelection;                                  // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"QuickActionMenuContext">();
	}
	static class UQuickActionMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuickActionMenuContext>();
	}
};

// Class LevelEditor.LevelEditorSubsystem
// 0x0070 (0x00A8 - 0x0038)
class ULevelEditorSubsystem final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 SaveFlags, class UWorld* World)> OnPreSaveWorld;                                    // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 SaveFlags, class UWorld* World, bool bSuccess)> OnPostSaveWorld;                                   // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(struct FVector& Location, struct FRotator& Rotation, ELevelViewportType ViewportType, int32 ViewIndex)> OnEditorCameraMoved;                               // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 MapChangeEventFlags)> OnMapChanged;                                      // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Filename, bool bAsTemplate)> OnMapOpened;                                       // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x18];                                      // 0x0090(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool BuildLightMaps(ELightingBuildQuality Quality, bool bWithReflectionCaptures);
	bool EditorGetGameView(class FName ViewportConfigKey);
	void EditorInvalidateViewports();
	void EditorPlaySimulate();
	void EditorRequestBeginPlay();
	void EditorRequestEndPlay();
	void EditorSetGameView(bool bGameView, class FName ViewportConfigKey);
	void EditorSetViewportRealtime(bool bInRealtime, class FName ViewportConfigKey);
	void EjectPilotLevelActor(class FName ViewportConfigKey);
	class FName GetActiveViewportConfigKey();
	bool GetAllowsCinematicControl(class FName ViewportConfigKey);
	class ULevel* GetCurrentLevel();
	class AActor* GetPilotLevelActor(class FName ViewportConfigKey);
	class UTypedElementSelectionSet* GetSelectionSet();
	TArray<class FName> GetViewportConfigKeys();
	bool LoadLevel(const class FString& AssetPath);
	bool NewLevel(const class FString& AssetPath, bool bIsPartitionedWorld);
	bool NewLevelFromTemplate(const class FString& AssetPath, const class FString& TemplateAssetPath);
	void PilotLevelActor(class AActor* ActorToPilot, class FName ViewportConfigKey);
	bool SaveAllDirtyLevels();
	bool SaveCurrentLevel();
	void SetAllowsCinematicControl(bool bAllow, class FName ViewportConfigKey);
	bool SetCurrentLevelByName(class FName LevelName);

	bool IsInPlayInEditor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelEditorSubsystem">();
	}
	static class ULevelEditorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelEditorSubsystem>();
	}
};

// Class LevelEditor.LevelViewportContext
// 0x0010 (0x0040 - 0x0030)
class ULevelViewportContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelViewportContext">();
	}
	static class ULevelViewportContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelViewportContext>();
	}
};

// Class LevelEditor.LightEditorSubsystem
// 0x0010 (0x0048 - 0x0038)
class ULightEditorSubsystem final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LightEditorSubsystem">();
	}
	static class ULightEditorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULightEditorSubsystem>();
	}
};

// Class LevelEditor.LevelEditorUISubsystem
// 0x0000 (0x0038 - 0x0038)
class ULevelEditorUISubsystem final : public UAssetEditorUISubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelEditorUISubsystem">();
	}
	static class ULevelEditorUISubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelEditorUISubsystem>();
	}
};

}

