#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LightGizmos

#include "Basic.hpp"

#include "InteractiveToolsFramework_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class LightGizmos.DirectionalLightGizmoBuilder
// 0x0000 (0x0030 - 0x0030)
class UDirectionalLightGizmoBuilder final : public UInteractiveGizmoBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DirectionalLightGizmoBuilder">();
	}
	static class UDirectionalLightGizmoBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDirectionalLightGizmoBuilder>();
	}
};

// Class LightGizmos.DirectionalLightGizmoActor
// 0x0010 (0x0438 - 0x0428)
class ADirectionalLightGizmoActor final : public AGizmoActor
{
public:
	uint8                                         Pad_428[0x10];                                     // 0x0428(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DirectionalLightGizmoActor">();
	}
	static class ADirectionalLightGizmoActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADirectionalLightGizmoActor>();
	}
};

// Class LightGizmos.DirectionalLightGizmo
// 0x00C8 (0x0108 - 0x0040)
class UDirectionalLightGizmo final : public UInteractiveGizmo
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USubTransformProxy*                     TransformProxy;                                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWorld*                                 World;                                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ADirectionalLightGizmoActor*            GizmoActor;                                        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGizmoViewContext*                      GizmoViewContext;                                  // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ADirectionalLight*                      LightActor;                                        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsHovering;                                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsDragging;                                       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DragStartWorldPosition;                            // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                InteractionStartPoint;                             // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InteractionStartParameter;                         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitAxis;                                           // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                RotationPlaneX;                                    // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                RotationPlaneZ;                                    // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGizmoBaseComponent*                    HitComponent;                                      // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ArrowLength;                                       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DirectionalLightGizmo">();
	}
	static class UDirectionalLightGizmo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDirectionalLightGizmo>();
	}
};

// Class LightGizmos.DirectionalLightGizmoInputBehavior
// 0x0050 (0x00D0 - 0x0080)
class UDirectionalLightGizmoInputBehavior final : public UAnyButtonInputBehavior
{
public:
	uint8                                         Pad_80[0x50];                                      // 0x0080(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DirectionalLightGizmoInputBehavior">();
	}
	static class UDirectionalLightGizmoInputBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDirectionalLightGizmoInputBehavior>();
	}
};

// Class LightGizmos.DirectionalLightGizmoFactory
// 0x0008 (0x0038 - 0x0030)
class UDirectionalLightGizmoFactory final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DirectionalLightGizmoFactory">();
	}
	static class UDirectionalLightGizmoFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDirectionalLightGizmoFactory>();
	}
};

// Class LightGizmos.PointLightGizmoBuilder
// 0x0000 (0x0030 - 0x0030)
class UPointLightGizmoBuilder final : public UInteractiveGizmoBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PointLightGizmoBuilder">();
	}
	static class UPointLightGizmoBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPointLightGizmoBuilder>();
	}
};

// Class LightGizmos.PointLightGizmo
// 0x0020 (0x0060 - 0x0040)
class UPointLightGizmo final : public UInteractiveGizmo
{
public:
	class UScalableSphereGizmo*                   AttenuationGizmo;                                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class APointLight*                            LightActor;                                        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWorld*                                 World;                                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USubTransformProxy*                     TransformProxy;                                    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PointLightGizmo">();
	}
	static class UPointLightGizmo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPointLightGizmo>();
	}
};

// Class LightGizmos.PointLightGizmoFactory
// 0x0008 (0x0038 - 0x0030)
class UPointLightGizmoFactory final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PointLightGizmoFactory">();
	}
	static class UPointLightGizmoFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPointLightGizmoFactory>();
	}
};

// Class LightGizmos.ScalableConeGizmoBuilder
// 0x0000 (0x0030 - 0x0030)
class UScalableConeGizmoBuilder final : public UInteractiveGizmoBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ScalableConeGizmoBuilder">();
	}
	static class UScalableConeGizmoBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScalableConeGizmoBuilder>();
	}
};

// Class LightGizmos.ScalableConeGizmo
// 0x0120 (0x0160 - 0x0040)
class alignas(0x10) UScalableConeGizmo final : public UInteractiveGizmo
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxAngle;                                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinAngle;                                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 ConeColor;                                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HitErrorThreshold;                                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   TransactionDescription;                            // 0x0058(0x0010)(NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x48];                                      // 0x0068(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Length;                                            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Angle;                                             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsHovering;                                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsDragging;                                       // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTransformProxy*                        ActiveTarget;                                      // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                DragStartWorldPosition;                            // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                DragCurrentPositionProjected;                      // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                InteractionStartPoint;                             // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InteractionStartParameter;                         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitAxis;                                           // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                RotationPlaneX;                                    // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                RotationPlaneY;                                    // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ScalableConeGizmo">();
	}
	static class UScalableConeGizmo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScalableConeGizmo>();
	}
};

// Class LightGizmos.ScalableConeGizmoInputBehavior
// 0x0050 (0x00D0 - 0x0080)
class UScalableConeGizmoInputBehavior final : public UAnyButtonInputBehavior
{
public:
	uint8                                         Pad_80[0x50];                                      // 0x0080(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ScalableConeGizmoInputBehavior">();
	}
	static class UScalableConeGizmoInputBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScalableConeGizmoInputBehavior>();
	}
};

// Class LightGizmos.SpotLightGizmoBuilder
// 0x0000 (0x0030 - 0x0030)
class USpotLightGizmoBuilder final : public UInteractiveGizmoBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpotLightGizmoBuilder">();
	}
	static class USpotLightGizmoBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpotLightGizmoBuilder>();
	}
};

// Class LightGizmos.SpotLightGizmoActor
// 0x0008 (0x0430 - 0x0428)
class ASpotLightGizmoActor final : public AGizmoActor
{
public:
	uint8                                         Pad_428[0x8];                                      // 0x0428(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpotLightGizmoActor">();
	}
	static class ASpotLightGizmoActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpotLightGizmoActor>();
	}
};

// Class LightGizmos.SpotLightGizmo
// 0x0060 (0x00A0 - 0x0040)
class USpotLightGizmo final : public UInteractiveGizmo
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpotLight*                             LightActor;                                        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWorld*                                 World;                                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USubTransformProxy*                     TransformProxy;                                    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScalableConeGizmo*                     OuterAngleGizmo;                                   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScalableConeGizmo*                     InnerAngleGizmo;                                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ASpotLightGizmoActor*                   GizmoActor;                                        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGizmoViewContext*                      GizmoViewContext;                                  // 0x0078(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                DragStartWorldPosition;                            // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InteractionStartParameter;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsHovering;                                       // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsDragging;                                       // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpotLightGizmo">();
	}
	static class USpotLightGizmo* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpotLightGizmo>();
	}
};

// Class LightGizmos.SpotLightGizmoInputBehavior
// 0x0050 (0x00D0 - 0x0080)
class USpotLightGizmoInputBehavior final : public UAnyButtonInputBehavior
{
public:
	uint8                                         Pad_80[0x50];                                      // 0x0080(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpotLightGizmoInputBehavior">();
	}
	static class USpotLightGizmoInputBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpotLightGizmoInputBehavior>();
	}
};

// Class LightGizmos.SpotLightGizmoFactory
// 0x0008 (0x0038 - 0x0030)
class USpotLightGizmoFactory final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpotLightGizmoFactory">();
	}
	static class USpotLightGizmoFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpotLightGizmoFactory>();
	}
};

// Class LightGizmos.SubTransformProxy
// 0x0080 (0x0230 - 0x01B0)
class USubTransformProxy final : public UTransformProxy
{
public:
	uint8                                         Pad_1B0[0x20];                                     // 0x01B0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RelativeTransform;                                 // 0x01D0(0x0060)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SubTransformProxy">();
	}
	static class USubTransformProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubTransformProxy>();
	}
};

}

