#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveLinkEditor

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "LiveLinkInterface_structs.hpp"
#include "Sequencer_classes.hpp"
#include "Persona_classes.hpp"
#include "UnrealEd_classes.hpp"


namespace SDK
{

// Class LiveLinkEditor.LiveLinkEditorSettings
// 0x0008 (0x0038 - 0x0030)
class ULiveLinkEditorSettings final : public UObject
{
public:
	bool                                          bReadOnly;                                         // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkEditorSettings">();
	}
	static class ULiveLinkEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkEditorSettings>();
	}
};

// Class LiveLinkEditor.LiveLinkPreviewController
// 0x0028 (0x0058 - 0x0030)
class ULiveLinkPreviewController final : public UPersonaPreviewSceneController
{
public:
	class FName                                   SubjectName;                                       // 0x0030(0x000C)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLiveLinkSubjectName                   LiveLinkSubjectName;                               // 0x003C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableCameraSync;                                 // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ULiveLinkRetargetAsset>     RetargetAsset;                                     // 0x0050(0x0008)(Edit, ZeroConstructor, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkPreviewController">();
	}
	static class ULiveLinkPreviewController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkPreviewController>();
	}
};

// Class LiveLinkEditor.LiveLinkSequencerTrackFilter
// 0x0000 (0x0030 - 0x0030)
class ULiveLinkSequencerTrackFilter final : public USequencerTrackFilterExtension
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkSequencerTrackFilter">();
	}
	static class ULiveLinkSequencerTrackFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkSequencerTrackFilter>();
	}
};

// Class LiveLinkEditor.LiveLinkBlueprintVirtualSubjectFactory
// 0x0008 (0x00B0 - 0x00A8)
class ULiveLinkBlueprintVirtualSubjectFactory final : public UBlueprintFactory
{
public:
	TSubclassOf<class ULiveLinkRole>              Role;                                              // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkBlueprintVirtualSubjectFactory">();
	}
	static class ULiveLinkBlueprintVirtualSubjectFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkBlueprintVirtualSubjectFactory>();
	}
};

}

