#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveLinkSequencer

#include "Basic.hpp"

#include "TakesCore_classes.hpp"
#include "TakeTrackRecorders_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "LiveLinkSequencer_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class LiveLinkSequencer.MovieSceneLiveLinkControllerTrackRecorder
// 0x0008 (0x0090 - 0x0088)
class UMovieSceneLiveLinkControllerTrackRecorder final : public UMovieSceneTrackRecorder
{
public:
	class ULiveLinkControllerBase*                LiveLinkControllerToRecord;                        // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneLiveLinkControllerTrackRecorder">();
	}
	static class UMovieSceneLiveLinkControllerTrackRecorder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLiveLinkControllerTrackRecorder>();
	}
};

// Class LiveLinkSequencer.LiveLinkSequencerSettings
// 0x0050 (0x00B0 - 0x0060)
class ULiveLinkSequencerSettings final : public UDeveloperSettings
{
public:
	TMap<TSubclassOf<class ULiveLinkControllerBase>, TSubclassOf<class UMovieSceneLiveLinkControllerTrackRecorder>> DefaultTrackRecordersForController;                // 0x0060(0x0050)(Edit, Config, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkSequencerSettings">();
	}
	static class ULiveLinkSequencerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkSequencerSettings>();
	}
};

// Class LiveLinkSequencer.MovieSceneLiveLinkControllerMapTrackRecorder
// 0x0010 (0x0098 - 0x0088)
class UMovieSceneLiveLinkControllerMapTrackRecorder final : public UMovieSceneTrackRecorder
{
public:
	TArray<class UMovieSceneLiveLinkControllerTrackRecorder*> ControllerRecorders;                               // 0x0088(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneLiveLinkControllerMapTrackRecorder">();
	}
	static class UMovieSceneLiveLinkControllerMapTrackRecorder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLiveLinkControllerMapTrackRecorder>();
	}
};

// Class LiveLinkSequencer.MovieSceneLiveLinkTrackRecorder
// 0x0080 (0x0108 - 0x0088)
class UMovieSceneLiveLinkTrackRecorder final : public UMovieSceneTrackRecorder
{
public:
	uint8                                         Pad_88[0x80];                                      // 0x0088(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneLiveLinkTrackRecorder">();
	}
	static class UMovieSceneLiveLinkTrackRecorder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneLiveLinkTrackRecorder>();
	}
};

// Class LiveLinkSequencer.LiveLinkSubjectProperties
// 0x0010 (0x0040 - 0x0030)
class ULiveLinkSubjectProperties final : public UObject
{
public:
	TArray<struct FLiveLinkSubjectProperty>       Properties;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveLinkSubjectProperties">();
	}
	static class ULiveLinkSubjectProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkSubjectProperties>();
	}
};

// Class LiveLinkSequencer.TakeRecorderLiveLinkSource
// 0x0020 (0x0060 - 0x0040)
class UTakeRecorderLiveLinkSource final : public UTakeRecorderSource
{
public:
	bool                                          bReduceKeys;                                       // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SubjectName;                                       // 0x0044(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSaveSubjectSettings;                              // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSourceTimecode;                                // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDiscardSamplesBeforeStart;                        // 0x0052(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieSceneLiveLinkTrackRecorder*       TrackRecorder;                                     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TakeRecorderLiveLinkSource">();
	}
	static class UTakeRecorderLiveLinkSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTakeRecorderLiveLinkSource>();
	}
};

}

