#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Localization

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum Localization.ELocalizationTargetConflictStatus
// NumValues: 0x0004
enum class ELocalizationTargetConflictStatus : uint8
{
	Unknown                                  = 0,
	ConflictsPresent                         = 1,
	Clear                                    = 2,
	ELocalizationTargetConflictStatus_MAX    = 3,
};

// Enum Localization.ELocalizationGatherPathRoot
// NumValues: 0x0004
enum class ELocalizationGatherPathRoot : uint8
{
	Auto                                     = 0,
	Engine                                   = 1,
	Project                                  = 2,
	ELocalizationGatherPathRoot_MAX          = 3,
};

// Enum Localization.ELocalizationTargetLoadingPolicy
// NumValues: 0x0007
enum class ELocalizationTargetLoadingPolicy : uint8
{
	Never                                    = 0,
	Always                                   = 1,
	Editor                                   = 2,
	Game                                     = 3,
	PropertyNames                            = 4,
	ToolTips                                 = 5,
	ELocalizationTargetLoadingPolicy_MAX     = 6,
};

// Enum Localization.ELocTextPlatformSplitMode
// NumValues: 0x0004
enum class ELocTextPlatformSplitMode : uint8
{
	None                                     = 0,
	Confidential                             = 1,
	All                                      = 2,
	ELocTextPlatformSplitMode_MAX            = 3,
};

// Enum Localization.ELocalizedTextCollapseMode
// NumValues: 0x0004
enum class ELocalizedTextCollapseMode : uint8
{
	IdenticalTextIdAndSource                 = 0,
	IdenticalPackageIdTextIdAndSource        = 1,
	IdenticalNamespaceAndSource              = 2,
	ELocalizedTextCollapseMode_MAX           = 3,
};

// Enum Localization.EPortableObjectFormat
// NumValues: 0x0003
enum class EPortableObjectFormat : uint8
{
	Unreal                                   = 0,
	Crowdin                                  = 1,
	EPortableObjectFormat_MAX                = 2,
};

// ScriptStruct Localization.UserGeneratedContentLocalizationDescriptor
// 0x0028 (0x0028 - 0x0000)
struct FUserGeneratedContentLocalizationDescriptor final
{
public:
	class FString                                 NativeCulture;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         CulturesToGenerate;                                // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EPortableObjectFormat                         PoFormat;                                          // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Localization.GatherTextSearchDirectory
// 0x0018 (0x0018 - 0x0000)
struct FGatherTextSearchDirectory final
{
public:
	ELocalizationGatherPathRoot                   PathRoot;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Path;                                              // 0x0008(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Localization.GatherTextIncludePath
// 0x0018 (0x0018 - 0x0000)
struct FGatherTextIncludePath final
{
public:
	ELocalizationGatherPathRoot                   PathRoot;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Pattern;                                           // 0x0008(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Localization.GatherTextExcludePath
// 0x0018 (0x0018 - 0x0000)
struct FGatherTextExcludePath final
{
public:
	ELocalizationGatherPathRoot                   PathRoot;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Pattern;                                           // 0x0008(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Localization.GatherTextFileExtension
// 0x0010 (0x0010 - 0x0000)
struct FGatherTextFileExtension final
{
public:
	class FString                                 Pattern;                                           // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Localization.GatherTextFromTextFilesConfiguration
// 0x0040 (0x0040 - 0x0000)
struct FGatherTextFromTextFilesConfiguration final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGatherTextSearchDirectory>     SearchDirectories;                                 // 0x0008(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FGatherTextExcludePath>         ExcludePathWildcards;                              // 0x0018(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FGatherTextFileExtension>       FileExtensions;                                    // 0x0028(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          ShouldGatherFromEditorOnlyData;                    // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Localization.GatherTextFromPackagesConfiguration
// 0x0060 (0x0060 - 0x0000)
struct FGatherTextFromPackagesConfiguration final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGatherTextIncludePath>         IncludePathWildcards;                              // 0x0008(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FGatherTextExcludePath>         ExcludePathWildcards;                              // 0x0018(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FGatherTextFileExtension>       FileExtensions;                                    // 0x0028(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FName>                           Collections;                                       // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FSoftClassPath>                 ExcludeClasses;                                    // 0x0048(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          ShouldExcludeDerivedClasses;                       // 0x0058(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldGatherFromEditorOnlyData;                    // 0x0059(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SkipGatherCache;                                   // 0x005A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Localization.MetaDataTextKeyPattern
// 0x0010 (0x0010 - 0x0000)
struct FMetaDataTextKeyPattern final
{
public:
	class FString                                 Pattern;                                           // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Localization.MetaDataKeyName
// 0x0010 (0x0010 - 0x0000)
struct FMetaDataKeyName final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Localization.MetaDataKeyGatherSpecification
// 0x0030 (0x0030 - 0x0000)
struct FMetaDataKeyGatherSpecification final
{
public:
	struct FMetaDataKeyName                       MetaDataKey;                                       // 0x0000(0x0010)(Edit, Config, NativeAccessSpecifierPublic)
	class FString                                 TextNamespace;                                     // 0x0010(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetaDataTextKeyPattern                TextKeyPattern;                                    // 0x0020(0x0010)(Edit, Config, NativeAccessSpecifierPublic)
};

// ScriptStruct Localization.GatherTextFromMetaDataConfiguration
// 0x0080 (0x0080 - 0x0000)
struct FGatherTextFromMetaDataConfiguration final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGatherTextIncludePath>         IncludePathWildcards;                              // 0x0008(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FGatherTextExcludePath>         ExcludePathWildcards;                              // 0x0018(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FMetaDataKeyGatherSpecification> KeySpecifications;                                 // 0x0028(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         FieldTypesToInclude;                               // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         FieldTypesToExclude;                               // 0x0048(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         FieldOwnerTypesToInclude;                          // 0x0058(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         FieldOwnerTypesToExclude;                          // 0x0068(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          ShouldGatherFromEditorOnlyData;                    // 0x0078(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Localization.LocalizationExportingSettings
// 0x0004 (0x0004 - 0x0000)
struct FLocalizationExportingSettings final
{
public:
	ELocalizedTextCollapseMode                    CollapseMode;                                      // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPortableObjectFormat                         POFormat;                                          // 0x0001(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldPersistCommentsOnExport;                     // 0x0002(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldAddSourceLocationsAsComments;                // 0x0003(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Localization.LocalizationCompilationSettings
// 0x0003 (0x0003 - 0x0000)
struct FLocalizationCompilationSettings final
{
public:
	bool                                          SkipSourceCheck;                                   // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ValidateFormatPatterns;                            // 0x0001(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ValidateSafeWhitespace;                            // 0x0002(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Localization.LocalizationImportDialogueSettings
// 0x0028 (0x0028 - 0x0000)
struct FLocalizationImportDialogueSettings final
{
public:
	struct FDirectoryPath                         RawAudioPath;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ImportedDialogueFolder;                            // 0x0010(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportNativeAsSource;                             // 0x0020(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Localization.CultureStatistics
// 0x0018 (0x0018 - 0x0000)
struct FCultureStatistics final
{
public:
	class FString                                 CultureName;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        WordCount;                                         // 0x0010(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Localization.LocalizationTargetSettings
// 0x01C0 (0x01C0 - 0x0000)
struct FLocalizationTargetSettings final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x0010(0x0010)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELocalizationTargetConflictStatus             ConflictStatus;                                    // 0x0020(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGuid>                          TargetDependencies;                                // 0x0028(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FFilePath>                      AdditionalManifestDependencies;                    // 0x0038(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<class FString>                         RequiredModuleNames;                               // 0x0048(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FGatherTextFromTextFilesConfiguration  GatherFromTextFiles;                               // 0x0058(0x0040)(Edit, Config, NativeAccessSpecifierPublic)
	struct FGatherTextFromPackagesConfiguration   GatherFromPackages;                                // 0x0098(0x0060)(Edit, Config, NativeAccessSpecifierPublic)
	struct FGatherTextFromMetaDataConfiguration   GatherFromMetaData;                                // 0x00F8(0x0080)(Edit, Config, NativeAccessSpecifierPublic)
	struct FLocalizationExportingSettings         ExportSettings;                                    // 0x0178(0x0004)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FLocalizationCompilationSettings       CompileSettings;                                   // 0x017C(0x0003)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_17F[0x1];                                      // 0x017F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLocalizationImportDialogueSettings    ImportDialogueSettings;                            // 0x0180(0x0028)(Edit, Config, NativeAccessSpecifierPublic)
	int32                                         NativeCultureIndex;                                // 0x01A8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCultureStatistics>             SupportedCulturesStatistics;                       // 0x01B0(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
};

}

