#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Localization

#include "Basic.hpp"

#include "Localization_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class Localization.UserGeneratedContentLocalizationSettings
// 0x0018 (0x0048 - 0x0030)
class UUserGeneratedContentLocalizationSettings final : public UObject
{
public:
	TArray<class FString>                         CulturesToDisable;                                 // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bCompileDLCLocalizationDuringCook;                 // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValidateDLCLocalizationDuringCook;                // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UserGeneratedContentLocalizationSettings">();
	}
	static class UUserGeneratedContentLocalizationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUserGeneratedContentLocalizationSettings>();
	}
};

// Class Localization.LocalizationSettings
// 0x0030 (0x0060 - 0x0030)
class ULocalizationSettings final : public UObject
{
public:
	class ULocalizationTargetSet*                 EngineTargetSet;                                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FLocalizationTargetSettings>    EngineTargetsSettings;                             // 0x0038(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	class ULocalizationTargetSet*                 GameTargetSet;                                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FLocalizationTargetSettings>    GameTargetsSettings;                               // 0x0050(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LocalizationSettings">();
	}
	static class ULocalizationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocalizationSettings>();
	}
};

// Class Localization.LocalizationTargetSet
// 0x0010 (0x0040 - 0x0030)
class ULocalizationTargetSet final : public UObject
{
public:
	TArray<class ULocalizationTarget*>            TargetObjects;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LocalizationTargetSet">();
	}
	static class ULocalizationTargetSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocalizationTargetSet>();
	}
};

// Class Localization.LocalizationTarget
// 0x01C0 (0x01F0 - 0x0030)
class ULocalizationTarget final : public UObject
{
public:
	struct FLocalizationTargetSettings            Settings;                                          // 0x0030(0x01C0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LocalizationTarget">();
	}
	static class ULocalizationTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocalizationTarget>();
	}
};

}

