#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocomotionInitiativeRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "LocomotionInitiativeRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MotionTrajectory_structs.hpp"
#include "PoseSearch_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class LocomotionInitiativeRuntime.FortLocomotionLayerMaskDataAsset
// 0x0020 (0x0058 - 0x0038)
class UFortLocomotionLayerMaskDataAsset final : public UDataAsset
{
public:
	float                                         MaskingHeadTorsoAlpha;                             // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaskingLeftArmAlpha;                               // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaskingRightArmAlpha;                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaskingWeaponAlpha;                                // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MutingHeadTorsoAlpha;                              // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MutingLeftArmAlpha;                                // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MutingRightArmAlpha;                               // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MutingWeaponAlpha;                                 // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ApplyTo(struct FFortLocomotionLayerMaskDataSet* DataAsset) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortLocomotionLayerMaskDataAsset">();
	}
	static class UFortLocomotionLayerMaskDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortLocomotionLayerMaskDataAsset>();
	}
};

// Class LocomotionInitiativeRuntime.FortPlayerMotionMatchingLocomotionAnimInstance
// 0x0550 (0x19F0 - 0x14A0)
class UFortPlayerMotionMatchingLocomotionAnimInstance final : public UFortPlayerAnimInstanceProxy
{
public:
	struct FVector                                FutureRootMotionVelocity;                          // 0x1498(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMotionMatchingLODConfig               TestConfig;                                        // 0x14B0(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FMotionMatchingLODConfig               LowEndTestConfig;                                  // 0x14F8(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FMotionMatchingLODConfig               HighEndConfig;                                     // 0x1540(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FMotionMatchingLODConfig               LowEndConfig;                                      // 0x1588(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FMotionMatchingLODConfig               CurrentLODConfig;                                  // 0x15D0(0x0048)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class UAnimSequence*                          SelectedIdleBreak;                                 // 0x1618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProxyAsset*                            MotionMatchingLODProxyAsset;                       // 0x1620(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MotionMatchingLOD;                                 // 0x1628(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMotionMatchingBlendInfo               MotionMatchingBlendInfo;                           // 0x162C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_163C[0x4];                                     // 0x163C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimNotifyState>           StopBranchOutWindowNotifyClass;                    // 0x1640(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMotionMatchingLocomotionState            LocomotionState;                                   // 0x1648(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1649[0x3];                                     // 0x1649(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartToLoopSearchDelaySeconds;                     // 0x164C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PivotToLoopSearchDelaySeconds;                     // 0x1650(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PivotSpeedThreshold;                               // 0x1654(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PivotDotProductThresholdWalk;                      // 0x1658(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PivotDotProductThresholdJog;                       // 0x165C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PivotDotProductThresholdRun;                       // 0x1660(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PivotDotProductThresholdSprint;                    // 0x1664(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DiagonalDetectionThreshold;                        // 0x1668(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocomotionStateTime;                               // 0x166C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelocityDirection;                                 // 0x1670(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MotionMatchingWeight;                              // 0x1674(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPoseSearchInterruptMode                      DatabaseSearchInterruptMode;                       // 0x1678(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOrientationWarping;                            // 0x1679(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseFutureForOrientationWarping;                   // 0x167A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLowEnd;                                         // 0x167B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLocomotionBlendspace;                          // 0x167C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPlayIdle;                                   // 0x167D(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPlayIdleBreak;                              // 0x167E(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldExitIdleBreak;                              // 0x167F(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldExitIdleBreakSlow;                          // 0x1680(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1681[0x3];                                     // 0x1681(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IdleTransitionTimer;                               // 0x1684(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IdleBreakTimer;                                    // 0x1688(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBothHandsIKInHandSpace;                           // 0x168C(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCrouchedTransition;                             // 0x168D(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasCrouching;                                     // 0x168E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPlayStandToCrouchTransition;                // 0x168F(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPlayCrouchToStandTransition;                // 0x1690(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldExitCrouchTransition;                       // 0x1691(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocallyControlled;                              // 0x1692(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1693[0x1];                                     // 0x1693(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraSpamYawThreshold;                            // 0x1694(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraSpamCoolDownSeconds;                         // 0x1698(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraSpamSearchThrottleTime;                      // 0x169C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultSearchThrottleTime;                         // 0x16A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayRateMultiplier;                                // 0x16A4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SearchThrottleTime;                                // 0x16A8(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AdditiveLeanAlpha;                                 // 0x16AC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnableAdditiveLeans : 1;                          // 0x16B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableAdditiveRunLeans : 1;                       // 0x16B0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisableArcs : 1;                                  // 0x16B0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisableDiamonds : 1;                              // 0x16B0(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIdleToMotionMatchingNoInertialization : 1;        // 0x16B0(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bRelaxedStateChanged : 1;                          // 0x16B0(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsMelee : 1;                                      // 0x16B0(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseRelaxedMotionMatchingData : 1;                 // 0x16B0(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bPlayRunToSprintTransition : 1;                    // 0x16B1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bPlayRunToJogTransition : 1;                       // 0x16B1(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_16B2[0x2];                                     // 0x16B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatInterval                         RunToJogTransitionAngleInterval;                   // 0x16B4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RunToJogTransitionTimeStamp;                       // 0x16BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PreviousLocalVelocityYawAngle;                     // 0x16C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16C4[0x4];                                     // 0x16C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseSearchQueryTrajectory             Trajectory;                                        // 0x16C8(0x0010)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	struct FTrajectorySamplingData                TrajectorySamplingData;                            // 0x16D8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_16F8[0x8];                                     // 0x16F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharacterTrajectoryData               CharacterTrajectoryData;                           // 0x1700(0x01E0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         TrajectorySpeedMultiplier;                         // 0x18E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowFrictionCustomMaxSpeed;                         // 0x18E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowFrictionCustomBrakingDeceleration;              // 0x18E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowFrictionCustomFriction;                         // 0x18EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortMotionMatchingAngleSpamTracker    AccelerationSpamTracker;                           // 0x18F0(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_1938[0x10];                                    // 0x1938(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Velocity;                                          // 0x1948(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PrevVelocity;                                      // 0x1960(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Acceleration;                                      // 0x1978(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SmoothedAcceleration;                              // 0x1990(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PawnFacing;                                        // 0x19A8(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19C0[0x10];                                    // 0x19C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EFortMovementStyle                            FortMovementStyle;                                 // 0x19D0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19D1[0x2];                                     // 0x19D1(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsPlayingIdleBreak;                               // 0x19D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19D4[0xC];                                     // 0x19D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastUpdateFrame;                                   // 0x19E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastMotionMatchingUpdateFrame;                     // 0x19E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPlayingInterruptibleStop;                       // 0x19E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPlayingIdleDatabase;                            // 0x19E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasReachedIdle;                                   // 0x19EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19EB[0x5];                                     // 0x19EB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnUpdateIdleBreaks(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void OnUpdateMotionMatching(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void OnUpdateMotionMatchingState(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);

	class UBlendProfile* GetMotionMatchingBlendProfile() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerMotionMatchingLocomotionAnimInstance">();
	}
	static class UFortPlayerMotionMatchingLocomotionAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerMotionMatchingLocomotionAnimInstance>();
	}
};

// Class LocomotionInitiativeRuntime.LocomotionInitiativeComponent
// 0x00B0 (0x0188 - 0x00D8)
class ULocomotionInitiativeComponent final : public UActorComponent
{
public:
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimInstance>              MotionMatchingLocomotionAnimBlueprintClass;        // 0x00E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UAnimInstance>              RigidBodyPBA_AnimBlueprintClass;                   // 0x00E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         IsLocomotionInitiativeEnabled;                     // 0x00F0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UAnimSequence*                          CrouchShuffleInPlaceAnim;                          // 0x0128(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_130[0x10];                                     // 0x0130(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLocomotionInitiativeScriptedPlayerInputEntry> ScriptedMovementPath;                              // 0x0140(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, EditorOnly, NativeAccessSpecifierPublic)
	bool                                          bForceADSForScriptedMovementPath;                  // 0x0150(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceCrouchForScriptedMovementPath;               // 0x0151(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetCameraForScriptedMovementPath;               // 0x0152(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFixFPSForScriptedMovementPath;                    // 0x0153(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceTacSprintForScriptedMovementPath;            // 0x0154(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_155[0x33];                                     // 0x0155(0x0033)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LocomotionInitiativeComponent">();
	}
	static class ULocomotionInitiativeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocomotionInitiativeComponent>();
	}
};

// Class LocomotionInitiativeRuntime.LocomotionInitiativeGameFeatureData
// 0x0160 (0x07E8 - 0x0688)
class ULocomotionInitiativeGameFeatureData final : public UFortGameFeatureData
{
public:
	struct FPerPlatformBool                       EnableRequestedFullBodyPBAByDefault;               // 0x0688(0x0058)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FPerPlatformBool                       EnableSkydivingFullBodyPBAByDefault;               // 0x06E0(0x0058)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FPerPlatformBool                       EnableDBNOCarriedFullBodyPBAByDefault;             // 0x0738(0x0058)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FPerPlatformBool                       SkydivingEnablePhysicsBasedAnimationByDefault;     // 0x0790(0x0058)(Deprecated, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LocomotionInitiativeGameFeatureData">();
	}
	static class ULocomotionInitiativeGameFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocomotionInitiativeGameFeatureData>();
	}
};

}

