#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LodeSwanGameplay

#include "Basic.hpp"

#include "ModularGameplay_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "TargetingSystem_classes.hpp"


namespace SDK
{

// Class LodeSwanGameplay.LodeSwanLayerAnimInstance
// 0x0070 (0x1510 - 0x14A0)
class ULodeSwanLayerAnimInstance final : public UFortPlayerAnimInstanceProxy
{
public:
	bool                                          bIsFiringLeft;                                     // 0x1498(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFiringRight;                                    // 0x1499(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_149A[0x2];                                     // 0x149A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ResultingPitch;                                    // 0x149C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInDiveAttack;                                     // 0x14A0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14A1[0x3];                                     // 0x14A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LaserAlphaAO;                                      // 0x14A4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               UpperBodyTwistRotator;                             // 0x14A8(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsWaterHovering;                                  // 0x14C0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnterWaterHover;                                  // 0x14C1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFiringAndPlayingMontage;                        // 0x14C2(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEnterHoverLoopToBase;                          // 0x14C3(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEnterJumpToHoverLoop;                          // 0x14C4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEnterFireToDefault;                            // 0x14C5(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAirBoost;                                         // 0x14C6(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14C7[0x1];                                     // 0x14C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FinalYaw;                                          // 0x14C8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DiveKickPitchAlpha;                                // 0x14CC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchDiveKick;                                     // 0x14D0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           AirBoostInitiatedTagName;                          // 0x14D4(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           DiveKickTagName;                                   // 0x14E0(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           WaterHoverTagName;                                 // 0x14EC(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           CantDoThatMontage;                                 // 0x14F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FiringTime;                                        // 0x1500(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1504[0xC];                                     // 0x1504(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LodeSwanLayerAnimInstance">();
	}
	static class ULodeSwanLayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULodeSwanLayerAnimInstance>();
	}
};

// Class LodeSwanGameplay.LodeSwan_FootDive_Telegraph
// 0x0020 (0x0440 - 0x0420)
class ALodeSwan_FootDive_Telegraph final : public AActor
{
public:
	TArray<EObjectTypeQuery>                      TraceObjectTypes;                                  // 0x0420(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         TraceDistance;                                     // 0x0430(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolateSpeed;                                  // 0x0434(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTelegraphIsOnWater;                               // 0x0438(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTelegraphIsOnWater(bool bIsOnWater);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LodeSwan_FootDive_Telegraph">();
	}
	static class ALodeSwan_FootDive_Telegraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALodeSwan_FootDive_Telegraph>();
	}
};

// Class LodeSwanGameplay.PawnComponent_LodeSwan
// 0x0020 (0x00F8 - 0x00D8)
class UPawnComponent_LodeSwan final : public UPawnComponent
{
public:
	struct FVector                                LaserHitLocation;                                  // 0x00D8(0x0018)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FootDiveAngle;                                     // 0x00F0(0x0004)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetFootDiveAngle(float InFootDiveAngle);
	void SetLaserHitLocation(const struct FVector& InLaserHitLocation);

	float GetFootDiveAngle() const;
	struct FVector GetLaserHitLocation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PawnComponent_LodeSwan">();
	}
	static class UPawnComponent_LodeSwan* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPawnComponent_LodeSwan>();
	}
};

// Class LodeSwanGameplay.TargetingSelectionTask_LodeSwanLaser
// 0x0080 (0x0260 - 0x01E0)
class UTargetingSelectionTask_LodeSwanLaser final : public UTargetingSelectionTask_Trace
{
public:
	float                                         TraceLengthPadding;                                // 0x01E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   SourceLocationSocketName;                          // 0x01E4(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxRange;                                          // 0x01F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F4[0x6C];                                     // 0x01F4(0x006C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingSelectionTask_LodeSwanLaser">();
	}
	static class UTargetingSelectionTask_LodeSwanLaser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingSelectionTask_LodeSwanLaser>();
	}
};

}

