#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LodeSwanGameplay

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LodeSwanGameplay.LodeSwan_FootDive_Telegraph.OnTelegraphIsOnWater
// 0x0001 (0x0001 - 0x0000)
struct LodeSwan_FootDive_Telegraph_OnTelegraphIsOnWater final
{
public:
	bool                                          bIsOnWater;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LodeSwanGameplay.PawnComponent_LodeSwan.SetFootDiveAngle
// 0x0004 (0x0004 - 0x0000)
struct PawnComponent_LodeSwan_SetFootDiveAngle final
{
public:
	float                                         InFootDiveAngle;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LodeSwanGameplay.PawnComponent_LodeSwan.SetLaserHitLocation
// 0x0018 (0x0018 - 0x0000)
struct PawnComponent_LodeSwan_SetLaserHitLocation final
{
public:
	struct FVector                                InLaserHitLocation;                                // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LodeSwanGameplay.PawnComponent_LodeSwan.GetFootDiveAngle
// 0x0004 (0x0004 - 0x0000)
struct PawnComponent_LodeSwan_GetFootDiveAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LodeSwanGameplay.PawnComponent_LodeSwan.GetLaserHitLocation
// 0x0018 (0x0018 - 0x0000)
struct PawnComponent_LodeSwan_GetLaserHitLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

