#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LogVisualizer

#include "Basic.hpp"

#include "LogVisualizer_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class LogVisualizer.VisualLoggerRenderingActorBase
// 0x0008 (0x0428 - 0x0420)
class AVisualLoggerRenderingActorBase : public AActor
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VisualLoggerRenderingActorBase">();
	}
	static class AVisualLoggerRenderingActorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVisualLoggerRenderingActorBase>();
	}
};

// Class LogVisualizer.VisualLoggerRenderingActor
// 0x0060 (0x0488 - 0x0428)
class AVisualLoggerRenderingActor final : public AVisualLoggerRenderingActorBase
{
public:
	uint8                                         Pad_428[0x60];                                     // 0x0428(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VisualLoggerRenderingActor">();
	}
	static class AVisualLoggerRenderingActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVisualLoggerRenderingActor>();
	}
};

// Class LogVisualizer.VisualLoggerRenderingComponent
// 0x0000 (0x05C0 - 0x05C0)
class UVisualLoggerRenderingComponent final : public UDebugDrawComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VisualLoggerRenderingComponent">();
	}
	static class UVisualLoggerRenderingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVisualLoggerRenderingComponent>();
	}
};

// Class LogVisualizer.LogVisualizerSessionSettings
// 0x0020 (0x0050 - 0x0030)
class ULogVisualizerSessionSettings final : public UObject
{
public:
	bool                                          bEnableGraphsVisualization;                        // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x1F];                                      // 0x0031(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LogVisualizerSessionSettings">();
	}
	static class ULogVisualizerSessionSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogVisualizerSessionSettings>();
	}
};

// Class LogVisualizer.LogVisualizerSettings
// 0x0090 (0x00C0 - 0x0030)
class ULogVisualizerSettings final : public UObject
{
public:
	bool                                          bIgnoreTrivialLogs;                                // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TrivialLogsThreshold;                              // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStickToRecentData;                                // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetDataWithNewSession;                          // 0x0039(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowHistogramLabelsOutside;                       // 0x003A(0x0001)(Edit, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultCameraDistance;                             // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSearchInsideLogs;                                 // 0x0040(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseFilterVolumes;                                 // 0x0041(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 GraphsBackgroundColor;                             // 0x0044(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPersistentFilters;                                // 0x0048(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawExtremesOnGraphs;                             // 0x0049(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConstrainGraphToLocalMinMax;                      // 0x004A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsePlayersOnlyForPause;                           // 0x004B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLogNavOctreeOnStop;                               // 0x004C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceUniqueLogNames;                              // 0x004D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVisualLoggerFiltersData               PersistentFilters;                                 // 0x0050(0x0040)(Config, Protected, NativeAccessSpecifierProtected)
	class UMaterial*                              DebugMeshMaterialFakeLight;                        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 DebugMeshMaterialFakeLightName;                    // 0x0098(0x0010)(ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LogVisualizerSettings">();
	}
	static class ULogVisualizerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogVisualizerSettings>();
	}
};

// Class LogVisualizer.VisualLoggerCameraController
// 0x0028 (0x0BB8 - 0x0B90)
class AVisualLoggerCameraController final : public ADebugCameraController
{
public:
	TWeakObjectPtr<class AActor>                  PickedActor;                                       // 0x0B90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B98[0x20];                                     // 0x0B98(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VisualLoggerCameraController">();
	}
	static class AVisualLoggerCameraController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVisualLoggerCameraController>();
	}
};

// Class LogVisualizer.VisualLoggerHUD
// 0x0040 (0x0550 - 0x0510)
class AVisualLoggerHUD final : public ADebugCameraHUD
{
public:
	uint8                                         Pad_510[0x40];                                     // 0x0510(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VisualLoggerHUD">();
	}
	static class AVisualLoggerHUD* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVisualLoggerHUD>();
	}
};

}

