#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LogVisualizer

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct LogVisualizer.CategoryFilter
// 0x0018 (0x0018 - 0x0000)
struct FCategoryFilter final
{
public:
	class FString                                 CategoryName;                                      // 0x0000(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LogVerbosity;                                      // 0x0010(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Enabled : 1;                                       // 0x0014(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LogVisualizer.VisualLoggerFiltersData
// 0x0040 (0x0040 - 0x0000)
struct FVisualLoggerFiltersData
{
public:
	class FString                                 SearchBoxFilter;                                   // 0x0000(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ObjectNameFilter;                                  // 0x0010(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCategoryFilter>                Categories;                                        // 0x0020(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         SelectedClasses;                                   // 0x0030(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
};

// ScriptStruct LogVisualizer.VisualLoggerFilters
// 0x0090 (0x00D0 - 0x0040)
struct FVisualLoggerFilters final : public FVisualLoggerFiltersData
{
public:
	uint8                                         Pad_40[0x90];                                      // 0x0040(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

