#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapDevice

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class MapDevice.CRDMapCustomizationComponent
// 0x0118 (0x01F0 - 0x00D8)
class UCRDMapCustomizationComponent final : public UActorComponent
{
public:
	TSoftObjectPtr<class UTexture2D>              TextureToLoad;                                     // 0x00D8(0x0030)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UMaterialInterface>      MaterialToLoad;                                    // 0x0108(0x0030)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                             LoadedTexture;                                     // 0x0138(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     LoadedMaterial;                                    // 0x0140(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_148[0xA8];                                     // 0x0148(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearOverrides();
	void SetOverrideMapMaterial(TSoftObjectPtr<class UMaterialInterface> MaterialOverride, const struct FVector& Location, const struct FRotator& Rotation, float Width, float Zoom);
	void SetOverrideMapTexture(TSoftObjectPtr<class UTexture2D> TextureOverride, const struct FVector& Location, const struct FRotator& Rotation, float Width, float Zoom);
	void SetOverrideSceneCapture(const struct FVector& Location, const struct FRotator& Rotation, float Width, float Zoom, bool bUseClippingPlanes, float NearClipLength, float FarClipLength);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CRDMapCustomizationComponent">();
	}
	static class UCRDMapCustomizationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCRDMapCustomizationComponent>();
	}
};

}

