#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassLOD

#include "Basic.hpp"

#include "MassSpawner_classes.hpp"
#include "Engine_structs.hpp"
#include "MassEntity_classes.hpp"
#include "MassLOD_structs.hpp"


namespace SDK
{

// Class MassLOD.MassLODCollectorProcessor
// 0x0CA0 (0x0D70 - 0x00D0)
class UMassLODCollectorProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_D0[0xCA0];                                     // 0x00D0(0x0CA0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLODCollectorProcessor">();
	}
	static class UMassLODCollectorProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLODCollectorProcessor>();
	}
};

// Class MassLOD.MassLODDistanceCollectorProcessor
// 0x0CA0 (0x0D70 - 0x00D0)
class UMassLODDistanceCollectorProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_D0[0xCA0];                                     // 0x00D0(0x0CA0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLODDistanceCollectorProcessor">();
	}
	static class UMassLODDistanceCollectorProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLODDistanceCollectorProcessor>();
	}
};

// Class MassLOD.MassLODSubsystem
// 0x00C8 (0x0108 - 0x0040)
class UMassLODSubsystem final : public UMassSubsystemBase
{
public:
	uint8                                         bGatherPlayerControllers : 1;                      // 0x0040(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bGatherStreamingSources : 1;                       // 0x0040(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bAllowNonPlayerViwerActors : 1;                    // 0x0040(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, Config, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bUsePlayerPawnLocationInsteadOfCamera : 1;         // 0x0040(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, Config, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FViewerInfo>                    Viewers;                                           // 0x0048(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMap<uint32, struct FMassViewerHandle>        ViewerMap;                                         // 0x0058(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         RegisteredActorViewers;                            // 0x00A8(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x50];                                      // 0x00B8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPlayerControllerEndPlay(class AActor* Actor, EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLODSubsystem">();
	}
	static class UMassLODSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLODSubsystem>();
	}
};

// Class MassLOD.MassLODCollectorTrait
// 0x0000 (0x0030 - 0x0030)
class UMassLODCollectorTrait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLODCollectorTrait">();
	}
	static class UMassLODCollectorTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLODCollectorTrait>();
	}
};

// Class MassLOD.MassDistanceLODCollectorTrait
// 0x0000 (0x0030 - 0x0030)
class UMassDistanceLODCollectorTrait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassDistanceLODCollectorTrait">();
	}
	static class UMassDistanceLODCollectorTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassDistanceLODCollectorTrait>();
	}
};

// Class MassLOD.MassSimulationLODTrait
// 0x0040 (0x0070 - 0x0030)
class UMassSimulationLODTrait final : public UMassEntityTraitBase
{
public:
	struct FMassSimulationLODParameters           Params_0;                                          // 0x0030(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bEnableVariableTicking;                            // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassSimulationVariableTickParameters  VariableTickParams;                                // 0x005C(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSimulationLODTrait">();
	}
	static class UMassSimulationLODTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSimulationLODTrait>();
	}
};

// Class MassLOD.MassSimulationLODProcessor
// 0x0FB0 (0x1080 - 0x00D0)
class UMassSimulationLODProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_D0[0xFA0];                                     // 0x00D0(0x0FA0)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDoAdjustmentFromCount;                            // 0x1070(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1071[0xF];                                     // 0x1071(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSimulationLODProcessor">();
	}
	static class UMassSimulationLODProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSimulationLODProcessor>();
	}
};

}

