#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassSimulation

#include "Basic.hpp"

#include "MassEntity_structs.hpp"
#include "MassEntity_classes.hpp"


namespace SDK
{

// Class MassSimulation.MassSimulationSettings
// 0x0028 (0x0058 - 0x0030)
class UMassSimulationSettings final : public UMassModuleSettings
{
public:
	double                                        DesiredActorSpawningTimeSlicePerTick;              // 0x0030(0x0008)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DesiredActorDestructionTimeSlicePerTick;           // 0x0038(0x0008)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEntityCompactionEnabled;                          // 0x0040(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DesiredEntityCompactionTimeSlicePerTick;           // 0x0048(0x0008)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DesiredActorFailedSpawningRetryTimeInterval;       // 0x0050(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DesiredActorFailedSpawningRetryMoveDistance;       // 0x0054(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSimulationSettings">();
	}
	static class UMassSimulationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSimulationSettings>();
	}
};

// Class MassSimulation.MassSimulationSubsystem
// 0x0498 (0x04D8 - 0x0040)
class UMassSimulationSubsystem final : public UMassSubsystemBase
{
public:
	uint8                                         Pad_40[0x460];                                     // 0x0040(0x0460)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassRuntimePipeline                   RuntimePipeline;                                   // 0x04A0(0x0018)(Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4B8[0x20];                                     // 0x04B8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSimulationSubsystem">();
	}
	static class UMassSimulationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSimulationSubsystem>();
	}
};

}

