#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassMovement

#include "Basic.hpp"

#include "MassSpawner_classes.hpp"
#include "MassEntity_classes.hpp"
#include "MassMovement_structs.hpp"


namespace SDK
{

// Class MassMovement.MassApplyMovementProcessor
// 0x0320 (0x03F0 - 0x00D0)
class UMassApplyMovementProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_D0[0x320];                                     // 0x00D0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassApplyMovementProcessor">();
	}
	static class UMassApplyMovementProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassApplyMovementProcessor>();
	}
};

// Class MassMovement.MassMovementSettings
// 0x0010 (0x0040 - 0x0030)
class UMassMovementSettings final : public UMassModuleSettings
{
public:
	TArray<struct FMassMovementStyle>             MovementStyles;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassMovementSettings">();
	}
	static class UMassMovementSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassMovementSettings>();
	}
};

// Class MassMovement.MassMovementTrait
// 0x0028 (0x0058 - 0x0030)
class UMassMovementTrait final : public UMassEntityTraitBase
{
public:
	struct FMassMovementParameters                Movement;                                          // 0x0030(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassMovementTrait">();
	}
	static class UMassMovementTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassMovementTrait>();
	}
};

// Class MassMovement.MassSimpleMovementTrait
// 0x0000 (0x0030 - 0x0030)
class UMassSimpleMovementTrait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSimpleMovementTrait">();
	}
	static class UMassSimpleMovementTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSimpleMovementTrait>();
	}
};

// Class MassMovement.MassSimpleMovementProcessor
// 0x0320 (0x03F0 - 0x00D0)
class UMassSimpleMovementProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_D0[0x320];                                     // 0x00D0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSimpleMovementProcessor">();
	}
	static class UMassSimpleMovementProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSimpleMovementProcessor>();
	}
};

// Class MassMovement.MassVelocityRandomizerTrait
// 0x0010 (0x0040 - 0x0030)
class UMassVelocityRandomizerTrait final : public UMassEntityTraitBase
{
public:
	float                                         MinSpeed;                                          // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxSpeed;                                          // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSetZComponent;                                    // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassVelocityRandomizerTrait">();
	}
	static class UMassVelocityRandomizerTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassVelocityRandomizerTrait>();
	}
};

// Class MassMovement.MassRandomVelocityInitializer
// 0x0348 (0x0430 - 0x00E8)
class UMassRandomVelocityInitializer final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_E8[0x328];                                     // 0x00E8(0x0328)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinSpeed;                                          // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxSpeed;                                          // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSetZComponent;                                    // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_419[0x17];                                     // 0x0419(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassRandomVelocityInitializer">();
	}
	static class UMassRandomVelocityInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassRandomVelocityInitializer>();
	}
};

}

