#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MassEntity_classes.hpp"
#include "AIModule_structs.hpp"
#include "Engine_classes.hpp"
#include "MassSpawner_structs.hpp"
#include "ZoneGraph_structs.hpp"


namespace SDK
{

// Class MassSpawner.MassEntityTraitBase
// 0x0000 (0x0030 - 0x0030)
class UMassEntityTraitBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassEntityTraitBase">();
	}
	static class UMassEntityTraitBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEntityTraitBase>();
	}
};

// Class MassSpawner.MassAssortedFragmentsTrait
// 0x0020 (0x0050 - 0x0030)
class UMassAssortedFragmentsTrait final : public UMassEntityTraitBase
{
public:
	TArray<struct FInstancedStruct>               Fragments;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FInstancedStruct>               Tags;                                              // 0x0040(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassAssortedFragmentsTrait">();
	}
	static class UMassAssortedFragmentsTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAssortedFragmentsTrait>();
	}
};

// Class MassSpawner.MassEntityConfigAsset
// 0x0030 (0x0068 - 0x0038)
class UMassEntityConfigAsset final : public UDataAsset
{
public:
	struct FMassEntityConfig                      Config;                                            // 0x0038(0x0030)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	void ValidateEntityConfig();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassEntityConfigAsset">();
	}
	static class UMassEntityConfigAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEntityConfigAsset>();
	}
};

// Class MassSpawner.MassEntitySpawnDataGeneratorBase
// 0x0008 (0x0038 - 0x0030)
class UMassEntitySpawnDataGeneratorBase : public UObject
{
public:
	int32                                         RandomSelectionSeed;                               // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bUseCustomSeed : 1;                                // 0x0034(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassEntitySpawnDataGeneratorBase">();
	}
	static class UMassEntitySpawnDataGeneratorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEntitySpawnDataGeneratorBase>();
	}
};

// Class MassSpawner.MassEntityEQSSpawnPointsGenerator
// 0x0050 (0x0088 - 0x0038)
class UMassEntityEQSSpawnPointsGenerator final : public UMassEntitySpawnDataGeneratorBase
{
public:
	struct FEQSParametrizedQueryExecutionRequest  EQSRequest;                                        // 0x0038(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassEntityEQSSpawnPointsGenerator">();
	}
	static class UMassEntityEQSSpawnPointsGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEntityEQSSpawnPointsGenerator>();
	}
};

// Class MassSpawner.MassEntityTemplateRegistry
// 0x0000 (0x0030 - 0x0030)
class UMassEntityTemplateRegistry final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassEntityTemplateRegistry">();
	}
	static class UMassEntityTemplateRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEntityTemplateRegistry>();
	}
};

// Class MassSpawner.MassEntityZoneGraphSpawnPointsGenerator
// 0x0018 (0x0050 - 0x0038)
class UMassEntityZoneGraphSpawnPointsGenerator final : public UMassEntitySpawnDataGeneratorBase
{
public:
	struct FZoneGraphTagFilter                    TagFilter;                                         // 0x0038(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         MinGap;                                            // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxGap;                                            // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassEntityZoneGraphSpawnPointsGenerator">();
	}
	static class UMassEntityZoneGraphSpawnPointsGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEntityZoneGraphSpawnPointsGenerator>();
	}
};

// Class MassSpawner.MassSpawner
// 0x00B0 (0x04D0 - 0x0420)
class AMassSpawner final : public AActor
{
public:
	TMulticastInlineDelegate<void()>              OnSpawningFinishedEvent;                           // 0x0420(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnDespawningFinishedEvent;                         // 0x0430(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0440(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMassSpawnedEntityType>         EntityTypes;                                       // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FMassSpawnDataGenerator>        SpawnDataGenerators;                               // 0x0458(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         bAutoSpawnOnBeginPlay : 1;                         // 0x0468(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bOverrideSchematics : 1;                           // 0x0468(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMassProcessor*>                 PostSpawnProcessors;                               // 0x0470(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	float                                         SpawningCountScale;                                // 0x0480(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_484[0x44];                                     // 0x0484(0x0044)(Fixing Size After Last Property [ Dumper-7 ])
	class UBillboardComponent*                    SpriteComponent;                                   // 0x04C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ClearTemplates();
	void DEBUG_Clear();
	void DEBUG_Spawn();
	void DoDespawning();
	void DoSpawning();
	void ScaleSpawningCount(float Scale);
	void UnloadConfig();

	int32 GetCount() const;
	float GetSpawningCountScale() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSpawner">();
	}
	static class AMassSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMassSpawner>();
	}
};

// Class MassSpawner.MassSpawnerSubsystem
// 0x0088 (0x00C8 - 0x0040)
class UMassSpawnerSubsystem final : public UMassSubsystemBase
{
public:
	TArray<class UMassProcessor*>                 SpawnDataInitializers;                             // 0x0040(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x78];                                      // 0x0050(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSpawnerSubsystem">();
	}
	static class UMassSpawnerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSpawnerSubsystem>();
	}
};

// Class MassSpawner.MassSpawnLocationProcessor
// 0x0330 (0x0400 - 0x00D0)
class UMassSpawnLocationProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_D0[0x330];                                     // 0x00D0(0x0330)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSpawnLocationProcessor">();
	}
	static class UMassSpawnLocationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSpawnLocationProcessor>();
	}
};

// Class MassSpawner.MassTranslator
// 0x0020 (0x00F0 - 0x00D0)
class UMassTranslator : public UMassProcessor
{
public:
	uint8                                         Pad_D0[0x20];                                      // 0x00D0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTranslator">();
	}
	static class UMassTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTranslator>();
	}
};

}

