#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassEntityTestSuite

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "MassEntity_classes.hpp"
#include "MassEntityTestSuite_structs.hpp"


namespace SDK
{

// Class MassEntityTestSuite.MassTestProcessorBase
// 0x03A0 (0x0470 - 0x00D0)
class UMassTestProcessorBase : public UMassProcessor
{
public:
	uint8                                         Pad_D0[0x3A0];                                     // 0x00D0(0x03A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTestProcessorBase">();
	}
	static class UMassTestProcessorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTestProcessorBase>();
	}
};

// Class MassEntityTestSuite.MassTestProcessor_A
// 0x0000 (0x0470 - 0x0470)
class UMassTestProcessor_A final : public UMassTestProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTestProcessor_A">();
	}
	static class UMassTestProcessor_A* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTestProcessor_A>();
	}
};

// Class MassEntityTestSuite.MassTestProcessor_B
// 0x0000 (0x0470 - 0x0470)
class UMassTestProcessor_B final : public UMassTestProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTestProcessor_B">();
	}
	static class UMassTestProcessor_B* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTestProcessor_B>();
	}
};

// Class MassEntityTestSuite.MassTestProcessor_C
// 0x0000 (0x0470 - 0x0470)
class UMassTestProcessor_C final : public UMassTestProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTestProcessor_C">();
	}
	static class UMassTestProcessor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTestProcessor_C>();
	}
};

// Class MassEntityTestSuite.MassTestProcessor_D
// 0x0000 (0x0470 - 0x0470)
class UMassTestProcessor_D final : public UMassTestProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTestProcessor_D">();
	}
	static class UMassTestProcessor_D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTestProcessor_D>();
	}
};

// Class MassEntityTestSuite.MassTestProcessor_E
// 0x0000 (0x0470 - 0x0470)
class UMassTestProcessor_E final : public UMassTestProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTestProcessor_E">();
	}
	static class UMassTestProcessor_E* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTestProcessor_E>();
	}
};

// Class MassEntityTestSuite.MassTestProcessor_F
// 0x0000 (0x0470 - 0x0470)
class UMassTestProcessor_F final : public UMassTestProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTestProcessor_F">();
	}
	static class UMassTestProcessor_F* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTestProcessor_F>();
	}
};

// Class MassEntityTestSuite.MassTestProcessor_Floats
// 0x0010 (0x0480 - 0x0470)
class UMassTestProcessor_Floats final : public UMassTestProcessorBase
{
public:
	uint8                                         Pad_470[0x10];                                     // 0x0470(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTestProcessor_Floats">();
	}
	static class UMassTestProcessor_Floats* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTestProcessor_Floats>();
	}
};

// Class MassEntityTestSuite.MassTestProcessor_Ints
// 0x0010 (0x0480 - 0x0470)
class UMassTestProcessor_Ints final : public UMassTestProcessorBase
{
public:
	uint8                                         Pad_470[0x10];                                     // 0x0470(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTestProcessor_Ints">();
	}
	static class UMassTestProcessor_Ints* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTestProcessor_Ints>();
	}
};

// Class MassEntityTestSuite.MassTestProcessor_FloatsInts
// 0x0020 (0x0490 - 0x0470)
class UMassTestProcessor_FloatsInts final : public UMassTestProcessorBase
{
public:
	uint8                                         Pad_470[0x20];                                     // 0x0470(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTestProcessor_FloatsInts">();
	}
	static class UMassTestProcessor_FloatsInts* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTestProcessor_FloatsInts>();
	}
};

// Class MassEntityTestSuite.MassTestStaticCounterProcessor
// 0x0000 (0x00D0 - 0x00D0)
class UMassTestStaticCounterProcessor final : public UMassProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTestStaticCounterProcessor">();
	}
	static class UMassTestStaticCounterProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTestStaticCounterProcessor>();
	}
};

// Class MassEntityTestSuite.MassTestWorldSubsystem
// 0x0008 (0x0040 - 0x0038)
class UMassTestWorldSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTestWorldSubsystem">();
	}
	static class UMassTestWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTestWorldSubsystem>();
	}
};

// Class MassEntityTestSuite.MassTestEngineSubsystem
// 0x0000 (0x0038 - 0x0038)
class UMassTestEngineSubsystem final : public UEngineSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTestEngineSubsystem">();
	}
	static class UMassTestEngineSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTestEngineSubsystem>();
	}
};

// Class MassEntityTestSuite.MassTestLocalPlayerSubsystem
// 0x0000 (0x0038 - 0x0038)
class UMassTestLocalPlayerSubsystem final : public ULocalPlayerSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTestLocalPlayerSubsystem">();
	}
	static class UMassTestLocalPlayerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTestLocalPlayerSubsystem>();
	}
};

// Class MassEntityTestSuite.MassTestGameInstanceSubsystem
// 0x0000 (0x0038 - 0x0038)
class UMassTestGameInstanceSubsystem final : public UGameInstanceSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTestGameInstanceSubsystem">();
	}
	static class UMassTestGameInstanceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTestGameInstanceSubsystem>();
	}
};

// Class MassEntityTestSuite.FarmProcessorBase
// 0x0320 (0x03F0 - 0x00D0)
class UFarmProcessorBase : public UMassProcessor
{
public:
	uint8                                         Pad_D0[0x320];                                     // 0x00D0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FarmProcessorBase">();
	}
	static class UFarmProcessorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFarmProcessorBase>();
	}
};

// Class MassEntityTestSuite.FarmWaterProcessor
// 0x0000 (0x03F0 - 0x03F0)
class UFarmWaterProcessor final : public UFarmProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FarmWaterProcessor">();
	}
	static class UFarmWaterProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFarmWaterProcessor>();
	}
};

// Class MassEntityTestSuite.FarmHarvestTimerSystem_Flowers
// 0x0000 (0x03F0 - 0x03F0)
class UFarmHarvestTimerSystem_Flowers final : public UFarmProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FarmHarvestTimerSystem_Flowers">();
	}
	static class UFarmHarvestTimerSystem_Flowers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFarmHarvestTimerSystem_Flowers>();
	}
};

// Class MassEntityTestSuite.FarmHarvestTimerSystem_Crops
// 0x0000 (0x03F0 - 0x03F0)
class UFarmHarvestTimerSystem_Crops final : public UFarmProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FarmHarvestTimerSystem_Crops">();
	}
	static class UFarmHarvestTimerSystem_Crops* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFarmHarvestTimerSystem_Crops>();
	}
};

// Class MassEntityTestSuite.FarmHarvestTimerExpired
// 0x0000 (0x03F0 - 0x03F0)
class UFarmHarvestTimerExpired final : public UFarmProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FarmHarvestTimerExpired">();
	}
	static class UFarmHarvestTimerExpired* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFarmHarvestTimerExpired>();
	}
};

// Class MassEntityTestSuite.FarmHarvestTimerSetIcon
// 0x0020 (0x0410 - 0x03F0)
class alignas(0x10) UFarmHarvestTimerSetIcon final : public UFarmProcessorBase
{
public:
	class UHierarchicalInstancedStaticMeshComponent* HarvestIconISMC;                                   // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F8[0x18];                                     // 0x03F8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FarmHarvestTimerSetIcon">();
	}
	static class UFarmHarvestTimerSetIcon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFarmHarvestTimerSetIcon>();
	}
};

// Class MassEntityTestSuite.MassEntityTestFarmPlot
// 0x00C0 (0x04E0 - 0x0420)
class AMassEntityTestFarmPlot final : public AActor
{
public:
	uint8                                         Pad_420[0x4];                                      // 0x0420(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GridCellWidth;                                     // 0x0424(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GridCellHeight;                                    // 0x0428(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HarvestIconScale;                                  // 0x042C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_430[0x10];                                     // 0x0430(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFarmVisualDataRow>             VisualDataTable;                                   // 0x0440(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> VisualDataISMCs;                                   // 0x0450(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_460[0x8];                                      // 0x0460(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMassProcessor*>                 PerFrameSystems;                                   // 0x0468(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UMassProcessor*>                 PerSecondSystems;                                  // 0x0478(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<uint16>                                TestDataFlowerIndicies;                            // 0x0488(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint16>                                TestDataCropIndicies;                              // 0x0498(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint32                                        VisualNearCullDistance;                            // 0x04A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        VisualFarCullDistance;                             // 0x04AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        IconNearCullDistance;                              // 0x04B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        IconFarCullDistance;                               // 0x04B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHierarchicalInstancedStaticMeshComponent* HarvestIconISMC;                                   // 0x04B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C0[0x20];                                     // 0x04C0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassEntityTestFarmPlot">();
	}
	static class AMassEntityTestFarmPlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMassEntityTestFarmPlot>();
	}
};

}

