#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassActors

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "MassSpawner_structs.hpp"
#include "MassSpawner_classes.hpp"
#include "MassEntity_classes.hpp"
#include "MassCommon_structs.hpp"
#include "MassActors_structs.hpp"


namespace SDK
{

// Class MassActors.MassActorPoolableInterface
// 0x0000 (0x0030 - 0x0030)
class IMassActorPoolableInterface final : public IInterface
{
public:
	bool CanBePooled();
	void PrepareForGame();
	void PrepareForPooling();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassActorPoolableInterface">();
	}
	static class IMassActorPoolableInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMassActorPoolableInterface>();
	}
};

// Class MassActors.MassActorSpawnerSubsystem
// 0x00B8 (0x00F8 - 0x0040)
class UMassActorSpawnerSubsystem : public UMassSubsystemBase
{
public:
	TArray<struct FInstancedStruct>               SpawnRequests;                                     // 0x0040(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         ActorsToDestroy;                                   // 0x0050(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         DeactivatedActorsToDestroy;                        // 0x0060(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_70[0x88];                                      // 0x0070(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassActorSpawnerSubsystem">();
	}
	static class UMassActorSpawnerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassActorSpawnerSubsystem>();
	}
};

// Class MassActors.MassActorSubsystem
// 0x0010 (0x0050 - 0x0040)
class UMassActorSubsystem final : public UMassSubsystemBase
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassActorSubsystem">();
	}
	static class UMassActorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassActorSubsystem>();
	}
};

// Class MassActors.MassAgentComponent
// 0x0108 (0x01E0 - 0x00D8)
class UMassAgentComponent final : public UActorComponent
{
public:
	uint8                                         Pad_D8[0xA0];                                      // 0x00D8(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassEntityConfig                      EntityConfig;                                      // 0x0178(0x0030)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A8[0x2C];                                     // 0x01A8(0x002C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassNetworkID                         NetID;                                             // 0x01D4(0x0004)(Net, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bAutoRegisterInEditorMode : 1;                     // 0x01D8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditorOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Disable();
	void Enable();
	void KillEntity(const bool bDestroyActor);
	void OnRep_NetID();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassAgentComponent">();
	}
	static class UMassAgentComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentComponent>();
	}
};

// Class MassActors.MassAgentSubsystem
// 0x0148 (0x0188 - 0x0040)
class UMassAgentSubsystem final : public UMassSubsystemBase
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UMassSpawnerSubsystem*                  SpawnerSystem;                                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMassSimulationSubsystem*               SimulationSystem;                                  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FMassEntityTemplateID, struct FMassAgentInitializationQueue> PendingAgentEntities;                              // 0x0060(0x0050)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<struct FMassEntityTemplateID, struct FMassAgentInitializationQueue> PendingPuppets;                                    // 0x00B0(0x0050)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UMassReplicationSubsystem*              ReplicationSubsystem;                              // 0x0100(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FMassNetworkID, class UMassAgentComponent*> ReplicatedAgentComponents;                         // 0x0108(0x0050)(ExportObject, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_158[0x30];                                     // 0x0158(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassAgentSubsystem">();
	}
	static class UMassAgentSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentSubsystem>();
	}
};

// Class MassActors.MassAgentSyncTrait
// 0x0008 (0x0038 - 0x0030)
class UMassAgentSyncTrait : public UMassEntityTraitBase
{
public:
	EMassTranslationDirection                     SyncDirection;                                     // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassAgentSyncTrait">();
	}
	static class UMassAgentSyncTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentSyncTrait>();
	}
};

// Class MassActors.MassAgentCapsuleCollisionSyncTrait
// 0x0008 (0x0040 - 0x0038)
class UMassAgentCapsuleCollisionSyncTrait final : public UMassAgentSyncTrait
{
public:
	bool                                          bSyncTransform;                                    // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassAgentCapsuleCollisionSyncTrait">();
	}
	static class UMassAgentCapsuleCollisionSyncTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentCapsuleCollisionSyncTrait>();
	}
};

// Class MassActors.MassAgentMovementSyncTrait
// 0x0000 (0x0038 - 0x0038)
class UMassAgentMovementSyncTrait final : public UMassAgentSyncTrait
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassAgentMovementSyncTrait">();
	}
	static class UMassAgentMovementSyncTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentMovementSyncTrait>();
	}
};

// Class MassActors.MassAgentOrientationSyncTrait
// 0x0000 (0x0038 - 0x0038)
class UMassAgentOrientationSyncTrait final : public UMassAgentSyncTrait
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassAgentOrientationSyncTrait">();
	}
	static class UMassAgentOrientationSyncTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentOrientationSyncTrait>();
	}
};

// Class MassActors.MassAgentFeetLocationSyncTrait
// 0x0000 (0x0038 - 0x0038)
class UMassAgentFeetLocationSyncTrait final : public UMassAgentSyncTrait
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassAgentFeetLocationSyncTrait">();
	}
	static class UMassAgentFeetLocationSyncTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentFeetLocationSyncTrait>();
	}
};

// Class MassActors.MassCapsuleTransformToMassTranslator
// 0x0320 (0x0410 - 0x00F0)
class UMassCapsuleTransformToMassTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_F0[0x320];                                     // 0x00F0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCapsuleTransformToMassTranslator">();
	}
	static class UMassCapsuleTransformToMassTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCapsuleTransformToMassTranslator>();
	}
};

// Class MassActors.MassTransformToActorCapsuleTranslator
// 0x0320 (0x0410 - 0x00F0)
class UMassTransformToActorCapsuleTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_F0[0x320];                                     // 0x00F0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTransformToActorCapsuleTranslator">();
	}
	static class UMassTransformToActorCapsuleTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTransformToActorCapsuleTranslator>();
	}
};

// Class MassActors.MassCharacterMovementToMassTranslator
// 0x0320 (0x0410 - 0x00F0)
class UMassCharacterMovementToMassTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_F0[0x320];                                     // 0x00F0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCharacterMovementToMassTranslator">();
	}
	static class UMassCharacterMovementToMassTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCharacterMovementToMassTranslator>();
	}
};

// Class MassActors.MassCharacterMovementToActorTranslator
// 0x0320 (0x0410 - 0x00F0)
class UMassCharacterMovementToActorTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_F0[0x320];                                     // 0x00F0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCharacterMovementToActorTranslator">();
	}
	static class UMassCharacterMovementToActorTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCharacterMovementToActorTranslator>();
	}
};

// Class MassActors.MassCharacterOrientationToMassTranslator
// 0x0320 (0x0410 - 0x00F0)
class UMassCharacterOrientationToMassTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_F0[0x320];                                     // 0x00F0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCharacterOrientationToMassTranslator">();
	}
	static class UMassCharacterOrientationToMassTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCharacterOrientationToMassTranslator>();
	}
};

// Class MassActors.MassCharacterOrientationToActorTranslator
// 0x0320 (0x0410 - 0x00F0)
class UMassCharacterOrientationToActorTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_F0[0x320];                                     // 0x00F0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCharacterOrientationToActorTranslator">();
	}
	static class UMassCharacterOrientationToActorTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCharacterOrientationToActorTranslator>();
	}
};

// Class MassActors.MassSceneComponentLocationToMassTranslator
// 0x0320 (0x0410 - 0x00F0)
class UMassSceneComponentLocationToMassTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_F0[0x320];                                     // 0x00F0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSceneComponentLocationToMassTranslator">();
	}
	static class UMassSceneComponentLocationToMassTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSceneComponentLocationToMassTranslator>();
	}
};

// Class MassActors.MassSceneComponentLocationToActorTranslator
// 0x0320 (0x0410 - 0x00F0)
class UMassSceneComponentLocationToActorTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_F0[0x320];                                     // 0x00F0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSceneComponentLocationToActorTranslator">();
	}
	static class UMassSceneComponentLocationToActorTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSceneComponentLocationToActorTranslator>();
	}
};

// Class MassActors.MassTranslator_BehaviorTree
// 0x0320 (0x0410 - 0x00F0)
class UMassTranslator_BehaviorTree final : public UMassTranslator
{
public:
	uint8                                         Pad_F0[0x320];                                     // 0x00F0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTranslator_BehaviorTree">();
	}
	static class UMassTranslator_BehaviorTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTranslator_BehaviorTree>();
	}
};

}

