#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchObjectivesUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "DynamicUI_classes.hpp"
#include "MatchObjectivesUI_structs.hpp"


namespace SDK
{

// Class MatchObjectivesUI.FortMobileButtonBehaviorComponent_MatchObjectivePicker
// 0x0010 (0x0150 - 0x0140)
class UFortMobileButtonBehaviorComponent_MatchObjectivePicker final : public UFortMobileActionButtonBehavior
{
public:
	class UFortControllerComponent_SkydiveFeedback* SkydiveFeedbackComp;                               // 0x0140(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleSkydiveModeChanged(ESkydiveFeedbackPhase Phase);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileButtonBehaviorComponent_MatchObjectivePicker">();
	}
	static class UFortMobileButtonBehaviorComponent_MatchObjectivePicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileButtonBehaviorComponent_MatchObjectivePicker>();
	}
};

// Class MatchObjectivesUI.FortMobileHUDElement_ObjectiveSelectorWrapper
// 0x0010 (0x04D0 - 0x04C0)
class UFortMobileHUDElement_ObjectiveSelectorWrapper final : public UFortMobileHUDElement
{
public:
	class UOverlay*                               Overlay_WrapperContents;                           // 0x04C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C8[0x8];                                      // 0x04C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleSkydiveFromBusAndLandingCompleted(bool bSkydivedFromBusAndLanded);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileHUDElement_ObjectiveSelectorWrapper">();
	}
	static class UFortMobileHUDElement_ObjectiveSelectorWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileHUDElement_ObjectiveSelectorWrapper>();
	}
};

// Class MatchObjectivesUI.MatchObjectivesBonusEntryWidget
// 0x0010 (0x0428 - 0x0418)
class UMatchObjectivesBonusEntryWidget final : public UUserWidget
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_Reward;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	bool HasBeenCompleted();
	void OnBonusRewardEntrySet(int32 Quantity);
	void UpdateBonusRewardCompleteState(bool GoalIsCompleted);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchObjectivesBonusEntryWidget">();
	}
	static class UMatchObjectivesBonusEntryWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchObjectivesBonusEntryWidget>();
	}
};

// Class MatchObjectivesUI.MatchObjectivesBonusPunchWidget
// 0x00A0 (0x04B8 - 0x0418)
class UMatchObjectivesBonusPunchWidget final : public UUserWidget
{
public:
	uint8                                         Pad_418[0x18];                                     // 0x0418(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TextExpiredQuest;                                  // 0x0430(0x0010)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_440[0x18];                                     // 0x0440(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  InclusiveFilterTags;                               // 0x0458(0x0020)(Edit, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ExclusiveFilterTags;                               // 0x0478(0x0020)(Edit, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	class UCommonDateTimeTextBlock*               Text_ResetTimer;                                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortDynamicEntryBox*                   DynamicEntryBox_DailyBonusPips;                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMatchObjectivesBonusEntryWidget*> WidgetsPips;                                       // 0x04A8(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void OnWidgetPipsStateUpdated();
	void UpdateTimerState(const bool bIsTimerValid, const EAthenaChallengeTimerState TimerState);

	bool CheckPunchcardsCompletion() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchObjectivesBonusPunchWidget">();
	}
	static class UMatchObjectivesBonusPunchWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchObjectivesBonusPunchWidget>();
	}
};

// Class MatchObjectivesUI.MatchObjectivesOptionEntryWidget
// 0x0040 (0x0458 - 0x0418)
class UMatchObjectivesOptionEntryWidget final : public UUserWidget
{
public:
	bool                                          bIsOptionSelected;                                 // 0x0418(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsOptionFocused;                                  // 0x0419(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_41A[0x1E];                                     // 0x041A(0x001E)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_TapSelect;                                  // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_440[0x18];                                     // 0x0440(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDailyObjectiveCountUpdated(const int32 ObjectiveCount, const int32 NumCompleted);
	void OnDailyObjectiveEntrySetup(const class UAthenaDailyQuestDefinition* DailyQuestData, const struct FFortItemQuantityPair& VisibleReward, const int32 ObjectiveCount, const int32 NumCompleted);
	void OnMatchObjectiveEntrySetup(const struct FUrgentQuestData& UrgentQuestData, const struct FFortItemQuantityPair& VisibleReward, const int32 ObjectiveCount);
	void OnOptionFocusedStateChanged(bool bIsFocused);
	void OnOptionSelectedStateChanged(bool bIsSelected);
	void OnTeammateSelectionUpdated(const TArray<class AFortPlayerState*>& PlayersThatHaveSelectedThis);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchObjectivesOptionEntryWidget">();
	}
	static class UMatchObjectivesOptionEntryWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchObjectivesOptionEntryWidget>();
	}
};

// Class MatchObjectivesUI.MatchObjectivesSocialAvatar
// 0x0008 (0x0420 - 0x0418)
class UMatchObjectivesSocialAvatar final : public UUserWidget
{
public:
	class UFortSocialAvatarIcon*                  Icon_SocialAvatar;                                 // 0x0418(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetSocialAvatar(const class AFortPlayerState* PlayerState);
	void SetSocialAvatarTexture(const TSoftObjectPtr<class UTexture2D>& AvatarTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchObjectivesSocialAvatar">();
	}
	static class UMatchObjectivesSocialAvatar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchObjectivesSocialAvatar>();
	}
};

// Class MatchObjectivesUI.MatchObjectivesUIDirectorBase
// 0x0010 (0x0460 - 0x0450)
class AMatchObjectivesUIDirectorBase final : public ADynamicUIDirectorBase
{
public:
	uint8                                         Pad_450[0x10];                                     // 0x0450(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleSkydiveModeChanged(ESkydiveFeedbackPhase Phase);
	void OnFinishSkydiving();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchObjectivesUIDirectorBase">();
	}
	static class AMatchObjectivesUIDirectorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMatchObjectivesUIDirectorBase>();
	}
};

// Class MatchObjectivesUI.MatchObjectivesSelectorWidget
// 0x0048 (0x04D0 - 0x0488)
class UMatchObjectivesSelectorWidget final : public UFortHUDElementWidget
{
public:
	class UMatchObjectivesBonusPunchWidget*       Quests_BonusPunchcard;                             // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                       DynamicEntryBox_OptionEntries;                     // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FString>                         GroupMatches;                                      // 0x0498(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	EMatchObjectivesSelectorState                 WidgetSelectorState;                               // 0x04A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        MatchObjectivesInputComponent;                     // 0x04B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_MobileToggle_Header;                        // 0x04B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_MobileToggle_List;                          // 0x04C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C8[0x8];                                      // 0x04C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnBonusPunchcardsLoaded(bool bAllPunchcardsCompleted);
	void GetDailyChallengesFromMCP();
	void OnQuestEntrySelected(class UUserWidget* SelectedEntry);
	void OnSelectorOpenStateChanged();
	void SetSelectorState(const EMatchObjectivesSelectorState State);
	void UpdateKeybindings();

	bool IsOpenByDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchObjectivesSelectorWidget">();
	}
	static class UMatchObjectivesSelectorWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchObjectivesSelectorWidget>();
	}
};

}

