#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchmakingPortalUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class MatchmakingPortalUI.FortControllerComponent_CreativeMatchmaking
// 0x0028 (0x0108 - 0x00E0)
class UFortControllerComponent_CreativeMatchmaking final : public UFortControllerComponent
{
public:
	class UFortGameActivity*                      CachedGameActivity;                                // 0x00E0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortCreativeMatchmakingFeedback> CreativeMatchmakingFeedbackClass;                  // 0x00E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortActivityDetailsModal>  IslandModal;                                       // 0x00F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCreativeMatchmakingFeedback*       CreativeMatchmakingFeedbackWidget;                 // 0x00F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortActivityDetailsModal*              MatchmakingPortalModalWidget;                      // 0x0100(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnCreativeReadyCheckStatusChanged(EInGameReadyCheckStatus InGameReadyCheckStatus);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortControllerComponent_CreativeMatchmaking">();
	}
	static class UFortControllerComponent_CreativeMatchmaking* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerComponent_CreativeMatchmaking>();
	}
};

// Class MatchmakingPortalUI.FortCreativeMatchmakingFeedback
// 0x0098 (0x0610 - 0x0578)
class UFortCreativeMatchmakingFeedback final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x18];                                     // 0x0578(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        ReadyAndCancelInputComponent;                      // 0x0590(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityScalingTextBlock*          Text_IslandName;                                   // 0x0598(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityScalingTextBlock*          Text_MatchmakingStatus;                            // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A8[0x1C];                                     // 0x05A8(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsCancelingMatchmaking;                           // 0x05C4(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsLocalPartyMemberReady;                          // 0x05C5(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasPushedInputComponent;                          // 0x05C6(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5C7[0x19];                                     // 0x05C7(0x0019)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameActivity*                      CachedGameActivity;                                // 0x05E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasError;                                         // 0x05E8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E9[0x7];                                      // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   MatchmakingStatusText;                             // 0x05F0(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UFortKeybindWidget*                     Action_HoldKeybindWidget;                          // 0x0600(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCTAButton*                         Action_MobileButton;                               // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_OnCreativeReadyCheckStatusChanged(EInGameReadyCheckStatus InGameReadyCheckStatus);
	void HandleCancelMatchmaking();
	void HoldAction();
	void HoldPressed();
	void HoldReleased();
	void OnCancelNotification();
	void OnCreativeReadyCheckStatusChanged(EInGameReadyCheckStatus InGameReadyCheckStatus);
	void OnLockStateChanged(bool bLockState);
	void OnMatchmakingStatusTextUpdated();
	void OnOutroFinished();
	void OnTakeActionNotification();
	void OnUserStartedHoldActionNotification();
	void PlayIntro();
	void PlayOutro();
	void PopInputComponent();
	void PushInputComponent();

	bool CanCancelMatchmaking() const;
	float GetTimeToDisplayMessageBeforeFadeOut() const;
	bool IsLocalPlayerReady() const;
	bool IsPartyLeader() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCreativeMatchmakingFeedback">();
	}
	static class UFortCreativeMatchmakingFeedback* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCreativeMatchmakingFeedback>();
	}
};

// Class MatchmakingPortalUI.FortMatchmakingPortalCountdown
// 0x0038 (0x05B0 - 0x0578)
class UFortMatchmakingPortalCountdown final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x10];                                     // 0x0578(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        MatchmakingPortalInputComponent;                   // 0x0588(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityScalingTextBlock*          Text_IslandName;                                   // 0x0590(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CountdownTime;                                     // 0x0598(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59C[0x4];                                      // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFinishedCountdown;                               // 0x05A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPublic)

public:
	void FinishTimer();
	void HandleCancelClicked();
	void StartCountdown();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMatchmakingPortalCountdown">();
	}
	static class UFortMatchmakingPortalCountdown* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMatchmakingPortalCountdown>();
	}
};

// Class MatchmakingPortalUI.FortMatchmakingPortalPopup
// 0x01A0 (0x0710 - 0x0570)
class UFortMatchmakingPortalPopup final : public UFortPortalHUDDetails
{
public:
	uint8                                         Pad_570[0x10];                                     // 0x0570(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                WorldPointerLocation;                              // 0x0580(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   CreatorNameTextFormat;                             // 0x0598(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UHeaderDescriptionHUDComponent> CachedHUDComponent;                                // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortActivityDetailsModal>  IslandModal;                                       // 0x05B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMatchmakingPortalPopupData            CachedIslandData;                                  // 0x05B8(0x0048)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class FText                                   InvalidLinkCodeWarningText;                        // 0x0600(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         MatchmakingFeedbackDelayTime;                      // 0x0610(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bIsWithinPortalRange : 1;                          // 0x0614(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_615[0x3];                                      // 0x0615(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonRichTextBlock*                   RichText_CreatorName;                              // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_IslandName;                                   // 0x0620(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                       EntryBox_ActivityTags;                             // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortKeybindWidget*                     GlobalActionKeybindWidget;                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortActivityCreatorPageView> CreatorPublishedIslandsPageClass;                  // 0x0638(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCommonActivatableWidget>   PlayerPageViewClass;                               // 0x0640(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortActivityBrowserAttributionsModal> AttributionsModalClass;                            // 0x0648(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortGameActivity*                      CachedGameActivity;                                // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_658[0x10];                                     // 0x0658(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InteractionMessage;                                // 0x0668(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                   InteractionMessage_Cancel;                         // 0x0678(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                   InteractionMessage_Disabled;                       // 0x0688(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                   InteractionMessage_PartyLeadOnly;                  // 0x0698(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6A8[0x68];                                     // 0x06A8(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindOverlapEvents();
	bool GetIslandData(struct FMatchmakingPortalPopupData* OutIslandData, class UHeaderDescriptionHUDComponent* HUDComponent);
	void HandleHUDShow(const bool bShow, const bool bShouldAnimate);
	void HandleLoadScreenChanged(class AFortPlayerControllerAthena* PlayerController, bool bLoadScreenEnabled, const class FText& HUDReason);
	void HandleOnPortalDetailsVisibilityCheck(bool bShowWidget);
	void HandleStartedRespawn(class AFortPlayerControllerZone* PlayerController);
	void HandleWidgetUpdate();
	bool IsInteractingDeviceAMatchmakingPortal();
	void OnLockStateChanged();
	void OnPlayerCanInteractChanged(const bool bPlayerCanInteract, const class FText& Message);
	void OnShowPortalPopup(const bool bShow, const bool bAnimate);
	void UpdateVisuals(const class UHeaderDescriptionHUDComponent* HUDComponent);

	class UFortAthenaCreativeMatchmakingWidget* GetMatchmakingFeedbackWidget(const class UCommonActivatableWidget* MatchmakingFeedbackContainer) const;
	bool HasActivityToShow() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMatchmakingPortalPopup">();
	}
	static class UFortMatchmakingPortalPopup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMatchmakingPortalPopup>();
	}
};

// Class MatchmakingPortalUI.FortModalBackground
// 0x0038 (0x05B0 - 0x0578)
class UFortModalBackground final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x20];                                     // 0x0578(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_Back;                                       // 0x0598(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_BackBoard;                                  // 0x05A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x05A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* InTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortModalBackground">();
	}
	static class UFortModalBackground* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortModalBackground>();
	}
};

// Class MatchmakingPortalUI.FortUIGameFeatureAction_OverridePortalHUDDetails
// 0x0030 (0x0060 - 0x0030)
class UFortUIGameFeatureAction_OverridePortalHUDDetails final : public UFortUIGameFeatureAction
{
public:
	TSoftClassPtr<class UClass>                   SoftPortalHUDDetailsClass;                         // 0x0030(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIGameFeatureAction_OverridePortalHUDDetails">();
	}
	static class UFortUIGameFeatureAction_OverridePortalHUDDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIGameFeatureAction_OverridePortalHUDDetails>();
	}
};

}

