#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MDLImporter

#include "Basic.hpp"

#include "UnrealEd_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class MDLImporter.MDLImporterFactory
// 0x0028 (0x00B0 - 0x0088)
class UMDLImporterFactory final : public UFactory
{
public:
	uint8                                         Pad_88[0x28];                                      // 0x0088(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MDLImporterFactory">();
	}
	static class UMDLImporterFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMDLImporterFactory>();
	}
};

// Class MDLImporter.MDLImporterOptions
// 0x0030 (0x0060 - 0x0030)
class UMDLImporterOptions final : public UObject
{
public:
	uint32                                        BakingResolution;                                  // 0x0030(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        BakingSamples;                                     // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         ResourcesDir;                                      // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         ModulesDir;                                        // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MetersPerSceneUnit;                                // 0x0058(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceBaking;                                      // 0x005C(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MDLImporterOptions">();
	}
	static class UMDLImporterOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMDLImporterOptions>();
	}
};

}

