#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MediaCompositingEditor

#include "Basic.hpp"


namespace SDK
{

// Enum MediaCompositingEditor.EMediaPlayerRecordingNumerationStyle
// NumValues: 0x0003
enum class EMediaPlayerRecordingNumerationStyle : uint8
{
	AppendFrameNumber                        = 0,
	AppendSampleTime                         = 1,
	EMediaPlayerRecordingNumerationStyle_MAX = 2,
};

// Enum MediaCompositingEditor.EMediaPlayerRecordingImageFormat
// NumValues: 0x0005
enum class EMediaPlayerRecordingImageFormat : uint8
{
	PNG                                      = 0,
	JPEG                                     = 1,
	BMP                                      = 2,
	EXR                                      = 3,
	EMediaPlayerRecordingImageFormat_MAX     = 4,
};

// ScriptStruct MediaCompositingEditor.MediaPlayerRecordingSettings
// 0x0028 (0x0028 - 0x0000)
struct FMediaPlayerRecordingSettings final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecordMediaFrame;                                 // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 BaseFilename;                                      // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMediaPlayerRecordingNumerationStyle          NumerationStyle;                                   // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMediaPlayerRecordingImageFormat              ImageFormat;                                       // 0x0019(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CompressionQuality;                                // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetAlpha;                                       // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

