#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MediaCompositingEditor

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "MediaCompositingEditor_structs.hpp"
#include "SequenceRecorder_classes.hpp"


namespace SDK
{

// Class MediaCompositingEditor.MediaPlayerRecording
// 0x0040 (0x0070 - 0x0030)
class UMediaPlayerRecording final : public USequenceRecordingBase
{
public:
	struct FMediaPlayerRecordingSettings          RecordingSettings;                                 // 0x0030(0x0028)(Edit, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UMediaPlayer>            MediaPlayerToRecord;                               // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MediaPlayerRecording">();
	}
	static class UMediaPlayerRecording* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaPlayerRecording>();
	}
};

// Class MediaCompositingEditor.MediaSequenceRecorderSettings
// 0x0018 (0x0048 - 0x0030)
class UMediaSequenceRecorderSettings final : public UObject
{
public:
	bool                                          bRecordMediaPlayerEnabled;                         // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MediaPlayerSubDirectory;                           // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MediaSequenceRecorderSettings">();
	}
	static class UMediaSequenceRecorderSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaSequenceRecorderSettings>();
	}
};

}

