#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MediaPlayerEditor

#include "Basic.hpp"

#include "ToolMenus_classes.hpp"
#include "MediaPlayerEditor_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UnrealEd_classes.hpp"


namespace SDK
{

// Class MediaPlayerEditor.MediaPlayerEditorMediaContext
// 0x0028 (0x0058 - 0x0030)
class UMediaPlayerEditorMediaContext final : public UToolMenuContextBase
{
public:
	class UObject*                                SelectedAsset;                                     // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StyleSetName;                                      // 0x0038(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x14];                                      // 0x0044(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MediaPlayerEditorMediaContext">();
	}
	static class UMediaPlayerEditorMediaContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaPlayerEditorMediaContext>();
	}
};

// Class MediaPlayerEditor.MediaPlayerEditorSettings
// 0x0010 (0x0040 - 0x0030)
class UMediaPlayerEditorSettings final : public UObject
{
public:
	class FName                                   DesiredPlayerName;                                 // 0x0030(0x000C)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShowTextOverlays;                                  // 0x003C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMediaPlayerEditorScale                       ViewportScale;                                     // 0x003D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MediaPlayerEditorSettings">();
	}
	static class UMediaPlayerEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaPlayerEditorSettings>();
	}
};

// Class MediaPlayerEditor.MediaSourceRenderer
// 0x0030 (0x0060 - 0x0030)
class UMediaSourceRenderer final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaPlayer*                           MediaPlayer;                                       // 0x0040(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaSource*                           MediaSource;                                       // 0x0048(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaTexture*                          MediaTexture;                                      // 0x0050(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnMediaOpened(const class FString& InURL);
	void OnMediaOpenFailed(const class FString& InURL);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MediaSourceRenderer">();
	}
	static class UMediaSourceRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaSourceRenderer>();
	}
};

// Class MediaPlayerEditor.MediaSourceThumbnailRenderer
// 0x0000 (0x0030 - 0x0030)
class UMediaSourceThumbnailRenderer final : public UTextureThumbnailRenderer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MediaSourceThumbnailRenderer">();
	}
	static class UMediaSourceThumbnailRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaSourceThumbnailRenderer>();
	}
};

// Class MediaPlayerEditor.FileMediaSourceFactoryNew
// 0x0000 (0x0088 - 0x0088)
class UFileMediaSourceFactoryNew final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FileMediaSourceFactoryNew">();
	}
	static class UFileMediaSourceFactoryNew* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFileMediaSourceFactoryNew>();
	}
};

// Class MediaPlayerEditor.MediaPlayerFactoryNew
// 0x0008 (0x0090 - 0x0088)
class UMediaPlayerFactoryNew final : public UFactory
{
public:
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MediaPlayerFactoryNew">();
	}
	static class UMediaPlayerFactoryNew* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaPlayerFactoryNew>();
	}
};

// Class MediaPlayerEditor.MediaPlaylistFactoryNew
// 0x0000 (0x0088 - 0x0088)
class UMediaPlaylistFactoryNew final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MediaPlaylistFactoryNew">();
	}
	static class UMediaPlaylistFactoryNew* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaPlaylistFactoryNew>();
	}
};

// Class MediaPlayerEditor.MediaTextureFactoryNew
// 0x0000 (0x0088 - 0x0088)
class UMediaTextureFactoryNew final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MediaTextureFactoryNew">();
	}
	static class UMediaTextureFactoryNew* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaTextureFactoryNew>();
	}
};

// Class MediaPlayerEditor.PlatformMediaSourceFactoryNew
// 0x0000 (0x0088 - 0x0088)
class UPlatformMediaSourceFactoryNew final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlatformMediaSourceFactoryNew">();
	}
	static class UPlatformMediaSourceFactoryNew* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlatformMediaSourceFactoryNew>();
	}
};

// Class MediaPlayerEditor.StreamMediaSourceFactoryNew
// 0x0000 (0x0088 - 0x0088)
class UStreamMediaSourceFactoryNew final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StreamMediaSourceFactoryNew">();
	}
	static class UStreamMediaSourceFactoryNew* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStreamMediaSourceFactoryNew>();
	}
};

}

