#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshModelingToolsEditorOnly

#include "Basic.hpp"

#include "ModelingComponents_classes.hpp"


namespace SDK
{

// Class MeshModelingToolsEditorOnly.ParameterizeMeshToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UParameterizeMeshToolBuilder final : public USingleSelectionMeshEditingToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ParameterizeMeshToolBuilder">();
	}
	static class UParameterizeMeshToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParameterizeMeshToolBuilder>();
	}
};

// Class MeshModelingToolsEditorOnly.ParameterizeMeshTool
// 0x0070 (0x0128 - 0x00B8)
class UParameterizeMeshTool final : public USingleSelectionMeshEditingTool
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshUVChannelProperties*               UVChannelProperties;                               // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParameterizeMeshToolProperties*        Settings;                                          // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParameterizeMeshToolUVAtlasProperties* UVAtlasProperties;                                 // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParameterizeMeshToolXAtlasProperties*  XAtlasProperties;                                  // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParameterizeMeshToolPatchBuilderProperties* PatchBuilderProperties;                            // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPolygroupLayersProperties*             PolygroupLayerProperties;                          // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UExistingMeshMaterialProperties*        MaterialSettings;                                  // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCreateUVLayoutViewOnSetup;                        // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUVLayoutPreview*                       UVLayoutView;                                      // 0x0100(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshOpPreviewWithBackgroundCompute*    Preview;                                           // 0x0108(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParameterizeMeshOperatorFactory*       Factory;                                           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_118[0x10];                                     // 0x0118(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ParameterizeMeshTool">();
	}
	static class UParameterizeMeshTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParameterizeMeshTool>();
	}
};

}

