#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshCosmeticsEditor

#include "Basic.hpp"

#include "MeshCosmeticsEditor_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "UnrealEd_classes.hpp"
#include "MeshCosmetics_structs.hpp"
#include "FortLiveLink_classes.hpp"


namespace SDK
{

// Class MeshCosmeticsEditor.FortCustomizableObjectVersionBridge
// 0x0008 (0x0038 - 0x0030)
class UFortCustomizableObjectVersionBridge final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCustomizableObjectVersionBridge">();
	}
	static class UFortCustomizableObjectVersionBridge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCustomizableObjectVersionBridge>();
	}
};

// Class MeshCosmeticsEditor.AssetDefinition_UFortCustomizableObjectVersionBridge
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_UFortCustomizableObjectVersionBridge final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_UFortCustomizableObjectVersionBridge">();
	}
	static class UAssetDefinition_UFortCustomizableObjectVersionBridge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_UFortCustomizableObjectVersionBridge>();
	}
};

// Class MeshCosmeticsEditor.FortCustomizableObjectVersionBridgeFactory
// 0x0000 (0x0088 - 0x0088)
class UFortCustomizableObjectVersionBridgeFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCustomizableObjectVersionBridgeFactory">();
	}
	static class UFortCustomizableObjectVersionBridgeFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCustomizableObjectVersionBridgeFactory>();
	}
};

// Class MeshCosmeticsEditor.MeshCosmeticsTempMannequin
// 0x00A0 (0x0938 - 0x0898)
class AMeshCosmeticsTempMannequin final : public AFortLiveMannequin
{
public:
	TArray<struct FJumpsuitMannequinIntParam>     IntParams;                                         // 0x0898(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FJumpsuitMannequinFloatParam>   FloatParams;                                       // 0x08A8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class UCustomizableObject*, class UCustomizableObjectInstance*> CustomizableObjectInstances;                       // 0x08B8(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_908[0x20];                                     // 0x0908(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMeshCosmeticsImageProviderWrapper     ImageProviderWrapper;                              // 0x0928(0x0010)(NativeAccessSpecifierPrivate)

public:
	void ReapplyVariants();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmeticsTempMannequin">();
	}
	static class AMeshCosmeticsTempMannequin* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMeshCosmeticsTempMannequin>();
	}
};

// Class MeshCosmeticsEditor.MeshCosmetics_ApparelEditorHelpers
// 0x0000 (0x0030 - 0x0030)
class UMeshCosmetics_ApparelEditorHelpers final : public UBlueprintFunctionLibrary
{
public:
	static void CreateApparelForCosmetics(const TArray<class UAthenaCosmeticItemDefinition*>& Cosmetics);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCosmetics_ApparelEditorHelpers">();
	}
	static class UMeshCosmetics_ApparelEditorHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCosmetics_ApparelEditorHelpers>();
	}
};

}

