#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshCosmeticsEditor

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct MeshCosmeticsEditor.JumpsuitMannequinIntParam
// 0x0020 (0x0020 - 0x0000)
struct FJumpsuitMannequinIntParam final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshCosmeticsEditor.JumpsuitMannequinFloatParam
// 0x0018 (0x0018 - 0x0000)
struct FJumpsuitMannequinFloatParam final
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

