#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshCosmeticsUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "MeshCosmeticsUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_classes.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class MeshCosmeticsUI.FortVariantRedirectorTile
// 0x0110 (0x0628 - 0x0518)
class UFortVariantRedirectorTile final : public UFortVariantEditorWidgetBase
{
public:
	class UDynamicEntryBox*                       EntryBox_VariantOptions;                           // 0x0518(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_VariantName;                                  // 0x0520(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   SprayCustomizerClass;                              // 0x0528(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortVariantSprayCustomizerConfig*      SprayCustomizerConfig;                             // 0x0558(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    ClearAllSlotsInputAction;                          // 0x0560(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    RandomizeSpraysInputAction;                        // 0x0578(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UAthenaCosmeticItemDefinition> ItemDefinition;                                    // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FFortVariantRedirectorTileLoadedEmoteToRandomize> LoadedEmotesToRandomize;                           // 0x0598(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(struct FMcpVariantChannelInfo& InChannelInfo)> OnVariantEngagedEvent;                             // 0x05A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B8[0x70];                                     // 0x05B8(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UWidget* HandleBoundaryNavigation(EUINavigation InNavigation);

	class UWidget* GetButtonToFocus() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVariantRedirectorTile">();
	}
	static class UFortVariantRedirectorTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVariantRedirectorTile>();
	}
};

// Class MeshCosmeticsUI.FortVariantSprayCustomizerConfig
// 0x0050 (0x0088 - 0x0038)
class UFortVariantSprayCustomizerConfig final : public UDataAsset
{
public:
	TMap<struct FGameplayTag, struct FFortVariantSprayCustomizerCosmeticOptions> SprayCustomizerOptions;                            // 0x0038(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVariantSprayCustomizerConfig">();
	}
	static class UFortVariantSprayCustomizerConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVariantSprayCustomizerConfig>();
	}
};

// Class MeshCosmeticsUI.FortVariantRedirectorTileButton
// 0x0080 (0x1880 - 0x1800)
class UFortVariantRedirectorTileButton final : public UCommonButtonBase
{
public:
	class UOverlay*                               ImageOverlay;                                      // 0x1800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         LazyImage_TileIcon;                                // 0x1808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ERedirectorTileDisplayMode                    DisplayMode;                                       // 0x1810(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1811[0x3];                                     // 0x1811(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SlotOpacitySprayAssigned;                          // 0x1814(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SlotOpacitySprayNotAssigned;                       // 0x1818(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_181C[0x64];                                    // 0x181C(0x0064)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVariantRedirectorTileButton">();
	}
	static class UFortVariantRedirectorTileButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVariantRedirectorTileButton>();
	}
};

// Class MeshCosmeticsUI.FortVariantSprayCustomizer
// 0x0190 (0x0A70 - 0x08E0)
class UFortVariantSprayCustomizer final : public UFortItemPreviewScreen
{
public:
	class UCommonButtonBase*                      Button_Back;                                       // 0x08E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Confirm;                                    // 0x08E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_HideArchivedItems;                          // 0x08F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ShowArchivedItems;                          // 0x08F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Widget_ArchivedItemsButtons;                       // 0x0900(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_SpraysTab;                                  // 0x0908(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_SettingsTab;                                // 0x0910(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_TouchClose;                                 // 0x0918(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                    ActionWidget_TabLeft;                              // 0x0920(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                    ActionWidget_TabRight;                             // 0x0928(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActivatableWidgetSwitcher*       Switcher_Tabs;                                     // 0x0930(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Widget_Sprays;                                     // 0x0938(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Widget_Settings;                                   // 0x0940(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortVariantItemTexturePicker*          TexturePicker_Sprays;                              // 0x0948(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortVariantSprayCustomizerSetting*     Setting_Saturation;                                // 0x0950(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortVariantSprayCustomizerSetting*     Setting_Wear;                                      // 0x0958(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortVariantSprayCustomizerSetting*     Setting_Scale;                                     // 0x0960(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    TabLeftAction;                                     // 0x0968(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    TabRightAction;                                    // 0x0980(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           ItemShopPreviewSceneChangerTag;                    // 0x0998(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9A4[0x4];                                      // 0x09A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonGroupLegacy*               TabButtonGroup;                                    // 0x09A8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCustomizableObjectSprayVariant*    SprayVariant;                                      // 0x09B0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9B8[0xB8];                                     // 0x09B8(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_SetChannelSlotIcon(const TSoftObjectPtr<class UObject>& ChannelSlotIcon);
	void BP_SetVariantEditorMode(const bool bIsLockerMode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVariantSprayCustomizer">();
	}
	static class UFortVariantSprayCustomizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVariantSprayCustomizer>();
	}
};

// Class MeshCosmeticsUI.FortVariantSprayCustomizerSetting
// 0x0040 (0x0458 - 0x0418)
class UFortVariantSprayCustomizerSetting final : public UUserWidget
{
public:
	class UAnalogSlider*                          Slider_Value;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CommitDelay;                                       // 0x0420(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_424[0x34];                                     // 0x0424(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnChangeValue(const float Value, const float NormalizedValue);
	void BP_OnSetConstraints(const struct FFloatRange& Constraints);
	void HandleSliderValueChanged(float NormalizedValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVariantSprayCustomizerSetting">();
	}
	static class UFortVariantSprayCustomizerSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVariantSprayCustomizerSetting>();
	}
};

}

