#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshModelingToolsEditorOnlyExp

#include "Basic.hpp"

#include "MeshModelingToolsEditorOnlyExp_structs.hpp"
#include "ModelingComponentsEditorOnly_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ModelingOperatorsEditorOnly_structs.hpp"
#include "InteractiveToolsFramework_structs.hpp"
#include "InteractiveToolsFramework_classes.hpp"
#include "MeshModelingToolsExp_classes.hpp"
#include "ModelingComponents_structs.hpp"
#include "ModelingComponents_classes.hpp"
#include "SkeletalMeshModifiers_structs.hpp"


namespace SDK
{

// Class MeshModelingToolsEditorOnlyExp.DrawSplineToolProperties
// 0x0060 (0x0110 - 0x00B0)
class UDrawSplineToolProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bLoop;                                             // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDrawSplineOutputMode                         OutputMode;                                        // 0x00B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  TargetActor;                                       // 0x00B4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UBlueprint>              BlueprintToCreate;                                 // 0x00BC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExistingSplineIndexToReplace;                      // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDrawSplineDrawMode                           DrawMode;                                          // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MinPointSpacing;                                   // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ClickOffset;                                       // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESplineOffsetMethod                           OffsetMethod;                                      // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OffsetDirection;                                   // 0x00E8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        FrameVisualizationWidth;                           // 0x0100(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDrawSplineUpVectorMode                       UpVectorMode;                                      // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreviewUsingActorCopy;                            // 0x0109(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitWorld;                                         // 0x010A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitCustomPlane;                                   // 0x010B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitGroundPlanes;                                  // 0x010C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRerunConstructionScriptOnDrag;                    // 0x010D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DrawSplineToolProperties">();
	}
	static class UDrawSplineToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDrawSplineToolProperties>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.DrawSplineTool
// 0x00E0 (0x0180 - 0x00A0)
class alignas(0x10) UDrawSplineTool final : public UInteractiveTool
{
public:
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UDrawSplineToolProperties*              Settings;                                          // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USingleClickOrDragInputBehavior*        ClickOrDragBehavior;                               // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UConstructionPlaneMechanic*             PlaneMechanic;                                     // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0x10];                                      // 0x00C8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class APreviewGeometryActor*                  PreviewRootActor;                                  // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 PreviewActor;                                      // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x18];                                      // 0x00E8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 PreviousTargetActor;                               // 0x0100(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_108[0x78];                                     // 0x0108(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DrawSplineTool">();
	}
	static class UDrawSplineTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDrawSplineTool>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.DrawSplineToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UDrawSplineToolBuilder final : public UInteractiveToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DrawSplineToolBuilder">();
	}
	static class UDrawSplineToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDrawSplineToolBuilder>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.HarvestInstancesToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UHarvestInstancesToolBuilder final : public UMultiSelectionMeshEditingToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarvestInstancesToolBuilder">();
	}
	static class UHarvestInstancesToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarvestInstancesToolBuilder>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.HarvestInstancesToolSettings
// 0x0008 (0x00B8 - 0x00B0)
class UHarvestInstancesToolSettings final : public UInteractiveToolPropertySet
{
public:
	bool                                          bDrawBounds;                                       // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarvestInstancesToolSettings">();
	}
	static class UHarvestInstancesToolSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarvestInstancesToolSettings>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.HarvestInstancesTool_OutputSettings
// 0x0020 (0x00D0 - 0x00B0)
class UHarvestInstancesTool_OutputSettings final : public UInteractiveToolPropertySet
{
public:
	EHarvestInstancesToolOutputType               ComponentType;                                     // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSingleActor;                                      // 0x00B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ActorName;                                         // 0x00B8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeSingleInstances;                           // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteInputs;                                     // 0x00C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHaveSingleInstanceSet;                            // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHaveLonerInstances;                               // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanDeleteInputs;                                  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarvestInstancesTool_OutputSettings">();
	}
	static class UHarvestInstancesTool_OutputSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarvestInstancesTool_OutputSettings>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.HarvestInstancesTool
// 0x0058 (0x0118 - 0x00C0)
class UHarvestInstancesTool final : public UMultiSelectionMeshEditingTool
{
public:
	class UHarvestInstancesToolSettings*          Settings;                                          // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHarvestInstancesTool_OutputSettings*   OutputSettings;                                    // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x48];                                      // 0x00D0(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HarvestInstancesTool">();
	}
	static class UHarvestInstancesTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHarvestInstancesTool>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.ISMEditorToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UISMEditorToolBuilder final : public UInteractiveToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ISMEditorToolBuilder">();
	}
	static class UISMEditorToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UISMEditorToolBuilder>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.ISMEditorToolProperties
// 0x0018 (0x00C8 - 0x00B0)
class UISMEditorToolProperties final : public UInteractiveToolPropertySet
{
public:
	EISMEditorTransformMode                       TransformMode;                                     // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetPivotMode;                                     // 0x00B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowSelectable;                                   // 0x00B2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowSelected;                                     // 0x00B3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideWhenDragging;                                 // 0x00B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         SelectedInstances;                                 // 0x00B8(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ISMEditorToolProperties">();
	}
	static class UISMEditorToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UISMEditorToolProperties>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.ISMEditorToolActionPropertySetBase
// 0x0008 (0x00B8 - 0x00B0)
class UISMEditorToolActionPropertySetBase : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ISMEditorToolActionPropertySetBase">();
	}
	static class UISMEditorToolActionPropertySetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UISMEditorToolActionPropertySetBase>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.ISMEditorToolActionPropertySet
// 0x0000 (0x00B8 - 0x00B8)
class UISMEditorToolActionPropertySet final : public UISMEditorToolActionPropertySetBase
{
public:
	void ClearSelection();
	void Delete();
	void Duplicate();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ISMEditorToolActionPropertySet">();
	}
	static class UISMEditorToolActionPropertySet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UISMEditorToolActionPropertySet>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.ISMEditorToolReplacePropertySet
// 0x0008 (0x00C0 - 0x00B8)
class UISMEditorToolReplacePropertySet final : public UISMEditorToolActionPropertySetBase
{
public:
	class UStaticMesh*                            ReplaceWith;                                       // 0x00B8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void Replace();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ISMEditorToolReplacePropertySet">();
	}
	static class UISMEditorToolReplacePropertySet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UISMEditorToolReplacePropertySet>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.ISMEditorTool
// 0x00A0 (0x0140 - 0x00A0)
class UISMEditorTool final : public UInteractiveTool
{
public:
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USingleClickOrDragInputBehavior*        ClickOrDragBehavior;                               // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URectangleMarqueeMechanic*              RectangleMarqueeMechanic;                          // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UISMEditorToolProperties*               TransformProps;                                    // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UISMEditorToolActionPropertySet*        ToolActions;                                       // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UISMEditorToolReplacePropertySet*       ReplaceAction;                                     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UInstancedStaticMeshComponent*>  TargetComponents;                                  // 0x00D8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FISMEditorTarget>               ActiveGizmos;                                      // 0x00E8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UPreviewGeometry*                       PreviewGeometry;                                   // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_100[0x40];                                     // 0x0100(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ISMEditorTool">();
	}
	static class UISMEditorTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UISMEditorTool>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.SkeletalMeshEditingInterface
// 0x0000 (0x0030 - 0x0030)
class ISkeletalMeshEditingInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkeletalMeshEditingInterface">();
	}
	static class ISkeletalMeshEditingInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISkeletalMeshEditingInterface>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.SkeletalMeshGizmoContextObjectBase
// 0x0000 (0x0030 - 0x0030)
class USkeletalMeshGizmoContextObjectBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkeletalMeshGizmoContextObjectBase">();
	}
	static class USkeletalMeshGizmoContextObjectBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkeletalMeshGizmoContextObjectBase>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.SkeletalMeshGizmoWrapperBase
// 0x0008 (0x0038 - 0x0030)
class USkeletalMeshGizmoWrapperBase : public UObject
{
public:
	TWeakObjectPtr<class USceneComponent>         Component;                                         // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkeletalMeshGizmoWrapperBase">();
	}
	static class USkeletalMeshGizmoWrapperBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkeletalMeshGizmoWrapperBase>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.SkeletalMeshEditorContextObjectBase
// 0x0000 (0x0030 - 0x0030)
class USkeletalMeshEditorContextObjectBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkeletalMeshEditorContextObjectBase">();
	}
	static class USkeletalMeshEditorContextObjectBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkeletalMeshEditorContextObjectBase>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.SkeletonEditingToolBuilder
// 0x0000 (0x0030 - 0x0030)
class USkeletonEditingToolBuilder final : public UInteractiveToolWithToolTargetsBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkeletonEditingToolBuilder">();
	}
	static class USkeletonEditingToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkeletonEditingToolBuilder>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.SkeletonEditingTool
// 0x0250 (0x0300 - 0x00B0)
class alignas(0x10) USkeletonEditingTool final : public USingleSelectionTool
{
public:
	uint8                                         Pad_B0[0x28];                                      // 0x00B0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletonEditingProperties*             Properties;                                        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProjectionProperties*                  ProjectionProperties;                              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMirroringProperties*                   MirroringProperties;                               // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOrientingProperties*                   OrientingProperties;                               // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPolygonSelectionMechanic*              SelectionMechanic;                                 // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletonModifier*                      Modifier;                                          // 0x0100(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USingleClickInputBehavior*              LeftClickBehavior;                                 // 0x0108(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewMesh*                           PreviewMesh;                                       // 0x0110(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UWorld>                  TargetWorld;                                       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UGizmoViewContext>       ViewContext;                                       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EEditingOperation                             Operation;                                         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class USkeletalMeshGizmoContextObjectBase> GizmoContext;                                      // 0x012C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshGizmoWrapperBase*          GizmoWrapper;                                      // 0x0138(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class USkeletalMeshEditorContextObjectBase> EditorContext;                                     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_148[0x1B8];                                    // 0x0148(0x01B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkeletonEditingTool">();
	}
	static class USkeletonEditingTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkeletonEditingTool>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.SkeletonEditingProperties
// 0x0090 (0x0140 - 0x00B0)
class USkeletonEditingProperties final : public UInteractiveToolPropertySet
{
public:
	class FName                                   Name_0;                                            // 0x00B0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x00C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateChildren;                                   // 0x0120(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AxisLength;                                        // 0x0124(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AxisThickness;                                     // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableComponentSelection;                         // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12D[0x13];                                     // 0x012D(0x0013)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkeletonEditingProperties">();
	}
	static class USkeletonEditingProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkeletonEditingProperties>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.ProjectionProperties
// 0x00A0 (0x0150 - 0x00B0)
class alignas(0x10) UProjectionProperties final : public UInteractiveToolPropertySet
{
public:
	EProjectionType                               ProjectionType;                                    // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x6F];                                      // 0x00B1(0x006F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PlaneOrigin;                                       // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                PlaneNormal;                                       // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProjectionProperties">();
	}
	static class UProjectionProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProjectionProperties>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.MirroringProperties
// 0x0038 (0x00E8 - 0x00B0)
class UMirroringProperties final : public UInteractiveToolPropertySet
{
public:
	struct FMirrorOptions                         Options;                                           // 0x00B0(0x0030)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MirroringProperties">();
	}
	static class UMirroringProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMirroringProperties>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.OrientingProperties
// 0x0038 (0x00E8 - 0x00B0)
class UOrientingProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bAutoOrient;                                       // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOrientOptions                         Options;                                           // 0x00B8(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OrientingProperties">();
	}
	static class UOrientingProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOrientingProperties>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.SkeletonTransformProxy
// 0x0010 (0x01C0 - 0x01B0)
class USkeletonTransformProxy final : public UTransformProxy
{
public:
	EToolContextCoordinateSystem                  TransformMode;                                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B1[0xF];                                      // 0x01B1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkeletonTransformProxy">();
	}
	static class USkeletonTransformProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkeletonTransformProxy>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.PivotActorTransformProperties
// 0x0040 (0x00F0 - 0x00B0)
class UPivotActorTransformProperties final : public UInteractiveToolPropertySet
{
public:
	struct FVector                                Position;                                          // 0x00B0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Rotation;                                          // 0x00D0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PivotActorTransformProperties">();
	}
	static class UPivotActorTransformProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPivotActorTransformProperties>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.AddPivotActorToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UAddPivotActorToolBuilder final : public UMultiSelectionMeshEditingToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddPivotActorToolBuilder">();
	}
	static class UAddPivotActorToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddPivotActorToolBuilder>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.AddPivotActorTool
// 0x01D0 (0x0290 - 0x00C0)
class alignas(0x10) UAddPivotActorTool final : public UMultiSelectionMeshEditingTool
{
public:
	class UDragAlignmentMechanic*                 DragAlignmentMechanic;                             // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCombinedTransformGizmo*                TransformGizmo;                                    // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTransformProxy*                        TransformProxy;                                    // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPivotActorTransformProperties*         TransformProperties;                               // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x1B0];                                     // 0x00E0(0x01B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddPivotActorTool">();
	}
	static class UAddPivotActorTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddPivotActorTool>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.AttributeEditorToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UAttributeEditorToolBuilder final : public UMultiSelectionMeshEditingToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AttributeEditorToolBuilder">();
	}
	static class UAttributeEditorToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttributeEditorToolBuilder>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.AttributeEditorAttribProperties
// 0x0060 (0x0110 - 0x00B0)
class UAttributeEditorAttribProperties final : public UInteractiveToolPropertySet
{
public:
	TArray<class FString>                         VertexAttributes;                                  // 0x00B0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class FString>                         InstanceAttributes;                                // 0x00C0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class FString>                         TriangleAttributes;                                // 0x00D0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class FString>                         PolygonAttributes;                                 // 0x00E0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class FString>                         EdgeAttributes;                                    // 0x00F0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class FString>                         GroupAttributes;                                   // 0x0100(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AttributeEditorAttribProperties">();
	}
	static class UAttributeEditorAttribProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttributeEditorAttribProperties>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.AttributeEditorActionPropertySet
// 0x0008 (0x00B8 - 0x00B0)
class UAttributeEditorActionPropertySet : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AttributeEditorActionPropertySet">();
	}
	static class UAttributeEditorActionPropertySet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttributeEditorActionPropertySet>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.AttributeEditorNormalsActions
// 0x0000 (0x00B8 - 0x00B8)
class UAttributeEditorNormalsActions final : public UAttributeEditorActionPropertySet
{
public:
	void DiscardTangents();
	void ResetHardNormals();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AttributeEditorNormalsActions">();
	}
	static class UAttributeEditorNormalsActions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttributeEditorNormalsActions>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.AttributeEditorUVActions
// 0x0020 (0x00D8 - 0x00B8)
class UAttributeEditorUVActions final : public UAttributeEditorActionPropertySet
{
public:
	class FString                                 UVLayer;                                           // 0x00B8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         UVLayerNamesList;                                  // 0x00C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	void AddNew();
	void ClearAll();
	void DeleteSelected();
	void DuplicateSelected();
	TArray<class FString> GetUVLayerNamesFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AttributeEditorUVActions">();
	}
	static class UAttributeEditorUVActions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttributeEditorUVActions>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.AttributeEditorLightmapUVActions
// 0x0010 (0x00C8 - 0x00B8)
class UAttributeEditorLightmapUVActions final : public UAttributeEditorActionPropertySet
{
public:
	bool                                          bGenerateLightmapUVs;                              // 0x00B8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SourceUVIndex;                                     // 0x00BC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DestinationUVIndex;                                // 0x00C0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Disable();
	void Enable();
	void Reset();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AttributeEditorLightmapUVActions">();
	}
	static class UAttributeEditorLightmapUVActions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttributeEditorLightmapUVActions>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.AttributeEditorNewAttributeActions
// 0x0018 (0x00D0 - 0x00B8)
class UAttributeEditorNewAttributeActions final : public UAttributeEditorActionPropertySet
{
public:
	class FString                                 NewName;                                           // 0x00B8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttributeEditorElementType                   ElementType;                                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttributeEditorAttribType                    DataType;                                          // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddPolyGroupLayer();
	void AddWeightMapLayer();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AttributeEditorNewAttributeActions">();
	}
	static class UAttributeEditorNewAttributeActions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttributeEditorNewAttributeActions>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.AttributeEditorModifyAttributeActions
// 0x0020 (0x00D8 - 0x00B8)
class UAttributeEditorModifyAttributeActions final : public UAttributeEditorActionPropertySet
{
public:
	class FString                                 Attribute;                                         // 0x00B8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         AttributeNamesList;                                // 0x00C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	void DeleteSelected();
	TArray<class FString> GetAttributeNamesFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AttributeEditorModifyAttributeActions">();
	}
	static class UAttributeEditorModifyAttributeActions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttributeEditorModifyAttributeActions>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.AttributeEditorCopyAttributeActions
// 0x0020 (0x00D8 - 0x00B8)
class UAttributeEditorCopyAttributeActions final : public UAttributeEditorActionPropertySet
{
public:
	TArray<class FString>                         FromAttribute;                                     // 0x00B8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         ToAttribute;                                       // 0x00C8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	void CopyFromTo();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AttributeEditorCopyAttributeActions">();
	}
	static class UAttributeEditorCopyAttributeActions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttributeEditorCopyAttributeActions>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.AttributeEditorTool
// 0x0048 (0x0108 - 0x00C0)
class UAttributeEditorTool final : public UMultiSelectionMeshEditingTool
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttributeEditorNormalsActions*         NormalsActions;                                    // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAttributeEditorUVActions*              UVActions;                                         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAttributeEditorLightmapUVActions*      LightmapUVActions;                                 // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAttributeEditorAttribProperties*       AttributeProps;                                    // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAttributeEditorNewAttributeActions*    NewAttributeProps;                                 // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAttributeEditorModifyAttributeActions* ModifyAttributeProps;                              // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAttributeEditorCopyAttributeActions*   CopyAttributeProps;                                // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AttributeEditorTool">();
	}
	static class UAttributeEditorTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttributeEditorTool>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.BakeRenderCaptureResults
// 0x0050 (0x0100 - 0x00B0)
class UBakeRenderCaptureResults final : public UInteractiveToolPropertySet
{
public:
	class UTexture2D*                             BaseColorMap;                                      // 0x00B0(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             NormalMap;                                         // 0x00B8(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             PackedMRSMap;                                      // 0x00C0(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             MetallicMap;                                       // 0x00C8(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             RoughnessMap;                                      // 0x00D0(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             SpecularMap;                                       // 0x00D8(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             EmissiveMap;                                       // 0x00E0(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             OpacityMap;                                        // 0x00E8(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             SubsurfaceColorMap;                                // 0x00F0(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             DeviceDepthMap;                                    // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeRenderCaptureResults">();
	}
	static class UBakeRenderCaptureResults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeRenderCaptureResults>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.BakeRenderCaptureToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UBakeRenderCaptureToolBuilder final : public UMultiSelectionMeshEditingToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeRenderCaptureToolBuilder">();
	}
	static class UBakeRenderCaptureToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeRenderCaptureToolBuilder>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.RenderCaptureProperties
// 0x0018 (0x00C8 - 0x00B0)
class URenderCaptureProperties final : public UInteractiveToolPropertySet
{
public:
	EBakeTextureResolution                        Resolution;                                        // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBaseColorMap;                                     // 0x00B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNormalMap;                                        // 0x00B5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPackedMRSMap;                                     // 0x00B6(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMetallicMap;                                      // 0x00B7(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRoughnessMap;                                     // 0x00B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSpecularMap;                                      // 0x00B9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEmissiveMap;                                      // 0x00BA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOpacityMap;                                       // 0x00BB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSubsurfaceColorMap;                               // 0x00BC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAntiAliasing;                                     // 0x00BD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeviceDepthMap;                                   // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BF[0x1];                                       // 0x00BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CaptureFieldOfView;                                // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NearPlaneDist;                                     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RenderCaptureProperties">();
	}
	static class URenderCaptureProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<URenderCaptureProperties>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.BakeRenderCaptureToolProperties
// 0x0030 (0x00E0 - 0x00B0)
class UBakeRenderCaptureToolProperties final : public UInteractiveToolPropertySet
{
public:
	class FString                                 MapPreview;                                        // 0x00B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBakeTextureSamplesPerPixel                   SamplesPerPixel;                                   // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBakeTextureResolution                        TextureSize;                                       // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidSampleDepthThreshold;                         // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMapPreview;                                 // 0x00CC(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         MapPreviewNamesList;                               // 0x00D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	const TArray<class FString> GetMapPreviewNamesFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeRenderCaptureToolProperties">();
	}
	static class UBakeRenderCaptureToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeRenderCaptureToolProperties>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.BakeRenderCaptureInputToolProperties
// 0x0028 (0x00D8 - 0x00B0)
class UBakeRenderCaptureInputToolProperties final : public UInteractiveToolPropertySet
{
public:
	class UStaticMesh*                            TargetStaticMesh;                                  // 0x00B0(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetUVLayer;                                     // 0x00B8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         TargetUVLayerNamesList;                            // 0x00C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	int32 GetTargetUVLayerIndex() const;
	const TArray<class FString> GetTargetUVLayerNamesFunc() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeRenderCaptureInputToolProperties">();
	}
	static class UBakeRenderCaptureInputToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeRenderCaptureInputToolProperties>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.BakeRenderCaptureVisualizationProperties
// 0x0010 (0x00C0 - 0x00B0)
class UBakeRenderCaptureVisualizationProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bPreviewAsMaterial;                                // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Brightness;                                        // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SSBrightness;                                      // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EmissiveScale;                                     // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeRenderCaptureVisualizationProperties">();
	}
	static class UBakeRenderCaptureVisualizationProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeRenderCaptureVisualizationProperties>();
	}
};

// Class MeshModelingToolsEditorOnlyExp.BakeRenderCaptureTool
// 0x01F0 (0x02B0 - 0x00C0)
class UBakeRenderCaptureTool final : public UMultiSelectionMeshEditingTool
{
public:
	uint8                                         Pad_C0[0x10];                                      // 0x00C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Actors;                                            // 0x00D0(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UBakeRenderCaptureToolProperties*       Settings;                                          // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class URenderCaptureProperties*               RenderCaptureProperties;                           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBakeRenderCaptureInputToolProperties*  InputMeshSettings;                                 // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBakeRenderCaptureVisualizationProperties* VisualizationProps;                                // 0x0100(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBakeRenderCaptureResults*              ResultSettings;                                    // 0x0108(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_110[0x58];                                     // 0x0110(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             EmptyNormalMap;                                    // 0x0168(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                             EmptyColorMapBlack;                                // 0x0170(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                             EmptyColorMapWhite;                                // 0x0178(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
