#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshPaintingToolset

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "InteractiveToolsFramework_classes.hpp"
#include "MeshPaintingToolset_structs.hpp"


namespace SDK
{

// Class MeshPaintingToolset.MeshPaintingSubsystem
// 0x00A8 (0x00E0 - 0x0038)
class UMeshPaintingSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_38[0x4];                                       // 0x0038(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UTexture>                OverridePaintTexture;                              // 0x003C(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x9C];                                      // 0x0044(0x009C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshPaintingSubsystem">();
	}
	static class UMeshPaintingSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshPaintingSubsystem>();
	}
};

// Class MeshPaintingToolset.MeshPaintSelectionInterface
// 0x0000 (0x0030 - 0x0030)
class IMeshPaintSelectionInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshPaintSelectionInterface">();
	}
	static class IMeshPaintSelectionInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMeshPaintSelectionInterface>();
	}
};

// Class MeshPaintingToolset.MeshPaintSelectionMechanic
// 0x0028 (0x0060 - 0x0038)
class UMeshPaintSelectionMechanic final : public UInteractionMechanic
{
public:
	TArray<class UMeshComponent*>                 CachedClickedComponents;                           // 0x0038(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         CachedClickedActors;                               // 0x0048(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshPaintSelectionMechanic">();
	}
	static class UMeshPaintSelectionMechanic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshPaintSelectionMechanic>();
	}
};

// Class MeshPaintingToolset.VertexAdapterClickToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UVertexAdapterClickToolBuilder final : public USingleClickToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VertexAdapterClickToolBuilder">();
	}
	static class UVertexAdapterClickToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVertexAdapterClickToolBuilder>();
	}
};

// Class MeshPaintingToolset.TextureAdapterClickToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UTextureAdapterClickToolBuilder final : public USingleClickToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TextureAdapterClickToolBuilder">();
	}
	static class UTextureAdapterClickToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextureAdapterClickToolBuilder>();
	}
};

// Class MeshPaintingToolset.MeshClickTool
// 0x0010 (0x00B8 - 0x00A8)
class UMeshClickTool : public USingleClickTool
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshPaintSelectionMechanic*            SelectionMechanic;                                 // 0x00B0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshClickTool">();
	}
	static class UMeshClickTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshClickTool>();
	}
};

// Class MeshPaintingToolset.VertexAdapterClickTool
// 0x0000 (0x00B8 - 0x00B8)
class UVertexAdapterClickTool final : public UMeshClickTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VertexAdapterClickTool">();
	}
	static class UVertexAdapterClickTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVertexAdapterClickTool>();
	}
};

// Class MeshPaintingToolset.TextureAdapterClickTool
// 0x0000 (0x00B8 - 0x00B8)
class UTextureAdapterClickTool final : public UMeshClickTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TextureAdapterClickTool">();
	}
	static class UTextureAdapterClickTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextureAdapterClickTool>();
	}
};

// Class MeshPaintingToolset.MeshTexturePaintingToolBuilder
// 0x0008 (0x0038 - 0x0030)
class UMeshTexturePaintingToolBuilder final : public UInteractiveToolBuilder
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshTexturePaintingToolBuilder">();
	}
	static class UMeshTexturePaintingToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshTexturePaintingToolBuilder>();
	}
};

// Class MeshPaintingToolset.MeshTexturePaintingToolProperties
// 0x0048 (0x0110 - 0x00C8)
class UMeshTexturePaintingToolProperties final : public UBrushBaseProperties
{
public:
	struct FLinearColor                           PaintColor;                                        // 0x00C8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           EraseColor;                                        // 0x00D8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWriteRed;                                         // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWriteGreen;                                       // 0x00E9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWriteBlue;                                        // 0x00EA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWriteAlpha;                                       // 0x00EB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UVChannel;                                         // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableSeamPainting;                               // 0x00F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             PaintTexture;                                      // 0x00F8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             PaintBrush;                                        // 0x0100(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PaintBrushRotationOffset;                          // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotateBrushTowardsDirection;                      // 0x010C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFlow;                                       // 0x010D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyFrontFacingTriangles;                         // 0x010E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10F[0x1];                                      // 0x010F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshTexturePaintingToolProperties">();
	}
	static class UMeshTexturePaintingToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshTexturePaintingToolProperties>();
	}
};

// Class MeshPaintingToolset.MeshTexturePaintingTool
// 0x0330 (0x05E8 - 0x02B8)
class UMeshTexturePaintingTool final : public UBaseBrushTool
{
public:
	uint8                                         Pad_2B8[0x90];                                     // 0x02B8(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshPaintSelectionMechanic*            SelectionMechanic;                                 // 0x0348(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshTexturePaintingToolProperties*     TextureProperties;                                 // 0x0350(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UTexture*>                       Textures;                                          // 0x0358(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_368[0x198];                                    // 0x0368(0x0198)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 BrushRenderTargetTexture;                          // 0x0500(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 BrushMaskRenderTargetTexture;                      // 0x0508(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 SeamMaskRenderTargetTexture;                       // 0x0510(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class UTexture2D*, struct FPaintTexture2DData> PaintTargetData;                                   // 0x0518(0x0050)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class UTexture2D*, struct FPaintComponentOverride> PaintComponentsOverride;                           // 0x0568(0x0050)(Transient, NonTransactional, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B8[0x10];                                     // 0x05B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         TexturePaintingCurrentMeshComponent;               // 0x05C8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture2D*                             PaintingTexture2D;                                 // 0x05D0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D8[0x10];                                     // 0x05D8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshTexturePaintingTool">();
	}
	static class UMeshTexturePaintingTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshTexturePaintingTool>();
	}
};

// Class MeshPaintingToolset.MeshColorPaintingToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UMeshColorPaintingToolBuilder final : public UInteractiveToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshColorPaintingToolBuilder">();
	}
	static class UMeshColorPaintingToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshColorPaintingToolBuilder>();
	}
};

// Class MeshPaintingToolset.MeshWeightPaintingToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UMeshWeightPaintingToolBuilder final : public UInteractiveToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshWeightPaintingToolBuilder">();
	}
	static class UMeshWeightPaintingToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshWeightPaintingToolBuilder>();
	}
};

// Class MeshPaintingToolset.MeshVertexPaintingToolProperties
// 0x0028 (0x00F0 - 0x00C8)
class UMeshVertexPaintingToolProperties : public UBrushBaseProperties
{
public:
	struct FLinearColor                           PaintColor;                                        // 0x00C8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           EraseColor;                                        // 0x00D8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFlow;                                       // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyFrontFacingTriangles;                         // 0x00E9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VertexPreviewSize;                                 // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshVertexPaintingToolProperties">();
	}
	static class UMeshVertexPaintingToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshVertexPaintingToolProperties>();
	}
};

// Class MeshPaintingToolset.MeshColorPaintingToolProperties
// 0x0010 (0x0100 - 0x00F0)
class UMeshColorPaintingToolProperties final : public UMeshVertexPaintingToolProperties
{
public:
	bool                                          bWriteRed;                                         // 0x00F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWriteGreen;                                       // 0x00F1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWriteBlue;                                        // 0x00F2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWriteAlpha;                                       // 0x00F3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPaintOnSpecificLOD;                               // 0x00F4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LODIndex;                                          // 0x00F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshColorPaintingToolProperties">();
	}
	static class UMeshColorPaintingToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshColorPaintingToolProperties>();
	}
};

// Class MeshPaintingToolset.MeshWeightPaintingToolProperties
// 0x0008 (0x00F8 - 0x00F0)
class UMeshWeightPaintingToolProperties final : public UMeshVertexPaintingToolProperties
{
public:
	EMeshPaintWeightTypes                         TextureWeightType;                                 // 0x00F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMeshPaintTextureIndex                        PaintTextureWeightIndex;                           // 0x00F1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMeshPaintTextureIndex                        EraseTextureWeightIndex;                           // 0x00F2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshWeightPaintingToolProperties">();
	}
	static class UMeshWeightPaintingToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshWeightPaintingToolProperties>();
	}
};

// Class MeshPaintingToolset.MeshVertexPaintingTool
// 0x01C8 (0x0480 - 0x02B8)
class UMeshVertexPaintingTool : public UBaseBrushTool
{
public:
	uint8                                         Pad_2B8[0x90];                                     // 0x02B8(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshPaintSelectionMechanic*            SelectionMechanic;                                 // 0x0348(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshVertexPaintingToolProperties*      VertexProperties;                                  // 0x0350(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_358[0x128];                                    // 0x0358(0x0128)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshVertexPaintingTool">();
	}
	static class UMeshVertexPaintingTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshVertexPaintingTool>();
	}
};

// Class MeshPaintingToolset.MeshColorPaintingTool
// 0x0010 (0x0490 - 0x0480)
class UMeshColorPaintingTool final : public UMeshVertexPaintingTool
{
public:
	class UMeshColorPaintingToolProperties*       ColorProperties;                                   // 0x0480(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshColorPaintingTool">();
	}
	static class UMeshColorPaintingTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshColorPaintingTool>();
	}
};

// Class MeshPaintingToolset.MeshWeightPaintingTool
// 0x0008 (0x0488 - 0x0480)
class UMeshWeightPaintingTool final : public UMeshVertexPaintingTool
{
public:
	class UMeshWeightPaintingToolProperties*      WeightProperties;                                  // 0x0480(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshWeightPaintingTool">();
	}
	static class UMeshWeightPaintingTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshWeightPaintingTool>();
	}
};

// Class MeshPaintingToolset.TexturePaintToolset
// 0x0000 (0x0030 - 0x0030)
class UTexturePaintToolset final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TexturePaintToolset">();
	}
	static class UTexturePaintToolset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTexturePaintToolset>();
	}
};

}

