#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshLODToolset

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnrealEd_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "ModelingComponents_classes.hpp"
#include "MeshLODToolset_structs.hpp"
#include "InteractiveToolsFramework_classes.hpp"


namespace SDK
{

// Class MeshLODToolset.AssetDefinition_StaticMeshLODGenerationSettings
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_StaticMeshLODGenerationSettings final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_StaticMeshLODGenerationSettings">();
	}
	static class UAssetDefinition_StaticMeshLODGenerationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_StaticMeshLODGenerationSettings>();
	}
};

// Class MeshLODToolset.GenerateStaticMeshLODProcess
// 0x07E0 (0x0810 - 0x0030)
class UGenerateStaticMeshLODProcess final : public UObject
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            SourceStaticMesh;                                  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_60[0x640];                                     // 0x0060(0x0640)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UTexture2D*>                       AllDerivedTextures;                                // 0x06A0(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UTexture2D*                             DerivedNormalMapTex;                               // 0x06F0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6F8[0x50];                                     // 0x06F8(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             DerivedMultiTextureBakeResult;                     // 0x0748(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_750[0xC0];                                     // 0x0750(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GenerateStaticMeshLODProcess">();
	}
	static class UGenerateStaticMeshLODProcess* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenerateStaticMeshLODProcess>();
	}
};

// Class MeshLODToolset.GenerateStaticMeshLODAssetToolBuilder
// 0x0008 (0x0038 - 0x0030)
class UGenerateStaticMeshLODAssetToolBuilder final : public UMultiSelectionMeshEditingToolBuilder
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GenerateStaticMeshLODAssetToolBuilder">();
	}
	static class UGenerateStaticMeshLODAssetToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenerateStaticMeshLODAssetToolBuilder>();
	}
};

// Class MeshLODToolset.GenerateStaticMeshLODAssetToolOutputProperties
// 0x0038 (0x00E8 - 0x00B0)
class UGenerateStaticMeshLODAssetToolOutputProperties final : public UInteractiveToolPropertySet
{
public:
	EGenerateLODAssetOutputMode                   OutputMode;                                        // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NewAssetName;                                      // 0x00B8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSaveInputAsHiResSource;                           // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GeneratedSuffix;                                   // 0x00D0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowOutputMode;                                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GenerateStaticMeshLODAssetToolOutputProperties">();
	}
	static class UGenerateStaticMeshLODAssetToolOutputProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenerateStaticMeshLODAssetToolOutputProperties>();
	}
};

// Class MeshLODToolset.GenerateStaticMeshLODAssetToolPresetProperties
// 0x0010 (0x00C0 - 0x00B0)
class UGenerateStaticMeshLODAssetToolPresetProperties final : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UStaticMeshLODGenerationSettings> Preset;                                            // 0x00B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ReadFromPreset();
	void WriteToPreset();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GenerateStaticMeshLODAssetToolPresetProperties">();
	}
	static class UGenerateStaticMeshLODAssetToolPresetProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenerateStaticMeshLODAssetToolPresetProperties>();
	}
};

// Class MeshLODToolset.GenerateStaticMeshLODAssetToolProperties
// 0x00C0 (0x0170 - 0x00B0)
class UGenerateStaticMeshLODAssetToolProperties final : public UInteractiveToolPropertySet
{
public:
	struct FGenerateStaticMeshLODProcess_PreprocessSettings Preprocessing;                                     // 0x00B0(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGenerateStaticMeshLODProcessSettings  MeshGeneration;                                    // 0x00D0(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGenerateStaticMeshLODProcess_SimplifySettings Simplification;                                    // 0x00E8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGenerateStaticMeshLODProcess_NormalsSettings Normals;                                           // 0x00F8(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGenerateStaticMeshLODProcess_TextureSettings TextureBaking;                                     // 0x0100(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGenerateStaticMeshLODProcess_UVSettings UVGeneration;                                      // 0x010C(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGenerateStaticMeshLODProcess_CollisionSettings SimpleCollision;                                   // 0x012C(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   CollisionGroupLayerName;                           // 0x0154(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         GroupLayersList;                                   // 0x0160(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	TArray<class FString> GetGroupLayersFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GenerateStaticMeshLODAssetToolProperties">();
	}
	static class UGenerateStaticMeshLODAssetToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenerateStaticMeshLODAssetToolProperties>();
	}
};

// Class MeshLODToolset.GenerateStaticMeshLODAssetToolTextureProperties
// 0x0030 (0x00E0 - 0x00B0)
class UGenerateStaticMeshLODAssetToolTextureProperties final : public UInteractiveToolPropertySet
{
public:
	TArray<struct FGenerateStaticMeshLOD_MaterialConfig> Materials;                                         // 0x00B0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGenerateStaticMeshLOD_TextureConfig> Textures;                                          // 0x00C0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UTexture2D*>                     PreviewTextures;                                   // 0x00D0(0x0010)(Edit, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GenerateStaticMeshLODAssetToolTextureProperties">();
	}
	static class UGenerateStaticMeshLODAssetToolTextureProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenerateStaticMeshLODAssetToolTextureProperties>();
	}
};

// Class MeshLODToolset.GenerateStaticMeshLODAssetTool
// 0x0078 (0x0138 - 0x00C0)
class UGenerateStaticMeshLODAssetTool final : public UMultiSelectionMeshEditingTool
{
public:
	class UGenerateStaticMeshLODAssetToolOutputProperties* OutputProperties;                                  // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGenerateStaticMeshLODAssetToolProperties* BasicProperties;                                   // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGenerateStaticMeshLODAssetToolPresetProperties* PresetProperties;                                  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGenerateStaticMeshLODAssetToolTextureProperties* TextureProperties;                                 // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCollisionGeometryVisualizationProperties* CollisionVizSettings;                              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshOpPreviewWithBackgroundCompute*    PreviewWithBackgroundCompute;                      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UTexture2D*>                     PreviewTextures;                                   // 0x00F0(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UMaterialInterface*>             PreviewMaterials;                                  // 0x0100(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UPhysicsObjectToolPropertySet*          ObjectData;                                        // 0x0110(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewGeometry*                       CollisionPreview;                                  // 0x0118(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UGenerateStaticMeshLODProcess*          GenerateProcess;                                   // 0x0128(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_130[0x8];                                      // 0x0130(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GenerateStaticMeshLODAssetTool">();
	}
	static class UGenerateStaticMeshLODAssetTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenerateStaticMeshLODAssetTool>();
	}
};

// Class MeshLODToolset.StaticMeshLODGenerationSettings
// 0x00A8 (0x00D8 - 0x0030)
class UStaticMeshLODGenerationSettings final : public UObject
{
public:
	struct FGenerateStaticMeshLODProcess_PreprocessSettings Preprocessing;                                     // 0x0030(0x0020)(Edit, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FGenerateStaticMeshLODProcessSettings  MeshGeneration;                                    // 0x0050(0x0018)(Edit, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FGenerateStaticMeshLODProcess_SimplifySettings Simplification;                                    // 0x0068(0x0010)(Edit, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FGenerateStaticMeshLODProcess_NormalsSettings Normals;                                           // 0x0078(0x0008)(Edit, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FGenerateStaticMeshLODProcess_TextureSettings TextureBaking;                                     // 0x0080(0x000C)(Edit, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FGenerateStaticMeshLODProcess_UVSettings UVGeneration;                                      // 0x008C(0x0020)(Edit, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FGenerateStaticMeshLODProcess_CollisionSettings SimpleCollision;                                   // 0x00AC(0x0028)(Edit, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StaticMeshLODGenerationSettings">();
	}
	static class UStaticMeshLODGenerationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStaticMeshLODGenerationSettings>();
	}
};

// Class MeshLODToolset.StaticMeshLODGenerationSettingsFactory
// 0x0000 (0x0088 - 0x0088)
class UStaticMeshLODGenerationSettingsFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StaticMeshLODGenerationSettingsFactory">();
	}
	static class UStaticMeshLODGenerationSettingsFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStaticMeshLODGenerationSettingsFactory>();
	}
};

// Class MeshLODToolset.LODManagerToolBuilder
// 0x0000 (0x0030 - 0x0030)
class ULODManagerToolBuilder final : public UMultiSelectionMeshEditingToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LODManagerToolBuilder">();
	}
	static class ULODManagerToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULODManagerToolBuilder>();
	}
};

// Class MeshLODToolset.LODManagerLODProperties
// 0x0048 (0x00F8 - 0x00B0)
class ULODManagerLODProperties final : public UInteractiveToolPropertySet
{
public:
	TArray<struct FLODManagerLODInfo>             SourceLODs;                                        // 0x00B0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FLODManagerLODInfo>             HiResSource;                                       // 0x00C0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FLODManagerLODInfo>             RenderLODs;                                        // 0x00D0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	bool                                          bNaniteEnabled;                                    // 0x00E0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         KeepTrianglePercent;                               // 0x00E4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FStaticMaterial>                Materials;                                         // 0x00E8(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LODManagerLODProperties">();
	}
	static class ULODManagerLODProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULODManagerLODProperties>();
	}
};

// Class MeshLODToolset.LODManagerPreviewLODProperties
// 0x0028 (0x00D8 - 0x00B0)
class ULODManagerPreviewLODProperties final : public UInteractiveToolPropertySet
{
public:
	class FString                                 VisibleLOD;                                        // 0x00B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         LODNamesList;                                      // 0x00C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bShowSeams;                                        // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const TArray<class FString> GetLODNamesFunc() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LODManagerPreviewLODProperties">();
	}
	static class ULODManagerPreviewLODProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULODManagerPreviewLODProperties>();
	}
};

// Class MeshLODToolset.LODManagerActionPropertySet
// 0x0008 (0x00B8 - 0x00B0)
class ULODManagerActionPropertySet : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LODManagerActionPropertySet">();
	}
	static class ULODManagerActionPropertySet* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULODManagerActionPropertySet>();
	}
};

// Class MeshLODToolset.LODManagerHiResSourceModelActions
// 0x0000 (0x00B8 - 0x00B8)
class ULODManagerHiResSourceModelActions final : public ULODManagerActionPropertySet
{
public:
	void Delete();
	void MoveToLOD0();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LODManagerHiResSourceModelActions">();
	}
	static class ULODManagerHiResSourceModelActions* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULODManagerHiResSourceModelActions>();
	}
};

// Class MeshLODToolset.LODManagerMaterialActions
// 0x0000 (0x00B8 - 0x00B8)
class ULODManagerMaterialActions final : public ULODManagerActionPropertySet
{
public:
	void CleanMaterials();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LODManagerMaterialActions">();
	}
	static class ULODManagerMaterialActions* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULODManagerMaterialActions>();
	}
};

// Class MeshLODToolset.LODManagerToolChangeTarget
// 0x0000 (0x0030 - 0x0030)
class ILODManagerToolChangeTarget final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LODManagerToolChangeTarget">();
	}
	static class ILODManagerToolChangeTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<ILODManagerToolChangeTarget>();
	}
};

// Class MeshLODToolset.LODManagerTool
// 0x00B0 (0x0170 - 0x00C0)
class ULODManagerTool final : public UMultiSelectionMeshEditingTool
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class ULODManagerLODProperties*               LODInfoProperties;                                 // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULODManagerPreviewLODProperties*        LODPreviewProperties;                              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULODManagerHiResSourceModelActions*     HiResSourceModelActions;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULODManagerMaterialActions*             MaterialActions;                                   // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x58];                                      // 0x00E8(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	class UPreviewMesh*                           LODPreview;                                        // 0x0140(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewGeometry*                       LODPreviewLines;                                   // 0x0148(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_150[0x20];                                     // 0x0150(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DeleteHiResSourceModel();
	void MoveHiResToLOD0();
	void RemoveUnreferencedMaterials();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LODManagerTool">();
	}
	static class ULODManagerTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULODManagerTool>();
	}
};

}

