#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshLODToolset

#include "Basic.hpp"


namespace SDK
{

// Enum MeshLODToolset.EGenerateStaticMeshLODProcess_MeshGeneratorModes
// NumValues: 0x0005
enum class EGenerateStaticMeshLODProcess_MeshGeneratorModes : uint8
{
	Solidify                                 = 0,
	SolidifyAndClose                         = 1,
	CleanAndSimplify                         = 2,
	ConvexHull                               = 3,
	EGenerateStaticMeshLODProcess_MAX        = 4,
};

// Enum MeshLODToolset.EGenerateStaticMeshLODProcess_SimplifyMethod
// NumValues: 0x0005
enum class EGenerateStaticMeshLODProcess_SimplifyMethod : uint8
{
	TriangleCount                            = 0,
	VertexCount                              = 1,
	TrianglePercentage                       = 2,
	GeometricTolerance                       = 3,
	EGenerateStaticMeshLODProcess_MAX        = 4,
};

// Enum MeshLODToolset.EGenerateStaticMeshLODProcess_NormalsMethod
// NumValues: 0x0004
enum class EGenerateStaticMeshLODProcess_NormalsMethod : uint8
{
	FromAngleThreshold                       = 0,
	PerVertex                                = 1,
	PerTriangle                              = 2,
	EGenerateStaticMeshLODProcess_MAX        = 3,
};

// Enum MeshLODToolset.EGenerateStaticMeshLODProcess_AutoUVMethod
// NumValues: 0x0004
enum class EGenerateStaticMeshLODProcess_AutoUVMethod : uint8
{
	PatchBuilder                             = 0,
	UVAtlas                                  = 1,
	XAtlas                                   = 2,
	EGenerateStaticMeshLODProcess_MAX        = 3,
};

// Enum MeshLODToolset.EGenerateStaticMeshLODBakeResolution
// NumValues: 0x000B
enum class EGenerateStaticMeshLODBakeResolution : uint32
{
	Resolution16                             = 16,
	Resolution32                             = 32,
	Resolution64                             = 64,
	Resolution128                            = 128,
	Resolution256                            = 256,
	Resolution512                            = 512,
	Resolution1024                           = 1024,
	Resolution2048                           = 2048,
	Resolution4096                           = 4096,
	Resolution8192                           = 8192,
	EGenerateStaticMeshLODBakeResolution_MAX = 8193,
};

// Enum MeshLODToolset.EGenerateStaticMeshLODSimpleCollisionGeometryType
// NumValues: 0x0009
enum class EGenerateStaticMeshLODSimpleCollisionGeometryType : uint8
{
	AlignedBoxes                             = 0,
	OrientedBoxes                            = 1,
	MinimalSpheres                           = 2,
	Capsules                                 = 3,
	ConvexHulls                              = 4,
	SweptHulls                               = 5,
	MinVolume                                = 6,
	None                                     = 7,
	EGenerateStaticMeshLODSimpleCollisionGeometryType_MAX = 8,
};

// Enum MeshLODToolset.EGenerateStaticMeshLODProjectedHullAxisMode
// NumValues: 0x0006
enum class EGenerateStaticMeshLODProjectedHullAxisMode : uint8
{
	X                                        = 0,
	Y                                        = 1,
	Z                                        = 2,
	SmallestBoxDimension                     = 3,
	SmallestVolume                           = 4,
	EGenerateStaticMeshLODProjectedHullAxisMode_MAX = 5,
};

// Enum MeshLODToolset.EGenerateLODAssetOutputMode
// NumValues: 0x0003
enum class EGenerateLODAssetOutputMode : uint8
{
	CreateNewAsset                           = 0,
	UpdateExistingAsset                      = 1,
	EGenerateLODAssetOutputMode_MAX          = 2,
};

// Enum MeshLODToolset.EGenerateLODAssetToolPresetAction
// NumValues: 0x0003
enum class EGenerateLODAssetToolPresetAction : uint8
{
	ReadFromPreset                           = 0,
	WriteToPreset                            = 1,
	EGenerateLODAssetToolPresetAction_MAX    = 2,
};

// Enum MeshLODToolset.EGenerateStaticMeshLOD_BakeConstraint
// NumValues: 0x0003
enum class EGenerateStaticMeshLOD_BakeConstraint : uint32
{
	NoConstraint                             = 0,
	DoNotBake                                = 1,
	EGenerateStaticMeshLOD_MAX               = 2,
};

// Enum MeshLODToolset.ELODManagerToolActions
// NumValues: 0x0005
enum class ELODManagerToolActions : uint8
{
	NoAction                                 = 0,
	MoveHiResToLOD0                          = 1,
	DeleteHiResSourceModel                   = 2,
	RemoveUnreferencedMaterials              = 3,
	ELODManagerToolActions_MAX               = 4,
};

// ScriptStruct MeshLODToolset.GenerateStaticMeshLODProcessSettings
// 0x0018 (0x0018 - 0x0000)
struct FGenerateStaticMeshLODProcessSettings final
{
public:
	EGenerateStaticMeshLODProcess_MeshGeneratorModes MeshGenerator;                                     // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SolidifyVoxelResolution;                           // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindingThreshold;                                  // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClosureDistance;                                   // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrefilterVertices;                                // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PrefilterGridResolution;                           // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshLODToolset.GenerateStaticMeshLODProcess_PreprocessSettings
// 0x0020 (0x0020 - 0x0000)
struct FGenerateStaticMeshLODProcess_PreprocessSettings final
{
public:
	class FName                                   FilterGroupLayer;                                  // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ThickenWeightMapName;                              // 0x000C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThickenAmount;                                     // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsThickenAmountEnabled;                           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MeshLODToolset.GenerateStaticMeshLODProcess_SimplifySettings
// 0x0010 (0x0010 - 0x0000)
struct FGenerateStaticMeshLODProcess_SimplifySettings final
{
public:
	EGenerateStaticMeshLODProcess_SimplifyMethod  Method;                                            // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TargetCount;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetPercentage;                                  // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Tolerance;                                         // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshLODToolset.GenerateStaticMeshLODProcess_NormalsSettings
// 0x0008 (0x0008 - 0x0000)
struct FGenerateStaticMeshLODProcess_NormalsSettings final
{
public:
	EGenerateStaticMeshLODProcess_NormalsMethod   Method;                                            // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Angle;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshLODToolset.GenerateStaticMeshLODProcess_UVSettings_PatchBuilder
// 0x000C (0x000C - 0x0000)
struct FGenerateStaticMeshLODProcess_UVSettings_PatchBuilder final
{
public:
	float                                         CurvatureAlignment;                                // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SmoothingSteps;                                    // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmoothingAlpha;                                    // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshLODToolset.GenerateStaticMeshLODProcess_UVSettings
// 0x0020 (0x0020 - 0x0000)
struct FGenerateStaticMeshLODProcess_UVSettings final
{
public:
	EGenerateStaticMeshLODProcess_AutoUVMethod    UVMethod;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumUVAtlasCharts;                                  // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumInitialPatches;                                 // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MergingThreshold;                                  // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAngleDeviation;                                 // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGenerateStaticMeshLODProcess_UVSettings_PatchBuilder PatchBuilder;                                      // 0x0014(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MeshLODToolset.GenerateStaticMeshLODProcess_TextureSettings
// 0x000C (0x000C - 0x0000)
struct FGenerateStaticMeshLODProcess_TextureSettings final
{
public:
	EGenerateStaticMeshLODBakeResolution          BakeResolution;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BakeThickness;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCombineTextures;                                  // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MeshLODToolset.GenerateStaticMeshLODProcess_CollisionSettings
// 0x0028 (0x0028 - 0x0000)
struct FGenerateStaticMeshLODProcess_CollisionSettings final
{
public:
	class FName                                   CollisionGroupLayerName;                           // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGenerateStaticMeshLODSimpleCollisionGeometryType CollisionType;                                     // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ConvexTriangleCount;                               // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrefilterVertices;                                // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PrefilterGridResolution;                           // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSimplifyPolygons;                                 // 0x001C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HullTolerance;                                     // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGenerateStaticMeshLODProjectedHullAxisMode   SweepAxis;                                         // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MeshLODToolset.GenerateStaticMeshLOD_TextureConfig
// 0x0010 (0x0010 - 0x0000)
struct FGenerateStaticMeshLOD_TextureConfig final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGenerateStaticMeshLOD_BakeConstraint         Constraint;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MeshLODToolset.GenerateStaticMeshLOD_MaterialConfig
// 0x0010 (0x0010 - 0x0000)
struct FGenerateStaticMeshLOD_MaterialConfig final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGenerateStaticMeshLOD_BakeConstraint         Constraint;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MeshLODToolset.LODManagerLODInfo
// 0x0008 (0x0008 - 0x0000)
struct FLODManagerLODInfo final
{
public:
	int32                                         VertexCount;                                       // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TriangleCount;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

