#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshModelingToolsEditorOnlyExp

#include "Basic.hpp"


namespace SDK::Params
{

// Function MeshModelingToolsEditorOnlyExp.AttributeEditorUVActions.GetUVLayerNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct AttributeEditorUVActions_GetUVLayerNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function MeshModelingToolsEditorOnlyExp.AttributeEditorModifyAttributeActions.GetAttributeNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct AttributeEditorModifyAttributeActions_GetAttributeNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function MeshModelingToolsEditorOnlyExp.BakeRenderCaptureToolProperties.GetMapPreviewNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeRenderCaptureToolProperties_GetMapPreviewNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function MeshModelingToolsEditorOnlyExp.BakeRenderCaptureInputToolProperties.GetTargetUVLayerIndex
// 0x0004 (0x0004 - 0x0000)
struct BakeRenderCaptureInputToolProperties_GetTargetUVLayerIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MeshModelingToolsEditorOnlyExp.BakeRenderCaptureInputToolProperties.GetTargetUVLayerNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeRenderCaptureInputToolProperties_GetTargetUVLayerNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function MeshModelingToolsEditorOnlyExp.EditMeshMaterialsToolProperties.GetMaterialNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct EditMeshMaterialsToolProperties_GetMaterialNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function MeshModelingToolsEditorOnlyExp.SkinWeightsPaintToolProperties.GetLODsFunc
// 0x0010 (0x0010 - 0x0000)
struct SkinWeightsPaintToolProperties_GetLODsFunc final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function MeshModelingToolsEditorOnlyExp.SkinWeightsPaintToolProperties.GetSkinWeightProfilesFunc
// 0x0010 (0x0010 - 0x0000)
struct SkinWeightsPaintToolProperties_GetSkinWeightProfilesFunc final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function MeshModelingToolsEditorOnlyExp.SkinWeightsPaintToolProperties.GetSourceLODsFunc
// 0x0010 (0x0010 - 0x0000)
struct SkinWeightsPaintToolProperties_GetSourceLODsFunc final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function MeshModelingToolsEditorOnlyExp.SkinWeightsPaintToolProperties.GetSourceSkinWeightProfilesFunc
// 0x0010 (0x0010 - 0x0000)
struct SkinWeightsPaintToolProperties_GetSourceSkinWeightProfilesFunc final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

}

