#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshPaintEditorMode

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "UnrealEd_classes.hpp"
#include "MeshPaintingToolset_structs.hpp"


namespace SDK
{

// Class MeshPaintEditorMode.ImportVertexColorOptions
// 0x0068 (0x0098 - 0x0030)
class UImportVertexColorOptions final : public UObject
{
public:
	int32                                         UVIndex;                                           // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LODIndex;                                          // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRed;                                              // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlue;                                             // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGreen;                                            // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlpha;                                            // 0x003B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportToInstance;                                 // 0x003C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x57];                                      // 0x003D(0x0057)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCanImportToInstance;                              // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImportVertexColorOptions">();
	}
	static class UImportVertexColorOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImportVertexColorOptions>();
	}
};

// Class MeshPaintEditorMode.MeshPaintMode
// 0x0030 (0x0160 - 0x0130)
class UMeshPaintMode final : public UEdMode
{
public:
	uint8                                         Pad_130[0x8];                                      // 0x0130(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshPaintModeSettings*                 ModeSettings;                                      // 0x0138(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_140[0x20];                                     // 0x0140(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshPaintMode">();
	}
	static class UMeshPaintMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshPaintMode>();
	}
};

// Class MeshPaintEditorMode.MeshPaintModeSettings
// 0x0008 (0x0038 - 0x0030)
class UMeshPaintModeSettings final : public UObject
{
public:
	EMeshPaintDataColorViewMode                   ColorViewMode;                                     // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshPaintModeSettings">();
	}
	static class UMeshPaintModeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshPaintModeSettings>();
	}
};

}

