#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanIdentityEditor

#include "Basic.hpp"

#include "UnrealEd_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class MetaHumanIdentityEditor.AssetDefinition_MetaHumanIdentity
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_MetaHumanIdentity final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_MetaHumanIdentity">();
	}
	static class UAssetDefinition_MetaHumanIdentity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_MetaHumanIdentity>();
	}
};

// Class MetaHumanIdentityEditor.MetaHumanIdentityAssetEditorContext
// 0x0010 (0x0040 - 0x0030)
class UMetaHumanIdentityAssetEditorContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanIdentityAssetEditorContext">();
	}
	static class UMetaHumanIdentityAssetEditorContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanIdentityAssetEditorContext>();
	}
};

// Class MetaHumanIdentityEditor.MetaHumanIdentityAssetEditor
// 0x0008 (0x0048 - 0x0040)
class UMetaHumanIdentityAssetEditor final : public UAssetEditor
{
public:
	class UMetaHumanIdentity*                     ObjectToEdit;                                      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanIdentityAssetEditor">();
	}
	static class UMetaHumanIdentityAssetEditor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanIdentityAssetEditor>();
	}
};

// Class MetaHumanIdentityEditor.MetaHumanIdentityFactoryNew
// 0x0000 (0x0088 - 0x0088)
class UMetaHumanIdentityFactoryNew final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanIdentityFactoryNew">();
	}
	static class UMetaHumanIdentityFactoryNew* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanIdentityFactoryNew>();
	}
};

// Class MetaHumanIdentityEditor.MetaHumanIdentityThumbnailRenderer
// 0x0008 (0x0040 - 0x0038)
class UMetaHumanIdentityThumbnailRenderer final : public UDefaultSizedThumbnailRenderer
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanIdentityThumbnailRenderer">();
	}
	static class UMetaHumanIdentityThumbnailRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanIdentityThumbnailRenderer>();
	}
};

// Class MetaHumanIdentityEditor.SelectedPromotedFrameIndexHolder
// 0x0018 (0x0048 - 0x0030)
class USelectedPromotedFrameIndexHolder final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PromotedFrameIndex;                                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SelectedPromotedFrameIndexHolder">();
	}
	static class USelectedPromotedFrameIndexHolder* GetDefaultObj()
	{
		return GetDefaultObjImpl<USelectedPromotedFrameIndexHolder>();
	}
};

}

