#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetasoundFrontend

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum MetasoundFrontend.ESetParamResult
// NumValues: 0x0003
enum class ESetParamResult : uint8
{
	Succeeded                                = 0,
	Failed                                   = 1,
	ESetParamResult_MAX                      = 2,
};

// Enum MetasoundFrontend.EMetasoundFrontendVertexAccessType
// NumValues: 0x0004
enum class EMetasoundFrontendVertexAccessType : uint32
{
	Reference                                = 0,
	Value                                    = 1,
	Unset                                    = 2,
	EMetasoundFrontendVertexAccessType_MAX   = 3,
};

// Enum MetasoundFrontend.EMetasoundFrontendClassType
// NumValues: 0x000C
enum class EMetasoundFrontendClassType : uint8
{
	External                                 = 0,
	Graph                                    = 1,
	Input                                    = 2,
	Output                                   = 3,
	Literal                                  = 4,
	Variable                                 = 5,
	VariableDeferredAccessor                 = 6,
	VariableAccessor                         = 7,
	VariableMutator                          = 8,
	Template                                 = 9,
	Invalid                                  = 10,
	EMetasoundFrontendClassType_MAX          = 11,
};

// Enum MetasoundFrontend.EMetaSoundFrontendGraphCommentMoveMode
// NumValues: 0x0003
enum class EMetaSoundFrontendGraphCommentMoveMode : uint8
{
	GroupMovement                            = 0,
	NoGroupMovement                          = 1,
	EMetaSoundFrontendGraphCommentMoveMode_MAX = 2,
};

// Enum MetasoundFrontend.EMetasoundFrontendNodeStyleDisplayVisibility
// NumValues: 0x0003
enum class EMetasoundFrontendNodeStyleDisplayVisibility : uint8
{
	Visible                                  = 0,
	Hidden                                   = 1,
	EMetasoundFrontendNodeStyleDisplayVisibility_MAX = 2,
};

// Enum MetasoundFrontend.EMetasoundFrontendLiteralType
// NumValues: 0x000E
enum class EMetasoundFrontendLiteralType : uint8
{
	None                                     = 0,
	Boolean                                  = 1,
	Integer                                  = 2,
	Float                                    = 3,
	String                                   = 4,
	UObject                                  = 5,
	NoneArray                                = 6,
	BooleanArray                             = 7,
	IntegerArray                             = 8,
	FloatArray                               = 9,
	StringArray                              = 10,
	UObjectArray                             = 11,
	Invalid                                  = 12,
	EMetasoundFrontendLiteralType_MAX        = 13,
};

// ScriptStruct MetasoundFrontend.NodeTemplateGenerateInterfaceParams
// 0x0020 (0x0020 - 0x0000)
struct FNodeTemplateGenerateInterfaceParams final
{
public:
	TArray<class FName>                           InputsToConnect;                                   // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           OutputsToConnect;                                  // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendVertexMetadata
// 0x0048 (0x0048 - 0x0000)
struct FMetasoundFrontendVertexMetadata final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0010)(Edit, EditorOnly, NativeAccessSpecifierPrivate)
	class FText                                   DisplayNameTransient;                              // 0x0010(0x0010)(Transient, EditorOnly, NativeAccessSpecifierPrivate)
	class FText                                   Description;                                       // 0x0020(0x0010)(Edit, EditorOnly, NativeAccessSpecifierPrivate)
	class FText                                   DescriptionTransient;                              // 0x0030(0x0010)(Transient, EditorOnly, NativeAccessSpecifierPrivate)
	int32                                         SortOrderIndex;                                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAdvancedDisplay;                                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSerializeText;                                    // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MetasoundFrontend.MetaSoundFrontendGraphComment
// 0x0050 (0x0050 - 0x0000)
struct FMetaSoundFrontendGraphComment final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Comment;                                           // 0x0010(0x0010)(ZeroConstructor, EditorOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Depth;                                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FontSize;                                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Position;                                          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Size;                                              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundFrontendGraphCommentMoveMode        MoveMode;                                          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bColorBubble : 1;                                  // 0x0049(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendVersionNumber
// 0x0008 (0x0008 - 0x0000)
struct FMetasoundFrontendVersionNumber final
{
public:
	int32                                         Major;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Minor;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendVersion
// 0x0014 (0x0014 - 0x0000)
struct FMetasoundFrontendVersion final
{
public:
	class FName                                   Name;                                              // 0x0000(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendVersionNumber        Number;                                            // 0x000C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendVertex
// 0x0028 (0x0028 - 0x0000)
struct FMetasoundFrontendVertex
{
public:
	class FName                                   Name;                                              // 0x0000(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TypeName;                                          // 0x000C(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  VertexID;                                          // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendLiteral
// 0x0058 (0x0058 - 0x0000)
struct FMetasoundFrontendLiteral final
{
public:
	EMetasoundFrontendLiteralType                 Type;                                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AsNumDefault;                                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<bool>                                  AsBoolean;                                         // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<int32>                                 AsInteger;                                         // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<float>                                 AsFloat;                                           // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class FString>                         AsString;                                          // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                        AsUObject;                                         // 0x0048(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendClassVertex
// 0x0060 (0x0088 - 0x0028)
struct FMetasoundFrontendClassVertex : public FMetasoundFrontendVertex
{
public:
	struct FGuid                                  NodeID;                                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendVertexMetadata       Metadata;                                          // 0x0038(0x0048)(Edit, EditorOnly, NativeAccessSpecifierPublic)
	EMetasoundFrontendVertexAccessType            AccessType;                                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendClassVariable
// 0x0058 (0x00E0 - 0x0088)
struct FMetasoundFrontendClassVariable final : public FMetasoundFrontendClassVertex
{
public:
	struct FMetasoundFrontendLiteral              DefaultLiteral;                                    // 0x0088(0x0058)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendVertexHandle
// 0x0020 (0x0020 - 0x0000)
struct FMetasoundFrontendVertexHandle
{
public:
	struct FGuid                                  NodeID;                                            // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  VertexID;                                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendVertexLiteral
// 0x0068 (0x0068 - 0x0000)
struct FMetasoundFrontendVertexLiteral final
{
public:
	struct FGuid                                  VertexID;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendLiteral              Value;                                             // 0x0010(0x0058)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendVariable
// 0x00E8 (0x00E8 - 0x0000)
struct FMetasoundFrontendVariable final
{
public:
	class FName                                   Name;                                              // 0x0000(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0010(0x0010)(EditorOnly, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0020(0x0010)(EditorOnly, NativeAccessSpecifierPublic)
	class FName                                   TypeName;                                          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetasoundFrontendLiteral              Literal;                                           // 0x0040(0x0058)(NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  VariableNodeID;                                    // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  MutatorNodeID;                                     // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          AccessorNodeIDs;                                   // 0x00C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          DeferredAccessorNodeIDs;                           // 0x00D8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendInterfaceStyle
// 0x0060 (0x0060 - 0x0000)
struct FMetasoundFrontendInterfaceStyle final
{
public:
	TArray<int32>                                 DefaultSortOrder;                                  // 0x0000(0x0010)(ZeroConstructor, EditorOnly, NativeAccessSpecifierPublic)
	TMap<class FName, class FText>                RequiredMembers;                                   // 0x0010(0x0050)(EditorOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendClassInput
// 0x0058 (0x00E0 - 0x0088)
struct FMetasoundFrontendClassInput final : public FMetasoundFrontendClassVertex
{
public:
	struct FMetasoundFrontendLiteral              DefaultLiteral;                                    // 0x0088(0x0058)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendClassOutput
// 0x0000 (0x0088 - 0x0088)
struct FMetasoundFrontendClassOutput final : public FMetasoundFrontendClassVertex
{
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendClassEnvironmentVariable
// 0x001C (0x001C - 0x0000)
struct FMetasoundFrontendClassEnvironmentVariable final
{
public:
	class FName                                   Name;                                              // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TypeName;                                          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRequired;                                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendClassInterface
// 0x0100 (0x0100 - 0x0000)
struct FMetasoundFrontendClassInterface
{
public:
	struct FMetasoundFrontendInterfaceStyle       InputStyle;                                        // 0x0000(0x0060)(EditorOnly, NativeAccessSpecifierPrivate)
	struct FMetasoundFrontendInterfaceStyle       OutputStyle;                                       // 0x0060(0x0060)(EditorOnly, NativeAccessSpecifierPrivate)
	TArray<struct FMetasoundFrontendClassInput>   Inputs;                                            // 0x00C0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FMetasoundFrontendClassOutput>  Outputs;                                           // 0x00D0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FMetasoundFrontendClassEnvironmentVariable> Environment;                                       // 0x00E0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FGuid                                  ChangeID;                                          // 0x00F0(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendNodeInterface
// 0x0030 (0x0030 - 0x0000)
struct FMetasoundFrontendNodeInterface final
{
public:
	TArray<struct FMetasoundFrontendVertex>       Inputs;                                            // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMetasoundFrontendVertex>       Outputs;                                           // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMetasoundFrontendVertex>       Environment;                                       // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendNodeStyleDisplay
// 0x0070 (0x0070 - 0x0000)
struct FMetasoundFrontendNodeStyleDisplay final
{
public:
	EMetasoundFrontendNodeStyleDisplayVisibility  Visibility;                                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGuid, struct FVector2D>          Locations;                                         // 0x0008(0x0050)(EditorOnly, NativeAccessSpecifierPublic)
	class FString                                 Comment;                                           // 0x0058(0x0010)(ZeroConstructor, EditorOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCommentVisible;                                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendNodeStyle
// 0x0078 (0x0078 - 0x0000)
struct FMetasoundFrontendNodeStyle final
{
public:
	struct FMetasoundFrontendNodeStyleDisplay     Display;                                           // 0x0000(0x0070)(EditorOnly, NativeAccessSpecifierPublic)
	bool                                          bMessageNodeUpdated;                               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPrivate;                                        // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUnconnectedPinsHidden;                            // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendNode
// 0x00E8 (0x00E8 - 0x0000)
struct FMetasoundFrontendNode final
{
public:
	struct FGuid                                  ID;                                                // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  ClassID;                                           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetasoundFrontendNodeInterface        Interface;                                         // 0x0030(0x0030)(NativeAccessSpecifierPublic)
	TArray<struct FMetasoundFrontendVertexLiteral> InputLiterals;                                     // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendNodeStyle            Style;                                             // 0x0070(0x0078)(EditorOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendInterfaceUClassOptions
// 0x001C (0x001C - 0x0000)
struct FMetasoundFrontendInterfaceUClassOptions final
{
public:
	struct FTopLevelAssetPath                     ClassPath;                                         // 0x0000(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsModifiable;                                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDefault;                                        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendInterface
// 0x0028 (0x0128 - 0x0100)
struct FMetasoundFrontendInterface final : public FMetasoundFrontendClassInterface
{
public:
	struct FMetasoundFrontendVersion              Version;                                           // 0x0100(0x0014)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetasoundFrontendInterfaceUClassOptions> UClassOptions;                                     // 0x0118(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendEdge
// 0x0040 (0x0040 - 0x0000)
struct FMetasoundFrontendEdge final
{
public:
	struct FGuid                                  FromNodeID;                                        // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  FromVertexID;                                      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ToNodeID;                                          // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ToVertexID;                                        // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendEdgeStyleLiteralColorPair
// 0x0068 (0x0068 - 0x0000)
struct FMetasoundFrontendEdgeStyleLiteralColorPair final
{
public:
	struct FMetasoundFrontendLiteral              Value;                                             // 0x0000(0x0058)(NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendEdgeStyle
// 0x0030 (0x0030 - 0x0000)
struct FMetasoundFrontendEdgeStyle final
{
public:
	struct FGuid                                  NodeID;                                            // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutputName;                                        // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetasoundFrontendEdgeStyleLiteralColorPair> LiteralColorPairs;                                 // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendGraphStyle
// 0x0068 (0x0068 - 0x0000)
struct FMetasoundFrontendGraphStyle final
{
public:
	bool                                          bIsGraphEditable;                                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetasoundFrontendEdgeStyle>    EdgeStyles;                                        // 0x0008(0x0010)(ZeroConstructor, EditorOnly, NativeAccessSpecifierPublic)
	TMap<struct FGuid, struct FMetaSoundFrontendGraphComment> Comments;                                          // 0x0018(0x0050)(EditorOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendGraph
// 0x00A8 (0x00A8 - 0x0000)
struct FMetasoundFrontendGraph final
{
public:
	TArray<struct FMetasoundFrontendNode>         Nodes;                                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMetasoundFrontendEdge>         Edges;                                             // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMetasoundFrontendVariable>     Variables;                                         // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendGraphStyle           Style;                                             // 0x0030(0x0068)(EditorOnly, NativeAccessSpecifierPublic)
	struct FGuid                                  PageID;                                            // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendClassStyleDisplay
// 0x0010 (0x0010 - 0x0000)
struct FMetasoundFrontendClassStyleDisplay final
{
public:
	class FName                                   ImageName;                                         // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowName;                                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowInputNames;                                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowOutputNames;                                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowLiterals;                                     // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendInterfaceVertexBinding
// 0x0018 (0x0018 - 0x0000)
struct FMetasoundFrontendInterfaceVertexBinding final
{
public:
	class FName                                   OutputName;                                        // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InputName;                                         // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendInterfaceBinding
// 0x0040 (0x0040 - 0x0000)
struct FMetasoundFrontendInterfaceBinding final
{
public:
	struct FMetasoundFrontendVersion              OutputInterfaceVersion;                            // 0x0000(0x0014)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendVersion              InputInterfaceVersion;                             // 0x0014(0x0014)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BindingPriority;                                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetasoundFrontendInterfaceVertexBinding> VertexBindings;                                    // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendClassName
// 0x0024 (0x0024 - 0x0000)
struct FMetasoundFrontendClassName final
{
public:
	class FName                                   Namespace;                                         // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Variant;                                           // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendClassMetadata
// 0x00E8 (0x00E8 - 0x0000)
struct FMetasoundFrontendClassMetadata final
{
public:
	struct FMetasoundFrontendClassName            ClassName;                                         // 0x0000(0x0024)(Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMetasoundFrontendVersionNumber        Version;                                           // 0x0024(0x0008)(Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMetasoundFrontendClassType                   Type;                                              // 0x002C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0030(0x0010)(Edit, EditorOnly, NativeAccessSpecifierPrivate)
	class FText                                   DisplayNameTransient;                              // 0x0040(0x0010)(Transient, EditorOnly, NativeAccessSpecifierPrivate)
	class FText                                   Description;                                       // 0x0050(0x0010)(Edit, EditorOnly, NativeAccessSpecifierPrivate)
	class FText                                   DescriptionTransient;                              // 0x0060(0x0010)(Transient, EditorOnly, NativeAccessSpecifierPrivate)
	class FText                                   PromptIfMissingTransient;                          // 0x0070(0x0010)(Transient, EditorOnly, NativeAccessSpecifierPrivate)
	class FString                                 Author;                                            // 0x0080(0x0010)(Edit, ZeroConstructor, EditorOnly, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FText>                           Keywords;                                          // 0x0090(0x0010)(Edit, ZeroConstructor, EditorOnly, NativeAccessSpecifierPrivate)
	TArray<class FText>                           KeywordsTransient;                                 // 0x00A0(0x0010)(ZeroConstructor, Transient, EditorOnly, NativeAccessSpecifierPrivate)
	TArray<class FText>                           CategoryHierarchy;                                 // 0x00B0(0x0010)(Edit, ZeroConstructor, EditorOnly, NativeAccessSpecifierPrivate)
	TArray<class FText>                           CategoryHierarchyTransient;                        // 0x00C0(0x0010)(ZeroConstructor, Transient, EditorOnly, NativeAccessSpecifierPrivate)
	bool                                          bIsDeprecated;                                     // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAutoUpdateManagesInterface;                       // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSerializeText;                                    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D3[0x1];                                       // 0x00D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  ChangeID;                                          // 0x00D4(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendClassStyle
// 0x0020 (0x0020 - 0x0000)
struct FMetasoundFrontendClassStyle final
{
public:
	struct FMetasoundFrontendClassStyleDisplay    Display;                                           // 0x0000(0x0010)(EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FGuid                                  ChangeID;                                          // 0x0010(0x0010)(ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendClass
// 0x0220 (0x0220 - 0x0000)
struct FMetasoundFrontendClass
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  ID;                                                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendClassMetadata        Metadata;                                          // 0x0018(0x00E8)(Edit, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendClassInterface       Interface;                                         // 0x0100(0x0100)(Edit, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendClassStyle           Style;                                             // 0x0200(0x0020)(EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendGraphClassPresetOptions
// 0x0058 (0x0058 - 0x0000)
struct FMetasoundFrontendGraphClassPresetOptions final
{
public:
	bool                                          bIsPreset;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FName>                             InputsInheritingDefault;                           // 0x0008(0x0050)(NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendGraphClass
// 0x0110 (0x0330 - 0x0220)
struct FMetasoundFrontendGraphClass final : public FMetasoundFrontendClass
{
public:
	struct FMetasoundFrontendGraph                Graph;                                             // 0x0220(0x00A8)(NativeAccessSpecifierPublic)
	TArray<struct FMetasoundFrontendGraph>        PagedGraphs;                                       // 0x02C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FMetasoundFrontendGraphClassPresetOptions PresetOptions;                                     // 0x02D8(0x0058)(NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendDocumentMetadata
// 0x0160 (0x0160 - 0x0000)
struct FMetasoundFrontendDocumentMetadata final
{
public:
	struct FMetasoundFrontendVersion              Version;                                           // 0x0000(0x0014)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0xFC];                                      // 0x0014(0x00FC)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGuid, class UMetaSoundFrontendMemberMetadata*> MemberMetadata;                                    // 0x0110(0x0050)(EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundFrontend.MetasoundFrontendDocument
// 0x0540 (0x0540 - 0x0000)
struct FMetasoundFrontendDocument final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetasoundFrontendDocumentMetadata     Metadata;                                          // 0x0010(0x0160)(Edit, NativeAccessSpecifierPublic)
	TSet<struct FMetasoundFrontendVersion>        Interfaces;                                        // 0x0170(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendGraphClass           RootGraph;                                         // 0x01C0(0x0330)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FMetasoundFrontendGraphClass>   Subgraphs;                                         // 0x04F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMetasoundFrontendClass>        Dependencies;                                      // 0x0500(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendVersion              ArchetypeVersion;                                  // 0x0510(0x0014)(EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetasoundFrontendVersion>      InterfaceVersions;                                 // 0x0528(0x0010)(ZeroConstructor, EditorOnly, NativeAccessSpecifierPrivate)
	uint32                                        IdCounter;                                         // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MetasoundFrontend.MetaSoundFrontendDocumentBuilder
// 0x0048 (0x0048 - 0x0000)
struct FMetaSoundFrontendDocumentBuilder final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMetaSoundDocumentInterface> DocumentInterface;                                 // 0x0008(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  BuildPageID;                                       // 0x0018(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

