#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanCoreEditor

#include "Basic.hpp"

#include "UnrealEd_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class MetaHumanCoreEditor.AssetDefinition_MetaHumanCameraCalibration
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_MetaHumanCameraCalibration final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_MetaHumanCameraCalibration">();
	}
	static class UAssetDefinition_MetaHumanCameraCalibration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_MetaHumanCameraCalibration>();
	}
};

// Class MetaHumanCoreEditor.MetaHumanCameraCalibrationFactoryNew
// 0x0000 (0x0088 - 0x0088)
class UMetaHumanCameraCalibrationFactoryNew final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanCameraCalibrationFactoryNew">();
	}
	static class UMetaHumanCameraCalibrationFactoryNew* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanCameraCalibrationFactoryNew>();
	}
};

// Class MetaHumanCoreEditor.MetaHumanCameraCalibrationImporterFactory
// 0x0028 (0x00B0 - 0x0088)
class UMetaHumanCameraCalibrationImporterFactory final : public UFactory
{
public:
	uint8                                         Pad_88[0x28];                                      // 0x0088(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanCameraCalibrationImporterFactory">();
	}
	static class UMetaHumanCameraCalibrationImporterFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanCameraCalibrationImporterFactory>();
	}
};

// Class MetaHumanCoreEditor.MetaHumanEditorSettings
// 0x0168 (0x0198 - 0x0030)
class UMetaHumanEditorSettings final : public UObject
{
public:
	int32                                         SampleCount;                                       // 0x0030(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaximumResolution;                                 // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceSerialIngestion;                             // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDevelopersContent;                            // 0x0039(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowOtherDevelopersContent;                       // 0x003A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoadTrackersOnStartup;                            // 0x003B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTrainSolversFastLowMemory;                        // 0x003C(0x0001)(ZeroConstructor, Config, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            PerformanceViewSetupSlot1;                         // 0x0040(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            PerformanceViewSetupSlot2;                         // 0x0090(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            PerformanceViewSetupSlot3;                         // 0x00E0(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            PerformanceViewSetupSlot4;                         // 0x0130(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_180[0x18];                                     // 0x0180(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanEditorSettings">();
	}
	static class UMetaHumanEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanEditorSettings>();
	}
};

}

