#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanUEFNRuntime

#include "Basic.hpp"

#include "GameFeatures_classes.hpp"
#include "MetaHumanRuntime_structs.hpp"
#include "MetaHumanRuntime_classes.hpp"


namespace SDK
{

// Class MetaHumanUEFNRuntime.GameFeatureAction_MetaHuman
// 0x0140 (0x0170 - 0x0030)
class UGameFeatureAction_MetaHuman final : public UGameFeatureAction
{
public:
	TMap<EMetaHumanBodyType, TSoftClassPtr<class UClass>> BodyPostAnimBPs;                                   // 0x0030(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   Face_AnimBP;                                       // 0x0080(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   Face_PostAnimBP;                                   // 0x00B0(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   RigidBodyAnimBP;                                   // 0x00E0(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   ControlRigRigidBodyAnimBP;                         // 0x0110(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   ControlRigAnimBP;                                  // 0x0140(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_MetaHuman">();
	}
	static class UGameFeatureAction_MetaHuman* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_MetaHuman>();
	}
};

// Class MetaHumanUEFNRuntime.MetaHumanComponent
// 0x0008 (0x01D8 - 0x01D0)
class UMetaHumanComponent final : public UMetaHumanComponentBase
{
public:
	int32                                         BodyLODThreshold;                                  // 0x01D0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanComponent">();
	}
	static class UMetaHumanComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanComponent>();
	}
};

}

