#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanFaceContourTracker

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class MetaHumanFaceContourTracker.MetaHumanFaceContourTrackerAsset
// 0x02C0 (0x02F0 - 0x0030)
class UMetaHumanFaceContourTrackerAsset final : public UObject
{
public:
	uint8                                         Pad_30[0xA0];                                      // 0x0030(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNNEModelData>           FaceDetectorModelData;                             // 0x00D0(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UNNEModelData>           FullFaceTrackerModelData;                          // 0x0100(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UNNEModelData>           BrowsDenseTrackerModelData;                        // 0x0130(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UNNEModelData>           EyesDenseTrackerModelData;                         // 0x0160(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UNNEModelData>           NasioLabialsDenseTrackerModelData;                 // 0x0190(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UNNEModelData>           MouthDenseTrackerModelData;                        // 0x01C0(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UNNEModelData>           LipzipDenseTrackerModelData;                       // 0x01F0(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UNNEModelData>           ChinDenseTrackerModelData;                         // 0x0220(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UNNEModelData>           TeethDenseTrackerModelData;                        // 0x0250(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UNNEModelData>           TeethConfidenceTrackerModelData;                   // 0x0280(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UNNEModelData*>                  LoadedTrackerModelData;                            // 0x02B0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C0[0x30];                                     // 0x02C0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanFaceContourTrackerAsset">();
	}
	static class UMetaHumanFaceContourTrackerAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanFaceContourTrackerAsset>();
	}
};

}

