#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanCaptureSource

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MetaHumanCore_structs.hpp"


namespace SDK
{

// Enum MetaHumanCaptureSource.EMetaHumanCaptureSourceType
// NumValues: 0x0005
enum class EMetaHumanCaptureSourceType : uint8
{
	Undefined                                = 0,
	LiveLinkFaceConnection                   = 1,
	LiveLinkFaceArchives                     = 2,
	HMCArchives                              = 3,
	EMetaHumanCaptureSourceType_MAX          = 4,
};

// Enum MetaHumanCaptureSource.EMetaHumanCaptureDepthPrecisionType
// NumValues: 0x0003
enum class EMetaHumanCaptureDepthPrecisionType : uint8
{
	Eightieth                                = 0,
	Full                                     = 1,
	EMetaHumanCaptureDepthPrecisionType_MAX  = 2,
};

// Enum MetaHumanCaptureSource.EMetaHumanCaptureDepthResolutionType
// NumValues: 0x0004
enum class EMetaHumanCaptureDepthResolutionType : uint8
{
	Full                                     = 0,
	Half                                     = 1,
	Quarter                                  = 2,
	EMetaHumanCaptureDepthResolutionType_MAX = 3,
};

// Enum MetaHumanCaptureSource.ETakeIngestMode
// NumValues: 0x0003
enum class ETakeIngestMode : uint8
{
	Async                                    = 0,
	Blocking                                 = 1,
	ETakeIngestMode_MAX                      = 2,
};

// ScriptStruct MetaHumanCaptureSource.DeviceAddress
// 0x0010 (0x0010 - 0x0000)
struct FDeviceAddress final
{
public:
	class FString                                 IpAddress;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MetaHumanCaptureSource.MetaHumanCaptureVoidResult
// 0x0018 (0x0018 - 0x0000)
struct FMetaHumanCaptureVoidResult final
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Code;                                              // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Message;                                           // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MetaHumanCaptureSource.MetaHumanCapturePerTakeVoidResult
// 0x0020 (0x0020 - 0x0000)
struct FMetaHumanCapturePerTakeVoidResult final
{
public:
	struct FMetaHumanCaptureVoidResult            Result;                                            // 0x0000(0x0018)(Edit, EditConst, NativeAccessSpecifierPublic)
	int32                                         TakeId;                                            // 0x0018(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MetaHumanCaptureSource.MetaHumanTakeInfo
// 0x0128 (0x0128 - 0x0000)
struct FMetaHumanTakeInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Id;                                                // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumFrames;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        FrameRate;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TakeNumber;                                        // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              Resolution;                                        // 0x0024(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              DepthResolution;                                   // 0x002C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              Date;                                              // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumStreams;                                        // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DeviceModel;                                       // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FString>                           Tags;                                              // 0x0058(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Metadata;                                          // 0x00A8(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TArray<uint8>                                 RawThumbnailData;                                  // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class FString                                 OutputDirectory;                                   // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FText>                           Issues;                                            // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct MetaHumanCaptureSource.MetaHumanTakeView
// 0x0060 (0x0060 - 0x0000)
struct FMetaHumanTakeView final
{
public:
	class UImgMediaSource*                        Video;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVideoTimecodePresent;                             // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimecode                              VideoTimecode;                                     // 0x000C(0x0014)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x4];                                       // 0x0020(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameRate                             VideoTimecodeRate;                                 // 0x0024(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImgMediaSource*                        Depth;                                             // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDepthTimecodePresent;                             // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimecode                              DepthTimecode;                                     // 0x003C(0x0014)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x4];                                       // 0x0050(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameRate                             DepthTimecodeRate;                                 // 0x0054(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MetaHumanCaptureSource.MetaHumanTake
// 0x0060 (0x0060 - 0x0000)
struct FMetaHumanTake final
{
public:
	int32                                         TakeId;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetaHumanTakeView>             Views;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class UMetaHumanCameraCalibration*            CameraCalibration;                                 // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundWave*                             Audio;                                             // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAudioTimecodePresent;                             // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimecode                              AudioTimecode;                                     // 0x002C(0x0014)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x4];                                       // 0x0040(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameRate                             AudioTimecodeRate;                                 // 0x0044(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetaHumanFrameRange>           CaptureExcludedFrames;                             // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

}

