#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanIdentity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum MetaHumanIdentity.EIdentityPoseType
// NumValues: 0x0006
enum class EIdentityPoseType : uint8
{
	Invalid                                  = 0,
	Neutral                                  = 1,
	Teeth                                    = 2,
	Custom                                   = 3,
	Count                                    = 4,
	EIdentityPoseType_MAX                    = 5,
};

// Enum MetaHumanIdentity.EIdentityTreeNodeIdentifier
// NumValues: 0x000A
enum class EIdentityTreeNodeIdentifier : uint32
{
	None                                     = 0,
	IdentityRoot                             = 1,
	TemplateMesh                             = 2,
	SkeletalMesh                             = 3,
	FaceNode                                 = 4,
	BodyNode                                 = 5,
	FacePoseList                             = 6,
	FaceNeutralPose                          = 7,
	FaceTeethPose                            = 8,
	EIdentityTreeNodeIdentifier_MAX          = 9,
};

// Enum MetaHumanIdentity.EIdentityEditType
// NumValues: 0x0005
enum class EIdentityEditType : uint8
{
	Add                                      = 0,
	Remove                                   = 1,
	ChangeProperty                           = 2,
	Count                                    = 3,
	EIdentityEditType_MAX                    = 4,
};

// Enum MetaHumanIdentity.ETargetTemplateCompatibility
// NumValues: 0x000A
enum class ETargetTemplateCompatibility : uint8
{
	Valid                                    = 0,
	InvalidInputMesh                         = 1,
	MissingImportModel                       = 2,
	MissingLOD                               = 3,
	MissingMeshInfo                          = 4,
	MismatchNumVertices                      = 5,
	MismatchStartImportedVertex              = 6,
	InvalidArchetype                         = 7,
	Count                                    = 8,
	ETargetTemplateCompatibility_MAX         = 9,
};

// Enum MetaHumanIdentity.EConformType
// NumValues: 0x0003
enum class EConformType : uint32
{
	Solve                                    = 0,
	Copy                                     = 1,
	EConformType_MAX                         = 2,
};

// ScriptStruct MetaHumanIdentity.IdentityHashFlags
// 0x0058 (0x0058 - 0x0000)
struct FIdentityHashFlags final
{
public:
	TMap<EIdentityPoseType, bool>                 bPoseHashesValid;                                  // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	bool                                          bIdentitySolveInputsHashValid;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBodyPartHashValid;                                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMeshToMetaHumanInputsHashValid;                   // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTeethFitted;                                      // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTeethPoseTrackingPointsHashValid;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrepareForPerformanceInputsHashValid;             // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MetaHumanIdentity.IdentityHashes
// 0x0120 (0x0120 - 0x0000)
struct FIdentityHashes final
{
public:
	struct FIdentityHashFlags                     HashFlags;                                         // 0x0000(0x0058)(NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0xC8];                                      // 0x0058(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MetaHumanIdentity.MetaHumanIdentityABViewportState
// 0x0001 (0x0001 - 0x0000)
struct FMetaHumanIdentityABViewportState final
{
public:
	uint8                                         bShowCurrentPose : 1;                              // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowTemplateMesh : 1;                             // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
};

// ScriptStruct MetaHumanIdentity.MetaHumanIdentityPoseState
// 0x000C (0x000C - 0x0000)
struct FMetaHumanIdentityPoseState final
{
public:
	int32                                         SelectedFrame;                                     // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameTime                             CurrentFrameTime;                                  // 0x0004(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

