#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanCaptureSource

#include "Basic.hpp"

#include "UnrealEd_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MetaHumanCaptureSource_structs.hpp"


namespace SDK
{

// Class MetaHumanCaptureSource.AssetDefinition_MetaHumanCaptureSource
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_MetaHumanCaptureSource final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_MetaHumanCaptureSource">();
	}
	static class UAssetDefinition_MetaHumanCaptureSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_MetaHumanCaptureSource>();
	}
};

// Class MetaHumanCaptureSource.MetaHumanCaptureSource
// 0x0050 (0x0080 - 0x0030)
class UMetaHumanCaptureSource final : public UObject
{
public:
	EMetaHumanCaptureSourceType                   CaptureSourceType;                                 // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDirectoryPath                         StoragePath;                                       // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DeviceAddress;                                     // 0x0048(0x0010)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDeviceAddress                         DeviceIpAddress;                                   // 0x0058(0x0010)(Edit, NativeAccessSpecifierPublic)
	uint16                                        DeviceControlPort;                                 // 0x0068(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        ExportListeningPort;                               // 0x006A(0x0002)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldCompressDepthFiles;                          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CopyImagesToProject;                               // 0x006D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinDistance;                                       // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaHumanCaptureDepthPrecisionType           DepthPrecision;                                    // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaHumanCaptureDepthResolutionType          DepthResolution;                                   // 0x0079(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanCaptureSource">();
	}
	static class UMetaHumanCaptureSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanCaptureSource>();
	}
};

// Class MetaHumanCaptureSource.MetaHumanCaptureSourceFactoryNew
// 0x0000 (0x0088 - 0x0088)
class UMetaHumanCaptureSourceFactoryNew final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanCaptureSourceFactoryNew">();
	}
	static class UMetaHumanCaptureSourceFactoryNew* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanCaptureSourceFactoryNew>();
	}
};

// Class MetaHumanCaptureSource.MetaHumanCaptureSourceSyncFactoryNew
// 0x0000 (0x0088 - 0x0088)
class UMetaHumanCaptureSourceSyncFactoryNew final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanCaptureSourceSyncFactoryNew">();
	}
	static class UMetaHumanCaptureSourceSyncFactoryNew* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanCaptureSourceSyncFactoryNew>();
	}
};

// Class MetaHumanCaptureSource.MetaHumanCaptureSourceSync
// 0x0060 (0x0090 - 0x0030)
class UMetaHumanCaptureSourceSync final : public UObject
{
public:
	EMetaHumanCaptureSourceType                   CaptureSourceType;                                 // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDirectoryPath                         StoragePath;                                       // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DeviceAddress;                                     // 0x0048(0x0010)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDeviceAddress                         DeviceIpAddress;                                   // 0x0058(0x0010)(Edit, NativeAccessSpecifierPublic)
	uint16                                        DeviceControlPort;                                 // 0x0068(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        ExportListeningPort;                               // 0x006A(0x0002)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldCompressDepthFiles;                          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CopyImagesToProject;                               // 0x006D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinDistance;                                       // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaHumanCaptureDepthPrecisionType           DepthPrecision;                                    // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaHumanCaptureDepthResolutionType          DepthResolution;                                   // 0x0079(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7A[0xE];                                       // 0x007A(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	class UMetaHumanCaptureSource*                MetaHumanCaptureSource;                            // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void CancelProcessing(const TArray<int32>& InTakeIdList);
	TArray<struct FMetaHumanTake> GetTakes(const TArray<int32>& InTakeIdList);
	TArray<struct FMetaHumanTakeInfo> Refresh();
	void SetTargetPath(const class FString& InTargetIngestDirectory, const class FString& InTargetFolderAssetPath);
	void Shutdown();
	void Startup();

	bool CanCancel() const;
	bool CanIngestTakes() const;
	bool CanStartup() const;
	int32 GetNumTakes() const;
	TArray<int32> GetTakeIds() const;
	bool GetTakeInfo(int32 InTakeId, struct FMetaHumanTakeInfo* OutTakeInfo) const;
	bool IsCancelling() const;
	bool IsProcessing() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanCaptureSourceSync">();
	}
	static class UMetaHumanCaptureSourceSync* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanCaptureSourceSync>();
	}
};

}

