#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanSequencer

#include "Basic.hpp"

#include "MovieSceneTracks_classes.hpp"
#include "MediaCompositing_classes.hpp"
#include "MetaHumanSequencer_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class MetaHumanSequencer.MetaHumanAudioTrack
// 0x0000 (0x0108 - 0x0108)
class UMetaHumanAudioTrack final : public UMovieSceneAudioTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanAudioTrack">();
	}
	static class UMetaHumanAudioTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanAudioTrack>();
	}
};

// Class MetaHumanSequencer.MetaHumanMovieSceneMediaSection
// 0x0100 (0x03B8 - 0x02B8)
class UMetaHumanMovieSceneMediaSection : public UMovieSceneMediaSection
{
public:
	struct FMetaHumanMovieSceneChannel            MetaHumanChannel;                                  // 0x02B8(0x0100)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanMovieSceneMediaSection">();
	}
	static class UMetaHumanMovieSceneMediaSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanMovieSceneMediaSection>();
	}
};

// Class MetaHumanSequencer.MetaHumanMovieSceneMediaTrack
// 0x0008 (0x0138 - 0x0130)
class UMetaHumanMovieSceneMediaTrack : public UMovieSceneMediaTrack
{
public:
	float                                         RowHeight;                                         // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanMovieSceneMediaTrack">();
	}
	static class UMetaHumanMovieSceneMediaTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanMovieSceneMediaTrack>();
	}
};

// Class MetaHumanSequencer.MetaHumanSceneSequence
// 0x0068 (0x00E0 - 0x0078)
class UMetaHumanSceneSequence final : public UMovieSceneSequence
{
public:
	class UMovieScene*                            MovieScene;                                        // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGuid, class UObject*>            Bindings;                                          // 0x0090(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanSceneSequence">();
	}
	static class UMetaHumanSceneSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanSceneSequence>();
	}
};

}

