#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanImport

#include "Basic.hpp"

#include "WebBrowser_structs.hpp"


namespace SDK::Params
{

// Function MetaHumanImport.MetaHumanImportBrowserBinding.DialogFailCallback
// 0x0020 (0x0020 - 0x0000)
struct MetaHumanImportBrowserBinding_DialogFailCallback final
{
public:
	struct FWebJSFunction                         DialogJSCallback;                                  // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
};

// Function MetaHumanImport.MetaHumanImportBrowserBinding.DialogSuccessCallback
// 0x0020 (0x0020 - 0x0000)
struct MetaHumanImportBrowserBinding_DialogSuccessCallback final
{
public:
	struct FWebJSFunction                         DialogJSCallback;                                  // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
};

// Function MetaHumanImport.MetaHumanImportBrowserBinding.ExportDataToMSPlugin
// 0x0010 (0x0010 - 0x0000)
struct MetaHumanImportBrowserBinding_ExportDataToMSPlugin final
{
public:
	class FString                                 Data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanImport.MetaHumanImportBrowserBinding.GetAuthToken
// 0x0010 (0x0010 - 0x0000)
struct MetaHumanImportBrowserBinding_GetAuthToken final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanImport.MetaHumanImportBrowserBinding.GetProjectPath
// 0x0010 (0x0010 - 0x0000)
struct MetaHumanImportBrowserBinding_GetProjectPath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanImport.MetaHumanImportBrowserBinding.OnBulkExportMetahumansCallback
// 0x0020 (0x0020 - 0x0000)
struct MetaHumanImportBrowserBinding_OnBulkExportMetahumansCallback final
{
public:
	struct FWebJSFunction                         OnBulkExportMetahumansJSCallback;                  // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
};

// Function MetaHumanImport.MetaHumanImportBrowserBinding.OnExitCallback
// 0x0020 (0x0020 - 0x0000)
struct MetaHumanImportBrowserBinding_OnExitCallback final
{
public:
	struct FWebJSFunction                         OnExitJSCallback;                                  // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
};

// Function MetaHumanImport.MetaHumanImportBrowserBinding.OpenExternalUrl
// 0x0010 (0x0010 - 0x0000)
struct MetaHumanImportBrowserBinding_OpenExternalUrl final
{
public:
	class FString                                 Url;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanImport.MetaHumanImportBrowserBinding.SaveAuthToken
// 0x0010 (0x0010 - 0x0000)
struct MetaHumanImportBrowserBinding_SaveAuthToken final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanImport.MetaHumanImportBrowserBinding.SendFailure
// 0x0010 (0x0010 - 0x0000)
struct MetaHumanImportBrowserBinding_SendFailure final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanImport.MetaHumanImportBrowserBinding.SendSuccess
// 0x0010 (0x0010 - 0x0000)
struct MetaHumanImportBrowserBinding_SendSuccess final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanImport.MetaHumanImportBrowserBinding.SetCurrentEnv
// 0x0010 (0x0010 - 0x0000)
struct MetaHumanImportBrowserBinding_SetCurrentEnv final
{
public:
	class FString                                 Env;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanImport.MetaHumanImportBrowserBinding.ShowDialog
// 0x0020 (0x0020 - 0x0000)
struct MetaHumanImportBrowserBinding_ShowDialog final
{
public:
	class FString                                 Type;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Url;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanImport.MetaHumanImportBrowserBinding.ShowLoginDialog
// 0x0020 (0x0020 - 0x0000)
struct MetaHumanImportBrowserBinding_ShowLoginDialog final
{
public:
	class FString                                 LoginUrl;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ResponseCodeUrl;                                   // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

