#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanCaptureData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MetaHumanCaptureData_structs.hpp"
#include "MetaHumanCore_structs.hpp"


namespace SDK
{

// Class MetaHumanCaptureData.CaptureData
// 0x0018 (0x0048 - 0x0030)
class UCaptureData : public UObject
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CaptureData">();
	}
	static class UCaptureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCaptureData>();
	}
};

// Class MetaHumanCaptureData.MeshCaptureData
// 0x0008 (0x0050 - 0x0048)
class UMeshCaptureData final : public UCaptureData
{
public:
	class UObject*                                TargetMesh;                                        // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshCaptureData">();
	}
	static class UMeshCaptureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCaptureData>();
	}
};

// Class MetaHumanCaptureData.FootageCaptureData
// 0x0080 (0x00C8 - 0x0048)
class UFootageCaptureData final : public UCaptureData
{
public:
	TArray<struct FFootageCaptureView>            Views;                                             // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class USoundWave*                             Audio;                                             // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAudioTimecodePresent;                             // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimecode                              AudioTimecode;                                     // 0x0064(0x0014)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x4];                                       // 0x0078(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameRate                             AudioTimecodeRate;                                 // 0x007C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMetaHumanCameraCalibration*            CameraCalibration;                                 // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFootageCaptureMetadata                Metadata;                                          // 0x0090(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FMetaHumanFrameRange>           CaptureExcludedFrames;                             // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FootageCaptureData">();
	}
	static class UFootageCaptureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFootageCaptureData>();
	}
};

}

