#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetasoundEditor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MetasoundFrontend_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum MetasoundEditor.EMetasoundMemberDefaultWidgetValueType
// NumValues: 0x0004
enum class EMetasoundMemberDefaultWidgetValueType : uint8
{
	Linear                                   = 0,
	Frequency                                = 1,
	Volume                                   = 2,
	EMetasoundMemberDefaultWidgetValueType_MAX = 3,
};

// Enum MetasoundEditor.EMetasoundActiveAnalyzerEnvelopeDirection
// NumValues: 0x0003
enum class EMetasoundActiveAnalyzerEnvelopeDirection : uint8
{
	FromSourceOutput                         = 0,
	FromDestinationInput                     = 1,
	EMetasoundActiveAnalyzerEnvelopeDirection_MAX = 2,
};

// Enum MetasoundEditor.EMetasoundMemberDefaultWidget
// NumValues: 0x0004
enum class EMetasoundMemberDefaultWidget : uint8
{
	None                                     = 0,
	Slider                                   = 1,
	RadialSlider                             = 2,
	EMetasoundMemberDefaultWidget_MAX        = 3,
};

// Enum MetasoundEditor.EMetasoundBoolMemberDefaultWidget
// NumValues: 0x0003
enum class EMetasoundBoolMemberDefaultWidget : uint8
{
	None                                     = 0,
	Button                                   = 1,
	EMetasoundBoolMemberDefaultWidget_MAX    = 2,
};

// Enum MetasoundEditor.EMetasoundActiveDetailView
// NumValues: 0x0003
enum class EMetasoundActiveDetailView : uint8
{
	Metasound                                = 0,
	General                                  = 1,
	EMetasoundActiveDetailView_MAX           = 2,
};

// ScriptStruct MetasoundEditor.MetasoundEditorGraphMemberDefaultBoolRef
// 0x0001 (0x0001 - 0x0000)
struct FMetasoundEditorGraphMemberDefaultBoolRef final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundEditor.MetasoundEditorGraphMemberDefaultIntRef
// 0x0004 (0x0004 - 0x0000)
struct FMetasoundEditorGraphMemberDefaultIntRef final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundEditor.MetasoundEditorGraphMemberDefaultObjectRef
// 0x0008 (0x0008 - 0x0000)
struct FMetasoundEditorGraphMemberDefaultObjectRef final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundEditor.MetasoundEditorGraphNodeBreadcrumb
// 0x0050 (0x0050 - 0x0000)
struct FMetasoundEditorGraphNodeBreadcrumb
{
public:
	struct FMetasoundFrontendClassName            ClassName;                                         // 0x0000(0x0024)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsClassNative;                                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FNodeTemplateGenerateInterfaceParams> TemplateParams;                                    // 0x0028(0x0028)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundEditor.MetasoundEditorGraphMemberNodeBreadcrumb
// 0x0070 (0x00C0 - 0x0050)
struct FMetasoundEditorGraphMemberNodeBreadcrumb : public FMetasoundEditorGraphNodeBreadcrumb
{
public:
	class FName                                   MemberName;                                        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DataType;                                          // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendLiteral              DefaultLiteral;                                    // 0x0068(0x0058)(NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundEditor.MetasoundEditorGraphVertexNodeBreadcrumb
// 0x0008 (0x00C8 - 0x00C0)
struct FMetasoundEditorGraphVertexNodeBreadcrumb final : public FMetasoundEditorGraphMemberNodeBreadcrumb
{
public:
	EMetasoundFrontendVertexAccessType            AccessType;                                        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction
// 0x0000 (0x00F0 - 0x00F0)
struct FMetasoundGraphSchemaAction : public FEdGraphSchemaAction
{
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction_NodeWithMultipleOutputs
// 0x0000 (0x00F0 - 0x00F0)
struct FMetasoundGraphSchemaAction_NodeWithMultipleOutputs : public FMetasoundGraphSchemaAction
{
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction_NewInput
// 0x0010 (0x0100 - 0x00F0)
struct FMetasoundGraphSchemaAction_NewInput final : public FMetasoundGraphSchemaAction_NodeWithMultipleOutputs
{
public:
	struct FGuid                                  NodeID;                                            // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction_PromoteToInput
// 0x0000 (0x00F0 - 0x00F0)
struct FMetasoundGraphSchemaAction_PromoteToInput final : public FMetasoundGraphSchemaAction_NodeWithMultipleOutputs
{
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction_NewOutput
// 0x0010 (0x0100 - 0x00F0)
struct FMetasoundGraphSchemaAction_NewOutput final : public FMetasoundGraphSchemaAction
{
public:
	struct FGuid                                  NodeID;                                            // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction_PromoteToOutput
// 0x0000 (0x00F0 - 0x00F0)
struct FMetasoundGraphSchemaAction_PromoteToOutput final : public FMetasoundGraphSchemaAction
{
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction_NewVariableNode
// 0x0010 (0x0100 - 0x00F0)
struct FMetasoundGraphSchemaAction_NewVariableNode : public FMetasoundGraphSchemaAction_NodeWithMultipleOutputs
{
public:
	struct FGuid                                  VariableID;                                        // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction_NewVariableAccessorNode
// 0x0000 (0x0100 - 0x0100)
struct FMetasoundGraphSchemaAction_NewVariableAccessorNode final : public FMetasoundGraphSchemaAction_NewVariableNode
{
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction_NewVariableDeferredAccessorNode
// 0x0000 (0x0100 - 0x0100)
struct FMetasoundGraphSchemaAction_NewVariableDeferredAccessorNode final : public FMetasoundGraphSchemaAction_NewVariableNode
{
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction_NewVariableMutatorNode
// 0x0000 (0x0100 - 0x0100)
struct FMetasoundGraphSchemaAction_NewVariableMutatorNode final : public FMetasoundGraphSchemaAction_NewVariableNode
{
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction_PromoteToVariable_AccessorNode
// 0x0000 (0x00F0 - 0x00F0)
struct FMetasoundGraphSchemaAction_PromoteToVariable_AccessorNode final : public FMetasoundGraphSchemaAction_NodeWithMultipleOutputs
{
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction_PromoteToVariable_MutatorNode
// 0x0000 (0x00F0 - 0x00F0)
struct FMetasoundGraphSchemaAction_PromoteToVariable_MutatorNode final : public FMetasoundGraphSchemaAction
{
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction_PromoteToVariable_DeferredAccessorNode
// 0x0000 (0x00F0 - 0x00F0)
struct FMetasoundGraphSchemaAction_PromoteToVariable_DeferredAccessorNode final : public FMetasoundGraphSchemaAction_NodeWithMultipleOutputs
{
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction_NewNode
// 0x00E8 (0x01D8 - 0x00F0)
struct FMetasoundGraphSchemaAction_NewNode : public FMetasoundGraphSchemaAction_NodeWithMultipleOutputs
{
public:
	uint8                                         Pad_F0[0xE8];                                      // 0x00F0(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction_NewFromSelected
// 0x0000 (0x01D8 - 0x01D8)
struct FMetasoundGraphSchemaAction_NewFromSelected final : public FMetasoundGraphSchemaAction_NewNode
{
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction_NewAudioAnalyzer
// 0x0000 (0x00F0 - 0x00F0)
struct FMetasoundGraphSchemaAction_NewAudioAnalyzer final : public FMetasoundGraphSchemaAction
{
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction_NewReroute
// 0x0018 (0x0108 - 0x00F0)
struct FMetasoundGraphSchemaAction_NewReroute final : public FMetasoundGraphSchemaAction
{
public:
	uint8                                         Pad_F0[0x18];                                      // 0x00F0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction_NewComment
// 0x0000 (0x00F0 - 0x00F0)
struct FMetasoundGraphSchemaAction_NewComment final : public FMetasoundGraphSchemaAction
{
};

// ScriptStruct MetasoundEditor.MetasoundGraphSchemaAction_Paste
// 0x0000 (0x00F0 - 0x00F0)
struct FMetasoundGraphSchemaAction_Paste final : public FMetasoundGraphSchemaAction
{
};

// ScriptStruct MetasoundEditor.MetasoundAnalyzerAnimationSettings
// 0x001C (0x001C - 0x0000)
struct FMetasoundAnalyzerAnimationSettings final
{
public:
	bool                                          bAnimateConnections;                               // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EnvelopeWireThickness;                             // 0x0004(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EnvelopeSpeed;                                     // 0x0008(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetasoundActiveAnalyzerEnvelopeDirection     EnvelopeDirection;                                 // 0x000C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NumericWireThickness;                              // 0x0010(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WireScalarMin;                                     // 0x0014(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WireScalarMax;                                     // 0x0018(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

