#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanCaptureSource

#include "Basic.hpp"

#include "MetaHumanCaptureSource_structs.hpp"


namespace SDK::Params
{

// Function MetaHumanCaptureSource.MetaHumanCaptureSourceSync.CancelProcessing
// 0x0010 (0x0010 - 0x0000)
struct MetaHumanCaptureSourceSync_CancelProcessing final
{
public:
	TArray<int32>                                 InTakeIdList;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function MetaHumanCaptureSource.MetaHumanCaptureSourceSync.GetTakes
// 0x0020 (0x0020 - 0x0000)
struct MetaHumanCaptureSourceSync_GetTakes final
{
public:
	TArray<int32>                                 InTakeIdList;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FMetaHumanTake>                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function MetaHumanCaptureSource.MetaHumanCaptureSourceSync.Refresh
// 0x0010 (0x0010 - 0x0000)
struct MetaHumanCaptureSourceSync_Refresh final
{
public:
	TArray<struct FMetaHumanTakeInfo>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function MetaHumanCaptureSource.MetaHumanCaptureSourceSync.SetTargetPath
// 0x0020 (0x0020 - 0x0000)
struct MetaHumanCaptureSourceSync_SetTargetPath final
{
public:
	class FString                                 InTargetIngestDirectory;                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InTargetFolderAssetPath;                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanCaptureSource.MetaHumanCaptureSourceSync.CanCancel
// 0x0001 (0x0001 - 0x0000)
struct MetaHumanCaptureSourceSync_CanCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanCaptureSource.MetaHumanCaptureSourceSync.CanIngestTakes
// 0x0001 (0x0001 - 0x0000)
struct MetaHumanCaptureSourceSync_CanIngestTakes final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanCaptureSource.MetaHumanCaptureSourceSync.CanStartup
// 0x0001 (0x0001 - 0x0000)
struct MetaHumanCaptureSourceSync_CanStartup final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanCaptureSource.MetaHumanCaptureSourceSync.GetNumTakes
// 0x0004 (0x0004 - 0x0000)
struct MetaHumanCaptureSourceSync_GetNumTakes final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanCaptureSource.MetaHumanCaptureSourceSync.GetTakeIds
// 0x0010 (0x0010 - 0x0000)
struct MetaHumanCaptureSourceSync_GetTakeIds final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function MetaHumanCaptureSource.MetaHumanCaptureSourceSync.GetTakeInfo
// 0x0138 (0x0138 - 0x0000)
struct MetaHumanCaptureSourceSync_GetTakeInfo final
{
public:
	int32                                         InTakeId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaHumanTakeInfo                     OutTakeInfo;                                       // 0x0008(0x0128)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0130(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MetaHumanCaptureSource.MetaHumanCaptureSourceSync.IsCancelling
// 0x0001 (0x0001 - 0x0000)
struct MetaHumanCaptureSourceSync_IsCancelling final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanCaptureSource.MetaHumanCaptureSourceSync.IsProcessing
// 0x0001 (0x0001 - 0x0000)
struct MetaHumanCaptureSourceSync_IsProcessing final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

