#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanPerformance

#include "Basic.hpp"

#include "MetaHumanPerformance_structs.hpp"
#include "MetaHumanCore_structs.hpp"


namespace SDK::Params
{

// Function MetaHumanPerformance.ContourDataComparisonHelper.ComparePerformanceContourData
// 0x0018 (0x0018 - 0x0000)
struct ContourDataComparisonHelper_ComparePerformanceContourData final
{
public:
	const class UMetaHumanPerformance*            InOriginal;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UMetaHumanPerformance*            InNew;                                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MetaHumanPerformance.MetaHumanPerformance.ExportAnimation
// 0x0001 (0x0001 - 0x0000)
struct MetaHumanPerformance_ExportAnimation final
{
public:
	EPerformanceExportRange                       InExportRange;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanPerformance.MetaHumanPerformance.SetBlockingProcessing
// 0x0001 (0x0001 - 0x0000)
struct MetaHumanPerformance_SetBlockingProcessing final
{
public:
	bool                                          bInBlockingProcessing;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanPerformance.MetaHumanPerformance.StartPipeline
// 0x0002 (0x0002 - 0x0000)
struct MetaHumanPerformance_StartPipeline final
{
public:
	bool                                          bInIsScriptedProcessing;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStartPipelineErrorType                       ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanPerformance.MetaHumanPerformance.CanExportAnimation
// 0x0001 (0x0001 - 0x0000)
struct MetaHumanPerformance_CanExportAnimation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanPerformance.MetaHumanPerformance.CanProcess
// 0x0001 (0x0001 - 0x0000)
struct MetaHumanPerformance_CanProcess final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanPerformance.MetaHumanPerformance.ContainsAnimationData
// 0x0001 (0x0001 - 0x0000)
struct MetaHumanPerformance_ContainsAnimationData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanPerformance.MetaHumanPerformance.DiagnosticsIndicatesProcessingIssue
// 0x0018 (0x0018 - 0x0000)
struct MetaHumanPerformance_DiagnosticsIndicatesProcessingIssue final
{
public:
	class FText                                   OutDiagnosticsWarningMessage;                      // 0x0000(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MetaHumanPerformance.MetaHumanPerformance.GetAnimationData
// 0x0018 (0x0018 - 0x0000)
struct MetaHumanPerformance_GetAnimationData final
{
public:
	int32                                         InStartFrameNumber;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InEndFrameNumber;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFrameAnimationData>            ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function MetaHumanPerformance.MetaHumanPerformance.GetNumberOfProcessedFrames
// 0x0004 (0x0004 - 0x0000)
struct MetaHumanPerformance_GetNumberOfProcessedFrames final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanPerformance.MetaHumanPerformance.IsProcessing
// 0x0001 (0x0001 - 0x0000)
struct MetaHumanPerformance_IsProcessing final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanPerformance.MetaHumanPerformanceExportAnimationSettings.GetTargetSkeleton
// 0x0008 (0x0008 - 0x0000)
struct MetaHumanPerformanceExportAnimationSettings_GetTargetSkeleton final
{
public:
	class USkeleton*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanPerformance.MetaHumanPerformanceExportAnimationSettings.IsTargetSkeletonCompatible
// 0x0068 (0x0068 - 0x0000)
struct MetaHumanPerformanceExportAnimationSettings_IsTargetSkeletonCompatible final
{
public:
	TSet<class FString>                           InCurves;                                          // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         OutMissingCurvesInSkeleton;                        // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MetaHumanPerformance.MetaHumanPerformanceExportUtils.ExportAnimationSequence
// 0x0018 (0x0018 - 0x0000)
struct MetaHumanPerformanceExportUtils_ExportAnimationSequence final
{
public:
	class UMetaHumanPerformance*                  InPerformance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMetaHumanPerformanceExportAnimationSettings* InExportSettings;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanPerformance.MetaHumanPerformanceExportUtils.ExportLevelSequence
// 0x0018 (0x0018 - 0x0000)
struct MetaHumanPerformanceExportUtils_ExportLevelSequence final
{
public:
	class UMetaHumanPerformance*                  InPerformance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMetaHumanPerformanceExportLevelSequenceSettings* InExportSettings;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevelSequence*                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanPerformance.MetaHumanPerformanceExportUtils.GetExportAnimationSequenceSettings
// 0x0010 (0x0010 - 0x0000)
struct MetaHumanPerformanceExportUtils_GetExportAnimationSequenceSettings final
{
public:
	const class UMetaHumanPerformance*            InPerformance;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMetaHumanPerformanceExportAnimationSettings* ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanPerformance.MetaHumanPerformanceExportUtils.GetExportLevelSequenceSettings
// 0x0010 (0x0010 - 0x0000)
struct MetaHumanPerformanceExportUtils_GetExportLevelSequenceSettings final
{
public:
	const class UMetaHumanPerformance*            InPerformance;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMetaHumanPerformanceExportLevelSequenceSettings* ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanPerformance.MetaHumanPerformanceViewportSettings.ToggleControlRigVisibility
// 0x0004 (0x0004 - 0x0000)
struct MetaHumanPerformanceViewportSettings_ToggleControlRigVisibility final
{
public:
	EABImageViewMode                              InView;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanPerformance.MetaHumanPerformanceViewportSettings.IsControlRigVisible
// 0x0008 (0x0008 - 0x0000)
struct MetaHumanPerformanceViewportSettings_IsControlRigVisible final
{
public:
	EABImageViewMode                              InView;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

