#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanIdentity

#include "Basic.hpp"

#include "MetaHumanIdentity_structs.hpp"
#include "RigLogicModule_structs.hpp"
#include "MetaHumanCore_structs.hpp"
#include "MetaHumanCore_classes.hpp"
#include "MetaHumanMeshTracker_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MetaHumanCaptureData_structs.hpp"
#include "GeometryFramework_classes.hpp"


namespace SDK
{

// Class MetaHumanIdentity.MetaHumanIdentityViewportSettings
// 0x00A8 (0x01A8 - 0x0100)
class UMetaHumanIdentityViewportSettings final : public UMetaHumanViewportSettings
{
public:
	EIdentityTreeNodeIdentifier                   SelectedTreeNode;                                  // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EIdentityPoseType, struct FMetaHumanIdentityPoseState> IdentityPosesState;                                // 0x0108(0x0050)(Edit, EditConst, NativeAccessSpecifierPrivate)
	TMap<EABImageViewMode, struct FMetaHumanIdentityABViewportState> IdentityViewportState;                             // 0x0158(0x0050)(Edit, EditConst, NativeAccessSpecifierPrivate)

public:
	void SetFrameTimeForPose(EIdentityPoseType InPoseType, const struct FFrameTime& InFrameTime);
	void SetSelectedPromotedFrame(EIdentityPoseType InPoseType, int32 InPromotedFrameIndex);
	void ToggleCurrentPoseVisibility(EABImageViewMode InView);
	void ToggleTemplateMeshVisibility(EABImageViewMode InView);

	struct FFrameTime GetFrameTimeForPose(EIdentityPoseType InPoseType) const;
	int32 GetSelectedPromotedFrame(EIdentityPoseType InPoseType) const;
	bool IsCurrentPoseVisible(EABImageViewMode InView) const;
	bool IsTemplateMeshVisible(EABImageViewMode InView) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanIdentityViewportSettings">();
	}
	static class UMetaHumanIdentityViewportSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanIdentityViewportSettings>();
	}
};

// Class MetaHumanIdentity.MetaHumanTemplateMeshComponent
// 0x00A0 (0x0610 - 0x0570)
class UMetaHumanTemplateMeshComponent final : public UPrimitiveComponent
{
public:
	uint8                                         bShowFittedTeeth : 1;                              // 0x0570(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowEyes : 1;                                     // 0x0570(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowTeethMesh : 1;                                // 0x0570(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicMeshComponent*                  HeadMeshComponent;                                 // 0x0578(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EIdentityPoseType, class UDynamicMesh*>  PoseHeadMeshes;                                    // 0x0580(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic)
	class UDynamicMeshComponent*                  TeethMeshComponent;                                // 0x05D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMeshComponent*                  LeftEyeComponent;                                  // 0x05D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMeshComponent*                  RightEyeComponent;                                 // 0x05E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           OriginalTeethMesh;                                 // 0x05E8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           FittedTeethMesh;                                   // 0x05F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5F8[0x18];                                     // 0x05F8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanTemplateMeshComponent">();
	}
	static class UMetaHumanTemplateMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanTemplateMeshComponent>();
	}
};

// Class MetaHumanIdentity.PromotedFrameUtils
// 0x0000 (0x0030 - 0x0030)
class UPromotedFrameUtils final : public UObject
{
public:
	static class FString GetImagePathForFrame(const class UFootageCaptureData* InFootageCaptureData, const class FString& InCamera, const int32 InFrameId, bool bInIsImageSequence, ETimecodeAlignment InAlignment);
	static bool GetPromotedFrameAsPixelArrayFromDisk(const class FString& InImagePath, struct FIntPoint* OutImageSize, TArray<struct FColor>* OutLocalSamples);
	static bool InitializeContourDataForFootageFrame(class UMetaHumanIdentityPose* InPose, class UMetaHumanIdentityFootageFrame* InFootageFrame);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PromotedFrameUtils">();
	}
	static class UPromotedFrameUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPromotedFrameUtils>();
	}
};

// Class MetaHumanIdentity.MetaHumanIdentityThumbnailInfo
// 0x0008 (0x0038 - 0x0030)
class UMetaHumanIdentityThumbnailInfo final : public UThumbnailInfo
{
public:
	int32                                         OverridePromotedFrame;                             // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanIdentityThumbnailInfo">();
	}
	static class UMetaHumanIdentityThumbnailInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanIdentityThumbnailInfo>();
	}
};

// Class MetaHumanIdentity.MetaHumanIdentity
// 0x01C8 (0x01F8 - 0x0030)
class UMetaHumanIdentity final : public UObject
{
public:
	TMulticastInlineDelegate<void(bool bInSuccess)> OnAutoRigServiceFinishedDynamicDelegate;           // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMetaHumanIdentityPart*>         Parts;                                             // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class UThumbnailInfo*                         ThumbnailInfo;                                     // 0x0068(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, AdvancedDisplay, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMetaHumanIdentityViewportSettings*     ViewportSettings;                                  // 0x0070(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MeshTrackerVersion;                                // 0x0078(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIdentityHashes                        IdentityHashes;                                    // 0x0088(0x0120)(NativeAccessSpecifierPublic)
	uint8                                         Pad_1A8[0x50];                                     // 0x01A8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool HandleError(EIdentityErrorCode InErrorCode, bool bInLogOnly);

	void CreateDNAForIdentity(bool bInAddMetaHumanToCreator, bool bInLogOnly);
	bool ExportDNADataToFiles(const class FString& InDnaPathWithName, const class FString& InBrowsPathWithName);
	class UMetaHumanIdentityPart* GetOrCreatePartOfClass(TSubclassOf<class UMetaHumanIdentityPart> InPartClass);
	EIdentityErrorCode ImportDNAFile(const class FString& InDNAFilePath, EDNADataLayer InDnaDataLayer, const class FString& InBrowsFilePath);
	bool IsAutoRiggingInProgress();
	bool IsLoggedInToService();
	void LogInToAutoRigService();
	void SetBlockingProcessing(bool bInBlockingProcessing);
	void StartFrameTrackingPipeline(const TArray<struct FColor>& InImageData, int32 InWidth, int32 InHeight, const class FString& InDepthFramePath, class UMetaHumanIdentityPose* InPose, class UMetaHumanIdentityPromotedFrame* InPromotedFrame, bool bInShowProgress);

	bool CanAddPartOfClass(TSubclassOf<class UMetaHumanIdentityPart> InPartClass) const;
	bool CanAddPoseOfClass(TSubclassOf<class UMetaHumanIdentityPose> InPoseClass, EIdentityPoseType InPoseType) const;
	bool DiagnosticsIndicatesProcessingIssue(class FText* OutDiagnosticsWarningMessage) const;
	class UMetaHumanIdentityPart* FindPartOfClass(TSubclassOf<class UMetaHumanIdentityPart> InPartClass) const;
	bool IsFrameTrackingPipelineProcessing() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanIdentity">();
	}
	static class UMetaHumanIdentity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanIdentity>();
	}
};

// Class MetaHumanIdentity.MetaHumanIdentityPart
// 0x0000 (0x0030 - 0x0030)
class UMetaHumanIdentityPart : public UObject
{
public:
	void Initialize();

	bool DiagnosticsIndicatesProcessingIssue(class FText* OutDiagnosticsWarningMessage) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanIdentityPart">();
	}
	static class UMetaHumanIdentityPart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanIdentityPart>();
	}
};

// Class MetaHumanIdentity.MetaHumanIdentityFace
// 0x04F0 (0x0520 - 0x0030)
class UMetaHumanIdentityFace final : public UMetaHumanIdentityPart
{
public:
	class UMetaHumanFaceFittingSolver*            DefaultSolver;                                     // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMetaHumanTemplateMeshComponent*        TemplateMeshComponent;                             // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 RigComponent;                                      // 0x0040(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsConformed : 1;                                  // 0x0048(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsAutoRigged : 1;                                 // 0x0048(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHasFittedEyes : 1;                                // 0x0048(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, EditConst, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             DNAToScanTransform;                                // 0x0050(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DNAPivot;                                          // 0x00B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DNAScale;                                          // 0x00C8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipDiagnostics;                                  // 0x00CC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaximumScaleDifferenceFromAverage;                 // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinimumDepthMapFaceCoverage;                       // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinimumDepthMapFaceWidth;                          // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x384];                                     // 0x00DC(0x0384)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 RawDNABuffer;                                      // 0x0460(0x0010)(ZeroConstructor, Deprecated, NonTransactional, NativeAccessSpecifierPrivate)
	TArray<uint8>                                 RawDeltaDNABuffer;                                 // 0x0470(0x0010)(ZeroConstructor, Deprecated, NonTransactional, NativeAccessSpecifierPrivate)
	TArray<uint8>                                 RawCombinedDNABuffer;                              // 0x0480(0x0010)(ZeroConstructor, Deprecated, NonTransactional, NativeAccessSpecifierPrivate)
	TArray<uint8>                                 DNABuffer;                                         // 0x0490(0x0010)(ZeroConstructor, Deprecated, NonTransactional, NativeAccessSpecifierPrivate)
	TArray<uint8>                                 PCARig;                                            // 0x04A0(0x0010)(ZeroConstructor, Deprecated, NonTransactional, NativeAccessSpecifierPrivate)
	TArray<uint8>                                 BrowsBuffer;                                       // 0x04B0(0x0010)(ZeroConstructor, Deprecated, NonTransactional, NativeAccessSpecifierPrivate)
	TArray<uint8>                                 PredictiveSolvers;                                 // 0x04C0(0x0010)(ZeroConstructor, Deprecated, NonTransactional, NativeAccessSpecifierPrivate)
	TArray<uint8>                                 PredictiveWithoutTeethSolver;                      // 0x04D0(0x0010)(ZeroConstructor, Deprecated, NonTransactional, NativeAccessSpecifierPrivate)
	TArray<class UMetaHumanIdentityPose*>         Poses;                                             // 0x04E0(0x0010)(Edit, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UMetaHumanTemplateMesh*                 ConformalMeshComponent;                            // 0x04F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FVector>                        ConformalVertsLeftEyeRigSpace;                     // 0x04F8(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	TArray<struct FVector>                        ConformalVertsRightEyeRigSpace;                    // 0x0508(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	uint8                                         Pad_518[0x8];                                      // 0x0518(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddPoseOfType(EIdentityPoseType InPoseType, class UMetaHumanIdentityPose* InPose);
	EIdentityErrorCode Conform(EConformType InConformType);
	void ExportTemplateMesh(const class FString& InPath, const class FString& InAssetName);
	bool RemovePose(class UMetaHumanIdentityPose* InPose);
	bool RunPredictiveSolverTraining();

	class UMetaHumanIdentityPose* FindPoseByType(EIdentityPoseType InPoseType) const;
	const TArray<class UMetaHumanIdentityPose*> GetPoses() const;
	bool HasDNABuffer() const;
	bool HasPredictiveSolvers() const;
	bool IsConformalRigValid() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanIdentityFace">();
	}
	static class UMetaHumanIdentityFace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanIdentityFace>();
	}
};

// Class MetaHumanIdentity.MetaHumanIdentityBody
// 0x0020 (0x0050 - 0x0030)
class UMetaHumanIdentityBody final : public UMetaHumanIdentityPart
{
public:
	int32                                         Height;                                            // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BodyTypeIndex;                                     // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanIdentityBody">();
	}
	static class UMetaHumanIdentityBody* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanIdentityBody>();
	}
};

// Class MetaHumanIdentity.MetaHumanIdentityHands
// 0x0000 (0x0030 - 0x0030)
class UMetaHumanIdentityHands final : public UMetaHumanIdentityPart
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanIdentityHands">();
	}
	static class UMetaHumanIdentityHands* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanIdentityHands>();
	}
};

// Class MetaHumanIdentity.MetaHumanIdentityOutfit
// 0x0000 (0x0030 - 0x0030)
class UMetaHumanIdentityOutfit final : public UMetaHumanIdentityPart
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanIdentityOutfit">();
	}
	static class UMetaHumanIdentityOutfit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanIdentityOutfit>();
	}
};

// Class MetaHumanIdentity.MetaHumanIdentityProp
// 0x0000 (0x0030 - 0x0030)
class UMetaHumanIdentityProp final : public UMetaHumanIdentityPart
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanIdentityProp">();
	}
	static class UMetaHumanIdentityProp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanIdentityProp>();
	}
};

// Class MetaHumanIdentity.MetaHumanTemplateMesh
// 0x0010 (0x0940 - 0x0930)
class UMetaHumanTemplateMesh final : public UDynamicMeshComponent
{
public:
	int32                                         MaskPreset;                                        // 0x0930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_934[0xC];                                      // 0x0934(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanTemplateMesh">();
	}
	static class UMetaHumanTemplateMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanTemplateMesh>();
	}
};

// Class MetaHumanIdentity.MetaHumanIdentityPose
// 0x0130 (0x0160 - 0x0030)
class UMetaHumanIdentityPose final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PoseName;                                          // 0x0040(0x0010)(Edit, NativeAccessSpecifierPublic)
	EIdentityPoseType                             PoseType;                                          // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFitEyes;                                          // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0xE];                                       // 0x0052(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             PoseTransform;                                     // 0x0060(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMetaHumanFaceContourTrackerAsset*      DefaultTracker;                                    // 0x00C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMetaHumanIdentityPromotedFrame> PromotedFrameClass;                                // 0x00C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMetaHumanIdentityPromotedFrame*> PromotedFrames;                                    // 0x00D0(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	class USceneComponent*                        CaptureDataSceneComponent;                         // 0x00E0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ManualTeethDepthOffset;                            // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x1C];                                      // 0x00EC(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	class UCaptureData*                           CaptureData;                                       // 0x0108(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CaptureDataConfig;                                 // 0x0118(0x0010)(Edit, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_128[0x18];                                     // 0x0128(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Camera;                                            // 0x0140(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETimecodeAlignment                            TimecodeAlignment;                                 // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_154[0xC];                                      // 0x0154(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMetaHumanIdentityPromotedFrame* AddNewPromotedFrame(int32* OutPromotedFrameIndex);
	void LoadDefaultTracker();
	void RemovePromotedFrame(class UMetaHumanIdentityPromotedFrame* InPromotedFrame);
	void SetCaptureData(class UCaptureData* InCaptureData);

	class UCaptureData* GetCaptureData() const;
	bool IsCaptureDataValid() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanIdentityPose">();
	}
	static class UMetaHumanIdentityPose* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanIdentityPose>();
	}
};

// Class MetaHumanIdentity.MetaHumanIdentityPromotedFrame
// 0x00B0 (0x00E0 - 0x0030)
#pragma pack(push, 0x1)
class alignas(0x10) UMetaHumanIdentityPromotedFrame : public UObject
{
public:
	struct FTransform                             HeadAlignment;                                     // 0x0030(0x0060)(Edit, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   FrameName;                                         // 0x0090(0x0010)(Edit, NativeAccessSpecifierPublic)
	uint8                                         bIsHeadAlignmentSet : 1;                           // 0x00A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseToSolve : 1;                                   // 0x00A0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsNavigationLocked : 1;                           // 0x00A0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTrackOnChange : 1;                                // 0x00A0(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsFrontView : 1;                                  // 0x00A0(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMetaHumanFaceContourTrackerAsset*      ContourTracker;                                    // 0x00A8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMetaHumanContourData*                  ContourData;                                       // 0x00B0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDepthMapDiagnosticsResult             DepthMapDiagnostics;                               // 0x00C8(0x000C)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetNavigationLocked(bool bIsLocked);
	void ToggleNavigationLocked();

	bool CanTrack() const;
	bool DiagnosticsIndicatesProcessingIssue(float InMinimumDepthMapFaceCoverage, float InMinimumDepthMapFaceWidth, class FText* OutDiagnosticsWarningMessage) const;
	bool FrameContoursContainActiveData() const;
	bool IsNavigationLocked() const;
	bool IsTrackingManually() const;
	bool IsTrackingOnChange() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanIdentityPromotedFrame">();
	}
	static class UMetaHumanIdentityPromotedFrame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanIdentityPromotedFrame>();
	}
};
#pragma pack(pop)

// Class MetaHumanIdentity.MetaHumanIdentityCameraFrame
// 0x0060 (0x0140 - 0x00E0)
class UMetaHumanIdentityCameraFrame final : public UMetaHumanIdentityPromotedFrame
{
public:
	struct FVector                                ViewLocation;                                      // 0x00D8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ViewRotation;                                      // 0x00F0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                LookAtLocation;                                    // 0x0108(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraViewFOV;                                     // 0x0120(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EViewModeIndex                                ViewMode;                                          // 0x0124(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FixedEV100;                                        // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x14];                                     // 0x012C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanIdentityCameraFrame">();
	}
	static class UMetaHumanIdentityCameraFrame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanIdentityCameraFrame>();
	}
};

// Class MetaHumanIdentity.MetaHumanIdentityFootageFrame
// 0x0000 (0x00E0 - 0x00E0)
class UMetaHumanIdentityFootageFrame final : public UMetaHumanIdentityPromotedFrame
{
public:
	int32                                         FrameNumber;                                       // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanIdentityFootageFrame">();
	}
	static class UMetaHumanIdentityFootageFrame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanIdentityFootageFrame>();
	}
};

}

