#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanConfig

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "MetaHumanConfig_structs.hpp"


namespace SDK
{

// Class MetaHumanConfig.MetaHumanConfig
// 0x0390 (0x03C0 - 0x0030)
class UMetaHumanConfig final : public UObject
{
public:
	EMetaHumanConfigType                          Type;                                              // 0x0030(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name_0;                                            // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Version;                                           // 0x0048(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InternalVersion;                                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5C[0x364];                                     // 0x005C(0x0364)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool ReadFromDirectory(const class FString& InPath);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanConfig">();
	}
	static class UMetaHumanConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanConfig>();
	}
};

}

