#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanCore

#include "Basic.hpp"

#include "MetaHumanCore_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class MetaHumanCore.MetaHumanCameraCalibration
// 0x0028 (0x0058 - 0x0030)
class UMetaHumanCameraCalibration final : public UObject
{
public:
	TArray<struct FExtendedLensFile>              CameraCalibrations;                                // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FStereoPair>                    StereoPairs;                                       // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAssetImportData*                       AssetImportData;                                   // 0x0050(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, EditorOnly, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanCameraCalibration">();
	}
	static class UMetaHumanCameraCalibration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanCameraCalibration>();
	}
};

// Class MetaHumanCore.MetaHumanContourData
// 0x01B0 (0x01E0 - 0x0030)
class UMetaHumanContourData final : public UObject
{
public:
	struct FFrameTrackingContourData              FrameTrackingContourData;                          // 0x0030(0x0060)(NativeAccessSpecifierPublic)
	TMap<class FString, struct FReducedContour>   ReducedContourData;                                // 0x0090(0x0050)(NativeAccessSpecifierPublic)
	TSet<class FString>                           ManuallyModifiedCurves;                            // 0x00E0(0x0050)(NativeAccessSpecifierPublic)
	class FString                                 ContourDataConfigVersion;                          // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_140[0xA0];                                     // 0x0140(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanContourData">();
	}
	static class UMetaHumanContourData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanContourData>();
	}
};

// Class MetaHumanCore.MetaHumanProcessingAsset
// 0x0000 (0x0030 - 0x0030)
class UMetaHumanProcessingAsset final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanProcessingAsset">();
	}
	static class UMetaHumanProcessingAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanProcessingAsset>();
	}
};

// Class MetaHumanCore.MetaHumanViewportSettings
// 0x00D0 (0x0100 - 0x0030)
class UMetaHumanViewportSettings : public UObject
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	EABImageViewMode                              CurrentViewMode;                                   // 0x0048(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthNear;                                         // 0x004C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthFar;                                          // 0x0050(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaHumanViewportCameraState          CameraState;                                       // 0x0058(0x0058)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	TMap<EABImageViewMode, struct FMetaHumanViewportState> ViewportState;                                     // 0x00B0(0x0050)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)

public:
	float GetEV100(EABImageViewMode InView);
	EViewModeIndex GetViewModeIndex(EABImageViewMode InView);
	bool IsFootageVisible(EABImageViewMode InView);
	void SetEV100(EABImageViewMode InView, float InValue, bool bInNotify);
	void SetViewModeIndex(EABImageViewMode InView, EViewModeIndex InViewModeIndex, bool bInNotify);
	void ToggleDepthMeshVisibility(EABImageViewMode InView);
	void ToggleDistortion(EABImageViewMode InView);
	void ToggleFootageVisibility(EABImageViewMode InView);
	void ToggleShowControlVertices(EABImageViewMode InView);
	void ToggleShowCurves(EABImageViewMode InView);
	void ToggleSkeletalMeshVisibility(EABImageViewMode InView);

	bool IsDepthMeshVisible(EABImageViewMode InView) const;
	bool IsShowingControlVertices(EABImageViewMode InView) const;
	bool IsShowingCurves(EABImageViewMode InView) const;
	bool IsShowingSingleView() const;
	bool IsShowingUndistorted(EABImageViewMode InView) const;
	bool IsSkeletalMeshVisible(EABImageViewMode InView) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanViewportSettings">();
	}
	static class UMetaHumanViewportSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanViewportSettings>();
	}
};

}

