#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanImageViewer

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "ProceduralMeshComponent_classes.hpp"
#include "MetaHumanCore_structs.hpp"
#include "MetaHumanImageViewer_structs.hpp"


namespace SDK
{

// Class MetaHumanImageViewer.MetaHumanDepthMeshComponent
// 0x0020 (0x0640 - 0x0620)
class UMetaHumanDepthMeshComponent final : public UProceduralMeshComponent
{
public:
	class UMetaHumanCameraCalibration*            CameraCalibration;                                 // 0x0620(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture*                               DepthTexture;                                      // 0x0628(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         Width;                                             // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         Height;                                            // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DepthNear;                                         // 0x0638(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DepthFar;                                          // 0x063C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanDepthMeshComponent">();
	}
	static class UMetaHumanDepthMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanDepthMeshComponent>();
	}
};

// Class MetaHumanImageViewer.MetaHumanFootageComponent
// 0x0070 (0x05E0 - 0x0570)
class UMetaHumanFootageComponent final : public UPrimitiveComponent
{
public:
	TMap<EABImageViewMode, struct FFootagePlaneData> FootagePlanes;                                     // 0x0570(0x0050)(Edit, EditConst, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UMetaHumanCameraCalibration*            CameraCalibration;                                 // 0x05C0(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 Camera;                                            // 0x05C8(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D8[0x8];                                      // 0x05D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanFootageComponent">();
	}
	static class UMetaHumanFootageComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanFootageComponent>();
	}
};

// Class MetaHumanImageViewer.MetaHumanSceneCaptureComponent2D
// 0x0050 (0x0BF0 - 0x0BA0)
class UMetaHumanSceneCaptureComponent2D final : public USceneCaptureComponent2D
{
public:
	uint8                                         Pad_BA0[0x50];                                     // 0x0BA0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanSceneCaptureComponent2D">();
	}
	static class UMetaHumanSceneCaptureComponent2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanSceneCaptureComponent2D>();
	}
};

}

