#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanRuntime

#include "Basic.hpp"

#include "MetaHumanRuntime_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MetaHumanRuntime.MetaHumanComponentBase
// 0x00F8 (0x01D0 - 0x00D8)
class UMetaHumanComponentBase : public UActorComponent
{
public:
	class USkeletalMeshComponent*                 Body;                                              // 0x00D8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 BodyComponentName;                                 // 0x00E0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMetaHumanBodyType                            BodyType;                                          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableBodyCorrectives;                            // 0x00F1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 Face;                                              // 0x00F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 FaceComponentName;                                 // 0x0100(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         RigLogicLODThreshold;                              // 0x0110(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableNeckCorrectives;                            // 0x0114(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NeckCorrectivesLODThreshold;                       // 0x0118(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableNeckProcControlRig;                         // 0x011C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NeckProcControlRigLODThreshold;                    // 0x0120(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaHumanCustomizableBodyPart         Torso;                                             // 0x0128(0x0038)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FMetaHumanCustomizableBodyPart         Legs;                                              // 0x0160(0x0038)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FMetaHumanCustomizableBodyPart         Feet;                                              // 0x0198(0x0038)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanComponentBase">();
	}
	static class UMetaHumanComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanComponentBase>();
	}
};

// Class MetaHumanRuntime.MetaHumanComponentUE
// 0x0000 (0x01D0 - 0x01D0)
class UMetaHumanComponentUE final : public UMetaHumanComponentBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetaHumanComponentUE">();
	}
	static class UMetaHumanComponentUE* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanComponentUE>();
	}
};

}

