#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanCore

#include "Basic.hpp"

#include "MetaHumanCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MetaHumanCore.MetaHumanViewportSettings.GetEV100
// 0x0008 (0x0008 - 0x0000)
struct MetaHumanViewportSettings_GetEV100 final
{
public:
	EABImageViewMode                              InView;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanCore.MetaHumanViewportSettings.GetViewModeIndex
// 0x0008 (0x0008 - 0x0000)
struct MetaHumanViewportSettings_GetViewModeIndex final
{
public:
	EABImageViewMode                              InView;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EViewModeIndex                                ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MetaHumanCore.MetaHumanViewportSettings.IsFootageVisible
// 0x0008 (0x0008 - 0x0000)
struct MetaHumanViewportSettings_IsFootageVisible final
{
public:
	EABImageViewMode                              InView;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MetaHumanCore.MetaHumanViewportSettings.SetEV100
// 0x000C (0x000C - 0x0000)
struct MetaHumanViewportSettings_SetEV100 final
{
public:
	EABImageViewMode                              InView;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InValue;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInNotify;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MetaHumanCore.MetaHumanViewportSettings.SetViewModeIndex
// 0x0008 (0x0008 - 0x0000)
struct MetaHumanViewportSettings_SetViewModeIndex final
{
public:
	EABImageViewMode                              InView;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EViewModeIndex                                InViewModeIndex;                                   // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInNotify;                                         // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MetaHumanCore.MetaHumanViewportSettings.ToggleDepthMeshVisibility
// 0x0004 (0x0004 - 0x0000)
struct MetaHumanViewportSettings_ToggleDepthMeshVisibility final
{
public:
	EABImageViewMode                              InView;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanCore.MetaHumanViewportSettings.ToggleDistortion
// 0x0004 (0x0004 - 0x0000)
struct MetaHumanViewportSettings_ToggleDistortion final
{
public:
	EABImageViewMode                              InView;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanCore.MetaHumanViewportSettings.ToggleFootageVisibility
// 0x0004 (0x0004 - 0x0000)
struct MetaHumanViewportSettings_ToggleFootageVisibility final
{
public:
	EABImageViewMode                              InView;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanCore.MetaHumanViewportSettings.ToggleShowControlVertices
// 0x0004 (0x0004 - 0x0000)
struct MetaHumanViewportSettings_ToggleShowControlVertices final
{
public:
	EABImageViewMode                              InView;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanCore.MetaHumanViewportSettings.ToggleShowCurves
// 0x0004 (0x0004 - 0x0000)
struct MetaHumanViewportSettings_ToggleShowCurves final
{
public:
	EABImageViewMode                              InView;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanCore.MetaHumanViewportSettings.ToggleSkeletalMeshVisibility
// 0x0004 (0x0004 - 0x0000)
struct MetaHumanViewportSettings_ToggleSkeletalMeshVisibility final
{
public:
	EABImageViewMode                              InView;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanCore.MetaHumanViewportSettings.IsDepthMeshVisible
// 0x0008 (0x0008 - 0x0000)
struct MetaHumanViewportSettings_IsDepthMeshVisible final
{
public:
	EABImageViewMode                              InView;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MetaHumanCore.MetaHumanViewportSettings.IsShowingControlVertices
// 0x0008 (0x0008 - 0x0000)
struct MetaHumanViewportSettings_IsShowingControlVertices final
{
public:
	EABImageViewMode                              InView;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MetaHumanCore.MetaHumanViewportSettings.IsShowingCurves
// 0x0008 (0x0008 - 0x0000)
struct MetaHumanViewportSettings_IsShowingCurves final
{
public:
	EABImageViewMode                              InView;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MetaHumanCore.MetaHumanViewportSettings.IsShowingSingleView
// 0x0001 (0x0001 - 0x0000)
struct MetaHumanViewportSettings_IsShowingSingleView final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MetaHumanCore.MetaHumanViewportSettings.IsShowingUndistorted
// 0x0008 (0x0008 - 0x0000)
struct MetaHumanViewportSettings_IsShowingUndistorted final
{
public:
	EABImageViewMode                              InView;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MetaHumanCore.MetaHumanViewportSettings.IsSkeletalMeshVisible
// 0x0008 (0x0008 - 0x0000)
struct MetaHumanViewportSettings_IsSkeletalMeshVisible final
{
public:
	EABImageViewMode                              InView;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

