#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MidMatchRiftPoiGameplayRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MidMatchRiftPoiGameplayRuntime.MidmatchRiftPoiCheatManager
// 0x0000 (0x0030 - 0x0030)
class UMidmatchRiftPoiCheatManager final : public UChildCheatManager
{
public:
	void MidmatchRiftPoiSpawnFurthestFromPawnLocation(const int32 DataLayerInfoIndex);
	void MidmatchRiftPoiSpawnNearestToPawnLocation(const int32 DataLayerInfoIndex);
	void SpawnMidmatchPoiFurthestLocation(const struct FVector& Location, const int32 DataLayerInfoIndex);
	void SpawnMidmatchPoiNearestLocation(const struct FVector& Location, const int32 DataLayerInfoIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MidmatchRiftPoiCheatManager">();
	}
	static class UMidmatchRiftPoiCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMidmatchRiftPoiCheatManager>();
	}
};

// Class MidMatchRiftPoiGameplayRuntime.MidMatchRiftPoiManagerActor
// 0x0100 (0x0520 - 0x0420)
class AMidMatchRiftPoiManagerActor final : public AActor
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bCanBeMarked : 1;                                  // 0x0428(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bBlockMarking : 1;                                 // 0x0428(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarkedActorDisplayInfo                MarkerDisplay;                                     // 0x0430(0x00D0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                MarkerPositionOffset;                              // 0x0500(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDynamicLandBrushApplied;                          // 0x0518(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetDynamicLandBrush(const struct FSlateBrush& LandIcon);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MidMatchRiftPoiManagerActor">();
	}
	static class AMidMatchRiftPoiManagerActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMidMatchRiftPoiManagerActor>();
	}
};

// Class MidMatchRiftPoiGameplayRuntime.MidmatchRiftPoiSpawnIndicator
// 0x0100 (0x0520 - 0x0420)
class AMidmatchRiftPoiSpawnIndicator final : public AActor
{
public:
	uint8                                         Pad_420[0x10];                                     // 0x0420(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bCanBeMarked : 1;                                  // 0x0430(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bBlockMarking : 1;                                 // 0x0430(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarkedActorDisplayInfo                MarkerDisplay;                                     // 0x0438(0x00D0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                MarkerPositionOffset;                              // 0x0508(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void TeleportVehicleActor(class AActor* VehicleActor, const struct FVector& TeleportLocation);

	bool IsActorInDataLayerInstance(const class AActor* Actor, const class UDataLayerInstance* DataLayerInstance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MidmatchRiftPoiSpawnIndicator">();
	}
	static class AMidmatchRiftPoiSpawnIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMidmatchRiftPoiSpawnIndicator>();
	}
};

}

