#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MilkshakeRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MilkshakeRuntime.MilkshakeControllerComponent.RegisterEarthquake
// 0x0008 (0x0008 - 0x0000)
struct MilkshakeControllerComponent_RegisterEarthquake final
{
public:
	class AMilkshakeEarthquakeActor*              Earthquake;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MilkshakeRuntime.MilkshakeControllerComponent.UnregisterEarthquake
// 0x0008 (0x0008 - 0x0000)
struct MilkshakeControllerComponent_UnregisterEarthquake final
{
public:
	class AMilkshakeEarthquakeActor*              Earthquake;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MilkshakeRuntime.MilkshakeEarthquakeActor.GetNormalizedMagnitudeAtLocation
// 0x0020 (0x0020 - 0x0000)
struct MilkshakeEarthquakeActor_GetNormalizedMagnitudeAtLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MilkshakeRuntime.MilkshakeEarthquakeActor.OnActorRemovedFromAsyncOverlappedActors
// 0x0008 (0x0008 - 0x0000)
struct MilkshakeEarthquakeActor_OnActorRemovedFromAsyncOverlappedActors final
{
public:
	class AActor*                                 RemovedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MilkshakeRuntime.MilkshakeEarthquakeActor.TickEarthquakePhysicsActorForces
// 0x0004 (0x0004 - 0x0000)
struct MilkshakeEarthquakeActor_TickEarthquakePhysicsActorForces final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MilkshakeRuntime.MilkshakeEarthquakeActor.GetRadius
// 0x0004 (0x0004 - 0x0000)
struct MilkshakeEarthquakeActor_GetRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MilkshakeRuntime.MilkshakeFieldSystemActor.SetStrength
// 0x0004 (0x0004 - 0x0000)
struct MilkshakeFieldSystemActor_SetStrength final
{
public:
	float                                         InStrength;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

