#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MilkshakeRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayCameras_structs.hpp"
#include "MilkshakeRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FieldSystemEngine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class MilkshakeRuntime.MilkshakeControllerComponent
// 0x0338 (0x0418 - 0x00E0)
class UMilkshakeControllerComponent final : public UFortControllerComponent
{
public:
	struct FScalableFloat                         NearbyBuildingActorsUpdateScanRadius;              // 0x00E0(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	int32                                         NearbyBuildingActorsUpdateScanRadiusReplicated;    // 0x0118(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         CameraShakeScale;                                  // 0x0120(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         CameraShakeScaleReplicated;                        // 0x0158(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         NearbyBuildingActorsUpdateInterval;                // 0x0160(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         NearbyBuildingActorsUpdateIntervalReplicated;      // 0x0198(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         bForceFeedbackEnabled;                             // 0x01A0(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bForceFeedbackEnabledReplicated;                   // 0x01D8(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ForceFeedbackTag;                                  // 0x01DC(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            PawnInAirBasedCameraShakeMultiplierLookUpCurve;    // 0x01E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PawnInAirBasedCameraShakeMultiplierInterpSpeed;    // 0x01F0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCameraShakeBase>           CameraShakeClass;                                  // 0x01F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FROscillator                           CameraShakeRotOscillationBaseValues;               // 0x0200(0x0024)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         CameraShakeRotOscillationPitchFrequencyMin;        // 0x0224(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CameraShakeRotOscillationPitchFrequencyMax;        // 0x0228(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CameraShakeRotOscillationRollFrequencyMin;         // 0x022C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CameraShakeRotOscillationRollFrequencyMax;         // 0x0230(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CameraShakeSoundCue;                               // 0x0238(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CameraShakeAudioFadeOutDuration;                   // 0x0240(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAudioFaderCurve                              CameraShakeAudioFadeCurveType;                     // 0x0244(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CameraShakeAudioParam;                             // 0x0248(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MinTimeBetweenBuildingDamageFX;                    // 0x0258(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         MinTimeBetweenBuildingDamageFXReplicated;          // 0x0290(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxTimeBetweenBuildingDamageFX;                    // 0x0298(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         MaxTimeBetweenBuildingDamageFXReplicated;          // 0x02D0(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemAsset*                         BuildingDamageFXTemplate;                          // 0x02D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BuildingDamageFXCooldown;                          // 0x02E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   BuildingDamageFXMagnitudeParamName;                // 0x02E4(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class ABuildingActor*, float>            RecentDamageFXBuildings;                           // 0x02F0(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<EFortResourceType, class USoundBase*>    BuildingDamageSoundCueByResourceType;              // 0x0340(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	float                                         PlayForceFeedbackInterval;                         // 0x0390(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UForceFeedbackEffect*>           ForceFeedbackEffects;                              // 0x0398(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A8[0x10];                                     // 0x03A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AMilkshakeEarthquakeActor*>      RegisteredEarthquakes;                             // 0x03B8(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class AMilkshakeEarthquakeActor*              CurrentEarthquake;                                 // 0x03C8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D0[0x18];                                     // 0x03D0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CurrentCameraShakeAudioComponent;                  // 0x03E8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ABuildingActor*>                 NearbyBuildingActors;                              // 0x03F0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_400[0x18];                                     // 0x0400(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PlayForceFeedback();
	void RegisterEarthquake(class AMilkshakeEarthquakeActor* Earthquake);
	void SpawnBuildingDamageFX();
	void UnregisterEarthquake(class AMilkshakeEarthquakeActor* Earthquake);
	void UpdateNearbyBuildingActors();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MilkshakeControllerComponent">();
	}
	static class UMilkshakeControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMilkshakeControllerComponent>();
	}
};

// Class MilkshakeRuntime.MilkshakeEarthquakeActor
// 0x00C0 (0x04E0 - 0x0420)
class AMilkshakeEarthquakeActor final : public AActor
{
public:
	int32                                         AsyncOverlappedActorsPreallocateCount;             // 0x0420(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         AsyncOverlappedActors;                             // 0x0428(0x0010)(BlueprintVisible, ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FMilkshakeEarthquakePhysicsActorInfo> OverlappedPhysicsActorInfos;                       // 0x0438(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxNumOfPhysicActorSimulation;                     // 0x0448(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	float                                         MinTimeBeforeNextForceDirectionUpdate;             // 0x0480(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxTimeBeforeNextForceDirectionUpdate;             // 0x0484(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinPhysicsImpulseMagnitude;                        // 0x0488(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxPhysicsImpulseMagnitude;                        // 0x048C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EFortPhysicsSimSize, float>              SimSizeToImpulseScalarMap;                         // 0x0490(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	float GetNormalizedMagnitudeAtLocation(const struct FVector& Location);
	void OnActorRemovedFromAsyncOverlappedActors(class AActor* RemovedActor);
	void RemoveAsyncOverlappedActorsOutsideRadius();
	void RemoveNullsFromAsyncOverlappedActors();
	void TickEarthquakePhysicsActorForces(const float DeltaSeconds);

	float GetRadius() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MilkshakeEarthquakeActor">();
	}
	static class AMilkshakeEarthquakeActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMilkshakeEarthquakeActor>();
	}
};

// Class MilkshakeRuntime.MilkshakeFieldSystemActor
// 0x0030 (0x0458 - 0x0428)
class AMilkshakeFieldSystemActor final : public AFieldSystemActor
{
public:
	class UOperatorField*                         OperatorFieldMultiplyComponent;                    // 0x0428(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URadialFalloff*                         RadialFallOffComponent;                            // 0x0430(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URadialVector*                          RadialVectorComponent;                             // 0x0438(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0440(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StopGameTime;                                      // 0x0444(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         IncomingDuration;                                  // 0x0448(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         OutgoingDuration;                                  // 0x044C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Strength;                                          // 0x0450(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetStrength(const float InStrength);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MilkshakeFieldSystemActor">();
	}
	static class AMilkshakeFieldSystemActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMilkshakeFieldSystemActor>();
	}
};

}

