#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MLDeformerFrameworkEditor

#include "Basic.hpp"

#include "UnrealEd_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class MLDeformerFrameworkEditor.AssetDefinition_MLDeformer
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_MLDeformer final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_MLDeformer">();
	}
	static class UAssetDefinition_MLDeformer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_MLDeformer>();
	}
};

// Class MLDeformerFrameworkEditor.MLDeformerFactory
// 0x0000 (0x0088 - 0x0088)
class UMLDeformerFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerFactory">();
	}
	static class UMLDeformerFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerFactory>();
	}
};

// Class MLDeformerFrameworkEditor.MLDeformerTrainingModel
// 0x0070 (0x00A0 - 0x0030)
class UMLDeformerTrainingModel : public UObject
{
public:
	TArray<float>                                 SampleDeltas;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 SampleCurveValues;                                 // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 SampleBoneRotations;                               // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 MaskIndexPerSample;                                // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x30];                                      // 0x0070(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool NextSample();
	void ResetSampling();
	bool SetCurrentSampleIndex(int32 Index_0);
	void SetDeviceList(const TArray<class FString>& DeviceNames, int32 PreferredDeviceIndex);
	void SetNeedsResampling(bool bNeedsResampling);
	void SetNumFloatsPerCurve(int32 NumFloatsPerCurve);

	TArray<int32> GetMaskIndexPerSampleArray() const;
	class UMLDeformerModel* GetModel() const;
	bool GetNeedsResampling() const;
	int32 GetNumberSampleCurves() const;
	int32 GetNumberSampleDeltas() const;
	int32 GetNumberSampleTransforms() const;
	TArray<float> GetTrainingInputAnimMaskData(class FName MaskName) const;
	TArray<class FName> GetTrainingInputAnimMasks() const;
	int32 NumSamples() const;
	void UpdateAvailableDevices() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerTrainingModel">();
	}
	static class UMLDeformerTrainingModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerTrainingModel>();
	}
};

// Class MLDeformerFrameworkEditor.MLDeformerGeomCacheTrainingModel
// 0x0000 (0x00A0 - 0x00A0)
class UMLDeformerGeomCacheTrainingModel : public UMLDeformerTrainingModel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerGeomCacheTrainingModel">();
	}
	static class UMLDeformerGeomCacheTrainingModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerGeomCacheTrainingModel>();
	}
};

// Class MLDeformerFrameworkEditor.MLDeformerPaintMode
// 0x0010 (0x0160 - 0x0150)
class UMLDeformerPaintMode final : public UBaseLegacyWidgetEdMode
{
public:
	uint8                                         Pad_150[0x10];                                     // 0x0150(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerPaintMode">();
	}
	static class UMLDeformerPaintMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerPaintMode>();
	}
};

}

