#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MLDeformerRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "MLDeformerFramework_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MLDeformerRuntime.FortMLDeformerComponent
// 0x0020 (0x0168 - 0x0148)
class UFortMLDeformerComponent final : public UMLDeformerComponent
{
public:
	class UMLDeformerAsset*                       RequestedMLDeformerAsset;                          // 0x0148(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMeshDeformer*                          RequestedMeshDeformerAsset;                        // 0x0150(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_158[0x10];                                     // 0x0158(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMLDeformerComponent">();
	}
	static class UFortMLDeformerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMLDeformerComponent>();
	}
};

// Class MLDeformerRuntime.MLDeformerGameFeatureData
// 0x0008 (0x0690 - 0x0688)
class UMLDeformerGameFeatureData final : public UFortGameFeatureData
{
public:
	bool                                          bDisableWhenOwnerIsNotViewTarget;                  // 0x0688(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldRampUpWeightWhenEnabled;                    // 0x0689(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68A[0x2];                                      // 0x068A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WeightIncreasePerSecond;                           // 0x068C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerGameFeatureData">();
	}
	static class UMLDeformerGameFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerGameFeatureData>();
	}
};

// Class MLDeformerRuntime.MLDeformerAssetMapping
// 0x0130 (0x0178 - 0x0048)
class UMLDeformerAssetMapping final : public UPrimaryDataAsset
{
public:
	TArray<TSoftObjectPtr<class UAthenaCharacterItemDefinition>> CharacterItemDefinitionToMLDeformerAssetMappingKeys; // 0x0048(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UMLDeformerAsset>> CharacterItemDefinitionToMLDeformerAssetMappingValues; // 0x0058(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UCustomCharacterPart>> CharacterPartToMLDeformerAssetMappingKeys;         // 0x0068(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UMLDeformerAsset>> CharacterPartToMLDeformerAssetMappingValues;       // 0x0078(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<TSoftObjectPtr<class UMLDeformerAsset>, TSoftObjectPtr<class UMeshDeformer>> MLDeformerToMeshDeformerAssetMap;                  // 0x0088(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<TSoftObjectPtr<class UAthenaCharacterItemDefinition>, TSoftObjectPtr<class UMLDeformerAsset>> CharacterItemDefinitionToMLDeformerAssetMap;       // 0x00D8(0x0050)(Deprecated, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<TSoftObjectPtr<class UCustomCharacterPart>, TSoftObjectPtr<class UMLDeformerAsset>> CharacterPartToMLDeformerAssetMap;                 // 0x0128(0x0050)(Deprecated, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerAssetMapping">();
	}
	static class UMLDeformerAssetMapping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerAssetMapping>();
	}
};

// Class MLDeformerRuntime.MLDeformerComponentManager
// 0x0028 (0x0100 - 0x00D8)
class UMLDeformerComponentManager final : public UActorComponent
{
public:
	uint8                                         Pad_D8[0x28];                                      // 0x00D8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MLDeformerComponentManager">();
	}
	static class UMLDeformerComponentManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerComponentManager>();
	}
};

}

