#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MLDeformerFramework

#include "Basic.hpp"


namespace SDK
{

// Enum MLDeformerFramework.EMLDeformerMaskingMode
// NumValues: 0x0003
enum class EMLDeformerMaskingMode : uint8
{
	Generated                                = 0,
	VertexAttribute                          = 1,
	EMLDeformerMaskingMode_MAX               = 2,
};

// Enum MLDeformerFramework.EMLDeformerVizMode
// NumValues: 0x0003
enum class EMLDeformerVizMode : uint8
{
	TrainingData                             = 0,
	TestData                                 = 1,
	EMLDeformerVizMode_MAX                   = 2,
};

// Enum MLDeformerFramework.EMLDeformerHeatMapMode
// NumValues: 0x0003
enum class EMLDeformerHeatMapMode : uint8
{
	Activations                              = 0,
	GroundTruth                              = 1,
	EMLDeformerHeatMapMode_MAX               = 2,
};

// Enum MLDeformerFramework.EMLDeformerMaskChannel
// NumValues: 0x0007
enum class EMLDeformerMaskChannel : uint8
{
	Disabled                                 = 0,
	VertexColorRed                           = 1,
	VertexColorGreen                         = 2,
	VertexColorBlue                          = 3,
	VertexColorAlpha                         = 4,
	VertexAttribute                          = 5,
	EMLDeformerMaskChannel_MAX               = 6,
};

// ScriptStruct MLDeformerFramework.MLDeformerCurveReference
// 0x000C (0x000C - 0x0000)
struct FMLDeformerCurveReference final
{
public:
	class FName                                   CurveName;                                         // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MLDeformerFramework.MLDeformerTrainingInputAnim
// 0x0058 (0x0058 - 0x0000)
struct FMLDeformerTrainingInputAnim
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequence>           AnimSequence;                                      // 0x0008(0x0030)(Edit, EditorOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseCustomRange;                                   // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StartFrame;                                        // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         EndFrame;                                          // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   VertexMask;                                        // 0x0044(0x000C)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnabled;                                          // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MLDeformerFramework.MLDeformerGeomCacheTrainingInputAnim
// 0x0030 (0x0088 - 0x0058)
struct FMLDeformerGeomCacheTrainingInputAnim final : public FMLDeformerTrainingInputAnim
{
public:
	TSoftObjectPtr<class UGeometryCache>          GeometryCache;                                     // 0x0058(0x0030)(Edit, EditorOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct MLDeformerFramework.MLDeformerMaskInfo
// 0x0020 (0x0020 - 0x0000)
struct FMLDeformerMaskInfo final
{
public:
	TArray<class FName>                           BoneNames;                                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	EMLDeformerMaskingMode                        MaskMode;                                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   VertexAttributeName;                               // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MLDeformerFramework.MLDeformerMorphModelQualityLevel
// 0x0004 (0x0004 - 0x0000)
struct FMLDeformerMorphModelQualityLevel final
{
public:
	int32                                         MaxActiveMorphs;                                   // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MLDeformerFramework.MLDeformerCompareActor
// 0x0040 (0x0040 - 0x0000)
struct FMLDeformerCompareActor final
{
public:
	class FName                                   Name;                                              // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMLDeformerAsset>        DeformerAsset;                                     // 0x0010(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

