#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MLDeformerFrameworkEditor

#include "Basic.hpp"


namespace SDK::Params
{

// Function MLDeformerFrameworkEditor.MLDeformerTrainingModel.NextSample
// 0x0001 (0x0001 - 0x0000)
struct MLDeformerTrainingModel_NextSample final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MLDeformerFrameworkEditor.MLDeformerTrainingModel.SetCurrentSampleIndex
// 0x0008 (0x0008 - 0x0000)
struct MLDeformerTrainingModel_SetCurrentSampleIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MLDeformerFrameworkEditor.MLDeformerTrainingModel.SetDeviceList
// 0x0018 (0x0018 - 0x0000)
struct MLDeformerTrainingModel_SetDeviceList final
{
public:
	TArray<class FString>                         DeviceNames;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         PreferredDeviceIndex;                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MLDeformerFrameworkEditor.MLDeformerTrainingModel.SetNeedsResampling
// 0x0001 (0x0001 - 0x0000)
struct MLDeformerTrainingModel_SetNeedsResampling final
{
public:
	bool                                          bNeedsResampling;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MLDeformerFrameworkEditor.MLDeformerTrainingModel.SetNumFloatsPerCurve
// 0x0004 (0x0004 - 0x0000)
struct MLDeformerTrainingModel_SetNumFloatsPerCurve final
{
public:
	int32                                         NumFloatsPerCurve;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MLDeformerFrameworkEditor.MLDeformerTrainingModel.GetMaskIndexPerSampleArray
// 0x0010 (0x0010 - 0x0000)
struct MLDeformerTrainingModel_GetMaskIndexPerSampleArray final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function MLDeformerFrameworkEditor.MLDeformerTrainingModel.GetModel
// 0x0008 (0x0008 - 0x0000)
struct MLDeformerTrainingModel_GetModel final
{
public:
	class UMLDeformerModel*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MLDeformerFrameworkEditor.MLDeformerTrainingModel.GetNeedsResampling
// 0x0001 (0x0001 - 0x0000)
struct MLDeformerTrainingModel_GetNeedsResampling final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MLDeformerFrameworkEditor.MLDeformerTrainingModel.GetNumberSampleCurves
// 0x0004 (0x0004 - 0x0000)
struct MLDeformerTrainingModel_GetNumberSampleCurves final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MLDeformerFrameworkEditor.MLDeformerTrainingModel.GetNumberSampleDeltas
// 0x0004 (0x0004 - 0x0000)
struct MLDeformerTrainingModel_GetNumberSampleDeltas final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MLDeformerFrameworkEditor.MLDeformerTrainingModel.GetNumberSampleTransforms
// 0x0004 (0x0004 - 0x0000)
struct MLDeformerTrainingModel_GetNumberSampleTransforms final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MLDeformerFrameworkEditor.MLDeformerTrainingModel.GetTrainingInputAnimMaskData
// 0x0020 (0x0020 - 0x0000)
struct MLDeformerTrainingModel_GetTrainingInputAnimMaskData final
{
public:
	class FName                                   MaskName;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function MLDeformerFrameworkEditor.MLDeformerTrainingModel.GetTrainingInputAnimMasks
// 0x0010 (0x0010 - 0x0000)
struct MLDeformerTrainingModel_GetTrainingInputAnimMasks final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function MLDeformerFrameworkEditor.MLDeformerTrainingModel.NumSamples
// 0x0004 (0x0004 - 0x0000)
struct MLDeformerTrainingModel_NumSamples final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

