#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModelViewViewModelBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ModelViewViewModel_structs.hpp"


namespace SDK
{

// Enum ModelViewViewModelBlueprint.EFilterFlag
// NumValues: 0x0003
enum class EFilterFlag : uint8
{
	None                                     = 0,
	All                                      = 1,
	EFilterFlag_MAX                          = 2,
};

// Enum ModelViewViewModelBlueprint.EMVVMDeveloperConversionFunctionFilterType
// NumValues: 0x0003
enum class EMVVMDeveloperConversionFunctionFilterType : uint8
{
	BlueprintActionRegistry                  = 0,
	AllowedList                              = 1,
	EMVVMDeveloperConversionFunctionFilterType_MAX = 2,
};

// Enum ModelViewViewModelBlueprint.EMVVMBlueprintFunctionReferenceType
// NumValues: 0x0004
enum class EMVVMBlueprintFunctionReferenceType : uint8
{
	None                                     = 0,
	Function                                 = 1,
	Node                                     = 2,
	EMVVMBlueprintFunctionReferenceType_MAX  = 3,
};

// Enum ModelViewViewModelBlueprint.EMVVMBlueprintPinStatus
// NumValues: 0x0003
enum class EMVVMBlueprintPinStatus : uint8
{
	Valid                                    = 0,
	Orphaned                                 = 1,
	EMVVMBlueprintPinStatus_MAX              = 2,
};

// Enum ModelViewViewModelBlueprint.EMVVMBlueprintViewModelContextCreationType
// NumValues: 0x0006
enum class EMVVMBlueprintViewModelContextCreationType : uint8
{
	Manual                                   = 0,
	CreateInstance                           = 1,
	GlobalViewModelCollection                = 2,
	PropertyPath                             = 3,
	Resolver                                 = 4,
	EMVVMBlueprintViewModelContextCreationType_MAX = 5,
};

// Enum ModelViewViewModelBlueprint.EMVVMBlueprintFieldPathSource
// NumValues: 0x0005
enum class EMVVMBlueprintFieldPathSource : uint8
{
	None                                     = 0,
	Widget                                   = 1,
	ViewModel                                = 2,
	SelfContext                              = 3,
	EMVVMBlueprintFieldPathSource_MAX        = 4,
};

// ScriptStruct ModelViewViewModelBlueprint.MVVMDeveloperProjectWidgetSettings
// 0x00A0 (0x00A0 - 0x0000)
struct FMVVMDeveloperProjectWidgetSettings final
{
public:
	TSet<class FName>                             DisallowedFieldNames;                              // 0x0000(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	TSet<class FName>                             AdvancedFieldNames;                                // 0x0050(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
};

// ScriptStruct ModelViewViewModelBlueprint.MVVMViewBindingFilterSettings
// 0x0001 (0x0001 - 0x0000)
struct FMVVMViewBindingFilterSettings final
{
public:
	EFilterFlag                                   FilterFlags;                                       // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ModelViewViewModelBlueprint.MVVMBlueprintFunctionReference
// 0x0048 (0x0048 - 0x0000)
struct FMVVMBlueprintFunctionReference final
{
public:
	struct FMemberReference                       FunctionReference;                                 // 0x0000(0x0038)(Edit, EditConst, NativeAccessSpecifierPrivate)
	TSubclassOf<class UK2Node>                    Node;                                              // 0x0038(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMVVMBlueprintFunctionReferenceType           Type;                                              // 0x0040(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ModelViewViewModelBlueprint.MVVMBlueprintPinId
// 0x0010 (0x0010 - 0x0000)
struct FMVVMBlueprintPinId final
{
public:
	TArray<class FName>                           PinNames;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
};

// ScriptStruct ModelViewViewModelBlueprint.MVVMBlueprintFieldPath
// 0x0040 (0x0040 - 0x0000)
struct FMVVMBlueprintFieldPath final
{
public:
	struct FMemberReference                       BindingReference;                                  // 0x0000(0x0038)(Edit, NativeAccessSpecifierPrivate)
	EBindingKind                                  BindingKind;                                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ModelViewViewModelBlueprint.MVVMBlueprintPropertyPath
// 0x0070 (0x0070 - 0x0000)
struct FMVVMBlueprintPropertyPath final
{
public:
	TArray<struct FMVVMBlueprintFieldPath>        Paths;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	class FName                                   WidgetName;                                        // 0x0010(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  ContextId;                                         // 0x001C(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMVVMBlueprintFieldPathSource                 Source;                                            // 0x002C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMemberReference                       BindingReference;                                  // 0x0030(0x0038)(Deprecated, EditorOnly, NativeAccessSpecifierPrivate)
	EBindingKind                                  BindingKind;                                       // 0x0068(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDeprecatedSource;                                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ModelViewViewModelBlueprint.MVVMBlueprintPin
// 0x00C8 (0x00C8 - 0x0000)
struct FMVVMBlueprintPin final
{
public:
	struct FMVVMBlueprintPinId                    Id;                                                // 0x0000(0x0010)(Edit, EditConst, NativeAccessSpecifierPrivate)
	struct FMVVMBlueprintPropertyPath             Path;                                              // 0x0010(0x0070)(Edit, EditConst, NativeAccessSpecifierPrivate)
	class FString                                 DefaultString;                                     // 0x0080(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                   DefaultText;                                       // 0x0090(0x0010)(Edit, EditConst, NativeAccessSpecifierPrivate)
	class UObject*                                DefaultObject;                                     // 0x00A0(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSplit;                                            // 0x00A8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMVVMBlueprintPinStatus                       Status;                                            // 0x00A9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PinName;                                           // 0x00AC(0x000C)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  PinId;                                             // 0x00B8(0x0010)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct ModelViewViewModelBlueprint.MVVMBlueprintViewConversionPath
// 0x00A0 (0x00A0 - 0x0000)
struct FMVVMBlueprintViewConversionPath final
{
public:
	struct FMemberReference                       DestinationToSourceFunction;                       // 0x0000(0x0038)(Deprecated, NativeAccessSpecifierPublic)
	class FName                                   DestinationToSourceWrapper;                        // 0x0038(0x000C)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMemberReference                       SourceToDestinationFunction;                       // 0x0048(0x0038)(Deprecated, NativeAccessSpecifierPublic)
	class FName                                   SourceToDestinationWrapper;                        // 0x0080(0x000C)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMVVMBlueprintViewConversionFunction*   DestinationToSourceConversion;                     // 0x0090(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMBlueprintViewConversionFunction*   SourceToDestinationConversion;                     // 0x0098(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ModelViewViewModelBlueprint.MVVMBlueprintViewBinding
// 0x01A0 (0x01A0 - 0x0000)
struct FMVVMBlueprintViewBinding final
{
public:
	struct FMVVMBlueprintPropertyPath             SourcePath;                                        // 0x0000(0x0070)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FMVVMBlueprintPropertyPath             DestinationPath;                                   // 0x0070(0x0070)(Edit, EditConst, NativeAccessSpecifierPublic)
	EMVVMBindingMode                              BindingType;                                       // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideExecutionMode;                            // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMVVMExecutionMode                            OverrideExecutionMode;                             // 0x00E2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMVVMBlueprintViewConversionPath       Conversion;                                        // 0x00E8(0x00A0)(Edit, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGuid                                  BindingId;                                         // 0x0188(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0198(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCompile;                                          // 0x0199(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ModelViewViewModelBlueprint.MVVMBlueprintViewModelContext
// 0x0080 (0x0080 - 0x0000)
struct FMVVMBlueprintViewModelContext final
{
public:
	struct FGuid                                  ViewModelContextId;                                // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UObject>                    NotifyFieldValueClass;                             // 0x0010(0x0008)(Edit, ZeroConstructor, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMVVMViewModelBase>         ViewModelClass;                                    // 0x0018(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   OverrideDisplayName;                               // 0x0020(0x0010)(Deprecated, NativeAccessSpecifierPublic)
	class FName                                   ViewModelName;                                     // 0x0030(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMVVMBlueprintViewModelContextCreationType    CreationType;                                      // 0x003C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   GlobalViewModelIdentifier;                         // 0x0040(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ViewModelPropertyPath;                             // 0x0050(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMViewModelContextResolver*          Resolver;                                          // 0x0060(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMBlueprintInstancedViewModelBase*   InstancedViewModel;                                // 0x0068(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateSetterFunction;                             // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateGetterFunction;                             // 0x0071(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOptional;                                         // 0x0072(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExposeInstanceInEditor;                           // 0x0073(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGlobalViewModelCollectionUpdate;                  // 0x0074(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideForceExecuteBindingsOnSetSource;          // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceExecuteBindingsOnSetSource;                  // 0x0076(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanRename;                                        // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEdit;                                          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanRemove;                                        // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateSetterFunction_Deprecation;                 // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ModelViewViewModelBlueprint.MVVMExtensionItem
// 0x0028 (0x0028 - 0x0000)
struct FMVVMExtensionItem final
{
public:
	class FName                                   WidgetName;                                        // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ViewmodelId;                                       // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMVVMBlueprintViewExtension*            ExtensionObj;                                      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

