#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModelViewViewModelBlueprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMGEditor_classes.hpp"
#include "BlueprintGraph_classes.hpp"
#include "ModelViewViewModelBlueprint_structs.hpp"
#include "ModelViewViewModel_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ModelViewViewModelBlueprint.MVVMBlueprintViewExtension
// 0x0000 (0x0030 - 0x0030)
class UMVVMBlueprintViewExtension : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMBlueprintViewExtension">();
	}
	static class UMVVMBlueprintViewExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMBlueprintViewExtension>();
	}
};

// Class ModelViewViewModelBlueprint.MVVMConversionFunctionGraphSchema
// 0x0000 (0x0040 - 0x0040)
class UMVVMConversionFunctionGraphSchema final : public UEdGraphSchema_K2
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMConversionFunctionGraphSchema">();
	}
	static class UMVVMConversionFunctionGraphSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMConversionFunctionGraphSchema>();
	}
};

// Class ModelViewViewModelBlueprint.MVVMDeveloperProjectSettings
// 0x02C8 (0x0328 - 0x0060)
class UMVVMDeveloperProjectSettings final : public UDeveloperSettings
{
public:
	TMap<struct FSoftClassPath, struct FMVVMDeveloperProjectWidgetSettings> FieldSelectorPermissions;                          // 0x0060(0x0050)(Edit, Config, NativeAccessSpecifierPrivate)
	TSet<EMVVMExecutionMode>                      AllowedExecutionMode;                              // 0x00B0(0x0050)(Edit, Config, NativeAccessSpecifierPrivate)
	TSet<EMVVMBlueprintViewModelContextCreationType> AllowedContextCreationType;                        // 0x0100(0x0050)(Edit, Config, NativeAccessSpecifierPrivate)
	bool                                          bAllowBindingFromDetailView;                       // 0x0150(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowGeneratedViewModelSetter;                    // 0x0151(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowLongSourcePath;                              // 0x0152(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDetailViewOptionInBindingPanel;               // 0x0153(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowViewSettings;                                 // 0x0154(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDeveloperGenerateGraphSettings;               // 0x0155(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowConversionFunctionGeneratedGraphInEditor;    // 0x0156(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowBindingEvent;                                // 0x0157(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanCreateViewModelInView;                         // 0x0158(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExposeViewModelInstanceInEditor;                  // 0x0159(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMVVMDeveloperConversionFunctionFilterType    ConversionFunctionFilter;                          // 0x015A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15B[0x5];                                      // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FSoftClassPath>                   AllowedClassForConversionFunctions;                // 0x0160(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	TSet<struct FSoftClassPath>                   DeniedClassForConversionFunctions;                 // 0x01B0(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	TSet<class FName>                             DeniedModuleForConversionFunctions;                // 0x0200(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	bool                                          bForceExecuteBindingsOnSetSource;                  // 0x0250(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMVVMViewBindingFilterSettings         FilterSettings;                                    // 0x0251(0x0001)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_252[0x6];                                      // 0x0252(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<TSoftClassPtr<class UClass>>             SupportedPanelClassesForExtension;                 // 0x0258(0x0050)(Edit, Config, UObjectWrapper, NativeAccessSpecifierPublic)
	TSet<TSoftClassPtr<class UClass>>             SupportedListViewBaseClassesForExtension;          // 0x02A8(0x0050)(Edit, Config, UObjectWrapper, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   DefaultResolverValue;                              // 0x02F8(0x0030)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMDeveloperProjectSettings">();
	}
	static class UMVVMDeveloperProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMDeveloperProjectSettings>();
	}
};

// Class ModelViewViewModelBlueprint.MVVMK2Node_AreSourcesValidForEvent
// 0x0008 (0x00C8 - 0x00C0)
class UMVVMK2Node_AreSourcesValidForEvent final : public UK2Node
{
public:
	struct FMVVMViewClass_EventKey                EventKey;                                          // 0x00C0(0x0004)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMK2Node_AreSourcesValidForEvent">();
	}
	static class UMVVMK2Node_AreSourcesValidForEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMK2Node_AreSourcesValidForEvent>();
	}
};

// Class ModelViewViewModelBlueprint.MVVMBlueprintViewExtension_ListViewBase
// 0x0020 (0x0050 - 0x0030)
class UMVVMBlueprintViewExtension_ListViewBase final : public UMVVMBlueprintViewExtension
{
public:
	class FName                                   WidgetName;                                        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  EntryViewModelId;                                  // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMBlueprintViewExtension_ListViewBase">();
	}
	static class UMVVMBlueprintViewExtension_ListViewBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMBlueprintViewExtension_ListViewBase>();
	}
};

// Class ModelViewViewModelBlueprint.MVVMBlueprintViewExtension_PanelWidget
// 0x0050 (0x0080 - 0x0030)
class UMVVMBlueprintViewExtension_PanelWidget final : public UMVVMBlueprintViewExtension
{
public:
	class FName                                   WidgetName;                                        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  EntryViewModelId;                                  // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidget>                EntryWidgetClass;                                  // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelSlot*                             SlotObj;                                           // 0x0058(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumDesignerPreviewEntries;                         // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   PanelPropertyName;                                 // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMVVMViewPanelWidgetClassExtension*     ExtensionObj;                                      // 0x0070(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMBlueprintViewExtension_PanelWidget">();
	}
	static class UMVVMBlueprintViewExtension_PanelWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMBlueprintViewExtension_PanelWidget>();
	}
};

// Class ModelViewViewModelBlueprint.MVVMWidgetBlueprintExtension_View
// 0x00A0 (0x00D0 - 0x0030)
class UMVVMWidgetBlueprintExtension_View final : public UWidgetBlueprintExtension
{
public:
	TMap<struct FGuid, TWeakObjectPtr<class UObject>> TemporaryViewModelInstances;                       // 0x0030(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	class UMVVMBlueprintView*                     BlueprintView;                                     // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMVVMViewBindingFilterSettings         FilterSettings;                                    // 0x0088(0x0001)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           GeneratedFunctions;                                // 0x0090(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A0[0x20];                                      // 0x00A0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMVVMExtensionItem>             BlueprintExtensions;                               // 0x00C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMWidgetBlueprintExtension_View">();
	}
	static class UMVVMWidgetBlueprintExtension_View* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMWidgetBlueprintExtension_View>();
	}
};

// Class ModelViewViewModelBlueprint.MVVMBlueprintView
// 0x0110 (0x0140 - 0x0030)
class UMVVMBlueprintView final : public UObject
{
public:
	uint8                                         Pad_30[0x60];                                      // 0x0030(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEdGraph*>                       TemporaryGraph;                                    // 0x0090(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	class UMVVMBlueprintViewSettings*             Settings;                                          // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FMVVMBlueprintViewBinding>      Bindings;                                          // 0x00A8(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UMVVMBlueprintViewEvent*>        Events;                                            // 0x00B8(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FMVVMBlueprintViewModelContext> AvailableViewModels;                               // 0x00C8(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FGuid                                  CompiledBindingLibraryId;                          // 0x00D8(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x58];                                      // 0x00E8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMBlueprintView">();
	}
	static class UMVVMBlueprintView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMBlueprintView>();
	}
};

// Class ModelViewViewModelBlueprint.MVVMBlueprintInstancedViewModelBase
// 0x0018 (0x0048 - 0x0030)
class UMVVMBlueprintInstancedViewModelBase : public UObject
{
public:
	TSubclassOf<class UObject>                    ParentClass;                                       // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    GeneratedClass;                                    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMVVMInstancedViewModelGeneratedClass> GeneratedClassType;                                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMBlueprintInstancedViewModelBase">();
	}
	static class UMVVMBlueprintInstancedViewModelBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMBlueprintInstancedViewModelBase>();
	}
};

// Class ModelViewViewModelBlueprint.MVVMBlueprintInstancedViewModel_PropertyBag
// 0x0068 (0x00B0 - 0x0048)
class UMVVMBlueprintInstancedViewModel_PropertyBag final : public UMVVMBlueprintInstancedViewModelBase
{
public:
	struct FInstancedPropertyBag                  Variables;                                         // 0x0048(0x0010)(Edit, NativeAccessSpecifierPrivate)
	uint64                                        PropertiesHash;                                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x50];                                      // 0x0060(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMBlueprintInstancedViewModel_PropertyBag">();
	}
	static class UMVVMBlueprintInstancedViewModel_PropertyBag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMBlueprintInstancedViewModel_PropertyBag>();
	}
};

// Class ModelViewViewModelBlueprint.MVVMBlueprintViewSettings
// 0x0008 (0x0038 - 0x0030)
class UMVVMBlueprintViewSettings final : public UObject
{
public:
	bool                                          bInitializeSourcesOnConstruct;                     // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitializeBindingsOnConstruct;                    // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitializeEventsOnConstruct;                      // 0x0032(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMBlueprintViewSettings">();
	}
	static class UMVVMBlueprintViewSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMBlueprintViewSettings>();
	}
};

// Class ModelViewViewModelBlueprint.MVVMBlueprintViewConversionFunction
// 0x00F0 (0x0120 - 0x0030)
class UMVVMBlueprintViewConversionFunction final : public UObject
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMVVMBlueprintFunctionReference        ConversionFunction;                                // 0x0048(0x0048)(Edit, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   GraphName;                                         // 0x0090(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMVVMBlueprintPin>              SavedPins;                                         // 0x00A0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	bool                                          bWrapperGraphTransient;                            // 0x00B0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEdGraph*                               CachedWrapperGraph;                                // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK2Node*                                CachedWrapperNode;                                 // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x18];                                      // 0x00C8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMemberReference                       FunctionReference;                                 // 0x00E0(0x0038)(Deprecated, NativeAccessSpecifierPrivate)
	TSubclassOf<class UK2Node>                    FunctionNode;                                      // 0x0118(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMBlueprintViewConversionFunction">();
	}
	static class UMVVMBlueprintViewConversionFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMBlueprintViewConversionFunction>();
	}
};

// Class ModelViewViewModelBlueprint.MVVMBlueprintViewEvent
// 0x0160 (0x0190 - 0x0030)
class UMVVMBlueprintViewEvent final : public UObject
{
public:
	bool                                          bEnabled;                                          // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCompile;                                          // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x1E];                                      // 0x0032(0x001E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMVVMBlueprintPropertyPath             EventPath;                                         // 0x0050(0x0070)(Edit, EditConst, NativeAccessSpecifierPrivate)
	struct FMVVMBlueprintPropertyPath             DestinationPath;                                   // 0x00C0(0x0070)(Edit, EditConst, NativeAccessSpecifierPrivate)
	TArray<struct FMVVMBlueprintPin>              SavedPins;                                         // 0x0130(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	class FName                                   GraphName;                                         // 0x0140(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMVVMViewClass_EventKey                EventKey;                                          // 0x014C(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_150[0x18];                                     // 0x0150(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UEdGraph*                               CachedWrapperGraph;                                // 0x0168(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UK2Node*                                CachedWrapperNode;                                 // 0x0170(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMVVMK2Node_AreSourcesValidForEvent*    CachedSourceValidNode;                             // 0x0178(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_180[0x10];                                     // 0x0180(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMBlueprintViewEvent">();
	}
	static class UMVVMBlueprintViewEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMBlueprintViewEvent>();
	}
};

// Class ModelViewViewModelBlueprint.MVVMBlueprintViewModel
// 0x0000 (0x0030 - 0x0030)
class UMVVMBlueprintViewModel final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMBlueprintViewModel">();
	}
	static class UMVVMBlueprintViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMBlueprintViewModel>();
	}
};

// Class ModelViewViewModelBlueprint.MVVMViewModelBlueprint
// 0x0000 (0x0560 - 0x0560)
class UMVVMViewModelBlueprint final : public UBlueprint
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMViewModelBlueprint">();
	}
	static class UMVVMViewModelBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMViewModelBlueprint>();
	}
};

}

