#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModelingToolsEditorMode

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "WidgetRegistration_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "EditorConfig_classes.hpp"
#include "UnrealEd_classes.hpp"
#include "ModelingToolsEditorMode_structs.hpp"


namespace SDK
{

// Class ModelingToolsEditorMode.ModelingSelectionInteraction
// 0x0220 (0x0250 - 0x0030)
class alignas(0x10) UModelingSelectionInteraction final : public UObject
{
public:
	uint8                                         Pad_30[0x48];                                      // 0x0030(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class USingleClickOrDragInputBehavior*        ClickOrDragBehavior;                               // 0x0078(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMouseHoverBehavior*                    HoverBehavior;                                     // 0x0080(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputBehaviorSet*                      BehaviorSet;                                       // 0x0088(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_90[0x88];                                      // 0x0090(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometrySelectionManager*              SelectionManager;                                  // 0x0118(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTransformProxy*                        TransformProxy;                                    // 0x0128(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCombinedTransformGizmo*                TransformGizmo;                                    // 0x0130(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDragAlignmentInteraction*              DragAlignmentInteraction;                          // 0x0138(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UKeyAsModifierInputBehavior*            DragAlignmentToggleBehavior;                       // 0x0140(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_148[0xF8];                                     // 0x0148(0x00F8)(Fixing Size After Last Property [ Dumper-7 ])
	class URectangleMarqueeInteraction*           RectangleMarqueeInteraction;                       // 0x0240(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPathSelectionInteraction*              PathSelectionInteraction;                          // 0x0248(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModelingSelectionInteraction">();
	}
	static class UModelingSelectionInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModelingSelectionInteraction>();
	}
};

// Class ModelingToolsEditorMode.PathSelectionInteraction
// 0x0010 (0x0040 - 0x0030)
class UPathSelectionInteraction final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UModelingSelectionInteraction> SelectionInteraction;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PathSelectionInteraction">();
	}
	static class UPathSelectionInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPathSelectionInteraction>();
	}
};

// Class ModelingToolsEditorMode.ModelingModeEditableToolPaletteConfig
// 0x0058 (0x0088 - 0x0030)
class UModelingModeEditableToolPaletteConfig final : public UEditorConfigBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FEditableToolPaletteSettings> EditableToolPalettes;                              // 0x0038(0x0050)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModelingModeEditableToolPaletteConfig">();
	}
	static class UModelingModeEditableToolPaletteConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModelingModeEditableToolPaletteConfig>();
	}
};

// Class ModelingToolsEditorMode.ModelingToolsHostCustomizationAPI
// 0x0018 (0x0048 - 0x0030)
class UModelingToolsHostCustomizationAPI final : public UObject
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModelingToolsHostCustomizationAPI">();
	}
	static class UModelingToolsHostCustomizationAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModelingToolsHostCustomizationAPI>();
	}
};

// Class ModelingToolsEditorMode.ModelingToolsEditorMode
// 0x0090 (0x01E0 - 0x0150)
class UModelingToolsEditorMode final : public UBaseLegacyWidgetEdMode
{
public:
	uint8                                         Pad_150[0x8];                                      // 0x0150(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableVolumeElementSelection;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableStaticMeshElementSelection;                 // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15A[0x46];                                     // 0x015A(0x0046)(Fixing Size After Last Property [ Dumper-7 ])
	class UModelingSceneSnappingManager*          SceneSnappingManager;                              // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGeometrySelectionManager*              SelectionManager;                                  // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModelingSelectionInteraction*          SelectionInteraction;                              // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B8[0x18];                                     // 0x01B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInteractiveCommand*>            ModelingModeCommands;                              // 0x01D0(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModelingToolsEditorMode">();
	}
	static class UModelingToolsEditorMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModelingToolsEditorMode>();
	}
};

// Class ModelingToolsEditorMode.ModelingToolsEditorModeSettings
// 0x0070 (0x00D0 - 0x0060)
class UModelingToolsEditorModeSettings final : public UDeveloperSettings
{
public:
	bool                                          bEnableDynamicMeshActors;                          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EModelingModeAssetGenerationLocation          AssetGenerationLocation;                           // 0x0064(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EModelingModeAssetGenerationBehavior          AssetGenerationMode;                               // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EModelingModeDefaultMeshObjectType            DefaultMeshObjectType;                             // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AutoGeneratedAssetPath;                            // 0x0070(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStoreUnsavedLevelAssetsInTopLevelGameFolder;      // 0x0080(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsePerUserAutogenSubfolder;                       // 0x0081(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AutogenSubfolderUserNameOverride;                  // 0x0088(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAppendRandomStringToName;                         // 0x0098(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRespectLevelEditorGizmoMode;                      // 0x0099(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnablePersistentSelections;                       // 0x009A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMeshSelections;                             // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x1C];                                      // 0x009C(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RestrictiveModeAutoGeneratedAssetPath;             // 0x00B8(0x0010)(ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0x1];                                       // 0x00C8(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableAbsoluteWorldSnapping;                      // 0x00C9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModelingToolsEditorModeSettings">();
	}
	static class UModelingToolsEditorModeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModelingToolsEditorModeSettings>();
	}
};

// Class ModelingToolsEditorMode.ModelingToolsModeCustomizationSettings
// 0x00B0 (0x0110 - 0x0060)
class UModelingToolsModeCustomizationSettings final : public UDeveloperSettings
{
public:
	bool                                          bUseLegacyModelingPalette;                         // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ToolSectionOrder;                                  // 0x0068(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x10];                                      // 0x0078(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FModelingModeCustomSectionColor> SectionColors;                                     // 0x0088(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FModelingModeCustomToolColor>   ToolColors;                                        // 0x0098(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FModelingModeAssetCollectionSet> BrushAlphaSets;                                    // 0x00A8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bShowCategoryButtonLabels;                         // 0x00B8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlwaysShowToolButtons;                            // 0x00B9(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           UnselectedColor;                                   // 0x00BC(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           HoverOverSelectedColor;                            // 0x00CC(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           HoverOverUnselectedColor;                          // 0x00DC(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GeometrySelectedColor;                             // 0x00EC(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastMeshSelectionDragMode;                         // 0x00FC(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastMeshSelectionLocalFrameMode;                   // 0x0100(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastMeshSelectionElementType;                      // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastMeshSelectionTopologyMode;                     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLastMeshSelectionVolumeToggle;                    // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLastMeshSelectionStaticMeshToggle;                // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModelingToolsModeCustomizationSettings">();
	}
	static class UModelingToolsModeCustomizationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModelingToolsModeCustomizationSettings>();
	}
};

}

