#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModelViewViewModelEditor

#include "Basic.hpp"

#include "ModelViewViewModelBlueprint_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ModelViewViewModel_classes.hpp"
#include "EditorSubsystem_classes.hpp"
#include "ModelViewViewModelEditor_structs.hpp"


namespace SDK
{

// Class ModelViewViewModelEditor.MVVMBlueprintViewModelContextWrapper
// 0x0098 (0x00C8 - 0x0030)
class UMVVMBlueprintViewModelContextWrapper final : public UObject
{
public:
	struct FMVVMBlueprintViewModelContext         Wrapper;                                           // 0x0030(0x0080)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x18];                                      // 0x00B0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMBlueprintViewModelContextWrapper">();
	}
	static class UMVVMBlueprintViewModelContextWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMBlueprintViewModelContextWrapper>();
	}
};

// Class ModelViewViewModelEditor.MVVMViewModelPanelToolMenuContext
// 0x0010 (0x0040 - 0x0030)
class UMVVMViewModelPanelToolMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMViewModelPanelToolMenuContext">();
	}
	static class UMVVMViewModelPanelToolMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMViewModelPanelToolMenuContext>();
	}
};

// Class ModelViewViewModelEditor.MVVMEditorSubsystem
// 0x0008 (0x0040 - 0x0038)
class UMVVMEditorSubsystem final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FMVVMBlueprintViewBinding AddBinding(class UWidgetBlueprint* WidgetBlueprint);
	class UMVVMBlueprintViewEvent* AddEvent(class UWidgetBlueprint* WidgetBlueprint);
	struct FGuid AddInstancedViewModel(class UWidgetBlueprint* WidgetBlueprint);
	struct FGuid AddViewModel(class UWidgetBlueprint* WidgetBlueprint, const class UClass* ViewModel);
	TArray<struct FMVVMAvailableBinding> GetChildViewModels(TSubclassOf<class UObject> Class_0, TSubclassOf<class UObject> Accessor);
	void RemoveBinding(class UWidgetBlueprint* WidgetBlueprint, const struct FMVVMBlueprintViewBinding& Binding);
	void RemoveEvent(class UWidgetBlueprint* WidgetBlueprint, class UMVVMBlueprintViewEvent* Event);
	void RemoveViewModel(class UWidgetBlueprint* WidgetBlueprint, class FName ViewModel);
	bool RenameViewModel(class UWidgetBlueprint* WidgetBlueprint, class FName ViewModel, class FName NewViewModel, class FText* OutError);
	bool ReparentViewModel(class UWidgetBlueprint* WidgetBlueprint, class FName ViewModel, const class UClass* NewViewModel, class FText* OutError);
	bool VerifyViewModelRename(class UWidgetBlueprint* WidgetBlueprint, class FName ViewModel, class FName NewViewModel, class FText* OutError);

	TArray<class UFunction*> GetAvailableConversionFunctions(const class UWidgetBlueprint* WidgetBlueprint, const struct FMVVMBlueprintPropertyPath& Source, const struct FMVVMBlueprintPropertyPath& Destination) const;
	class UFunction* GetConversionFunction(const class UWidgetBlueprint* WidgetBlueprint, const struct FMVVMBlueprintViewBinding& Binding, bool bSourceToDestination) const;
	class UEdGraph* GetConversionFunctionGraph(const class UWidgetBlueprint* WidgetBlueprint, const struct FMVVMBlueprintViewBinding& Binding, bool bSourceToDestination) const;
	class UK2Node_CallFunction* GetConversionFunctionNode(const class UWidgetBlueprint* WidgetBlueprint, const struct FMVVMBlueprintViewBinding& Binding, bool bSourceToDestination) const;
	class UMVVMBlueprintView* GetView(const class UWidgetBlueprint* WidgetBlueprint) const;
	bool IsSimpleConversionFunction(const class UFunction* Function) const;
	bool IsValidConversionFunction(const class UWidgetBlueprint* WidgetBlueprint, const class UFunction* Function, const struct FMVVMBlueprintPropertyPath& Source, const struct FMVVMBlueprintPropertyPath& Destination) const;
	class UMVVMBlueprintView* RequestView(class UWidgetBlueprint* WidgetBlueprint) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMEditorSubsystem">();
	}
	static class UMVVMEditorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMEditorSubsystem>();
	}
};

// Class ModelViewViewModelEditor.MVVMViewModelBindingExecTest
// 0x0040 (0x0070 - 0x0030)
class UMVVMViewModelBindingExecTest final : public UObject
{
public:
	struct FMVVMBindingExecTextCounter            PropertyA;                                         // 0x0030(0x0004)(BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMVVMBindingExecTextCounter>    PropertyB;                                         // 0x0038(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         PropertyC;                                         // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 PropertyD;                                         // 0x0050(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         PropertyFloat;                                     // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PropertyFloatAccessor;                             // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        PropertyDouble;                                    // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static TArray<struct FMVVMBindingExecTextCounter> ConversionArrayIntToArrayStruct(const TArray<int32>& Values);
	static TArray<int32> ConversionArrayStructToArrayInt(const TArray<struct FMVVMBindingExecTextCounter>& Values);
	static struct FMVVMBindingExecTextCounter ConversionConstIntToStruct(const int32& Value);
	static int32 ConversionConstStructToInt(const struct FMVVMBindingExecTextCounter& Value);
	static float ConversionIncDouble(double Value);
	static float ConversionIncFloat(float Value);
	static struct FMVVMBindingExecTextCounter ConversionIntToStruct(int32 Value);
	static int32 ConversionStructToInt(const struct FMVVMBindingExecTextCounter& Value);

	void SetterA(const struct FMVVMBindingExecTextCounter& Value);
	void SetterB(const TArray<struct FMVVMBindingExecTextCounter>& Value);
	void SetterC(int32 Value);
	void SetterD(const TArray<int32>& Value);
	void SetterDouble(double Value);
	void SetterFloat(float Value);

	struct FMVVMBindingExecTextCounter GetterA() const;
	TArray<struct FMVVMBindingExecTextCounter> GetterB() const;
	int32 GetterC() const;
	TArray<int32> GetterD() const;
	double GetterDouble() const;
	float GetterFloat() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMViewModelBindingExecTest">();
	}
	static class UMVVMViewModelBindingExecTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMViewModelBindingExecTest>();
	}
};

// Class ModelViewViewModelEditor.MVVMViewModelBindingHelperTest
// 0x0030 (0x00A0 - 0x0070)
class UMVVMViewModelBindingHelperTest final : public UMVVMViewModelBase
{
public:
	int32                                         PropertyA;                                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PropertyB;                                         // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PropertyC;                                         // 0x0078(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PropertyD;                                         // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PropertyE;                                         // 0x0080(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PropertyI;                                         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PropertyJ;                                         // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PropertyK;                                         // 0x008C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PropertyL;                                         // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PropertyM;                                         // 0x0094(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PropertyX;                                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void FunctionConversionA();
	static int32 FunctionConversionB();
	static int32 FunctionConversionC(int32 Param1);
	static int32 FunctionConversionD(int32 Param1, int32 Param2);
	static void FunctionConversionE(int32 Param1);
	static void FunctionConversionF(int32 Param1, int32 Param2);
	static void FunctionConversionG(TArray<int32>* Param1, const TSet<int32>& Param2);
	static TArray<int32> FunctionConversionH(const TSet<int32>& Param1);
	static TArray<int32> FunctionConversionI(const TSet<int32>& Param1, TMap<int32, int32>* Param2);
	static TArray<int32> FunctionConversionJ(TSet<int32>* Param1, const TMap<int32, int32>& Param2);

	int32 FunctionGetB();
	void FunctionSetA(int32 Value);
	void FunctionSetB(int32 Value);
	int32 FunctionSetC(int32 Param1);
	void FunctionSetF(TArray<int32>* Param1);
	void FunctionSetG(const TArray<int32>& Param1);
	void FunctionSetH(TArray<int32>* Param1, const TArray<int32>& Param2);
	void FunctionSetProtected(int32 Value);
	void FunctionSetter(int32 Value);

	int32 FunctionGetA() const;
	int32 FunctionGetC() const;
	int32 FunctionGetD(int32 Param1) const;
	int32 FunctionGetE(int32 Param1, int32 Param2) const;
	TArray<int32> FunctionGetF() const;
	void FunctionGetG(TArray<int32>* Result) const;
	void FunctionGetH(const TArray<int32>& Result) const;
	TArray<int32> FunctionGetI(TArray<int32>* Result) const;
	void FunctionGetJ(TArray<int32>* Result, const TArray<int32>& Value) const;
	int32 FunctionGetProtected() const;
	int32 FunctionGetter() const;
	void FunctionSetD(int32 Param1) const;
	void FunctionSetE(int32 Param1, int32 Param2) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMViewModelBindingHelperTest">();
	}
	static class UMVVMViewModelBindingHelperTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMViewModelBindingHelperTest>();
	}
};

// Class ModelViewViewModelEditor.MVVMObjectFieldPathHelperTest
// 0x0170 (0x01A0 - 0x0030)
class UMVVMObjectFieldPathHelperTest : public UObject
{
public:
	int32                                         PropertyInt;                                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PropertyIntWithGetterSetter;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PropertyIntWithGetterSetterAndBP;                  // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PropertyIntWithBPGetterSetter;                     // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PropertyVector;                                    // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PropertyVectorWithGetterSetter;                    // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PropertyVectorWithGetterSetterAndBP;               // 0x0070(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PropertyVectorWithBPGetterSetter;                  // 0x0088(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMVVMStructFieldPathHelperTest         PropertyStruct;                                    // 0x00A0(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMVVMStructFieldPathHelperTest         PropertyStructWithGetterSetter;                    // 0x00D0(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMVVMStructFieldPathHelperTest         PropertyStructWithGetterSetterAndBP;               // 0x0100(0x0030)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FMVVMStructFieldPathHelperTest         PropertyStructWithBPGetterSetter;                  // 0x0130(0x0030)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class UMVVMObjectFieldPathHelperTest*         PropertyObject;                                    // 0x0160(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMObjectFieldPathHelperTest*         PropertyObjectWithGetterSetter;                    // 0x0168(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMObjectFieldPathHelperTest*         PropertyObjectWithGetterSetterAndBP;               // 0x0170(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMObjectFieldPathHelperTest*         PropertyObjectWithBPGetterSetter;                  // 0x0178(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMViewModelFieldPathHelperTest*      PropertyViewModel;                                 // 0x0180(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMViewModelFieldPathHelperTest*      PropertyViewModelWithGetterSetter;                 // 0x0188(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMViewModelFieldPathHelperTest*      PropertyViewModelWithGetterSetterAndBP;            // 0x0190(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMViewModelFieldPathHelperTest*      PropertyViewModelWithBPGetterSetter;               // 0x0198(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetPropertyInt(int32 Value);
	void SetPropertyIntWithBPGetterSetter(int32 Value);
	void SetPropertyIntWithGetterSetter(int32 Value);
	void SetPropertyIntWithGetterSetterAndBP(int32 Value);
	void SetPropertyObject(class UMVVMObjectFieldPathHelperTest* Value);
	void SetPropertyObjectWithBPGetterSetter(class UMVVMObjectFieldPathHelperTest* Value);
	void SetPropertyObjectWithGetterSetter(class UMVVMObjectFieldPathHelperTest* Value);
	void SetPropertyObjectWithGetterSetterAndBP(class UMVVMObjectFieldPathHelperTest* Value);
	void SetPropertyStruct(const struct FMVVMStructFieldPathHelperTest& Value);
	void SetPropertyStructWithBPGetterSetter(const struct FMVVMStructFieldPathHelperTest& Value);
	void SetPropertyStructWithGetterSetter(const struct FMVVMStructFieldPathHelperTest& Value);
	void SetPropertyStructWithGetterSetterAndBP(const struct FMVVMStructFieldPathHelperTest& Value);
	void SetPropertyVector(const struct FVector& Value);
	void SetPropertyVectorWithBPGetterSetter(const struct FVector& Value);
	void SetPropertyVectorWithGetterSetter(const struct FVector& Value);
	void SetPropertyVectorWithGetterSetterAndBP(const struct FVector& Value);
	void SetPropertyViewModel(class UMVVMViewModelFieldPathHelperTest* Value);
	void SetPropertyViewModelWithBPGetterSetter(class UMVVMViewModelFieldPathHelperTest* Value);
	void SetPropertyViewModelWithGetterSetter(class UMVVMViewModelFieldPathHelperTest* Value);
	void SetPropertyViewModelWithGetterSetterAndBP(class UMVVMViewModelFieldPathHelperTest* Value);

	int32 GetPropertyInt() const;
	int32 GetPropertyIntWithBPGetterSetter() const;
	int32 GetPropertyIntWithGetterSetter() const;
	int32 GetPropertyIntWithGetterSetterAndBP() const;
	class UMVVMObjectFieldPathHelperTest* GetPropertyObject() const;
	class UMVVMObjectFieldPathHelperTest* GetPropertyObjectWithBPGetterSetter() const;
	class UMVVMObjectFieldPathHelperTest* GetPropertyObjectWithGetterSetter() const;
	class UMVVMObjectFieldPathHelperTest* GetPropertyObjectWithGetterSetterAndBP() const;
	struct FMVVMStructFieldPathHelperTest GetPropertyStruct() const;
	struct FMVVMStructFieldPathHelperTest GetPropertyStructWithBPGetterSetter() const;
	struct FMVVMStructFieldPathHelperTest GetPropertyStructWithGetterSetter() const;
	struct FMVVMStructFieldPathHelperTest GetPropertyStructWithGetterSetterAndBP() const;
	struct FVector GetPropertyVector() const;
	struct FVector GetPropertyVectorWithBPGetterSetter() const;
	struct FVector GetPropertyVectorWithGetterSetter() const;
	struct FVector GetPropertyVectorWithGetterSetterAndBP() const;
	class UMVVMViewModelFieldPathHelperTest* GetPropertyViewModel() const;
	class UMVVMViewModelFieldPathHelperTest* GetPropertyViewModelWithBPGetterSetter() const;
	class UMVVMViewModelFieldPathHelperTest* GetPropertyViewModelWithGetterSetter() const;
	class UMVVMViewModelFieldPathHelperTest* GetPropertyViewModelWithGetterSetterAndBP() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMObjectFieldPathHelperTest">();
	}
	static class UMVVMObjectFieldPathHelperTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMObjectFieldPathHelperTest>();
	}
};

// Class ModelViewViewModelEditor.MVVMViewModelFieldPathHelperTestBase
// 0x0008 (0x01A8 - 0x01A0)
class UMVVMViewModelFieldPathHelperTestBase : public UMVVMObjectFieldPathHelperTest
{
public:
	uint8                                         Pad_1A0[0x8];                                      // 0x01A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMViewModelFieldPathHelperTestBase">();
	}
	static class UMVVMViewModelFieldPathHelperTestBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMViewModelFieldPathHelperTestBase>();
	}
};

// Class ModelViewViewModelEditor.MVVMViewModelFieldPathHelperTest
// 0x0060 (0x0208 - 0x01A8)
class UMVVMViewModelFieldPathHelperTest final : public UMVVMViewModelFieldPathHelperTestBase
{
public:
	int32                                         PropertyIntNotify;                                 // 0x01A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PropertyVectorNotify;                              // 0x01B0(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMVVMStructFieldPathHelperTest         PropertyStructNotify;                              // 0x01C8(0x0030)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class UMVVMObjectFieldPathHelperTest*         PropertyObjectNotify;                              // 0x01F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMViewModelFieldPathHelperTest*      PropertyViewModelNotify;                           // 0x0200(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetPropertyIntNotify(int32 Value);
	void SetPropertyObjectNotify(class UMVVMObjectFieldPathHelperTest* Value);
	void SetPropertyStructNotify(const struct FMVVMStructFieldPathHelperTest& Value);
	void SetPropertyVectorNotify(const struct FVector& Value);
	void SetPropertyViewModelNotify(class UMVVMViewModelFieldPathHelperTest* Value);

	int32 GetPropertyIntNotify() const;
	class UMVVMObjectFieldPathHelperTest* GetPropertyObjectNotify() const;
	struct FMVVMStructFieldPathHelperTest GetPropertyStructNotify() const;
	struct FVector GetPropertyVectorNotify() const;
	class UMVVMViewModelFieldPathHelperTest* GetPropertyViewModelNotify() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMViewModelFieldPathHelperTest">();
	}
	static class UMVVMViewModelFieldPathHelperTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMViewModelFieldPathHelperTest>();
	}
};

// Class ModelViewViewModelEditor.MVVMWidgetFieldPathHelperTest
// 0x01D0 (0x05E8 - 0x0418)
class UMVVMWidgetFieldPathHelperTest final : public UUserWidget
{
public:
	int32                                         PropertyInt;                                       // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PropertyIntWithGetterSetter;                       // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PropertyIntWithGetterSetterAndBP;                  // 0x0420(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PropertyIntWithBPGetterSetter;                     // 0x0424(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PropertyIntNotify;                                 // 0x0428(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PropertyVector;                                    // 0x0430(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PropertyVectorWithGetterSetter;                    // 0x0448(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PropertyVectorWithGetterSetterAndBP;               // 0x0460(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PropertyVectorWithBPGetterSetter;                  // 0x0478(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PropertyVectorNotify;                              // 0x0490(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMVVMStructFieldPathHelperTest         PropertyStruct;                                    // 0x04A8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMVVMStructFieldPathHelperTest         PropertyStructWithGetterSetter;                    // 0x04D8(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMVVMStructFieldPathHelperTest         PropertyStructWithGetterSetterAndBP;               // 0x0508(0x0030)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FMVVMStructFieldPathHelperTest         PropertyStructWithBPGetterSetter;                  // 0x0538(0x0030)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FMVVMStructFieldPathHelperTest         PropertyStructNotify;                              // 0x0568(0x0030)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class UMVVMObjectFieldPathHelperTest*         PropertyObject;                                    // 0x0598(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMObjectFieldPathHelperTest*         PropertyObjectWithGetterSetter;                    // 0x05A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMObjectFieldPathHelperTest*         PropertyObjectWithGetterSetterAndBP;               // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMObjectFieldPathHelperTest*         PropertyObjectWithBPGetterSetter;                  // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMObjectFieldPathHelperTest*         PropertyObjectNotify;                              // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMViewModelFieldPathHelperTest*      PropertyViewModel;                                 // 0x05C0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMViewModelFieldPathHelperTest*      PropertyViewModelWithGetterSetter;                 // 0x05C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMViewModelFieldPathHelperTest*      PropertyViewModelWithGetterSetterAndBP;            // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMViewModelFieldPathHelperTest*      PropertyViewModelWithBPGetterSetter;               // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMViewModelFieldPathHelperTest*      PropertyViewModelNotify;                           // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetPropertyInt(int32 Value);
	void SetPropertyIntNotify(int32 Value);
	void SetPropertyIntWithBPGetterSetter(int32 Value);
	void SetPropertyIntWithGetterSetter(int32 Value);
	void SetPropertyIntWithGetterSetterAndBP(int32 Value);
	void SetPropertyObject(class UMVVMObjectFieldPathHelperTest* Value);
	void SetPropertyObjectNotify(class UMVVMObjectFieldPathHelperTest* Value);
	void SetPropertyObjectWithBPGetterSetter(class UMVVMObjectFieldPathHelperTest* Value);
	void SetPropertyObjectWithGetterSetter(class UMVVMObjectFieldPathHelperTest* Value);
	void SetPropertyObjectWithGetterSetterAndBP(class UMVVMObjectFieldPathHelperTest* Value);
	void SetPropertyStruct(const struct FMVVMStructFieldPathHelperTest& Value);
	void SetPropertyStructNotify(const struct FMVVMStructFieldPathHelperTest& Value);
	void SetPropertyStructWithBPGetterSetter(const struct FMVVMStructFieldPathHelperTest& Value);
	void SetPropertyStructWithGetterSetter(const struct FMVVMStructFieldPathHelperTest& Value);
	void SetPropertyStructWithGetterSetterAndBP(const struct FMVVMStructFieldPathHelperTest& Value);
	void SetPropertyVector(const struct FVector& Value);
	void SetPropertyVectorNotify(const struct FVector& Value);
	void SetPropertyVectorWithBPGetterSetter(const struct FVector& Value);
	void SetPropertyVectorWithGetterSetter(const struct FVector& Value);
	void SetPropertyVectorWithGetterSetterAndBP(const struct FVector& Value);
	void SetPropertyViewModel(class UMVVMViewModelFieldPathHelperTest* Value);
	void SetPropertyViewModelNotify(class UMVVMViewModelFieldPathHelperTest* Value);
	void SetPropertyViewModelWithBPGetterSetter(class UMVVMViewModelFieldPathHelperTest* Value);
	void SetPropertyViewModelWithGetterSetter(class UMVVMViewModelFieldPathHelperTest* Value);
	void SetPropertyViewModelWithGetterSetterAndBP(class UMVVMViewModelFieldPathHelperTest* Value);

	int32 GetPropertyInt() const;
	int32 GetPropertyIntNotify() const;
	int32 GetPropertyIntWithBPGetterSetter() const;
	int32 GetPropertyIntWithGetterSetter() const;
	int32 GetPropertyIntWithGetterSetterAndBP() const;
	class UMVVMObjectFieldPathHelperTest* GetPropertyObject() const;
	class UMVVMObjectFieldPathHelperTest* GetPropertyObjectNotify() const;
	class UMVVMObjectFieldPathHelperTest* GetPropertyObjectWithBPGetterSetter() const;
	class UMVVMObjectFieldPathHelperTest* GetPropertyObjectWithGetterSetter() const;
	class UMVVMObjectFieldPathHelperTest* GetPropertyObjectWithGetterSetterAndBP() const;
	struct FMVVMStructFieldPathHelperTest GetPropertyStruct() const;
	struct FMVVMStructFieldPathHelperTest GetPropertyStructNotify() const;
	struct FMVVMStructFieldPathHelperTest GetPropertyStructWithBPGetterSetter() const;
	struct FMVVMStructFieldPathHelperTest GetPropertyStructWithGetterSetter() const;
	struct FMVVMStructFieldPathHelperTest GetPropertyStructWithGetterSetterAndBP() const;
	struct FVector GetPropertyVector() const;
	struct FVector GetPropertyVectorNotify() const;
	struct FVector GetPropertyVectorWithBPGetterSetter() const;
	struct FVector GetPropertyVectorWithGetterSetter() const;
	struct FVector GetPropertyVectorWithGetterSetterAndBP() const;
	class UMVVMViewModelFieldPathHelperTest* GetPropertyViewModel() const;
	class UMVVMViewModelFieldPathHelperTest* GetPropertyViewModelNotify() const;
	class UMVVMViewModelFieldPathHelperTest* GetPropertyViewModelWithBPGetterSetter() const;
	class UMVVMViewModelFieldPathHelperTest* GetPropertyViewModelWithGetterSetter() const;
	class UMVVMViewModelFieldPathHelperTest* GetPropertyViewModelWithGetterSetterAndBP() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMWidgetFieldPathHelperTest">();
	}
	static class UMVVMWidgetFieldPathHelperTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMWidgetFieldPathHelperTest>();
	}
};

// Class ModelViewViewModelEditor.MVVMFieldValueChangedTest
// 0x0008 (0x0078 - 0x0070)
class UMVVMFieldValueChangedTest final : public UMVVMViewModelBase
{
public:
	int32                                         PropertyInt;                                       // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PropertyFloat;                                     // 0x0074(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	float FunctionFloat() const;
	int32 FunctionInt() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MVVMFieldValueChangedTest">();
	}
	static class UMVVMFieldValueChangedTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMFieldValueChangedTest>();
	}
};

}

