#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModularGameplay

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum ModularGameplay.EGameFrameworkAddComponentFlags
// NumValues: 0x0005
enum class EGameFrameworkAddComponentFlags : uint8
{
	None                                     = 0,
	AddUnique                                = 1,
	AddIfNotChild                            = 2,
	UseAutoGeneratedName                     = 4,
	EGameFrameworkAddComponentFlags_MAX      = 5,
};

// ScriptStruct ModularGameplay.ActorInitStateChangedParams
// 0x0030 (0x0030 - 0x0000)
struct FActorInitStateChangedParams final
{
public:
	class AActor*                                 OwningActor;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FeatureName;                                       // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Implementer;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           FeatureState;                                      // 0x0020(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

