#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MoonFlaxWarBusRuntime

#include "Basic.hpp"

#include "MoonFlaxWarBusRuntime_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class MoonFlaxWarBusRuntime.MoonFlaxWarBusTurretAudioManager
// 0x00A0 (0x00D0 - 0x0030)
class UMoonFlaxWarBusTurretAudioManager final : public UObject
{
public:
	class AFortAthenaVehicle*                     VehicleOwner;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WeaponsMovementMinThreshold;                       // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WeaponsMovementMaxThreshold;                       // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMoonFlaxWarBusTurretState             FrontTurretState;                                  // 0x0040(0x0048)(NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FMoonFlaxWarBusTurretState             BackTurretState;                                   // 0x0088(0x0048)(NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	void Initialize(const struct FMoonFlaxWarBusTurretState& InFrontTurretState, const struct FMoonFlaxWarBusTurretState& InBackTurretState);
	void SetTurretAimDelta(struct FMoonFlaxWarBusTurretState* TurretState);
	void StartBackTurretUpdate(float TickRate, class UAudioComponent* InTurretAudioComponent);
	void StartFrontTurretUpdate(float TickRate, class UAudioComponent* InTurretAudioComponent);
	void StopBackTurretUpdate();
	void StopFrontTurretUpdate();
	void UpdateBackTurretAudio();
	void UpdateFrontTurretAudio();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoonFlaxWarBusTurretAudioManager">();
	}
	static class UMoonFlaxWarBusTurretAudioManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoonFlaxWarBusTurretAudioManager>();
	}
};

}

