#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MotherGameplayRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MotherGameplayRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class MotherGameplayRuntime.GravityGunTargetTrackingComponent
// 0x0240 (0x0318 - 0x00D8)
class UGravityGunTargetTrackingComponent final : public UActorComponent
{
public:
	struct FScalableFloat                         AllowLargeObjects;                                 // 0x00D8(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AllowMultipleGrabbers;                             // 0x0110(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AllowVehicles;                                     // 0x0148(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AllowPickups;                                      // 0x0180(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AllowProjectiles;                                  // 0x01B8(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AllowForay;                                        // 0x01F0(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AllowWhileInVehicle;                               // 0x0228(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                   GrabbedByGravityGunTagName;                        // 0x0260(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  InvalidTargetTags;                                 // 0x0270(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TargetIsPlayerTag;                                 // 0x0290(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TargetIsAlreadyGrabbedTag;                         // 0x02B0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TargetIsOwnVehicleTag;                             // 0x02D0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class AActor* NewTarget)> FoundTargetDelegate;                               // 0x02F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              DeactivateReticleDelegate;                         // 0x0300(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_310[0x8];                                      // 0x0310(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FindTargetActor(class AActor* OwningPlayer, const struct FVector& TraceStart, const struct FVector& TraceEnd);
	bool FindTargetProjectile(class AActor* OwningPlayer, const struct FVector& TraceStart, const struct FVector& TraceEnd, float TargetingRadius);
	bool IsValidTarget(class AActor* OwningPlayer, class AActor* PotentialTarget, struct FGameplayTagContainer* ReasonForFailure);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GravityGunTargetTrackingComponent">();
	}
	static class UGravityGunTargetTrackingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGravityGunTargetTrackingComponent>();
	}
};

// Class MotherGameplayRuntime.FortCabbageIglooVehicle
// 0x0000 (0x3090 - 0x3090)
class AFortCabbageIglooVehicle final : public AFortOctopusVehicle
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCabbageIglooVehicle">();
	}
	static class AFortCabbageIglooVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortCabbageIglooVehicle>();
	}
};

// Class MotherGameplayRuntime.FortBaseAnimInstance_CageSaddle
// 0x01A0 (0x0690 - 0x04F0)
class UFortBaseAnimInstance_CageSaddle final : public UFortBaseAnimInstance
{
public:
	class AFortSphericalVehicle*                  AsFortSphericalVehicle;                            // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOnGround;                                       // 0x04F8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RemappedPitch;                                     // 0x04FC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentRoll;                                       // 0x0500(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LockedRoll;                                        // 0x0504(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHeadShouldBend;                                   // 0x0508(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFootShouldBend;                                   // 0x0509(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50A[0x6];                                      // 0x050A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BodyGroundOffset;                                  // 0x0510(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MinClampPitchInRange;                              // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MinClampPitchOutRange;                             // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MaxClampPitchInRange;                              // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MaxClampPitchOutRange;                             // 0x0558(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeadAlphaInterpSpeed;                              // 0x0568(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56C[0x124];                                    // 0x056C(0x0124)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBaseAnimInstance_CageSaddle">();
	}
	static class UFortBaseAnimInstance_CageSaddle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBaseAnimInstance_CageSaddle>();
	}
};

// Class MotherGameplayRuntime.FortGameplayCueNotifyLoop_Goop
// 0x0050 (0x0BE8 - 0x0B98)
class AFortGameplayCueNotifyLoop_Goop final : public AFortGameplayCueNotify_Loop
{
public:
	class FName                                   SpeedParamName;                                    // 0x0B98(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IsFallingParamName;                                // 0x0BA4(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGoopAudioMapRangeClamped              SpeedMapRangeClamped;                              // 0x0BB0(0x0020)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         InterpSpeed;                                       // 0x0BD0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BD4[0x4];                                      // 0x0BD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        LoopingAudioComponent;                             // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BE0[0x8];                                      // 0x0BE0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayCueNotifyLoop_Goop">();
	}
	static class AFortGameplayCueNotifyLoop_Goop* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortGameplayCueNotifyLoop_Goop>();
	}
};

// Class MotherGameplayRuntime.PropGunFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class UPropGunFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ClearPropActivatedEventState(class AActor* ContextActor);
	static void ClearPropIndexEventState(class AActor* ContextActor);
	static void UpdatePropActivatedEventState(class AActor* ContextActor, const struct FPaddleGingerPropActivatedData& Payload);
	static void UpdatePropIndexEventState(class AActor* ContextActor, const struct FPaddleGingerPropData& Payload);
	static void UpdatePropPreviewPosition(class USceneComponent* PropPreviewComponent, const float DeltaTime, const class AFortPawn* AttachPawn, const class FName AttachSocket, const class USkeletalMeshComponent* WeaponMesh, const struct FVector& DesiredRelativeTransform, const float MinimumZOffset, const struct FRotator& RelativeRotation, const struct FVector& CachedScale, const float InterpSpeed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropGunFunctionLibrary">();
	}
	static class UPropGunFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropGunFunctionLibrary>();
	}
};

// Class MotherGameplayRuntime.ReactorGradeGameplayCue_ChargeUp
// 0x00A8 (0x0C40 - 0x0B98)
class AReactorGradeGameplayCue_ChargeUp final : public AFortGameplayCueNotify_Loop
{
public:
	class AFortPawn*                              Pawn;                                              // 0x0B98(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortWeaponFxComponent_ChargeAimLocation* CachedAimLocationComponent;                        // 0x0BA0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                FoundEndPoint;                                     // 0x0BA8(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinHitDistance;                                    // 0x0BC0(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HitObjectsLimit;                                   // 0x0BF8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_C30[0x4];                                      // 0x0C30(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	ECollisionChannel                             TraceChannel;                                      // 0x0C34(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C35[0xB];                                      // 0x0C35(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEndPointUpdated(const struct FVector& FoundPoint);
	void UpdateAimEndPoint();

	const struct FVector GetFoundEndPoint() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReactorGradeGameplayCue_ChargeUp">();
	}
	static class AReactorGradeGameplayCue_ChargeUp* GetDefaultObj()
	{
		return GetDefaultObjImpl<AReactorGradeGameplayCue_ChargeUp>();
	}
};

}

