#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieRenderPipelineEditor

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "UnrealEd_classes.hpp"
#include "FunctionalTesting_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MovieRenderPipelineCore_structs.hpp"
#include "MovieRenderPipelineCore_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "EditorSubsystem_classes.hpp"


namespace SDK
{

// Class MovieRenderPipelineEditor.AssetDefinition_MovieGraphConfig
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_MovieGraphConfig final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_MovieGraphConfig">();
	}
	static class UAssetDefinition_MovieGraphConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_MovieGraphConfig>();
	}
};

// Class MovieRenderPipelineEditor.AssetDefinition_PipelinePrimaryConfig
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_PipelinePrimaryConfig final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_PipelinePrimaryConfig">();
	}
	static class UAssetDefinition_PipelinePrimaryConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_PipelinePrimaryConfig>();
	}
};

// Class MovieRenderPipelineEditor.AssetDefinition_PipelineQueue
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_PipelineQueue final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_PipelineQueue">();
	}
	static class UAssetDefinition_PipelineQueue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_PipelineQueue>();
	}
};

// Class MovieRenderPipelineEditor.AssetDefinition_PipelineShotConfig
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_PipelineShotConfig final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_PipelineShotConfig">();
	}
	static class UAssetDefinition_PipelineShotConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_PipelineShotConfig>();
	}
};

// Class MovieRenderPipelineEditor.MoviePipelineEdGraph
// 0x0008 (0x00B8 - 0x00B0)
class UMoviePipelineEdGraph final : public UEdGraph
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineEdGraph">();
	}
	static class UMoviePipelineEdGraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineEdGraph>();
	}
};

// Class MovieRenderPipelineEditor.MoviePipelineEdGraphNodeBase
// 0x0038 (0x00F8 - 0x00C0)
class UMoviePipelineEdGraphNodeBase : public UEdGraphNode
{
public:
	class UMovieGraphNode*                        RuntimeNode;                                       // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        OriginGraph;                                       // 0x00D0(0x0028)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineEdGraphNodeBase">();
	}
	static class UMoviePipelineEdGraphNodeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineEdGraphNodeBase>();
	}
};

// Class MovieRenderPipelineEditor.MoviePipelineEdGraphNodeInput
// 0x0000 (0x00F8 - 0x00F8)
class UMoviePipelineEdGraphNodeInput final : public UMoviePipelineEdGraphNodeBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineEdGraphNodeInput">();
	}
	static class UMoviePipelineEdGraphNodeInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineEdGraphNodeInput>();
	}
};

// Class MovieRenderPipelineEditor.MoviePipelineEdGraphNode
// 0x0000 (0x00F8 - 0x00F8)
class UMoviePipelineEdGraphNode : public UMoviePipelineEdGraphNodeBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineEdGraphNode">();
	}
	static class UMoviePipelineEdGraphNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineEdGraphNode>();
	}
};

// Class MovieRenderPipelineEditor.MoviePipelineEdGraphNodeOutput
// 0x0000 (0x00F8 - 0x00F8)
class UMoviePipelineEdGraphNodeOutput final : public UMoviePipelineEdGraphNodeBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineEdGraphNodeOutput">();
	}
	static class UMoviePipelineEdGraphNodeOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineEdGraphNodeOutput>();
	}
};

// Class MovieRenderPipelineEditor.MoviePipelineEdGraphVariableNode
// 0x0000 (0x00F8 - 0x00F8)
class UMoviePipelineEdGraphVariableNode final : public UMoviePipelineEdGraphNodeBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineEdGraphVariableNode">();
	}
	static class UMoviePipelineEdGraphVariableNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineEdGraphVariableNode>();
	}
};

// Class MovieRenderPipelineEditor.DummyRenderLayerOnlyNode
// 0x0000 (0x00C0 - 0x00C0)
class UDummyRenderLayerOnlyNode final : public UMovieGraphSettingNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummyRenderLayerOnlyNode">();
	}
	static class UDummyRenderLayerOnlyNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDummyRenderLayerOnlyNode>();
	}
};

// Class MovieRenderPipelineEditor.MovieGraphSchema
// 0x0000 (0x0030 - 0x0030)
class UMovieGraphSchema final : public UEdGraphSchema
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphSchema">();
	}
	static class UMovieGraphSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphSchema>();
	}
};

// Class MovieRenderPipelineEditor.MoviePipelineEdGraphSubgraphNode
// 0x0000 (0x00F8 - 0x00F8)
class UMoviePipelineEdGraphSubgraphNode final : public UMoviePipelineEdGraphNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineEdGraphSubgraphNode">();
	}
	static class UMoviePipelineEdGraphSubgraphNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineEdGraphSubgraphNode>();
	}
};

// Class MovieRenderPipelineEditor.MoviePipelinePIEExecutorSettings
// 0x0008 (0x0068 - 0x0060)
class UMoviePipelinePIEExecutorSettings final : public UDeveloperSettings
{
public:
	int32                                         InitialDelayFrameCount;                            // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResizePIEWindowToOutputResolution;                // 0x0064(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelinePIEExecutorSettings">();
	}
	static class UMoviePipelinePIEExecutorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelinePIEExecutorSettings>();
	}
};

// Class MovieRenderPipelineEditor.MovieGraphConfigFactory
// 0x0008 (0x0090 - 0x0088)
class UMovieGraphConfigFactory final : public UFactory
{
public:
	class UMovieGraphConfig*                      InitialSubgraphAsset;                              // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphConfigFactory">();
	}
	static class UMovieGraphConfigFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphConfigFactory>();
	}
};

// Class MovieRenderPipelineEditor.MoviePipelineAssetEditor
// 0x0008 (0x0048 - 0x0040)
class UMoviePipelineAssetEditor final : public UAssetEditor
{
public:
	class UObject*                                ObjectToEdit;                                      // 0x0040(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineAssetEditor">();
	}
	static class UMoviePipelineAssetEditor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineAssetEditor>();
	}
};

// Class MovieRenderPipelineEditor.MoviePipelinePrimaryConfigFactory
// 0x0000 (0x0088 - 0x0088)
class UMoviePipelinePrimaryConfigFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelinePrimaryConfigFactory">();
	}
	static class UMoviePipelinePrimaryConfigFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelinePrimaryConfigFactory>();
	}
};

// Class MovieRenderPipelineEditor.MoviePipelineShotConfigFactory
// 0x0000 (0x0088 - 0x0088)
class UMoviePipelineShotConfigFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineShotConfigFactory">();
	}
	static class UMoviePipelineShotConfigFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineShotConfigFactory>();
	}
};

// Class MovieRenderPipelineEditor.MoviePipelineEditorBlueprintLibrary
// 0x0000 (0x0030 - 0x0030)
class UMoviePipelineEditorBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class FString ConvertManifestFileToString(const class FString& InManifestFilePath);
	static class UMoviePipelineExecutorJob* CreateJobFromSequence(class UMoviePipelineQueue* InPipelineQueue, const class ULevelSequence* InSequence);
	static void EnsureJobHasDefaultSettings(class UMoviePipelineExecutorJob* InJob);
	static bool ExportConfigToAsset(const class UMoviePipelinePrimaryConfig* InConfig, const class FString& InPackagePath, const class FString& InFileName, const bool bInSaveAsset, class UMoviePipelinePrimaryConfig** OutAsset, class FText* OutErrorReason);
	static bool GetDisplayOutputPathFromJob(class UMoviePipelineExecutorJob* InJob, class FString* OutOutputPath);
	static bool IsMapValidForRemoteRender(const TArray<class UMoviePipelineExecutorJob*>& InJobs);
	static class FString ResolveOutputDirectoryFromJob(class UMoviePipelineExecutorJob* InJob);
	static class UMoviePipelineQueue* SaveQueueToManifestFile(class UMoviePipelineQueue* InPipelineQueue, class FString* OutManifestFilePath);
	static void WarnUserOfUnsavedMap();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineEditorBlueprintLibrary">();
	}
	static class UMoviePipelineEditorBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineEditorBlueprintLibrary>();
	}
};

// Class MovieRenderPipelineEditor.MoviePipelineFunctionalTestBase
// 0x0018 (0x0580 - 0x0568)
class AMoviePipelineFunctionalTestBase final : public AFunctionalTest
{
public:
	class UMoviePipelineQueue*                    QueuePreset;                                       // 0x0568(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMoviePipeline*                         ActiveMoviePipeline;                               // 0x0570(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMoviePipelineQueue*                    ActiveQueue;                                       // 0x0578(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineFunctionalTestBase">();
	}
	static class AMoviePipelineFunctionalTestBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMoviePipelineFunctionalTestBase>();
	}
};

// Class MovieRenderPipelineEditor.MoviePipelineNewProcessExecutor
// 0x0008 (0x0128 - 0x0120)
class UMoviePipelineNewProcessExecutor final : public UMoviePipelineExecutorBase
{
public:
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineNewProcessExecutor">();
	}
	static class UMoviePipelineNewProcessExecutor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineNewProcessExecutor>();
	}
};

// Class MovieRenderPipelineEditor.MoviePipelinePIEExecutor
// 0x0128 (0x0270 - 0x0148)
class UMoviePipelinePIEExecutor final : public UMoviePipelineLinearExecutorBase
{
public:
	uint8                                         Pad_148[0x70];                                     // 0x0148(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UMoviePipelineExecutorJob* FinishedJob, bool bSuccess)> OnIndividualJobFinishedDelegate;                   // 0x01B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C8[0x18];                                     // 0x01C8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FMoviePipelineOutputData& Results)> OnIndividualJobWorkFinishedDelegate;               // 0x01E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(const struct FMoviePipelineOutputData& Results)> OnIndividualShotWorkFinishedDelegate;              // 0x01F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(class UMoviePipelineExecutorJob* StartedJob)> OnIndividualJobStartedDelegate;                    // 0x0200(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_210[0x60];                                     // 0x0210(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetInitializationTime(const struct FDateTime& InInitializationTime);
	void SetIsRenderingOffscreen(const bool bInRenderOffscreen);

	bool IsRenderingOffscreen() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelinePIEExecutor">();
	}
	static class UMoviePipelinePIEExecutor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelinePIEExecutor>();
	}
};

// Class MovieRenderPipelineEditor.MoviePipelineQueueSubsystem
// 0x0028 (0x0060 - 0x0038)
class UMoviePipelineQueueSubsystem final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UMoviePipelineExecutorBase*             ActiveExecutor;                                    // 0x0050(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMoviePipelineQueue*                    CurrentQueue;                                      // 0x0058(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	bool LoadQueue(class UMoviePipelineQueue* QueueToLoad, const bool bPromptOnReplacingDirtyQueue);
	class UMoviePipelineExecutorBase* RenderQueueWithExecutor(TSubclassOf<class UMoviePipelineExecutorBase> InExecutorType);
	void RenderQueueWithExecutorInstance(class UMoviePipelineExecutorBase* InExecutor);

	class UMoviePipelineExecutorBase* GetActiveExecutor() const;
	class UMoviePipelineQueue* GetQueue() const;
	bool IsQueueDirty() const;
	bool IsRendering() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineQueueSubsystem">();
	}
	static class UMoviePipelineQueueSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineQueueSubsystem>();
	}
};

// Class MovieRenderPipelineEditor.MovieRenderPipelineProjectSettings
// 0x0120 (0x0150 - 0x0030)
class UMovieRenderPipelineProjectSettings final : public UObject
{
public:
	struct FSoftClassPath                         DefaultPipeline;                                   // 0x0030(0x0028)(Edit, BlueprintVisible, ZeroConstructor, Config, NoClear, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         PresetSaveDir;                                     // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMoviePipelinePrimaryConfig> LastPresetOrigin;                                  // 0x0068(0x0030)(BlueprintVisible, Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         DefaultLocalExecutor;                              // 0x0098(0x0028)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         DefaultRemoteExecutor;                             // 0x00C0(0x0028)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         DefaultExecutorJob;                                // 0x00E8(0x0028)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMovieGraphConfig>       DefaultGraph;                                      // 0x0110(0x0030)(Edit, BlueprintVisible, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftClassPath>                 DefaultClasses;                                    // 0x0140(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieRenderPipelineProjectSettings">();
	}
	static class UMovieRenderPipelineProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieRenderPipelineProjectSettings>();
	}
};

}

