#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieSceneGameplayEventTrack

#include "Basic.hpp"

#include "MovieSceneGameplayEventTrack_structs.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class MovieSceneGameplayEventTrack.MovieSceneGameplayEventSection
// 0x0100 (0x0248 - 0x0148)
class UMovieSceneGameplayEventSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneGameplayEventChannel        EventChannel;                                      // 0x0150(0x00F8)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneGameplayEventSection">();
	}
	static class UMovieSceneGameplayEventSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneGameplayEventSection>();
	}
};

// Class MovieSceneGameplayEventTrack.MovieSceneGameplayEventSystem
// 0x0050 (0x0098 - 0x0048)
class UMovieSceneGameplayEventSystem final : public UMovieSceneEntitySystem
{
public:
	uint8                                         Pad_48[0x50];                                      // 0x0048(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneGameplayEventSystem">();
	}
	static class UMovieSceneGameplayEventSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneGameplayEventSystem>();
	}
};

// Class MovieSceneGameplayEventTrack.MovieSceneGameplayEventTrack
// 0x0020 (0x0110 - 0x00F0)
class UMovieSceneGameplayEventTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bFireEventsWhenForwards : 1;                       // 0x00F8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFireEventsWhenBackwards : 1;                      // 0x00F8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0100(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneGameplayEventTrack">();
	}
	static class UMovieSceneGameplayEventTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneGameplayEventTrack>();
	}
};

}

