#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieSceneTools

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum MovieSceneTools.EBakingKeySettings
// NumValues: 0x0003
enum class EBakingKeySettings : uint8
{
	KeysOnly                                 = 0,
	AllFrames                                = 1,
	EBakingKeySettings_MAX                   = 2,
};

// Enum MovieSceneTools.EMovieSceneToolsPropertyTrackType
// NumValues: 0x0003
enum class EMovieSceneToolsPropertyTrackType : uint32
{
	FloatTrack                               = 0,
	DoubleTrack                              = 1,
	EMovieSceneToolsPropertyTrackType_MAX    = 2,
};

// Enum MovieSceneTools.EThumbnailQuality
// NumValues: 0x0004
enum class EThumbnailQuality : uint8
{
	Draft                                    = 0,
	Normal                                   = 1,
	Best                                     = 2,
	EThumbnailQuality_MAX                    = 3,
};

// Enum MovieSceneTools.FControlRigChannelEnum
// NumValues: 0x0010
enum class EFControlRigChannelEnum : uint8
{
	Bool                                     = 0,
	Enum                                     = 1,
	Integer                                  = 2,
	Float                                    = 3,
	Vector2DX                                = 4,
	Vector2DY                                = 5,
	PositionX                                = 6,
	PositionY                                = 7,
	PositionZ                                = 8,
	RotatorX                                 = 9,
	RotatorY                                 = 10,
	RotatorZ                                 = 11,
	ScaleX                                   = 12,
	ScaleY                                   = 13,
	ScaleZ                                   = 14,
	FControlRigChannelEnum_MAX               = 15,
};

// Enum MovieSceneTools.FTransformChannelEnum
// NumValues: 0x000A
enum class EFTransformChannelEnum : uint8
{
	TranslateX                               = 0,
	TranslateY                               = 1,
	TranslateZ                               = 2,
	RotateX                                  = 3,
	RotateY                                  = 4,
	RotateZ                                  = 5,
	ScaleX                                   = 6,
	ScaleY                                   = 7,
	ScaleZ                                   = 8,
	FTransformChannelEnum_MAX                = 9,
};

// ScriptStruct MovieSceneTools.BakingAnimationKeySettings
// 0x0018 (0x0018 - 0x0000)
struct FBakingAnimationKeySettings final
{
public:
	struct FFrameNumber                           StartFrame;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           EndFrame;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBakingKeySettings                            BakingKeySettings;                                 // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FrameIncrement;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReduceKeys;                                       // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Tolerance;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MovieSceneTools.MovieSceneToolsPropertyTrackSettings
// 0x0020 (0x0020 - 0x0000)
struct FMovieSceneToolsPropertyTrackSettings final
{
public:
	class FString                                 ComponentName;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0010(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MovieSceneTools.MovieSceneToolsFbxSettings
// 0x0038 (0x0038 - 0x0000)
struct FMovieSceneToolsFbxSettings final
{
public:
	class FString                                 FbxPropertyName;                                   // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneToolsPropertyTrackSettings  PropertyPath;                                      // 0x0010(0x0020)(Edit, Config, NativeAccessSpecifierPublic)
	EMovieSceneToolsPropertyTrackType             PropertyType;                                      // 0x0030(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MovieSceneTools.ControlToTransformMappings
// 0x0003 (0x0003 - 0x0000)
struct FControlToTransformMappings final
{
public:
	EFControlRigChannelEnum                       ControlChannel;                                    // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFTransformChannelEnum                        FBXChannel;                                        // 0x0001(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNegate;                                           // 0x0002(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MovieSceneTools.ControlFindReplaceString
// 0x0020 (0x0020 - 0x0000)
struct FControlFindReplaceString final
{
public:
	class FString                                 Find;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Replace;                                           // 0x0010(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

