#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieScene

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "MovieScene_structs.hpp"


namespace SDK
{

// Class MovieScene.MovieSceneBlenderSystemSupport
// 0x0000 (0x0030 - 0x0030)
class IMovieSceneBlenderSystemSupport final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBlenderSystemSupport">();
	}
	static class IMovieSceneBlenderSystemSupport* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneBlenderSystemSupport>();
	}
};

// Class MovieScene.MovieSceneBoundObjectProxy
// 0x0000 (0x0030 - 0x0030)
class IMovieSceneBoundObjectProxy final : public IInterface
{
public:
	class UObject* BP_GetBoundObjectForSequencer(class UObject* ResolvedObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBoundObjectProxy">();
	}
	static class IMovieSceneBoundObjectProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneBoundObjectProxy>();
	}
};

// Class MovieScene.MovieSceneChannelOverrideProvider
// 0x0000 (0x0030 - 0x0030)
class IMovieSceneChannelOverrideProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneChannelOverrideProvider">();
	}
	static class IMovieSceneChannelOverrideProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneChannelOverrideProvider>();
	}
};

// Class MovieScene.MovieSceneDeterminismSource
// 0x0000 (0x0030 - 0x0030)
class IMovieSceneDeterminismSource final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneDeterminismSource">();
	}
	static class IMovieSceneDeterminismSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneDeterminismSource>();
	}
};

// Class MovieScene.MovieSceneMetaDataInterface
// 0x0000 (0x0030 - 0x0030)
class IMovieSceneMetaDataInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneMetaDataInterface">();
	}
	static class IMovieSceneMetaDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneMetaDataInterface>();
	}
};

// Class MovieScene.MovieScenePlaybackClient
// 0x0000 (0x0030 - 0x0030)
class IMovieScenePlaybackClient final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScenePlaybackClient">();
	}
	static class IMovieScenePlaybackClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieScenePlaybackClient>();
	}
};

// Class MovieScene.MovieSceneSequencePlayerObserver
// 0x0000 (0x0030 - 0x0030)
class IMovieSceneSequencePlayerObserver final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSequencePlayerObserver">();
	}
	static class IMovieSceneSequencePlayerObserver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneSequencePlayerObserver>();
	}
};

// Class MovieScene.MovieSceneBindingEventReceiverInterface
// 0x0000 (0x0030 - 0x0030)
class IMovieSceneBindingEventReceiverInterface final : public IInterface
{
public:
	void OnObjectBoundBySequencer(class UMovieSceneSequencePlayer* Player, const struct FMovieSceneObjectBindingID& BindingID);
	void OnObjectUnboundBySequencer(class UMovieSceneSequencePlayer* Player, const struct FMovieSceneObjectBindingID& BindingID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBindingEventReceiverInterface">();
	}
	static class IMovieSceneBindingEventReceiverInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneBindingEventReceiverInterface>();
	}
};

// Class MovieScene.MovieSceneBindingOwnerInterface
// 0x0000 (0x0030 - 0x0030)
class IMovieSceneBindingOwnerInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBindingOwnerInterface">();
	}
	static class IMovieSceneBindingOwnerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneBindingOwnerInterface>();
	}
};

// Class MovieScene.MovieSceneCachedTrack
// 0x0000 (0x0030 - 0x0030)
class IMovieSceneCachedTrack final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCachedTrack">();
	}
	static class IMovieSceneCachedTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneCachedTrack>();
	}
};

// Class MovieScene.MovieSceneCustomBinding
// 0x0000 (0x0030 - 0x0030)
class UMovieSceneCustomBinding : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCustomBinding">();
	}
	static class UMovieSceneCustomBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCustomBinding>();
	}
};

// Class MovieScene.MovieSceneEasingFunction
// 0x0000 (0x0030 - 0x0030)
class IMovieSceneEasingFunction final : public IInterface
{
public:
	float OnEvaluate(float Interp) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEasingFunction">();
	}
	static class IMovieSceneEasingFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneEasingFunction>();
	}
};

// Class MovieScene.MovieSceneEntitySystem
// 0x0018 (0x0048 - 0x0030)
class UMovieSceneEntitySystem : public UObject
{
public:
	class UMovieSceneEntitySystemLinker*          Linker;                                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEntitySystem">();
	}
	static class UMovieSceneEntitySystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEntitySystem>();
	}
};

// Class MovieScene.MovieSceneEntityGroupingSystem
// 0x00A8 (0x00F0 - 0x0048)
class UMovieSceneEntityGroupingSystem final : public UMovieSceneEntitySystem
{
public:
	uint8                                         Pad_48[0xA8];                                      // 0x0048(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEntityGroupingSystem">();
	}
	static class UMovieSceneEntityGroupingSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEntityGroupingSystem>();
	}
};

// Class MovieScene.MovieSceneKeyProxy
// 0x0000 (0x0030 - 0x0030)
class IMovieSceneKeyProxy final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneKeyProxy">();
	}
	static class IMovieSceneKeyProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneKeyProxy>();
	}
};

// Class MovieScene.MovieSceneReplaceableBindingBase
// 0x0008 (0x0038 - 0x0030)
class UMovieSceneReplaceableBindingBase : public UMovieSceneCustomBinding
{
public:
	class UMovieSceneSpawnableBindingBase*        PreviewSpawnable;                                  // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, EditorOnly, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneReplaceableBindingBase">();
	}
	static class UMovieSceneReplaceableBindingBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneReplaceableBindingBase>();
	}
};

// Class MovieScene.MovieSceneSequenceTickManagerClient
// 0x0000 (0x0030 - 0x0030)
class IMovieSceneSequenceTickManagerClient final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSequenceTickManagerClient">();
	}
	static class IMovieSceneSequenceTickManagerClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneSequenceTickManagerClient>();
	}
};

// Class MovieScene.MovieSceneSpawnableBindingBase
// 0x0008 (0x0038 - 0x0030)
class UMovieSceneSpawnableBindingBase : public UMovieSceneCustomBinding
{
public:
	ESpawnOwnership                               SpawnOwnership;                                    // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bContinuouslyRespawn;                              // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSpawnableBindingBase">();
	}
	static class UMovieSceneSpawnableBindingBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSpawnableBindingBase>();
	}
};

// Class MovieScene.MovieSceneSignedObject
// 0x0038 (0x0068 - 0x0030)
class UMovieSceneSignedObject : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Signature;                                         // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSignedObject">();
	}
	static class UMovieSceneSignedObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSignedObject>();
	}
};

// Class MovieScene.MovieSceneChannelOverrideContainer
// 0x0000 (0x0068 - 0x0068)
class UMovieSceneChannelOverrideContainer : public UMovieSceneSignedObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneChannelOverrideContainer">();
	}
	static class UMovieSceneChannelOverrideContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneChannelOverrideContainer>();
	}
};

// Class MovieScene.MovieSceneSectionChannelOverrideRegistry
// 0x0050 (0x0080 - 0x0030)
class UMovieSceneSectionChannelOverrideRegistry final : public UObject
{
public:
	TMap<class FName, class UMovieSceneChannelOverrideContainer*> Overrides;                                         // 0x0030(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSectionChannelOverrideRegistry">();
	}
	static class UMovieSceneSectionChannelOverrideRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSectionChannelOverrideRegistry>();
	}
};

// Class MovieScene.MovieSceneTrackTemplateProducer
// 0x0000 (0x0030 - 0x0030)
class IMovieSceneTrackTemplateProducer final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTrackTemplateProducer">();
	}
	static class IMovieSceneTrackTemplateProducer* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneTrackTemplateProducer>();
	}
};

// Class MovieScene.MovieSceneCompiledData
// 0x03E8 (0x0418 - 0x0030)
class UMovieSceneCompiledData final : public UObject
{
public:
	struct FMovieSceneEvaluationTemplate          EvaluationTemplate;                                // 0x0030(0x0160)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FMovieSceneSequenceHierarchy           Hierarchy;                                         // 0x0190(0x0120)(NativeAccessSpecifierPrivate)
	struct FMovieSceneEntityComponentField        EntityComponentField;                              // 0x02B0(0x00F0)(NativeAccessSpecifierPrivate)
	struct FMovieSceneEvaluationField             TrackTemplateField;                                // 0x03A0(0x0040)(NativeAccessSpecifierPrivate)
	TArray<struct FFrameTime>                     DeterminismFences;                                 // 0x03E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FGuid                                  CompiledSignature;                                 // 0x03F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  CompilerVersion;                                   // 0x0400(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMovieSceneSequenceCompilerMask               AccumulatedMask;                                   // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMovieSceneSequenceCompilerMask               AllocatedMask;                                     // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMovieSceneSequenceFlags                      AccumulatedFlags;                                  // 0x0412(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_413[0x5];                                      // 0x0413(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCompiledData">();
	}
	static class UMovieSceneCompiledData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCompiledData>();
	}
};

// Class MovieScene.MovieSceneCompiledDataManager
// 0x0208 (0x0238 - 0x0030)
class UMovieSceneCompiledDataManager final : public UObject
{
public:
	uint8                                         Pad_30[0xB0];                                      // 0x0030(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FMovieSceneSequenceHierarchy> Hierarchies;                                       // 0x00E0(0x0050)(NativeAccessSpecifierPrivate)
	TMap<int32, struct FMovieSceneEvaluationTemplate> TrackTemplates;                                    // 0x0130(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<int32, struct FMovieSceneEvaluationField> TrackTemplateFields;                               // 0x0180(0x0050)(NativeAccessSpecifierPrivate)
	TMap<int32, struct FMovieSceneEntityComponentField> EntityComponentFields;                             // 0x01D0(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_220[0x18];                                     // 0x0220(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCompiledDataManager">();
	}
	static class UMovieSceneCompiledDataManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCompiledDataManager>();
	}
};

// Class MovieScene.MovieSceneEntityProvider
// 0x0000 (0x0030 - 0x0030)
class IMovieSceneEntityProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEntityProvider">();
	}
	static class IMovieSceneEntityProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneEntityProvider>();
	}
};

// Class MovieScene.MovieSceneBindingLifetimeSystem
// 0x0000 (0x0048 - 0x0048)
class UMovieSceneBindingLifetimeSystem final : public UMovieSceneEntitySystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBindingLifetimeSystem">();
	}
	static class UMovieSceneBindingLifetimeSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBindingLifetimeSystem>();
	}
};

// Class MovieScene.MovieSceneBlenderSystem
// 0x0028 (0x0070 - 0x0048)
class UMovieSceneBlenderSystem : public UMovieSceneEntitySystem
{
public:
	uint8                                         Pad_48[0x28];                                      // 0x0048(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBlenderSystem">();
	}
	static class UMovieSceneBlenderSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBlenderSystem>();
	}
};

// Class MovieScene.MovieSceneEntityInstantiatorSystem
// 0x0000 (0x0048 - 0x0048)
class UMovieSceneEntityInstantiatorSystem : public UMovieSceneEntitySystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEntityInstantiatorSystem">();
	}
	static class UMovieSceneEntityInstantiatorSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEntityInstantiatorSystem>();
	}
};

// Class MovieScene.MovieSceneGenericBoundObjectInstantiator
// 0x0000 (0x0048 - 0x0048)
class UMovieSceneGenericBoundObjectInstantiator final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneGenericBoundObjectInstantiator">();
	}
	static class UMovieSceneGenericBoundObjectInstantiator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneGenericBoundObjectInstantiator>();
	}
};

// Class MovieScene.MovieSceneBoundSceneComponentInstantiator
// 0x0000 (0x0048 - 0x0048)
class UMovieSceneBoundSceneComponentInstantiator final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBoundSceneComponentInstantiator">();
	}
	static class UMovieSceneBoundSceneComponentInstantiator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBoundSceneComponentInstantiator>();
	}
};

// Class MovieScene.MovieSceneValueDecomposer
// 0x0000 (0x0030 - 0x0030)
class IMovieSceneValueDecomposer final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneValueDecomposer">();
	}
	static class IMovieSceneValueDecomposer* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneValueDecomposer>();
	}
};

// Class MovieScene.MovieSceneEntitySystemLinker
// 0x0728 (0x0758 - 0x0030)
class UMovieSceneEntitySystemLinker : public UObject
{
public:
	uint8                                         Pad_30[0x278];                                     // 0x0030(0x0278)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneEntitySystemGraph           SystemGraph;                                       // 0x02A8(0x0190)(NativeAccessSpecifierPublic)
	uint8                                         Pad_438[0x320];                                    // 0x0438(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEntitySystemLinker">();
	}
	static class UMovieSceneEntitySystemLinker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEntitySystemLinker>();
	}
};

// Class MovieScene.MovieSceneEvalTimeSystem
// 0x0170 (0x01B8 - 0x0048)
class UMovieSceneEvalTimeSystem final : public UMovieSceneEntitySystem
{
public:
	uint8                                         Pad_48[0x170];                                     // 0x0048(0x0170)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEvalTimeSystem">();
	}
	static class UMovieSceneEvalTimeSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEvalTimeSystem>();
	}
};

// Class MovieScene.MovieSceneEvaluationHookSystem
// 0x0050 (0x0098 - 0x0048)
class UMovieSceneEvaluationHookSystem final : public UMovieSceneEntitySystem
{
public:
	TMap<struct FMovieSceneEvaluationInstanceKey, struct FMovieSceneEvaluationHookEventContainer> PendingEventsByRootInstance;                       // 0x0048(0x0050)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEvaluationHookSystem">();
	}
	static class UMovieSceneEvaluationHookSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEvaluationHookSystem>();
	}
};

// Class MovieScene.MovieScenePreAnimatedStateSystemInterface
// 0x0000 (0x0030 - 0x0030)
class IMovieScenePreAnimatedStateSystemInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScenePreAnimatedStateSystemInterface">();
	}
	static class IMovieScenePreAnimatedStateSystemInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieScenePreAnimatedStateSystemInterface>();
	}
};

// Class MovieScene.MovieSceneCachePreAnimatedStateSystem
// 0x0000 (0x0048 - 0x0048)
class UMovieSceneCachePreAnimatedStateSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCachePreAnimatedStateSystem">();
	}
	static class UMovieSceneCachePreAnimatedStateSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCachePreAnimatedStateSystem>();
	}
};

// Class MovieScene.MovieSceneRestorePreAnimatedStateSystem
// 0x0010 (0x0058 - 0x0048)
class UMovieSceneRestorePreAnimatedStateSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneRestorePreAnimatedStateSystem">();
	}
	static class UMovieSceneRestorePreAnimatedStateSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneRestorePreAnimatedStateSystem>();
	}
};

// Class MovieScene.MovieSceneRootInstantiatorSystem
// 0x0000 (0x0048 - 0x0048)
class UMovieSceneRootInstantiatorSystem final : public UMovieSceneEntityInstantiatorSystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneRootInstantiatorSystem">();
	}
	static class UMovieSceneRootInstantiatorSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneRootInstantiatorSystem>();
	}
};

// Class MovieScene.MovieSceneSpawnablesSystem
// 0x0000 (0x0048 - 0x0048)
class UMovieSceneSpawnablesSystem final : public UMovieSceneEntitySystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSpawnablesSystem">();
	}
	static class UMovieSceneSpawnablesSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSpawnablesSystem>();
	}
};

// Class MovieScene.MovieSceneTrackInstance
// 0x0028 (0x0058 - 0x0030)
class UMovieSceneTrackInstance : public UObject
{
public:
	TWeakObjectPtr<class UObject>                 WeakAnimatedObject;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsRootTrackInstance;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieSceneEntitySystemLinker*          PrivateLinker;                                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneTrackInstanceInput>  Inputs;                                            // 0x0048(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTrackInstance">();
	}
	static class UMovieSceneTrackInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTrackInstance>();
	}
};

// Class MovieScene.MovieSceneTrackInstanceInstantiator
// 0x00B0 (0x00F8 - 0x0048)
class UMovieSceneTrackInstanceInstantiator final : public UMovieSceneEntityInstantiatorSystem
{
public:
	uint8                                         Pad_48[0xB0];                                      // 0x0048(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTrackInstanceInstantiator">();
	}
	static class UMovieSceneTrackInstanceInstantiator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTrackInstanceInstantiator>();
	}
};

// Class MovieScene.MovieSceneTrackInstanceSystem
// 0x0008 (0x0050 - 0x0048)
class UMovieSceneTrackInstanceSystem final : public UMovieSceneEntitySystem
{
public:
	class UMovieSceneTrackInstanceInstantiator*   Instantiator;                                      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTrackInstanceSystem">();
	}
	static class UMovieSceneTrackInstanceSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTrackInstanceSystem>();
	}
};

// Class MovieScene.MovieSceneCustomClockSource
// 0x0000 (0x0030 - 0x0030)
class IMovieSceneCustomClockSource final : public IInterface
{
public:
	struct FFrameTime OnRequestCurrentTime(const struct FQualifiedFrameTime& InCurrentTime, float InPlayRate);
	void OnStartPlaying(const struct FQualifiedFrameTime& InStartTime);
	void OnStopPlaying(const struct FQualifiedFrameTime& InStopTime);
	void OnTick(float DeltaSeconds, float InPlayRate);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCustomClockSource">();
	}
	static class IMovieSceneCustomClockSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneCustomClockSource>();
	}
};

// Class MovieScene.MovieSceneEvaluationHook
// 0x0000 (0x0030 - 0x0030)
class IMovieSceneEvaluationHook final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEvaluationHook">();
	}
	static class IMovieSceneEvaluationHook* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneEvaluationHook>();
	}
};

// Class MovieScene.MovieSceneBuiltInEasingFunction
// 0x0010 (0x0040 - 0x0030)
class UMovieSceneBuiltInEasingFunction final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EMovieSceneBuiltInEasing                      Type;                                              // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBuiltInEasingFunction">();
	}
	static class UMovieSceneBuiltInEasingFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBuiltInEasingFunction>();
	}
};

// Class MovieScene.MovieSceneEasingExternalCurve
// 0x0010 (0x0040 - 0x0030)
class UMovieSceneEasingExternalCurve final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            Curve;                                             // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEasingExternalCurve">();
	}
	static class UMovieSceneEasingExternalCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEasingExternalCurve>();
	}
};

// Class MovieScene.NodeAndChannelMappings
// 0x0000 (0x0030 - 0x0030)
class INodeAndChannelMappings final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NodeAndChannelMappings">();
	}
	static class INodeAndChannelMappings* GetDefaultObj()
	{
		return GetDefaultObjImpl<INodeAndChannelMappings>();
	}
};

// Class MovieScene.MovieSceneNodeGroup
// 0x0040 (0x0070 - 0x0030)
class UMovieSceneNodeGroup final : public UObject
{
public:
	class FName                                   Name_0;                                            // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Nodes;                                             // 0x0040(0x0010)(ZeroConstructor, EditorOnly, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x20];                                      // 0x0050(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNodeGroup">();
	}
	static class UMovieSceneNodeGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNodeGroup>();
	}
};

// Class MovieScene.MovieSceneNodeGroupCollection
// 0x0030 (0x0060 - 0x0030)
class UMovieSceneNodeGroupCollection final : public UObject
{
public:
	TArray<class UMovieSceneNodeGroup*>           NodeGroups;                                        // 0x0030(0x0010)(ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNodeGroupCollection">();
	}
	static class UMovieSceneNodeGroupCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNodeGroupCollection>();
	}
};

// Class MovieScene.MovieScene
// 0x0360 (0x03C8 - 0x0068)
class UMovieScene final : public UMovieSceneSignedObject
{
public:
	uint8                                         Pad_68[0x10];                                      // 0x0068(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMovieSceneSpawnable>           Spawnables;                                        // 0x0078(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMovieScenePossessable>         Possessables;                                      // 0x0088(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneBinding>             ObjectBindings;                                    // 0x0098(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FMovieSceneObjectBindingIDs> BindingGroups;                                     // 0x00A8(0x0050)(NativeAccessSpecifierPrivate)
	TArray<class UMovieSceneTrack*>               Tracks;                                            // 0x00F8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UMovieSceneTrack*                       CameraCutTrack;                                    // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMovieSceneFrameRange                  SelectionRange;                                    // 0x0110(0x0020)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FMovieSceneFrameRange                  PlaybackRange;                                     // 0x0130(0x0020)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FFrameRate                             TickResolution;                                    // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFrameRate                             DisplayRate;                                       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMovieSceneEvaluationType                     EvaluationType;                                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EUpdateClockSource                            ClockSource;                                       // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        CustomClockSourcePath;                             // 0x0168(0x0028)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneMarkedFrame>         MarkedFrames;                                      // 0x0190(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bReadOnly;                                         // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPlaybackRangeLocked;                              // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bMarkedFramesLocked;                               // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A3[0x5];                                      // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FText>              ObjectsToDisplayNames;                             // 0x01A8(0x0050)(EditorOnly, NativeAccessSpecifierPrivate)
	TMap<class FString, struct FMovieSceneTrackLabels> ObjectsToLabels;                                   // 0x01F8(0x0050)(EditorOnly, NativeAccessSpecifierPrivate)
	struct FMovieSceneEditorData                  EditorData;                                        // 0x0248(0x00F0)(EditorOnly, NativeAccessSpecifierPrivate)
	TArray<class UMovieSceneFolder*>              RootFolders;                                       // 0x0338(0x0010)(ExportObject, ZeroConstructor, EditorOnly, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class FString>                         SoloNodes;                                         // 0x0348(0x0010)(ZeroConstructor, EditorOnly, NativeAccessSpecifierPrivate)
	TArray<class FString>                         MuteNodes;                                         // 0x0358(0x0010)(ZeroConstructor, EditorOnly, NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneSectionGroup>        SectionGroups;                                     // 0x0368(0x0010)(ZeroConstructor, EditorOnly, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UMovieSceneNodeGroupCollection*         NodeGroupCollection;                               // 0x0378(0x0008)(ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bGloballyShowMarkedFrames;                         // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InTime;                                            // 0x0384(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         OutTime;                                           // 0x0388(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         StartTime;                                         // 0x038C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EndTime;                                           // 0x0390(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bForceFixedFrameIntervalPlayback;                  // 0x0394(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FixedFrameInterval;                                // 0x0398(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneTrack*>               MasterTracks;                                      // 0x03A0(0x0010)(ExportObject, ZeroConstructor, Deprecated, EditorOnly, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3B0[0x18];                                     // 0x03B0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScene">();
	}
	static class UMovieScene* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene>();
	}
};

// Class MovieScene.MovieSceneBindingOverrides
// 0x0068 (0x0098 - 0x0030)
class UMovieSceneBindingOverrides final : public UObject
{
public:
	TArray<struct FMovieSceneBindingOverrideData> BindingData;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x58];                                      // 0x0040(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBindingOverrides">();
	}
	static class UMovieSceneBindingOverrides* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBindingOverrides>();
	}
};

// Class MovieScene.BuiltInDynamicBindingResolverLibrary
// 0x0000 (0x0030 - 0x0030)
class UBuiltInDynamicBindingResolverLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FMovieSceneDynamicBindingResolveResult ResolveToPlayerPawn(class UObject* WorldContextObject, int32 PlayerControllerIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuiltInDynamicBindingResolverLibrary">();
	}
	static class UBuiltInDynamicBindingResolverLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuiltInDynamicBindingResolverLibrary>();
	}
};

// Class MovieScene.MovieSceneFolder
// 0x0078 (0x00A8 - 0x0030)
class UMovieSceneFolder final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   FolderName;                                        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneFolder*>              ChildFolders;                                      // 0x0050(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UMovieSceneTrack*>               ChildTracks;                                       // 0x0060(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class FString>                         ChildObjectBindingStrings;                         // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FColor                                 FolderColor;                                       // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SortingOrder;                                      // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_88[0x10];                                      // 0x0088(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneTrack*>               ChildMasterTracks;                                 // 0x0098(0x0010)(ExportObject, ZeroConstructor, Deprecated, EditorOnly, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneFolder">();
	}
	static class UMovieSceneFolder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneFolder>();
	}
};

// Class MovieScene.MovieSceneMetaData
// 0x0030 (0x0060 - 0x0030)
class UMovieSceneMetaData final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Author;                                            // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDateTime                              Created;                                           // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 Notes;                                             // 0x0050(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetAuthor(const class FString& InAuthor);
	void SetCreated(const struct FDateTime& InCreated);
	void SetNotes(const class FString& InNotes);

	class FString GetAuthor() const;
	struct FDateTime GetCreated() const;
	class FString GetNotes() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneMetaData">();
	}
	static class UMovieSceneMetaData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneMetaData>();
	}
};

// Class MovieScene.MovieSceneTrack
// 0x0068 (0x00D0 - 0x0068)
class UMovieSceneTrack : public UMovieSceneSignedObject
{
public:
	struct FMovieSceneTrackEvalOptions            EvalOptions;                                       // 0x0068(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMovieSceneTrackDisplayOptions         DisplayOptions;                                    // 0x006C(0x0004)(Edit, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x1];                                       // 0x0070(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsEvalDisabled;                                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 RowsDisabled;                                      // 0x0078(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x4];                                       // 0x0088(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  EvaluationFieldGuid;                               // 0x008C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int8                                          EvaluationFieldVersion;                            // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneTrackEvaluationField        EvaluationField;                                   // 0x00A0(0x0010)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FGuid                                  ObjectBindingID;                                   // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 TrackTint;                                         // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SortingOrder;                                      // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSupportsDefaultSections;                          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTrack">();
	}
	static class UMovieSceneTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTrack>();
	}
};

// Class MovieScene.MovieSceneNameableTrack
// 0x0020 (0x00F0 - 0x00D0)
class UMovieSceneNameableTrack : public UMovieSceneTrack
{
public:
	class FText                                   DisplayName;                                       // 0x00D0(0x0010)(Edit, EditorOnly, NativeAccessSpecifierPrivate)
	TArray<class FText>                           TrackRowDisplayNames;                              // 0x00E0(0x0010)(Edit, ZeroConstructor, EditorOnly, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNameableTrack">();
	}
	static class UMovieSceneNameableTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNameableTrack>();
	}
};

// Class MovieScene.MovieSceneSection
// 0x00E0 (0x0148 - 0x0068)
class UMovieSceneSection : public UMovieSceneSignedObject
{
public:
	struct FMovieSceneSectionEvalOptions          EvalOptions;                                       // 0x0068(0x0002)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x16];                                      // 0x006A(0x0016)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneEasingSettings              Easing;                                            // 0x0080(0x0048)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMovieSceneFrameRange                  SectionRange;                                      // 0x00C8(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMovieSceneTimecodeSource              TimecodeSource;                                    // 0x00E8(0x0018)(Edit, EditorOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FFrameNumber                           PreRollFrames;                                     // 0x0100(0x0004)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFrameNumber                           PostRollFrames;                                    // 0x0104(0x0004)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         RowIndex;                                          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         OverlapPriority;                                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bIsActive : 1;                                     // 0x0110(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bIsLocked : 1;                                     // 0x0110(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 ColorTint;                                         // 0x0114(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         StartTime;                                         // 0x0118(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EndTime;                                           // 0x011C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PreRollTime;                                       // 0x0120(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PostRollTime;                                      // 0x0124(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bIsInfinite : 1;                                   // 0x0128(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Deprecated, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSupportsInfiniteRange;                            // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FOptionalMovieSceneBlendType           BlendType;                                         // 0x012D(0x0002)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_12F[0x19];                                     // 0x012F(0x0019)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBlendType(EMovieSceneBlendType InBlendType);
	void SetColorTint(const struct FColor& InColorTint);
	void SetCompletionMode(EMovieSceneCompletionMode InCompletionMode);
	void SetIsActive(bool bInIsActive);
	void SetIsLocked(bool bInIsLocked);
	void SetOverlapPriority(int32 NewPriority);
	void SetPostRollFrames(int32 InPostRollFrames);
	void SetPreRollFrames(int32 InPreRollFrames);
	void SetRowIndex(int32 NewRowIndex);

	struct FOptionalMovieSceneBlendType GetBlendType() const;
	struct FColor GetColorTint() const;
	EMovieSceneCompletionMode GetCompletionMode() const;
	int32 GetOverlapPriority() const;
	int32 GetPostRollFrames() const;
	int32 GetPreRollFrames() const;
	int32 GetRowIndex() const;
	bool IsActive() const;
	bool IsLocked() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSection">();
	}
	static class UMovieSceneSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSection>();
	}
};

// Class MovieScene.MovieSceneSequence
// 0x0010 (0x0078 - 0x0068)
class UMovieSceneSequence : public UMovieSceneSignedObject
{
public:
	class UMovieSceneCompiledData*                CompiledData;                                      // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMovieSceneCompletionMode                     DefaultCompletionMode;                             // 0x0070(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bParentContextsAreSignificant;                     // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPlayableDirectly;                                 // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMovieSceneSequenceFlags                      SequenceFlags;                                     // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FMovieSceneObjectBindingID FindBindingByTag(class FName InBindingName) const;
	const TArray<struct FMovieSceneObjectBindingID> FindBindingsByTag(class FName InBindingName) const;
	struct FMovieSceneTimecodeSource GetEarliestTimecodeSource() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSequence">();
	}
	static class UMovieSceneSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSequence>();
	}
};

// Class MovieScene.MovieSceneSequencePlayer
// 0x0448 (0x0478 - 0x0030)
class UMovieSceneSequencePlayer : public UObject
{
public:
	uint8                                         Pad_30[0x1F8];                                     // 0x0030(0x01F8)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMovieSceneSequencePlayerObserver> Observer;                                          // 0x0228(0x0010)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPlay;                                            // 0x0238(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPlayReverse;                                     // 0x0248(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnStop;                                            // 0x0258(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPause;                                           // 0x0268(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFinished;                                        // 0x0278(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_288[0x10];                                     // 0x0288(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EMovieScenePlayerStatus                       Status;                                            // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bReversePlayback : 1;                              // 0x029C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieSceneSequence*                    Sequence;                                          // 0x02A0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFrameNumber                           StartTime;                                         // 0x02A8(0x0004)(Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DurationFrames;                                    // 0x02AC(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DurationSubFrames;                                 // 0x02B0(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentNumLoops;                                   // 0x02B4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SerialNumber;                                      // 0x02B8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMovieSceneSequencePlaybackSettings    PlaybackSettings;                                  // 0x02BC(0x0028)(Net, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance;                              // 0x02E8(0x0020)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_308[0x8C];                                     // 0x0308(0x008C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequenceReplProperties      NetSyncProps;                                      // 0x0394(0x0014)(Net, NoDestructor, Protected, NativeAccessSpecifierProtected)
