#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieRenderPipelineCore

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MovieRenderPipelineCore_structs.hpp"
#include "OpenColorIO_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class MovieRenderPipelineCore.MovieGraphNode
// 0x0090 (0x00C0 - 0x0030)
class UMovieGraphNode : public UObject
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UEdGraphNode*                           GraphNode;                                         // 0x0048(0x0008)(ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMovieGraphPin*>                 InputPins;                                         // 0x0050(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UMovieGraphPin*>                 OutputPins;                                        // 0x0060(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FInstancedPropertyBag                  DynamicProperties;                                 // 0x0070(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FMovieGraphPropertyInfo>        ExposedPropertyInfo;                               // 0x0080(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         NodePosX;                                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NodePosY;                                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 NodeComment;                                       // 0x0098(0x0010)(ZeroConstructor, EditorOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bIsCommentBubblePinned : 1;                        // 0x00A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (EditorOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIsCommentBubbleVisible : 1;                       // 0x00A8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (EditorOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIsDisabled : 1;                                   // 0x00A8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Guid;                                              // 0x00AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetDisabled(const bool bNewDisableState);
	void SetIsCommentBubblePinned(const uint8 bIsPinned);
	void SetIsCommentBubbleVisible(uint8 bIsVisible);
	void SetNodeComment(const class FString& InNodeComment);
	void SetNodePosX(const int32 InNodePosX);
	void SetNodePosY(const int32 InNodePosY);
	void TogglePromotePropertyToPin(const class FName& PropertyName);

	bool CanBeAddedByUser() const;
	bool CanBeDisabled() const;
	EMovieGraphBranchRestriction GetBranchRestriction() const;
	TArray<struct FMovieGraphPropertyInfo> GetExposedProperties() const;
	class UMovieGraphPin* GetFirstConnectedInputPin() const;
	class UMovieGraphPin* GetFirstConnectedOutputPin() const;
	class UMovieGraphPin* GetInputPin(const class FName& InPinLabel, const EMovieGraphPinQueryRequirement PinRequirement) const;
	TArray<struct FMovieGraphPinProperties> GetInputPinProperties() const;
	const TArray<class UMovieGraphPin*> GetInputPins() const;
	class FText GetKeywords() const;
	class FText GetMenuCategory() const;
	class FString GetNodeComment() const;
	int32 GetNodePosX() const;
	int32 GetNodePosY() const;
	class FText GetNodeTitle(const bool bGetDescriptive) const;
	class UMovieGraphPin* GetOutputPin(const class FName& InPinLabel) const;
	TArray<struct FMovieGraphPinProperties> GetOutputPinProperties() const;
	const TArray<class UMovieGraphPin*> GetOutputPins() const;
	TArray<struct FMovieGraphPropertyInfo> GetOverrideablePropertyInfo() const;
	bool IsCommentBubblePinned() const;
	bool IsCommentBubbleVisible() const;
	bool IsDisabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphNode">();
	}
	static class UMovieGraphNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphNode>();
	}
};

// Class MovieRenderPipelineCore.MoviePipelineBase
// 0x0050 (0x0080 - 0x0030)
class UMoviePipelineBase : public UObject
{
public:
	TMulticastInlineDelegate<void(const struct FMoviePipelineOutputData& Results)> OnMoviePipelineWorkFinishedDelegate;               // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FMoviePipelineOutputData& Results)> OnMoviePipelineShotWorkFinishedDelegate;           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x30];                                      // 0x0050(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RequestShutdown(bool bIsError);
	void Shutdown(bool bIsError);

	EMovieRenderPipelineState GetPipelineState() const;
	bool IsShutdownRequested() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineBase">();
	}
	static class UMoviePipelineBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineBase>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphPipeline
// 0x0150 (0x01D0 - 0x0080)
class UMovieGraphPipeline final : public UMoviePipelineBase
{
public:
	TArray<class UMovieGraphTimeStepBase*>        GraphTimeStepInstances;                            // 0x0080(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UMovieGraphTimeStepBase*                PendingTimeStepInstance;                           // 0x0090(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMovieGraphTimeStepBase*                GraphTimeStepInstance;                             // 0x0098(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMovieGraphRendererBase*                GraphRendererInstance;                             // 0x00A0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMovieGraphDataSourceBase*              GraphDataSourceInstance;                           // 0x00A8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMovieGraphAudioRendererBase*           GraphAudioRendererInstance;                        // 0x00B0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMovieGraphEvaluatedConfig*             PostRenderEvaluatedGraph;                          // 0x00B8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMoviePipelineExecutorJob*              CurrentJob;                                        // 0x00C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMoviePipelineExecutorJob*              CurrentJobDuplicate;                               // 0x00C8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMoviePipelineExecutorShot*>     ActiveShotList;                                    // 0x00D0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSubclassOf<class UMovieGraphRenderPreviewWidget> PreviewWidgetClassToUse;                           // 0x00E0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMovieGraphRenderPreviewWidget*         PreviewWidget;                                     // 0x00E8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMovieGraphScriptBase*>          CurrentScriptInstances;                            // 0x00F0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSet<class UMovieGraphFileOutputNode*>        OutputNodesDataSentTo;                             // 0x0100(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_150[0x70];                                     // 0x0150(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieGraphEngineTimeStep*              CustomEngineTimeStep;                              // 0x01C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEngineCustomTimeStep*                  PrevCustomEngineTimeStep;                          // 0x01C8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void Initialize(class UMoviePipelineExecutorJob* InJob, const struct FMovieGraphInitConfig& InitConfig);
	void OnMoviePipelineFinishedImpl();
	void SetInitializationTime(const struct FDateTime& InDateTime);

	class UMoviePipelineExecutorJob* GetCurrentJob() const;
	struct FMovieGraphTraversalContext GetCurrentTraversalContext(const bool bForShot) const;
	struct FDateTime GetInitializationTime() const;
	struct FTimespan GetInitializationTimeOffset() const;
	class UMovieGraphRendererBase* GetRendererInstance() const;
	class UMovieGraphTimeStepBase* GetTimeStepInstance() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphPipeline">();
	}
	static class UMovieGraphPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphPipeline>();
	}
};

// Class MovieRenderPipelineCore.MoviePipelineSetting
// 0x0020 (0x0050 - 0x0030)
class UMoviePipelineSetting : public UObject
{
public:
	TWeakObjectPtr<class UMoviePipeline>          CachedPipeline;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnabled;                                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x17];                                      // 0x0039(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetIsEnabled(bool bInEnabled);

	void BuildNewProcessCommandLineArgs(TArray<class FString>& InOutUnrealURLParams, TArray<class FString>& InOutCommandLineArgs, TArray<class FString>& InOutDeviceProfileCvars, TArray<class FString>& InOutExecCmds) const;
	bool IsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineSetting">();
	}
	static class UMoviePipelineSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineSetting>();
	}
};

// Class MovieRenderPipelineCore.MoviePipelineRenderPass
// 0x0000 (0x0050 - 0x0050)
class UMoviePipelineRenderPass : public UMoviePipelineSetting
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineRenderPass">();
	}
	static class UMoviePipelineRenderPass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineRenderPass>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphSettingNode
// 0x0000 (0x00C0 - 0x00C0)
class UMovieGraphSettingNode : public UMovieGraphNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphSettingNode">();
	}
	static class UMovieGraphSettingNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphSettingNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphApplyCVarPresetNode
// 0x0018 (0x00D8 - 0x00C0)
class UMovieGraphApplyCVarPresetNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_ConsoleVariablePreset : 1;               // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMovieSceneConsoleVariableTrackInterface> ConsoleVariablePreset;                             // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphApplyCVarPresetNode">();
	}
	static class UMovieGraphApplyCVarPresetNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphApplyCVarPresetNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphConditionGroupQueryBase
// 0x0008 (0x0038 - 0x0030)
class UMovieGraphConditionGroupQueryBase : public UObject
{
public:
	EMovieGraphConditionGroupQueryOpType          OpType;                                            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsEnabled;                                        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetEnabled(const bool bEnabled);
	void SetOperationType(const EMovieGraphConditionGroupQueryOpType OperationType);

	void Evaluate(const TArray<class AActor*>& InActorsToQuery, const class UWorld* InWorld, TSet<class AActor*>* OutMatchingActors) const;
	EMovieGraphConditionGroupQueryOpType GetOperationType() const;
	bool IsEditorOnlyQuery() const;
	bool IsEnabled() const;
	bool IsFirstConditionGroupQuery() const;
	bool ShouldHidePropertyNames() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphConditionGroupQueryBase">();
	}
	static class UMovieGraphConditionGroupQueryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphConditionGroupQueryBase>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphConditionGroupQuery_ComponentType
// 0x0030 (0x0068 - 0x0038)
class UMovieGraphConditionGroupQuery_ComponentType final : public UMovieGraphConditionGroupQueryBase
{
public:
	uint8                                         Pad_38[0x20];                                      // 0x0038(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UObject>>            ComponentTypes;                                    // 0x0058(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphConditionGroupQuery_ComponentType">();
	}
	static class UMovieGraphConditionGroupQuery_ComponentType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphConditionGroupQuery_ComponentType>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphFileOutputNode
// 0x0018 (0x00D8 - 0x00C0)
class UMovieGraphFileOutputNode : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_FileNameFormat : 1;                      // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FileNameFormat;                                    // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphFileOutputNode">();
	}
	static class UMovieGraphFileOutputNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphFileOutputNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphAudioOutputNode
// 0x0010 (0x00E8 - 0x00D8)
class UMovieGraphAudioOutputNode final : public UMovieGraphFileOutputNode
{
public:
	uint8                                         Pad_D8[0x10];                                      // 0x00D8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphAudioOutputNode">();
	}
	static class UMovieGraphAudioOutputNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphAudioOutputNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphBlueprintLibrary
// 0x0000 (0x0030 - 0x0030)
class UMovieGraphBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float GetCompletionPercentage(const class UMovieGraphPipeline* InPipeline);
	static float GetCurrentAperture(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static class UCineCameraComponent* GetCurrentCineCamera(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static float GetCurrentFocalLength(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static float GetCurrentFocusDistance(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static void GetCurrentSegmentName(const class UMovieGraphPipeline* InMovieGraphPipeline, class FText* OutOuterName, class FText* OutInnerName);
	static EMovieRenderShotState GetCurrentSegmentState(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FMoviePipelineSegmentWorkMetrics GetCurrentSegmentWorkMetrics(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FFrameNumber GetCurrentShotFrameNumber(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FTimecode GetCurrentShotTimecode(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FFrameRate GetEffectiveFrameRate(class UMovieGraphGlobalOutputSettingNode* InNode, const struct FFrameRate& InDefaultRate);
	static struct FIntPoint GetEffectiveOutputResolution(class UMovieGraphEvaluatedConfig* InEvaluatedGraph);
	static bool GetEstimatedTimeRemaining(const class UMovieGraphPipeline* InMovieGraphPipeline, struct FTimespan* OutEstimate);
	static class FText GetJobAuthor(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FDateTime GetJobInitializationTime(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static class FText GetJobName(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static void GetOverallOutputFrames(const class UMovieGraphPipeline* InMovieGraphPipeline, int32* OutCurrentIndex, int32* OutTotalCount);
	static void GetOverallSegmentCounts(const class UMovieGraphPipeline* InMovieGraphPipeline, int32* OutCurrentIndex, int32* OutTotalCount);
	static EMovieRenderPipelineState GetPipelineState(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FFrameNumber GetRootFrameNumber(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FTimecode GetRootTimecode(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static bool IsNamedResolutionValid(const class FName& InResolutionProfileName);
	static struct FMovieGraphNamedResolution NamedResolutionFromProfile(const class FName& InResolutionProfileName);
	static struct FMovieGraphNamedResolution NamedResolutionFromSize(const int32 InResX, const int32 InResY);
	static class FString ResolveFilenameFormatArguments(const class FString& InFormatString, const struct FMovieGraphFilenameResolveParams& InParams, struct FMovieGraphResolveArgs* OutMergedFormatArgs);
	static int32 ResolveVersionNumber(const struct FMovieGraphFilenameResolveParams& InParams, const bool bGetNextVersion);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphBlueprintLibrary">();
	}
	static class UMovieGraphBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBlueprintLibrary>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphBranchNode
// 0x0000 (0x00C0 - 0x00C0)
class UMovieGraphBranchNode final : public UMovieGraphNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphBranchNode">();
	}
	static class UMovieGraphBranchNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBranchNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphRenderPassNode
// 0x0000 (0x00C0 - 0x00C0)
class UMovieGraphRenderPassNode : public UMovieGraphSettingNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphRenderPassNode">();
	}
	static class UMovieGraphRenderPassNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphRenderPassNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphWidgetRendererBaseNode
// 0x0078 (0x0138 - 0x00C0)
class UMovieGraphWidgetRendererBaseNode : public UMovieGraphRenderPassNode
{
public:
	uint8                                         bOverride_bCompositeOntoFinalImage : 1;            // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          bCompositeOntoFinalImage;                          // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C2[0x76];                                      // 0x00C2(0x0076)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphWidgetRendererBaseNode">();
	}
	static class UMovieGraphWidgetRendererBaseNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphWidgetRendererBaseNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphConditionGroupQuery_ActorType
// 0x0030 (0x0068 - 0x0038)
class UMovieGraphConditionGroupQuery_ActorType final : public UMovieGraphConditionGroupQueryBase
{
public:
	TArray<TSubclassOf<class UObject>>            ActorTypes;                                        // 0x0038(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x20];                                      // 0x0048(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphConditionGroupQuery_ActorType">();
	}
	static class UMovieGraphConditionGroupQuery_ActorType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphConditionGroupQuery_ActorType>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphBurnInNode
// 0x0080 (0x01B8 - 0x0138)
class UMovieGraphBurnInNode final : public UMovieGraphWidgetRendererBaseNode
{
public:
	uint8                                         bOverride_BurnInClass : 1;                         // 0x0138(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         BurnInClass;                                       // 0x0140(0x0028)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<TSubclassOf<class UObject>, class UMovieGraphBurnInWidget*> BurnInWidgetInstances;                             // 0x0168(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphBurnInNode">();
	}
	static class UMovieGraphBurnInNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBurnInNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphBurnInWidget
// 0x0000 (0x0418 - 0x0418)
class UMovieGraphBurnInWidget : public UUserWidget
{
public:
	void UpdateForGraph(class UMovieGraphPipeline* InGraphPipeline, class UMovieGraphEvaluatedConfig* InEvaluatedConfig);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphBurnInWidget">();
	}
	static class UMovieGraphBurnInWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBurnInWidget>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphCameraSettingNode
// 0x0008 (0x00C8 - 0x00C0)
class UMovieGraphCameraSettingNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_ShutterTiming : 1;                       // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OverscanPercentage : 1;                  // 0x00C0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EMoviePipelineShutterTiming                   ShutterTiming;                                     // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverscanPercentage;                                // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphCameraSettingNode">();
	}
	static class UMovieGraphCameraSettingNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphCameraSettingNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphCollectionNode
// 0x0010 (0x00D0 - 0x00C0)
class UMovieGraphCollectionNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_Collection : 1;                          // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieGraphCollection*                  Collection;                                        // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphCollectionNode">();
	}
	static class UMovieGraphCollectionNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphCollectionNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphCommandLineEncoderNode
// 0x00A0 (0x0160 - 0x00C0)
class UMovieGraphCommandLineEncoderNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bOverride_FileNameFormat : 1;                      // 0x00C8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bDeleteSourceFiles : 1;                  // 0x00C8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bSkipEncodeOnRenderCanceled : 1;         // 0x00C8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VideoCodec : 1;                          // 0x00C8(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_AudioCodec : 1;                          // 0x00C8(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OutputFileExtension : 1;                 // 0x00C8(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CommandLineFormat : 1;                   // 0x00C8(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VideoInputStringFormat : 1;              // 0x00C8(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_AudioInputStringFormat : 1;              // 0x00C9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_EncodeSettings : 1;                      // 0x00C9(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bRetainInputTextFiles : 1;               // 0x00C9(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FileNameFormat;                                    // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteSourceFiles;                                // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipEncodeOnRenderCanceled;                       // 0x00E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 VideoCodec;                                        // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AudioCodec;                                        // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutputFileExtension;                               // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CommandLineFormat;                                 // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VideoInputStringFormat;                            // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AudioInputStringFormat;                            // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EncodeSettings;                                    // 0x0148(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRetainInputTextFiles;                             // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphCommandLineEncoderNode">();
	}
	static class UMovieGraphCommandLineEncoderNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphCommandLineEncoderNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphValueContainer
// 0x0020 (0x0050 - 0x0030)
class UMovieGraphValueContainer : public UObject
{
public:
	class FName                                   PropertyName;                                      // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedPropertyBag                  Value;                                             // 0x0040(0x0010)(Edit, NativeAccessSpecifierPrivate)

public:
	class FString GetValueSerializedString();
	bool SetValueBool(const bool bInValue);
	bool SetValueByte(const uint8 InValue);
	bool SetValueClass(class UClass* InValue);
	void SetValueContainerType(EMovieGraphContainerType ContainerType);
	bool SetValueDouble(const double InValue);
	bool SetValueEnum(const uint8 InValue, const class UEnum* Enum);
	bool SetValueFloat(const float InValue);
	bool SetValueInt32(const int32 InValue);
	bool SetValueInt64(const int64 InValue);
	bool SetValueName(const class FName InValue);
	bool SetValueObject(class UObject* InValue);
	bool SetValueSerializedString(const class FString& NewValue);
	bool SetValueString(const class FString& InValue);
	bool SetValueText(const class FText& InValue);
	void SetValueType(EMovieGraphValueType ValueType, class UObject* InValueTypeObject);
	void SetValueTypeObject(const class UObject* ValueTypeObject);

	bool GetValueBool(bool* bOutValue) const;
	bool GetValueByte(uint8* OutValue) const;
	bool GetValueClass(class UClass** OutValue) const;
	EMovieGraphContainerType GetValueContainerType() const;
	bool GetValueDouble(double* OutValue) const;
	bool GetValueEnum(uint8* OutValue, const class UEnum* RequestedEnum) const;
	bool GetValueFloat(float* OutValue) const;
	bool GetValueInt32(int32* OutValue) const;
	bool GetValueInt64(int64* OutValue) const;
	bool GetValueName(class FName* OutValue) const;
	bool GetValueObject(class UObject* OutValue, const class UClass* RequestedClass) const;
	bool GetValueString(class FString* OutValue) const;
	bool GetValueText(class FText* OutValue) const;
	EMovieGraphValueType GetValueType() const;
	const class UObject* GetValueTypeObject() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphValueContainer">();
	}
	static class UMovieGraphValueContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphValueContainer>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphMember
// 0x0038 (0x0088 - 0x0050)
class UMovieGraphMember : public UMovieGraphValueContainer
{
public:
	class FString                                 Description;                                       // 0x0050(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0060(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  Guid;                                              // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsEditable;                                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool SetMemberName(const class FString& InNewName);

	const struct FGuid GetGuid() const;
	class FString GetMemberName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphMember">();
	}
	static class UMovieGraphMember* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphMember>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphVariable
// 0x0028 (0x00B0 - 0x0088)
class UMovieGraphVariable : public UMovieGraphMember
{
public:
	uint8                                         Pad_88[0x18];                                      // 0x0088(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Category;                                          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphVariable">();
	}
	static class UMovieGraphVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphVariable>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable
// 0x0000 (0x00B0 - 0x00B0)
class UMovieGraphGlobalVariable : public UMovieGraphVariable
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphGlobalVariable">();
	}
	static class UMovieGraphGlobalVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable_ShotName
// 0x0000 (0x00B0 - 0x00B0)
class UMovieGraphGlobalVariable_ShotName final : public UMovieGraphGlobalVariable
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphGlobalVariable_ShotName">();
	}
	static class UMovieGraphGlobalVariable_ShotName* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable_ShotName>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphShowFlags
// 0x00E8 (0x0118 - 0x0030)
class UMovieGraphShowFlags final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<uint32>                                  OverriddenShowFlags;                               // 0x0038(0x0050)(NativeAccessSpecifierPrivate)
	TMap<uint32, bool>                            ShowFlagEnableState;                               // 0x0088(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x40];                                      // 0x00D8(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphShowFlags">();
	}
	static class UMovieGraphShowFlags* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphShowFlags>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable_SequenceName
// 0x0000 (0x00B0 - 0x00B0)
class UMovieGraphGlobalVariable_SequenceName final : public UMovieGraphGlobalVariable
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphGlobalVariable_SequenceName">();
	}
	static class UMovieGraphGlobalVariable_SequenceName* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable_SequenceName>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable_FrameNumber
// 0x0000 (0x00B0 - 0x00B0)
class UMovieGraphGlobalVariable_FrameNumber final : public UMovieGraphGlobalVariable
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphGlobalVariable_FrameNumber">();
	}
	static class UMovieGraphGlobalVariable_FrameNumber* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable_FrameNumber>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable_CameraName
// 0x0000 (0x00B0 - 0x00B0)
class UMovieGraphGlobalVariable_CameraName final : public UMovieGraphGlobalVariable
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphGlobalVariable_CameraName">();
	}
	static class UMovieGraphGlobalVariable_CameraName* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable_CameraName>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphInterfaceBase
// 0x0008 (0x0090 - 0x0088)
class UMovieGraphInterfaceBase : public UMovieGraphMember
{
public:
	bool                                          bIsBranch;                                         // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphInterfaceBase">();
	}
	static class UMovieGraphInterfaceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphInterfaceBase>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphWarmUpSettingNode
// 0x0010 (0x00D0 - 0x00C0)
class UMovieGraphWarmUpSettingNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_NumWarmUpFrames : 1;                     // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bEmulateMotionBlur : 1;                  // 0x00C0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumWarmUpFrames;                                   // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEmulateMotionBlur;                                // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphWarmUpSettingNode">();
	}
	static class UMovieGraphWarmUpSettingNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphWarmUpSettingNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphInput
// 0x0018 (0x00A8 - 0x0090)
class UMovieGraphInput final : public UMovieGraphInterfaceBase
{
public:
	uint8                                         Pad_90[0x18];                                      // 0x0090(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphInput">();
	}
	static class UMovieGraphInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphInput>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphOutput
// 0x0018 (0x00A8 - 0x0090)
class UMovieGraphOutput final : public UMovieGraphInterfaceBase
{
public:
	uint8                                         Pad_90[0x18];                                      // 0x0090(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphOutput">();
	}
	static class UMovieGraphOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphOutput>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphDataSourceBase
// 0x0000 (0x0030 - 0x0030)
class UMovieGraphDataSourceBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphDataSourceBase">();
	}
	static class UMovieGraphDataSourceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphDataSourceBase>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphSequenceDataSource
// 0x0028 (0x0058 - 0x0030)
class UMovieGraphSequenceDataSource final : public UMovieGraphDataSourceBase
{
public:
	class ALevelSequenceActor*                    LevelSequenceActor;                                // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x20];                                      // 0x0038(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphSequenceDataSource">();
	}
	static class UMovieGraphSequenceDataSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphSequenceDataSource>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphEvaluatedConfig
// 0x0050 (0x0080 - 0x0030)
class UMovieGraphEvaluatedConfig final : public UObject
{
public:
	TMap<class FName, struct FMovieGraphEvaluatedBranchConfig> BranchConfigMapping;                               // 0x0030(0x0050)(Transient, NativeAccessSpecifierPublic)

public:
	const TArray<class FName> GetBranchNames() const;
	class UMovieGraphSettingNode* GetSettingForBranch(class UClass* InClass, const class FName InBranchName, bool bIncludeCDOs, bool bExactMatch) const;
	TArray<class UMovieGraphSettingNode*> GetSettingsForBranch(class UClass* InClass, const class FName InBranchName, bool bIncludeCDOs, bool bExactMatch) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphEvaluatedConfig">();
	}
	static class UMovieGraphEvaluatedConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphEvaluatedConfig>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphTraversableObject
// 0x0000 (0x0030 - 0x0030)
class IMovieGraphTraversableObject final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphTraversableObject">();
	}
	static class IMovieGraphTraversableObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieGraphTraversableObject>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphConfig
// 0x00F0 (0x0120 - 0x0030)
class UMovieGraphConfig final : public UObject
{
public:
	uint8                                         Pad_30[0x78];                                      // 0x0030(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieGraphNode*>                AllNodes;                                          // 0x00A8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UMovieGraphNode*                        InputNode;                                         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMovieGraphNode*                        OutputNode;                                        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEdGraph*                               PipelineEdGraph;                                   // 0x00C8(0x0008)(ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMovieGraphVariable*>            Variables;                                         // 0x00D0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UMovieGraphGlobalVariable*>      GlobalVariables;                                   // 0x00E0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UMovieGraphInput*>               Inputs;                                            // 0x00F0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UMovieGraphOutput*>              Outputs;                                           // 0x0100(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                        EditorOnlyNodes;                                   // 0x0110(0x0010)(ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	class UMovieGraphInput* AddInput();
	bool AddLabeledEdge(class UMovieGraphNode* FromNode, const class FName& FromPinLabel, class UMovieGraphNode* ToNode, const class FName& ToPinLabel);
	class UMovieGraphOutput* AddOutput();
	class UMovieGraphVariable* AddVariable(const class FName InCustomBaseName);
	class UMovieGraphEvaluatedConfig* CreateFlattenedGraph(const struct FMovieGraphTraversalContext& InContext, class FString* OutError);
	class UMovieGraphNode* CreateNodeByClass(const TSubclassOf<class UMovieGraphNode> InClass);
	bool DeleteMember(class UMovieGraphMember* MemberToDelete);
	bool RemoveAllInboundEdges(class UMovieGraphNode* InNode);
	bool RemoveAllOutboundEdges(class UMovieGraphNode* InNode);
	bool RemoveInboundEdges(class UMovieGraphNode* InNode, const class FName& InPinName);
	bool RemoveLabeledEdge(class UMovieGraphNode* FromNode, const class FName& FromPinName, class UMovieGraphNode* ToNode, const class FName& ToPinName);
	bool RemoveNode(class UMovieGraphNode* InNode);
	bool RemoveNodes(const TArray<class UMovieGraphNode*>& InNodes);
	bool RemoveOutboundEdges(class UMovieGraphNode* InNode, const class FName& InPinName);
	void UpdateGlobalVariableValues(const class UMovieGraphPipeline* InPipeline);

	class UMovieGraphNode* GetInputNode() const;
	TArray<class UMovieGraphInput*> GetInputs() const;
	class UMovieGraphNode* GetOutputNode() const;
	TArray<class UMovieGraphOutput*> GetOutputs() const;
	TArray<class UMovieGraphVariable*> GetVariables(const bool bIncludeGlobal) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphConfig">();
	}
	static class UMovieGraphConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphConfig>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphTimeStepBase
// 0x0000 (0x0030 - 0x0030)
class UMovieGraphTimeStepBase : public UObject
{
public:
	struct FMovieGraphTimeStepData GetCalculatedTimeData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphTimeStepBase">();
	}
	static class UMovieGraphTimeStepBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphTimeStepBase>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphCoreTimeStep
// 0x0150 (0x0180 - 0x0030)
class UMovieGraphCoreTimeStep : public UMovieGraphTimeStepBase
{
public:
	struct FMovieGraphTimeStepData                CurrentTimeStepData;                               // 0x0030(0x0070)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A0[0xE0];                                      // 0x00A0(0x00E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphCoreTimeStep">();
	}
	static class UMovieGraphCoreTimeStep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphCoreTimeStep>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphEngineTimeStep
// 0x0018 (0x0048 - 0x0030)
class UMovieGraphEngineTimeStep final : public UEngineCustomTimeStep
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphEngineTimeStep">();
	}
	static class UMovieGraphEngineTimeStep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphEngineTimeStep>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphRendererBase
// 0x0000 (0x0030 - 0x0030)
class UMovieGraphRendererBase : public UObject
{
public:
	TArray<struct FMovieGraphImagePreviewData> GetPreviewData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphRendererBase">();
	}
	static class UMovieGraphRendererBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphRendererBase>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphAudioRendererBase
// 0x0030 (0x0060 - 0x0030)
class UMovieGraphAudioRendererBase : public UObject
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphAudioRendererBase">();
	}
	static class UMovieGraphAudioRendererBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphAudioRendererBase>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphDebugSettingNode
// 0x0018 (0x00D8 - 0x00C0)
class UMovieGraphDebugSettingNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_bCaptureFramesWithRenderDoc : 1;         // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bCaptureUnrealInsightsTrace : 1;         // 0x00C0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_UnrealInsightsTraceFileNameFormat : 1;   // 0x00C0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          bCaptureFramesWithRenderDoc;                       // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCaptureUnrealInsightsTrace;                       // 0x00C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UnrealInsightsTraceFileNameFormat;                 // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphDebugSettingNode">();
	}
	static class UMovieGraphDebugSettingNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphDebugSettingNode>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphDefaultAudioRenderer
// 0x0000 (0x0060 - 0x0060)
class UMovieGraphDefaultAudioRenderer final : public UMovieGraphAudioRendererBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphDefaultAudioRenderer">();
	}
	static class UMovieGraphDefaultAudioRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphDefaultAudioRenderer>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphDefaultRenderer
// 0x0190 (0x01C0 - 0x0030)
class UMovieGraphDefaultRenderer final : public UMovieGraphRendererBase
{
public:
	TArray<class UMovieGraphRenderPassNode*>      RenderPassesInUse;                                 // 0x0030(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x180];                                     // 0x0040(0x0180)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphDefaultRenderer">();
	}
	static class UMovieGraphDefaultRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphDefaultRenderer>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphEdge
// 0x0010 (0x0040 - 0x0030)
class UMovieGraphEdge final : public UObject
{
public:
	class UMovieGraphPin*                         InputPin;                                          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMovieGraphPin*                         OutputPin;                                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphEdge">();
	}
	static class UMovieGraphEdge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphEdge>();
	}
};

// Class MovieRenderPipelineCore.MovieGraphScriptBase
// 0x0000 (0x0030 - 0x0030)
class UMovieGraphScriptBase final : public UObject
{
public:
	void OnJobFinished(class UMoviePipelineExecutorJob* InJobCopy, const struct FMoviePipelineOutputData& InOutputData);
	void OnJobStart(class UMoviePipelineExecutorJob* InJobCopy);
	void OnShotFinished(class UMoviePipelineExecutorJob* InJobCopy, class UMoviePipelineExecutorShot* InShotCopy, const struct FMoviePipelineOutputData& OutputData);
	void OnShotStart(class UMoviePipelineExecutorJob* InJobCopy, class UMoviePipelineExecutorShot* InShotCopy);

	bool IsPerShotCallbackNeeded() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphScriptBase">();
	}
	static class UMovieGraphScriptBase* GetDefaultObj()
	{
