#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MusicBlocks

#include "Basic.hpp"

#include "MusicBlocks_structs.hpp"
#include "Engine_classes.hpp"
#include "PlayspaceSystem_classes.hpp"


namespace SDK
{

// Class MusicBlocks.MusicSequencerHitComponent
// 0x0148 (0x0220 - 0x00D8)
class UMusicSequencerHitComponent final : public UActorComponent
{
public:
	struct FMusicSequencerHitArray                MusicSequencerEventList;                           // 0x00D8(0x0128)(Net, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class USoundBase*>                     LoadedSoundsList;                                  // 0x0200(0x0010)(Net, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class AActor>>             SoundPreloadClassList;                             // 0x0210(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static bool RegisterMusicSequencerActor(const class UObject* WorldContextObject, TScriptInterface<class IFortMusicSequencerInterface> Actor);
	static bool ReplicateMusicSequencerHit(const class UObject* WorldContextObject, TScriptInterface<class IFortMusicSequencerInterface> HitInterface, const class AController* Instigator);

	bool AddMusicSequencerActor(TScriptInterface<class IFortMusicSequencerInterface> HitInterface);
	bool AddSequenceHitEvent(TScriptInterface<class IFortMusicSequencerInterface> HitInterface, const class AController* Instigator);
	void OnSequenceHitEventExpired(const struct FMusicSequencerHitHandle& ExpiredHandle);
	bool ProcessSequenceHitEvent(const struct FMusicSequencerHitEntry& Event);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MusicSequencerHitComponent">();
	}
	static class UMusicSequencerHitComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMusicSequencerHitComponent>();
	}
};

// Class MusicBlocks.MusicSequencerHitActor
// 0x0008 (0x0428 - 0x0420)
class AMusicSequencerHitActor final : public AActor
{
public:
	class UMusicSequencerHitComponent*            MusicSequencerHitComponent;                        // 0x0420(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UMusicSequencerHitComponent* GetMusicSequencerHitComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MusicSequencerHitActor">();
	}
	static class AMusicSequencerHitActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMusicSequencerHitActor>();
	}
};

// Class MusicBlocks.MusicSequencerHitAdderComponent
// 0x0010 (0x00E8 - 0x00D8)
class UMusicSequencerHitAdderComponent final : public UPlayspaceComponent
{
public:
	TSubclassOf<class AMusicSequencerHitActor>    MusicSequencerHitActorClass;                       // 0x00D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AMusicSequencerHitActor> MusicSequencerHitActor;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class AMusicSequencerHitActor* GetMusicSequencerHitActor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MusicSequencerHitAdderComponent">();
	}
	static class UMusicSequencerHitAdderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMusicSequencerHitAdderComponent>();
	}
};

}

