#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MutableValidation

#include "Basic.hpp"

#include "DataValidation_classes.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class MutableValidation.AssetValidator_CustomizableObjects
// 0x0000 (0x0078 - 0x0078)
class UAssetValidator_CustomizableObjects final : public UEditorValidatorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetValidator_CustomizableObjects">();
	}
	static class UAssetValidator_CustomizableObjects* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetValidator_CustomizableObjects>();
	}
};

// Class MutableValidation.AssetValidator_ReferencedCustomizableObjects
// 0x0000 (0x0078 - 0x0078)
class UAssetValidator_ReferencedCustomizableObjects final : public UEditorValidatorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetValidator_ReferencedCustomizableObjects">();
	}
	static class UAssetValidator_ReferencedCustomizableObjects* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetValidator_ReferencedCustomizableObjects>();
	}
};

// Class MutableValidation.COIBakingTestCommandlet
// 0x0008 (0x0090 - 0x0088)
class UCOIBakingTestCommandlet final : public UCommandlet
{
public:
	class UCustomizableObjectInstance*            TargetInstance;                                    // 0x0088(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"COIBakingTestCommandlet">();
	}
	static class UCOIBakingTestCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCOIBakingTestCommandlet>();
	}
};

// Class MutableValidation.COIBulkUpdateTestCommandlet
// 0x0000 (0x0088 - 0x0088)
class UCOIBulkUpdateTestCommandlet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"COIBulkUpdateTestCommandlet">();
	}
	static class UCOIBulkUpdateTestCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCOIBulkUpdateTestCommandlet>();
	}
};

// Class MutableValidation.CustomizableObjectValidationCommandlet
// 0x0028 (0x00B0 - 0x0088)
class UCustomizableObjectValidationCommandlet final : public UCommandlet
{
public:
	class UCustomizableObject*                    ToTestCustomizableObject;                          // 0x0088(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x20];                                      // 0x0090(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectValidationCommandlet">();
	}
	static class UCustomizableObjectValidationCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectValidationCommandlet>();
	}
};

// Class MutableValidation.MutableValidationSettings
// 0x0008 (0x0038 - 0x0030)
class UMutableValidationSettings final : public UObject
{
public:
	bool                                          bEnableDirectCOValidation;                         // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableIndirectCOValidation;                       // 0x0031(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MutableValidationSettings">();
	}
	static class UMutableValidationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMutableValidationSettings>();
	}
};

}

