#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: mutator_zone_device

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"
#include "effect_volume_device_classes.hpp"


namespace SDK
{

// VerseClass mutator_zone_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class mutator_zone_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass mutator_zone_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class mutator_zone_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<mutator_zone_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass mutator_zone_device.mutator_zone_device
// 0x0040 (0x0110 - 0x00D0)
class Umutator_zone_device final : public Ueffect_volume_device
{
public:
	class UObject*                                __verse_0xFD0296CD_AgentBeginsEmotingEvent;        // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x5C97A819_AgentEndsEmotingEvent;          // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x4DE856BF_AgentEntersEvent;               // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x8B9DBCF4_AgentExitsEvent;                // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x3AE56902_UpdateSelectedClassFunction;    // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xAD065A9B_UpdateSelectedTeamFunction;     // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0xB2AEAE78_IsAgentInVolumeFunction;        // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fmutator__zone__device_N_RIsInVolume_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fmutator__zone__device_N_RUpdateSelectedClass_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fmutator__zone__device_N_RUpdateSelectedTeam_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"mutator_zone_device">();
	}
	static class Umutator_zone_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Umutator_zone_device>();
	}
};

}

