#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NaniteDisplacedMesh

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct NaniteDisplacedMesh.NaniteDisplacedMeshDisplacementMap
// 0x0010 (0x0010 - 0x0000)
struct FNaniteDisplacedMeshDisplacementMap final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Center;                                            // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct NaniteDisplacedMesh.NaniteDisplacedMeshParams
// 0x0020 (0x0020 - 0x0000)
struct FNaniteDisplacedMeshParams final
{
public:
	class UStaticMesh*                            BaseMesh;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RelativeError;                                     // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNaniteDisplacedMeshDisplacementMap> DisplacementMaps;                                  // 0x0010(0x0010)(Edit, ZeroConstructor, EditorOnly, NativeAccessSpecifierPublic)
};

}

