#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NearestNeighborModel

#include "Basic.hpp"

#include "MLDeformerFramework_classes.hpp"
#include "NearestNeighborModel_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "OptimusCore_classes.hpp"
#include "ComputeFramework_classes.hpp"


namespace SDK
{

// Class NearestNeighborModel.NearestNeighborModelVizSettings
// 0x0028 (0x0150 - 0x0128)
class UNearestNeighborModelVizSettings final : public UMLDeformerMorphModelVizSettings
{
public:
	bool                                          bDrawVerts;                                        // 0x0128(0x0001)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VertVizSectionIndex;                               // 0x012C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NearestNeighborActorsOffset;                       // 0x0130(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NearestNeighborActorSectionIndex;                  // 0x0134(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 NearestNeighborIds;                                // 0x0138(0x0010)(Edit, ZeroConstructor, EditConst, EditorOnly, NativeAccessSpecifierPublic)
	int32                                         NeighborStatsPartId;                               // 0x0148(0x0004)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborModelVizSettings">();
	}
	static class UNearestNeighborModelVizSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborModelVizSettings>();
	}
};

// Class NearestNeighborModel.NearestNeighborNetworkLayer
// 0x0018 (0x0048 - 0x0030)
class UNearestNeighborNetworkLayer : public UObject
{
public:
	int32                                         NumInputs;                                         // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumOutputs;                                        // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNearestNeighborNetworkParameter> Parameters;                                        // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborNetworkLayer">();
	}
	static class UNearestNeighborNetworkLayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborNetworkLayer>();
	}
};

// Class NearestNeighborModel.NearestNeighborNetworkLayer_Gemm_Prelu
// 0x0000 (0x0048 - 0x0048)
class UNearestNeighborNetworkLayer_Gemm_Prelu final : public UNearestNeighborNetworkLayer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborNetworkLayer_Gemm_Prelu">();
	}
	static class UNearestNeighborNetworkLayer_Gemm_Prelu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborNetworkLayer_Gemm_Prelu>();
	}
};

// Class NearestNeighborModel.NearestNeighborNetworkLayer_Gemm
// 0x0000 (0x0048 - 0x0048)
class UNearestNeighborNetworkLayer_Gemm final : public UNearestNeighborNetworkLayer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborNetworkLayer_Gemm">();
	}
	static class UNearestNeighborNetworkLayer_Gemm* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborNetworkLayer_Gemm>();
	}
};

// Class NearestNeighborModel.NearestNeighborOptimizedNetwork
// 0x0030 (0x0060 - 0x0030)
class UNearestNeighborOptimizedNetwork final : public UObject
{
public:
	class UNNEModelData*                          ModelData;                                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumInputs;                                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumOutputs;                                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UNearestNeighborNetworkLayer*>   Layers;                                            // 0x0050(0x0010)(ZeroConstructor, Deprecated, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void Empty();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborOptimizedNetwork">();
	}
	static class UNearestNeighborOptimizedNetwork* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborOptimizedNetwork>();
	}
};

// Class NearestNeighborModel.NearestNeighborOptimizedNetworkInstance
// 0x0038 (0x0068 - 0x0030)
class UNearestNeighborOptimizedNetworkInstance final : public UObject
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UNearestNeighborOptimizedNetwork*       Network;                                           // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborOptimizedNetworkInstance">();
	}
	static class UNearestNeighborOptimizedNetworkInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborOptimizedNetworkInstance>();
	}
};

// Class NearestNeighborModel.NearestNeighborOptimizedNetworkLoader
// 0x0008 (0x0038 - 0x0030)
class UNearestNeighborOptimizedNetworkLoader final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool LoadOptimizedNetwork(const class FString& OnnxPath);

	class UNearestNeighborOptimizedNetwork* GetOptimizedNetwork() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborOptimizedNetworkLoader">();
	}
	static class UNearestNeighborOptimizedNetworkLoader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborOptimizedNetworkLoader>();
	}
};

// Class NearestNeighborModel.NearestNeighborModelSection
// 0x0118 (0x0148 - 0x0030)
class UNearestNeighborModelSection final : public UObject
{
public:
	class UAnimSequence*                          NeighborPoses;                                     // 0x0030(0x0008)(Edit, ZeroConstructor, EditorOnly, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGeometryCache*                         NeighborMeshes;                                    // 0x0038(0x0008)(Edit, ZeroConstructor, EditorOnly, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ENearestNeighborModelSectionWeightMapCreationMethod WeightMapCreationMethod;                           // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           BoneNames;                                         // 0x0048(0x0010)(ZeroConstructor, EditorOnly, Protected, NativeAccessSpecifierProtected)
	class FName                                   AttributeName;                                     // 0x0058(0x000C)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 VertexMapString;                                   // 0x0068(0x0010)(Edit, ZeroConstructor, EditorOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 ExternalTxtFile;                                   // 0x0078(0x0010)(Edit, ZeroConstructor, EditConst, EditorOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<int32>                                 ExcludedFrames;                                    // 0x0088(0x0010)(Edit, ZeroConstructor, EditorOnly, Protected, NativeAccessSpecifierProtected)
	int32                                         MeshIndex;                                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNearestNeighborModel*                  Model;                                             // 0x00A0(0x0008)(ZeroConstructor, EditorOnly, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<int32>                                 VertexMap;                                         // 0x00A8(0x0010)(ZeroConstructor, EditorOnly, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 VertexWeights;                                     // 0x00B8(0x0010)(ZeroConstructor, EditorOnly, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 Basis;                                             // 0x00C8(0x0010)(ZeroConstructor, EditorOnly, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 VertexMean;                                        // 0x00D8(0x0010)(ZeroConstructor, EditorOnly, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 AssetNeighborCoeffs;                               // 0x00E8(0x0010)(ZeroConstructor, EditorOnly, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 AssetNeighborOffsets;                              // 0x00F8(0x0010)(ZeroConstructor, EditorOnly, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 AssetNeighborIndexMap;                             // 0x0108(0x0010)(ZeroConstructor, EditorOnly, Protected, NativeAccessSpecifierProtected)
	int32                                         NumPCACoeffs;                                      // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumVertices;                                       // 0x011C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         RuntimeNumNeighbors;                               // 0x0120(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 RuntimeNeighborCoeffs;                             // 0x0128(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsReadyForTraining;                               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsReadyForInference;                              // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_13A[0xE];                                      // 0x013A(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBasisData(const TArray<float>& InVertexMean, const TArray<float>& InBasis);
	void SetNeighborData(const TArray<float>& InNeighborCoeffs, const TArray<float>& InNeighborOffsets);

	bool DoesUsePCA() const;
	const TArray<float> GetAssetNeighborCoeffs() const;
	int32 GetAssetNumNeighbors() const;
	const TArray<float> GetBasis() const;
	int32 GetNumBasis() const;
	TArray<class FName> GetVertexAttributeNames() const;
	const TArray<int32> GetVertexMap() const;
	const TArray<float> GetVertexMean() const;
	const TArray<float> GetVertexWeights() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborModelSection">();
	}
	static class UNearestNeighborModelSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborModelSection>();
	}
};

// Class NearestNeighborModel.NearestNeighborModel
// 0x0150 (0x0490 - 0x0340)
class UNearestNeighborModel final : public UMLDeformerMorphModel
{
public:
	int32                                         InputDim;                                          // 0x0340(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         OutputDim;                                         // 0x0344(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<int32>                                 HiddenLayerDims;                                   // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditorOnly, Protected, NativeAccessSpecifierProtected)
	int32                                         NumEpochs;                                         // 0x0358(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, EditorOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumIterations;                                     // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         BatchSize;                                         // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RegularizationFactor;                              // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SmoothLossBeta;                                    // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LearningRate;                                      // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         EarlyStopEpochs;                                   // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseFileCache;                                     // 0x0374(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FileCacheDirectory;                                // 0x0378(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, EditorOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_388[0x30];                                     // 0x0388(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FClothPartData>                 ClothPartData;                                     // 0x03B8(0x0010)(ZeroConstructor, Deprecated, EditorOnly, Protected, NativeAccessSpecifierProtected)
	bool                                          bUseInputMultipliers;                              // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector3f>                      InputMultipliers;                                  // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 InputsMin;                                         // 0x03E0(0x0010)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 InputsMax;                                         // 0x03F0(0x0010)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bUsePCA;                                           // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumBasisPerSection;                                // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseDualQuaternionDeltas;                          // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DecayFactor;                                       // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NearestNeighborOffsetWeight;                       // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseRBF;                                           // 0x0414(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_415[0x3];                                      // 0x0415(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RBFSigma;                                          // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNearestNeighborModelSection*>   Sections;                                          // 0x0420(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<int32>                                 PCACoeffStarts;                                    // 0x0430(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bIsReadyForTraining;                               // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsReadyForInference;                              // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_442[0x6];                                      // 0x0442(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNearestNeighborOptimizedNetwork*       OptimizedNetwork;                                  // 0x0448(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_450[0x8];                                      // 0x0450(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         NetworkLastWriteTime;                              // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int64                                         MorphTargetsLastWriteTime;                         // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 NetworkLastWriteArchitectureString;                // 0x0468(0x0010)(ZeroConstructor, EditorOnly, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_478[0x18];                                     // 0x0478(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool DoesUsePCA() const;
	int32 GetBatchSize() const;
	TArray<class FString> GetCachedDeltasPaths() const;
	TArray<class FString> GetCachedNetworkPaths() const;
	TArray<class FString> GetCachedPCAPaths() const;
	int32 GetEarlyStopEpochs() const;
	TArray<int32> GetHiddenLayerDims() const;
	int32 GetInputDim() const;
	float GetLearningRate() const;
	class FString GetModelDir() const;
	int32 GetNumEpochs() const;
	int32 GetNumIterations() const;
	int32 GetNumSections() const;
	int32 GetOutputDim() const;
	const TArray<int32> GetPCACoeffStarts() const;
	float GetRegularizationFactor() const;
	const class UNearestNeighborModelSection* GetSectionPtr(int32 Index_0) const;
	float GetSmoothLossBeta() const;
	int32 GetTotalNumBasis() const;
	bool IsReadyForInference() const;
	bool IsReadyForTraining() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborModel">();
	}
	static class UNearestNeighborModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborModel>();
	}
};

// Class NearestNeighborModel.NearestNeighborModelInputInfo
// 0x0010 (0x00C0 - 0x00B0)
class UNearestNeighborModelInputInfo final : public UMLDeformerMorphModelInputInfo
{
public:
	TArray<struct FQuat>                          RefBoneRotations;                                  // 0x00B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborModelInputInfo">();
	}
	static class UNearestNeighborModelInputInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborModelInputInfo>();
	}
};

// Class NearestNeighborModel.NearestNeighborModelInstance
// 0x0040 (0x00D8 - 0x0098)
class UNearestNeighborModelInstance final : public UMLDeformerMorphModelInstance
{
public:
	uint8                                         Pad_98[0x38];                                      // 0x0098(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UNearestNeighborOptimizedNetworkInstance* OptimizedNetworkInstance;                          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	TArray<float> Eval(const TArray<float>& InputData);
	void Reset();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborModelInstance">();
	}
	static class UNearestNeighborModelInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborModelInstance>();
	}
};

// Class NearestNeighborModel.OptimusSkeletonWithQuatsDataInterface
// 0x0000 (0x0030 - 0x0030)
class UOptimusSkeletonWithQuatsDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkeletonWithQuatsDataInterface">();
	}
	static class UOptimusSkeletonWithQuatsDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkeletonWithQuatsDataInterface>();
	}
};

// Class NearestNeighborModel.OptimusSkeletonWithQuatsDataProvider
// 0x0008 (0x0038 - 0x0030)
class UOptimusSkeletonWithQuatsDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkeletonWithQuatsDataProvider">();
	}
	static class UOptimusSkeletonWithQuatsDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkeletonWithQuatsDataProvider>();
	}
};

}

