#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NearestNeighborModel

#include "Basic.hpp"


namespace SDK::Params
{

// Function NearestNeighborModel.NearestNeighborOptimizedNetworkLoader.LoadOptimizedNetwork
// 0x0018 (0x0018 - 0x0000)
struct NearestNeighborOptimizedNetworkLoader_LoadOptimizedNetwork final
{
public:
	class FString                                 OnnxPath;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function NearestNeighborModel.NearestNeighborOptimizedNetworkLoader.GetOptimizedNetwork
// 0x0008 (0x0008 - 0x0000)
struct NearestNeighborOptimizedNetworkLoader_GetOptimizedNetwork final
{
public:
	class UNearestNeighborOptimizedNetwork*       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModelSection.SetBasisData
// 0x0020 (0x0020 - 0x0000)
struct NearestNeighborModelSection_SetBasisData final
{
public:
	TArray<float>                                 InVertexMean;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 InBasis;                                           // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModelSection.SetNeighborData
// 0x0020 (0x0020 - 0x0000)
struct NearestNeighborModelSection_SetNeighborData final
{
public:
	TArray<float>                                 InNeighborCoeffs;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 InNeighborOffsets;                                 // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModelSection.DoesUsePCA
// 0x0001 (0x0001 - 0x0000)
struct NearestNeighborModelSection_DoesUsePCA final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModelSection.GetAssetNeighborCoeffs
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborModelSection_GetAssetNeighborCoeffs final
{
public:
	TArray<float>                                 ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModelSection.GetAssetNumNeighbors
// 0x0004 (0x0004 - 0x0000)
struct NearestNeighborModelSection_GetAssetNumNeighbors final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModelSection.GetBasis
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborModelSection_GetBasis final
{
public:
	TArray<float>                                 ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModelSection.GetNumBasis
// 0x0004 (0x0004 - 0x0000)
struct NearestNeighborModelSection_GetNumBasis final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModelSection.GetVertexAttributeNames
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborModelSection_GetVertexAttributeNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModelSection.GetVertexMap
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborModelSection_GetVertexMap final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModelSection.GetVertexMean
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborModelSection_GetVertexMean final
{
public:
	TArray<float>                                 ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModelSection.GetVertexWeights
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborModelSection_GetVertexWeights final
{
public:
	TArray<float>                                 ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.DoesUsePCA
// 0x0001 (0x0001 - 0x0000)
struct NearestNeighborModel_DoesUsePCA final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetBatchSize
// 0x0004 (0x0004 - 0x0000)
struct NearestNeighborModel_GetBatchSize final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetCachedDeltasPaths
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborModel_GetCachedDeltasPaths final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetCachedNetworkPaths
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborModel_GetCachedNetworkPaths final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetCachedPCAPaths
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborModel_GetCachedPCAPaths final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetEarlyStopEpochs
// 0x0004 (0x0004 - 0x0000)
struct NearestNeighborModel_GetEarlyStopEpochs final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetHiddenLayerDims
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborModel_GetHiddenLayerDims final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetInputDim
// 0x0004 (0x0004 - 0x0000)
struct NearestNeighborModel_GetInputDim final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetLearningRate
// 0x0004 (0x0004 - 0x0000)
struct NearestNeighborModel_GetLearningRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetModelDir
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborModel_GetModelDir final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetNumEpochs
// 0x0004 (0x0004 - 0x0000)
struct NearestNeighborModel_GetNumEpochs final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetNumIterations
// 0x0004 (0x0004 - 0x0000)
struct NearestNeighborModel_GetNumIterations final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetNumSections
// 0x0004 (0x0004 - 0x0000)
struct NearestNeighborModel_GetNumSections final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetOutputDim
// 0x0004 (0x0004 - 0x0000)
struct NearestNeighborModel_GetOutputDim final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetPCACoeffStarts
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborModel_GetPCACoeffStarts final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetRegularizationFactor
// 0x0004 (0x0004 - 0x0000)
struct NearestNeighborModel_GetRegularizationFactor final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetSectionPtr
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborModel_GetSectionPtr final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UNearestNeighborModelSection*     ReturnValue;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetSmoothLossBeta
// 0x0004 (0x0004 - 0x0000)
struct NearestNeighborModel_GetSmoothLossBeta final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.GetTotalNumBasis
// 0x0004 (0x0004 - 0x0000)
struct NearestNeighborModel_GetTotalNumBasis final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.IsReadyForInference
// 0x0001 (0x0001 - 0x0000)
struct NearestNeighborModel_IsReadyForInference final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModel.IsReadyForTraining
// 0x0001 (0x0001 - 0x0000)
struct NearestNeighborModel_IsReadyForTraining final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModel.NearestNeighborModelInstance.Eval
// 0x0020 (0x0020 - 0x0000)
struct NearestNeighborModelInstance_Eval final
{
public:
	TArray<float>                                 InputData;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

}

