#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NearestNeighborModel

#include "Basic.hpp"


namespace SDK
{

// Enum NearestNeighborModel.ENearestNeighborModelSectionWeightMapCreationMethod
// NumValues: 0x0005
enum class ENearestNeighborModelSectionWeightMapCreationMethod : uint8
{
	FromText                                 = 0,
	SelectedBones                            = 1,
	VertexAttributes                         = 2,
	ExternalTxt                              = 3,
	ENearestNeighborModelSectionWeightMapCreationMethod_MAX = 4,
};

// ScriptStruct NearestNeighborModel.NearestNeighborNetworkParameter
// 0x0020 (0x0020 - 0x0000)
struct FNearestNeighborNetworkParameter final
{
public:
	TArray<float>                                 Values;                                            // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 Shape;                                             // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct NearestNeighborModel.ClothPartData
// 0x0080 (0x0080 - 0x0000)
struct FClothPartData final
{
public:
	int32                                         PCACoeffNum;                                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        PCACoeffStart;                                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        NumVertices;                                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        NumNeighbors;                                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint32>                                VertexMap;                                         // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 PCABasis;                                          // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 VertexMean;                                        // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 AssetNeighborCoeffs;                               // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 AssetNeighborOffsets;                              // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 AssetNeighborIndexMap;                             // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 NeighborCoeffs;                                    // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

}

