#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NearestNeighborModelEditor

#include "Basic.hpp"

#include "NearestNeighborModelEditor_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MLDeformerFrameworkEditor_classes.hpp"


namespace SDK
{

// Class NearestNeighborModelEditor.NearestNeighborAnimStream
// 0x0038 (0x0068 - 0x0030)
class UNearestNeighborAnimStream final : public UObject
{
public:
	uint8                                         Pad_30[0x38];                                      // 0x0030(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AppendFrames(const class UAnimSequence* Anim, const TArray<int32>& Frames);
	void Init(class USkeleton* InSkeleton);

	bool IsValid() const;
	bool ToAnim(class UAnimSequence* OutAnim) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborAnimStream">();
	}
	static class UNearestNeighborAnimStream* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborAnimStream>();
	}
};

// Class NearestNeighborModelEditor.NearestNeighborGeometryCacheStream
// 0x0030 (0x0060 - 0x0030)
class UNearestNeighborGeometryCacheStream final : public UObject
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AppendFrames(const class UGeometryCache* Cache, const TArray<int32>& Frames);
	void Init(const class UGeometryCache* InTemplateCache);
	bool ToGeometryCache(class UGeometryCache* OutCache);

	bool IsValid() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborGeometryCacheStream">();
	}
	static class UNearestNeighborGeometryCacheStream* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborGeometryCacheStream>();
	}
};

// Class NearestNeighborModelEditor.NearestNeighborKMeansData
// 0x0038 (0x0068 - 0x0030)
class UNearestNeighborKMeansData final : public UObject
{
public:
	class UMLDeformerAsset*                       NearestNeighborModelAsset;                         // 0x0030(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIndex;                                      // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumClusters;                                       // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExtractGeometryCache;                             // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNearestNeighborKMeansInputData> Inputs;                                            // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAnimSequence*                          ExtractedPoses;                                    // 0x0058(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryCache*                         ExtractedCache;                                    // 0x0060(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborKMeansData">();
	}
	static class UNearestNeighborKMeansData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborKMeansData>();
	}
};

// Class NearestNeighborModelEditor.NearestNeighborStatsData
// 0x0018 (0x0048 - 0x0030)
class UNearestNeighborStatsData final : public UObject
{
public:
	class UMLDeformerAsset*                       NearestNeighborModelAsset;                         // 0x0030(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          TestAnim;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIndex;                                      // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborStatsData">();
	}
	static class UNearestNeighborStatsData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborStatsData>();
	}
};

// Class NearestNeighborModelEditor.NearestNeighborTrainingModel
// 0x0028 (0x00C8 - 0x00A0)
class UNearestNeighborTrainingModel final : public UMLDeformerGeomCacheTrainingModel
{
public:
	TArray<float>                                 CustomSamplerBoneRotations;                        // 0x00A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 CustomSamplerDeltas;                               // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UNearestNeighborModelInstance* CreateModelInstance();
	bool CustomSample(int32 Frame);
	void DestroyModelInstance(class UNearestNeighborModelInstance* ModelInstance);
	TArray<int32> GetMeshIndexBuffer();
	bool GetNeighborStats(const class UNearestNeighborStatsData* StatsData);
	TArray<float> GetUnskinnedVertexPositions();
	int32 KmeansClusterPoses(const class UNearestNeighborKMeansData* KMeansData);
	bool SetCustomSamplerData(class UAnimSequence* Anim, class UGeometryCache* Cache);
	bool SetCustomSamplerDataFromSection(int32 SectionIndex);
	int32 UpdateNearestNeighborData();

	const class USkeleton* GetModelSkeleton(const class UMLDeformerModel* Model) const;
	class UNearestNeighborModel* GetNearestNeighborModel() const;
	int32 GetNumFramesAnimSequence(const class UAnimSequence* Anim) const;
	int32 GetNumFramesGeometryCache(const class UGeometryCache* GeometryCache) const;
	int32 Train() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborTrainingModel">();
	}
	static class UNearestNeighborTrainingModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborTrainingModel>();
	}
};

}

