#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NearestNeighborModelEditor

#include "Basic.hpp"


namespace SDK::Params
{

// Function NearestNeighborModelEditor.NearestNeighborAnimStream.AppendFrames
// 0x0020 (0x0020 - 0x0000)
struct NearestNeighborAnimStream_AppendFrames final
{
public:
	const class UAnimSequence*                    Anim;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 Frames;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function NearestNeighborModelEditor.NearestNeighborAnimStream.Init
// 0x0008 (0x0008 - 0x0000)
struct NearestNeighborAnimStream_Init final
{
public:
	class USkeleton*                              InSkeleton;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModelEditor.NearestNeighborAnimStream.IsValid
// 0x0001 (0x0001 - 0x0000)
struct NearestNeighborAnimStream_IsValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModelEditor.NearestNeighborAnimStream.ToAnim
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborAnimStream_ToAnim final
{
public:
	class UAnimSequence*                          OutAnim;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function NearestNeighborModelEditor.NearestNeighborGeometryCacheStream.AppendFrames
// 0x0020 (0x0020 - 0x0000)
struct NearestNeighborGeometryCacheStream_AppendFrames final
{
public:
	const class UGeometryCache*                   Cache;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 Frames;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function NearestNeighborModelEditor.NearestNeighborGeometryCacheStream.Init
// 0x0008 (0x0008 - 0x0000)
struct NearestNeighborGeometryCacheStream_Init final
{
public:
	const class UGeometryCache*                   InTemplateCache;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModelEditor.NearestNeighborGeometryCacheStream.ToGeometryCache
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborGeometryCacheStream_ToGeometryCache final
{
public:
	class UGeometryCache*                         OutCache;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function NearestNeighborModelEditor.NearestNeighborGeometryCacheStream.IsValid
// 0x0001 (0x0001 - 0x0000)
struct NearestNeighborGeometryCacheStream_IsValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModelEditor.NearestNeighborTrainingModel.CreateModelInstance
// 0x0008 (0x0008 - 0x0000)
struct NearestNeighborTrainingModel_CreateModelInstance final
{
public:
	class UNearestNeighborModelInstance*          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModelEditor.NearestNeighborTrainingModel.CustomSample
// 0x0008 (0x0008 - 0x0000)
struct NearestNeighborTrainingModel_CustomSample final
{
public:
	int32                                         Frame;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function NearestNeighborModelEditor.NearestNeighborTrainingModel.DestroyModelInstance
// 0x0008 (0x0008 - 0x0000)
struct NearestNeighborTrainingModel_DestroyModelInstance final
{
public:
	class UNearestNeighborModelInstance*          ModelInstance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModelEditor.NearestNeighborTrainingModel.GetMeshIndexBuffer
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborTrainingModel_GetMeshIndexBuffer final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModelEditor.NearestNeighborTrainingModel.GetNeighborStats
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborTrainingModel_GetNeighborStats final
{
public:
	const class UNearestNeighborStatsData*        StatsData;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function NearestNeighborModelEditor.NearestNeighborTrainingModel.GetUnskinnedVertexPositions
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborTrainingModel_GetUnskinnedVertexPositions final
{
public:
	TArray<float>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModelEditor.NearestNeighborTrainingModel.KmeansClusterPoses
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborTrainingModel_KmeansClusterPoses final
{
public:
	const class UNearestNeighborKMeansData*       KMeansData;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function NearestNeighborModelEditor.NearestNeighborTrainingModel.SetCustomSamplerData
// 0x0018 (0x0018 - 0x0000)
struct NearestNeighborTrainingModel_SetCustomSamplerData final
{
public:
	class UAnimSequence*                          Anim;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryCache*                         Cache;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function NearestNeighborModelEditor.NearestNeighborTrainingModel.SetCustomSamplerDataFromSection
// 0x0008 (0x0008 - 0x0000)
struct NearestNeighborTrainingModel_SetCustomSamplerDataFromSection final
{
public:
	int32                                         SectionIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function NearestNeighborModelEditor.NearestNeighborTrainingModel.UpdateNearestNeighborData
// 0x0004 (0x0004 - 0x0000)
struct NearestNeighborTrainingModel_UpdateNearestNeighborData final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModelEditor.NearestNeighborTrainingModel.GetModelSkeleton
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborTrainingModel_GetModelSkeleton final
{
public:
	const class UMLDeformerModel*                 Model;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class USkeleton*                        ReturnValue;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModelEditor.NearestNeighborTrainingModel.GetNearestNeighborModel
// 0x0008 (0x0008 - 0x0000)
struct NearestNeighborTrainingModel_GetNearestNeighborModel final
{
public:
	class UNearestNeighborModel*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NearestNeighborModelEditor.NearestNeighborTrainingModel.GetNumFramesAnimSequence
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborTrainingModel_GetNumFramesAnimSequence final
{
public:
	const class UAnimSequence*                    Anim;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function NearestNeighborModelEditor.NearestNeighborTrainingModel.GetNumFramesGeometryCache
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborTrainingModel_GetNumFramesGeometryCache final
{
public:
	const class UGeometryCache*                   GeometryCache;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function NearestNeighborModelEditor.NearestNeighborTrainingModel.Train
// 0x0004 (0x0004 - 0x0000)
struct NearestNeighborTrainingModel_Train final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

