#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NexusFramework_nexus_test_device

#include "Basic.hpp"

#include "VerseColors_structs.hpp"
#include "NexusFramework_nexus_test_device_structs.hpp"
#include "VerseNative_structs.hpp"
#include "UnrealEngineExperimental_0_structs.hpp"


namespace SDK::Params
{

// Function NexusFramework_nexus_test_device.nexus_test_device.$InitCDO
// 0x0040 (0x0040 - 0x0000)
struct nexus_test_device__InitCDO final
{
public:
	FVerseStringProperty_                         _ExprResult_0;                                     // 0x0000(0x0010)(HasGetValueTypeHash)
	class Unexus_test_runner*                     _ExprResult_1;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_2;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0020(0x0010)(HasGetValueTypeHash)
	class Unexus_test_runner*                     _ExprResult_4;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function NexusFramework_nexus_test_device.nexus_test_device._L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd
// 0x04A0 (0x04A0 - 0x0000)
struct nexus_test_device__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd final
{
public:
	struct NexusFramework_nexus_test_device::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R _ExprResult_2;                                     // 0x0020(0x0040)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0060(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                __verse_0xFFC68BC5_Array_1;                        // 0x0070(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0080(0x0018)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ExprResult_5;                                     // 0x0098(0x0010)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                 __verse_0xFFC68BC5_Array_2;                        // 0x00A8(0x0010)(ContainsInstancedReference)
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_M_Kchar_M_Kchar_R __verse_0x00000000__3;                             // 0x00B8(0x0030)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x00E8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_7;                                // 0x00F8(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x0108(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_9;                                     // 0x0120(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_10;                               // 0x0130(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_11;                               // 0x0140(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_12;                               // 0x0150(0x0010)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ForResult_13;                                     // 0x0160(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_14;                                      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_15;                                     // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xFB88B569_Item_5;                         // 0x0180(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ExprResult_16;                                    // 0x0190(0x0010)(ContainsInstancedReference)
	FVerseStringProperty_                         __verse_0xFFC68BC5_Array_6;                        // 0x01A0(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ForResult_17;                                     // 0x01B0(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_18;                                      // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_19;                                     // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xFB88B569_Item_8;                         // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_20;                                    // 0x01D8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ForResult_21;                                     // 0x01E8(0x0010)(HasGetValueTypeHash)
	int64                                         _ForIndex_22;                                      // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_23;                                     // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        __verse_0xFB88B569_Item_10;                        // 0x0208(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_24;                                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<double>                             _ExprResult_25;                                    // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<struct FColors_color>               _ExprResult_26;                                    // 0x0230(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVerseTrue                                    _InvokeSureResultDummy_27;                         // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_28;                                        // 0x0258(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R _ExprResult_29;                                    // 0x0270(0x0040)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_30;                                    // 0x02B0(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                __verse_0xFFC68BC5_Array_11;                       // 0x02C0(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_31;                                        // 0x02D0(0x0018)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ExprResult_32;                                    // 0x02E8(0x0010)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                 __verse_0xFFC68BC5_Array_12;                       // 0x02F8(0x0010)(ContainsInstancedReference)
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_M_Kchar_M_Kchar_R __verse_0x00000000__13;                            // 0x0308(0x0030)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_33;                                    // 0x0338(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_34;                               // 0x0348(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_35;                                        // 0x0358(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_36;                                    // 0x0370(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_37;                               // 0x0380(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_38;                               // 0x0390(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_39;                               // 0x03A0(0x0010)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ForResult_40;                                     // 0x03B0(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_41;                                      // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_42;                                     // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xFB88B569_Item_15;                        // 0x03D0(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ExprResult_43;                                    // 0x03E0(0x0010)(ContainsInstancedReference)
	FVerseStringProperty_                         __verse_0xFFC68BC5_Array_16;                       // 0x03F0(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ForResult_44;                                     // 0x0400(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_45;                                      // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_46;                                     // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xFB88B569_Item_18;                        // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_47;                                    // 0x0428(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ForResult_48;                                     // 0x0438(0x0010)(HasGetValueTypeHash)
	int64                                         _ForIndex_49;                                      // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_50;                                     // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        __verse_0xFB88B569_Item_20;                        // 0x0458(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_51;                                    // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<double>                             _ExprResult_52;                                    // 0x0470(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<struct FColors_color>               _ExprResult_53;                                    // 0x0480(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function NexusFramework_nexus_test_device.nexus_test_device._L_2fFortnite_2ecom_2fVerseInternalTesting_2fNexusFramework_2fnexus__test__device_N_RAddCheck_L_Nlogic_M_N_Kchar_M_N_Kchar_R
// 0x0128 (0x0128 - 0x0000)
struct nexus_test_device__L_2fFortnite_2ecom_2fVerseInternalTesting_2fNexusFramework_2fnexus__test__device_N_RAddCheck_L_Nlogic_M_N_Kchar_M_N_Kchar_R final
{
public:
	struct Ftuple_Llogic_M_Kchar_M_Kchar_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0028)(Parm, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_0;                                // 0x0028(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_1;                          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_M_Kchar_R _ExprResult_3;                                     // 0x0048(0x0020)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_4;                          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0070(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_M_Kchar_R _ExprResult_6;                                     // 0x0088(0x0020)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_7;                                // 0x00A8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_8;                          // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x00B0(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_M_Kchar_R _ExprResult_10;                                    // 0x00C8(0x0020)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_11;                         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_12;                                        // 0x00F0(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_M_Kchar_R _ExprResult_13;                                    // 0x0108(0x0020)(HasGetValueTypeHash)
};

// Function NexusFramework_nexus_test_device.nexus_test_device._L_2fFortnite_2ecom_2fVerseInternalTesting_2fNexusFramework_2fnexus__test__device_N_RAddFail_L_N_Kchar_M_N_Kchar_R
// 0x00B0 (0x00B0 - 0x0000)
struct nexus_test_device__L_2fFortnite_2ecom_2fVerseInternalTesting_2fNexusFramework_2fnexus__test__device_N_RAddFail_L_N_Kchar_M_N_Kchar_R final
{
public:
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_M_Kchar_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0028(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_Mlogic_M_Kchar_R _ExprResult_2;                                     // 0x0040(0x0028)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0070(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_Mlogic_M_Kchar_R _ExprResult_5;                                     // 0x0088(0x0028)(HasGetValueTypeHash)
};

// Function NexusFramework_nexus_test_device.nexus_test_device._L_2fFortnite_2ecom_2fVerseInternalTesting_2fNexusFramework_2fnexus__test__device_N_RAddPass_L_N_Kchar_M_N_Kchar_R
// 0x00B0 (0x00B0 - 0x0000)
struct nexus_test_device__L_2fFortnite_2ecom_2fVerseInternalTesting_2fNexusFramework_2fnexus__test__device_N_RAddPass_L_N_Kchar_M_N_Kchar_R final
{
public:
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_M_Kchar_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0028(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_Mlogic_M_Kchar_R _ExprResult_2;                                     // 0x0040(0x0028)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0070(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_Mlogic_M_Kchar_R _ExprResult_5;                                     // 0x0088(0x0028)(HasGetValueTypeHash)
};

// Function NexusFramework_nexus_test_device.nexus_test_device._L_2fFortnite_2ecom_2fVerseInternalTesting_2fNexusFramework_2fnexus__test__device_N_RAddResults_L_N_Kchar_M_Nlogic_M_N_Kchar_R
// 0x06A8 (0x06A8 - 0x0000)
struct nexus_test_device__L_2fFortnite_2ecom_2fVerseInternalTesting_2fNexusFramework_2fnexus__test__device_N_RAddResults_L_N_Kchar_M_Nlogic_M_N_Kchar_R final
{
public:
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_Mlogic_M_Kchar_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0028)(Parm, HasGetValueTypeHash)
	ETesting_test_result                          __verse_0x326E455F_TestResult_1;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_0;                                // 0x0029(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETesting_test_result                          _AssignmentScratch_1;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETesting_test_result                          _AssignmentScratch_2;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R _ExprResult_5;                                     // 0x0048(0x0040)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                __verse_0xFFC68BC5_Array_4;                        // 0x0098(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x00A8(0x0018)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ExprResult_8;                                     // 0x00C0(0x0010)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                 __verse_0xFFC68BC5_Array_5;                        // 0x00D0(0x0010)(ContainsInstancedReference)
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_R __verse_0x00000000__6;                             // 0x00E0(0x0040)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_9;                                     // 0x0120(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_10;                               // 0x0130(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x0140(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_12;                                    // 0x0158(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_13;                               // 0x0168(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_14;                                        // 0x0178(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_15;                               // 0x0190(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_16;                               // 0x01A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_17;                               // 0x01B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_18;                               // 0x01C0(0x0010)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ForResult_19;                                     // 0x01D0(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_20;                                      // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_21;                                     // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xFB88B569_Item_8;                         // 0x01F0(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ExprResult_22;                                    // 0x0200(0x0010)(ContainsInstancedReference)
	FVerseStringProperty_                         __verse_0xFFC68BC5_Array_9;                        // 0x0210(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ForResult_23;                                     // 0x0220(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_24;                                      // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_25;                                     // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xFB88B569_Item_11;                        // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_26;                                    // 0x0248(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ForResult_27;                                     // 0x0258(0x0010)(HasGetValueTypeHash)
	int64                                         _ForIndex_28;                                      // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_29;                                     // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        __verse_0xFB88B569_Item_13;                        // 0x0278(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_30;                                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<double>                             _ExprResult_31;                                    // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<struct FColors_color>               _ExprResult_32;                                    // 0x02A0(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTesting_test_reporter*                 __verse_0x00000000__14;                            // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Unexus_test_runner*                     _ExprResultStack_33;                               // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_34;                         // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_35;                                        // 0x02D8(0x0018)(HasGetValueTypeHash)
	struct Ftuple_L_Kchar_Mtest__result_M_QCategory_N_Kchar_M_QSubCategory_N_Kchar_R _ExprResult_36;                                    // 0x02F0(0x0048)(HasGetValueTypeHash)
	TOptional<FVerseStringProperty_>              _ExprResult_37;                                    // 0x0338(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TOptional<FVerseStringProperty_>              _ExprResult_38;                                    // 0x0350(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	ETesting_test_result                          __verse_0x326E455F_TestResult_15;                  // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_39;                               // 0x0369(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETesting_test_result                          _AssignmentScratch_40;                             // 0x036B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETesting_test_result                          _AssignmentScratch_41;                             // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_42;                         // 0x036D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36E[0x2];                                      // 0x036E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_43;                                        // 0x0370(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R _ExprResult_44;                                    // 0x0388(0x0040)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_45;                                    // 0x03C8(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                __verse_0xFFC68BC5_Array_18;                       // 0x03D8(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_46;                                        // 0x03E8(0x0018)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ExprResult_47;                                    // 0x0400(0x0010)(ContainsInstancedReference)
	TArray<FVerseStringProperty_>                 __verse_0xFFC68BC5_Array_19;                       // 0x0410(0x0010)(ContainsInstancedReference)
	struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_R __verse_0x00000000__20;                            // 0x0420(0x0040)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_48;                                    // 0x0460(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_49;                               // 0x0470(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_50;                                        // 0x0480(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_51;                                    // 0x0498(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_52;                               // 0x04A8(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_53;                                        // 0x04B8(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_54;                               // 0x04D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_55;                               // 0x04E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_56;                               // 0x04F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultDummy_57;                               // 0x0500(0x0010)(HasGetValueTypeHash)
	TArray<TArray<FVerseDynamicProperty_>>        _ForResult_58;                                     // 0x0510(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_59;                                      // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_60;                                     // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xFB88B569_Item_22;                        // 0x0530(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ExprResult_61;                                    // 0x0540(0x0010)(ContainsInstancedReference)
	FVerseStringProperty_                         __verse_0xFFC68BC5_Array_23;                       // 0x0550(0x0010)(HasGetValueTypeHash)
	TArray<FVerseDynamicProperty_>                _ForResult_62;                                     // 0x0560(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_63;                                      // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_64;                                     // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xFB88B569_Item_25;                        // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _ExprResult_65;                                    // 0x0588(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ForResult_66;                                     // 0x0598(0x0010)(HasGetValueTypeHash)
	int64                                         _ForIndex_67;                                      // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_68;                                     // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        __verse_0xFB88B569_Item_27;                        // 0x05B8(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_69;                                    // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<double>                             _ExprResult_70;                                    // 0x05D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<struct FColors_color>               _ExprResult_71;                                    // 0x05E0(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTesting_test_reporter*                 __verse_0x00000000__28;                            // 0x0600(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Unexus_test_runner*                     _ExprResultStack_72;                               // 0x0608(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_73;                         // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_74;                                        // 0x0618(0x0018)(HasGetValueTypeHash)
	struct Ftuple_L_Kchar_Mtest__result_M_QCategory_N_Kchar_M_QSubCategory_N_Kchar_R _ExprResult_75;                                    // 0x0630(0x0048)(HasGetValueTypeHash)
	TOptional<FVerseStringProperty_>              _ExprResult_76;                                    // 0x0678(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TOptional<FVerseStringProperty_>              _ExprResult_77;                                    // 0x0690(0x0018)(ZeroConstructor, HasGetValueTypeHash)
};

// Function NexusFramework_nexus_test_device.nexus_test_device._L_2fFortnite_2ecom_2fVerseInternalTesting_2fNexusFramework_2fnexus__test__device_N_RAddSkip_L_Nlogic_M_N_Kchar_M_N_Kchar_R
// 0x0178 (0x0178 - 0x0000)
struct nexus_test_device__L_2fFortnite_2ecom_2fVerseInternalTesting_2fNexusFramework_2fnexus__test__device_N_RAddSkip_L_Nlogic_M_N_Kchar_M_N_Kchar_R final
{
public:
	struct Ftuple_Llogic_M_Kchar_M_Kchar_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0028)(Parm, HasGetValueTypeHash)
	class UTesting_test_reporter*                 __verse_0x00000000__1;                             // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Unexus_test_runner*                     _ExprResultStack_0;                                // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_1;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
	struct Ftuple_L_Kchar_Mtest__result_M_QCategory_N_Kchar_M_QSubCategory_N_Kchar_R _ExprResult_3;                                     // 0x0058(0x0048)(HasGetValueTypeHash)
	TOptional<FVerseStringProperty_>              _ExprResult_4;                                     // 0x00A0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TOptional<FVerseStringProperty_>              _ExprResult_5;                                     // 0x00B8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class UTesting_test_reporter*                 __verse_0x00000000__2;                             // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Unexus_test_runner*                     _ExprResultStack_6;                                // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_7;                          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x00E8(0x0018)(HasGetValueTypeHash)
	struct Ftuple_L_Kchar_Mtest__result_M_QCategory_N_Kchar_M_QSubCategory_N_Kchar_R _ExprResult_9;                                     // 0x0100(0x0048)(HasGetValueTypeHash)
	TOptional<FVerseStringProperty_>              _ExprResult_10;                                    // 0x0148(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TOptional<FVerseStringProperty_>              _ExprResult_11;                                    // 0x0160(0x0018)(ZeroConstructor, HasGetValueTypeHash)
};

// Function NexusFramework_nexus_test_device.nexus_test_device.OnBegin
// 0x0028 (0x0028 - 0x0000)
struct nexus_test_device_OnBegin final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct NexusFramework_nexus_test_device::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function NexusFramework_nexus_test_device.task_nexus_test_device$OnBegin.Update
// 0x0008 (0x0008 - 0x0000)
struct task_nexus_test_device_OnBegin_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

