#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NexusFramework_nexus_test_device

#include "Basic.hpp"

#include "VerseColors_structs.hpp"
#include "UnrealEngineExperimental_0_structs.hpp"


namespace SDK
{

// VerseStruct NexusFramework_nexus_test_device.tuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_R
// 0x0040 (0x0040 - 0x0000)
struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0020(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xF64C4596_Elem3;                          // 0x0030(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct NexusFramework_nexus_test_device.tuple_L_Kchar_M_Kchar_M_Kchar_R
// 0x0030 (0x0030 - 0x0000)
struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_M_Kchar_M_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0020(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct NexusFramework_nexus_test_device.tuple_L_Kchar_M_Kchar_R
// 0x0020 (0x0020 - 0x0000)
struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_M_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct NexusFramework_nexus_test_device.tuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R
// 0x0040 (0x0040 - 0x0000)
struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<double>                             __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<struct FColors_color>               __verse_0x932BF92E_Elem2;                          // 0x0020(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};

// VerseStruct NexusFramework_nexus_test_device.tuple_L_Kchar_Mlogic_M_Kchar_R
// 0x0028 (0x0028 - 0x0000)
struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_Mlogic_M_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         __verse_0x7D844C3C_Elem1 : 1;                      // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0018(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct NexusFramework_nexus_test_device.tuple_L_Kchar_Mtest__result_M_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R
// 0x0048 (0x0048 - 0x0000)
struct NexusFramework_nexus_test_device::Ftuple_L_Kchar_Mtest__result_M_QCategory_N_Kchar_20_3d_20_2e_2e_2e_M_QSubCategory_N_Kchar_20_3d_20_2e_2e_2e_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	ETesting_test_result                          __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<FVerseStringProperty_>              __verse_0x932BF92E_Elem2;                          // 0x0018(0x0018)(ZeroConstructor, InstancedReference, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<FVerseStringProperty_>              __verse_0xF64C4596_Elem3;                          // 0x0030(0x0018)(ZeroConstructor, InstancedReference, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct NexusFramework_nexus_test_device.tuple_L_Kchar_Mtest__result_M_QCategory_N_Kchar_M_QSubCategory_N_Kchar_R
// 0x0048 (0x0048 - 0x0000)
struct Ftuple_L_Kchar_Mtest__result_M_QCategory_N_Kchar_M_QSubCategory_N_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	ETesting_test_result                          __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<FVerseStringProperty_>              __verse_0x932BF92E_Elem2;                          // 0x0018(0x0018)(ZeroConstructor, InstancedReference, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<FVerseStringProperty_>              __verse_0xF64C4596_Elem3;                          // 0x0030(0x0018)(ZeroConstructor, InstancedReference, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct NexusFramework_nexus_test_device.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct NexusFramework_nexus_test_device::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct NexusFramework_nexus_test_device.tuple_Llogic_M_Kchar_M_Kchar_R
// 0x0028 (0x0028 - 0x0000)
struct Ftuple_Llogic_M_Kchar_M_Kchar_R final
{
public:
	uint8                                         __verse_0x18E3F084_Elem0 : 1;                      // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0018(0x0010)(InstancedReference, HasGetValueTypeHash)
};

}

