#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NexusFramework_example_nexus_device

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "NexusFramework_nexus_test_device_classes.hpp"
#include "NexusFramework_example_nexus_device_structs.hpp"
#include "VerseNative_structs.hpp"
#include "VerseNative_0_classes.hpp"


namespace SDK
{

// VerseClass NexusFramework_example_nexus_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class NexusFramework_example_nexus_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass NexusFramework_example_nexus_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class NexusFramework_example_nexus_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<NexusFramework_example_nexus_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass NexusFramework_example_nexus_device.example_nexus_device
// 0x0000 (0x00F0 - 0x00F0)
class Uexample_nexus_device final : public Unexus_test_device
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd(const struct NexusFramework_example_nexus_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* OnBegin(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct NexusFramework_example_nexus_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"example_nexus_device">();
	}
	static class Uexample_nexus_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uexample_nexus_device>();
	}
};

// VerseClass NexusFramework_example_nexus_device.task_example_nexus_device$OnBegin
// 0x02F0 (0x03B8 - 0x00C8)
class Utask_example_nexus_device_OnBegin final : public UConcurrency_task
{
public:
	class Uexample_nexus_device*                  _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct NexusFramework_example_nexus_device::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_0;                                      // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct NexusFramework_example_nexus_device::Ftuple_L_R _ExprResult_1;                                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_2;                                    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x00F8(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_example_nexus_device::Ftuple_L_Kchar_Mlogic_M_Kchar_R _ExprResult_5;                                     // 0x0110(0x0028)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x0138(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0148(0x0010)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_8;                          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x0160(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_example_nexus_device::Ftuple_L_Kchar_M_Kchar_R _ExprResult_10;                                    // 0x0178(0x0020)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x0198(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_12;                                    // 0x01A8(0x0010)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_13;                         // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_14;                                        // 0x01C0(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_example_nexus_device::Ftuple_L_Kchar_M_Kchar_R _ExprResult_15;                                    // 0x01D8(0x0020)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_16;                                    // 0x01F8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_17;                                    // 0x0208(0x0010)(HasGetValueTypeHash)
	class Unexus_test_runner*                     __verse_0x00000000__2;                             // 0x0218(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_18;                         // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_19;                                        // 0x0228(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_example_nexus_device::Ftuple_L_R _ExprResult_20;                                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_21;                                     // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct NexusFramework_example_nexus_device::Ftuple_L_R _ExprResult_22;                                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_23;                                   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_24;                         // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_25;                                        // 0x0268(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_example_nexus_device::Ftuple_L_Kchar_Mlogic_M_Kchar_R _ExprResult_26;                                    // 0x0280(0x0028)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_27;                                    // 0x02A8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_28;                                    // 0x02B8(0x0010)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_29;                         // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_30;                                        // 0x02D0(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_example_nexus_device::Ftuple_L_Kchar_M_Kchar_R _ExprResult_31;                                    // 0x02E8(0x0020)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_32;                                    // 0x0308(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_33;                                    // 0x0318(0x0010)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_34;                         // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_35;                                        // 0x0330(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_example_nexus_device::Ftuple_L_Kchar_M_Kchar_R _ExprResult_36;                                    // 0x0348(0x0020)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_37;                                    // 0x0368(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_38;                                    // 0x0378(0x0010)(HasGetValueTypeHash)
	class Unexus_test_runner*                     __verse_0x00000000__4;                             // 0x0388(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_39;                         // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_40;                                        // 0x0398(0x0018)(HasGetValueTypeHash)
	struct NexusFramework_example_nexus_device::Ftuple_L_R _ExprResult_41;                                    // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_example_nexus_device$OnBegin">();
	}
	static class Utask_example_nexus_device_OnBegin* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_example_nexus_device_OnBegin>();
	}
};

}

