#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NiagaraSimCaching

#include "Basic.hpp"

#include "NiagaraSimCaching_structs.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class NiagaraSimCaching.MovieSceneNiagaraCacheSection
// 0x0090 (0x01E8 - 0x0158)
class UMovieSceneNiagaraCacheSection final : public UMovieSceneBaseCacheSection
{
public:
	struct FMovieSceneNiagaraCacheParams          Params_0;                                          // 0x0158(0x0088)(Edit, NativeAccessSpecifierPublic)
	bool                                          bCacheOutOfDate;                                   // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraCacheSection">();
	}
	static class UMovieSceneNiagaraCacheSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraCacheSection>();
	}
};

// Class NiagaraSimCaching.MovieSceneNiagaraCacheTrack
// 0x0030 (0x0120 - 0x00F0)
class UMovieSceneNiagaraCacheTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_F0[0x10];                                      // 0x00F0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsRecording;                                      // 0x0100(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             AnimationSections;                                 // 0x0108(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	bool                                          bCacheRecordingEnabled;                            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraCacheTrack">();
	}
	static class UMovieSceneNiagaraCacheTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraCacheTrack>();
	}
};

}

