#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: nitro_hoop_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass nitro_hoop_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class nitro_hoop_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass nitro_hoop_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class nitro_hoop_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<nitro_hoop_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass nitro_hoop_device.nitro_hoop_device
// 0x0060 (0x0120 - 0x00C0)
class Unitro_hoop_device final : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0xF2C0ED71_PlayerTriggeredEvent;           // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xDAE82D3C_VehicleTriggeredEvent;          // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x3D4C7222_CooldownStartEvent;             // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xBBE8E2FC_EnabledEvent;                   // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x5BB90C4F_ActivateFunction;               // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x1B079F29_DeactivateFunction;             // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_logic*     __verse_0xDA80398D_SetCooldownEnabledFunction;     // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_float*     __verse_0x3D975034_StartCooldownFunction;          // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_logic*     __verse_0x6D93709C_GetEnabledStateFunction;        // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_float*     __verse_0xAAA9CCE9_GetDefaultCooldownDurationFunction; // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_float*     __verse_0x60833856_SetDefaultCooldownDurationFunction; // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fnitro__hoop__device_N_RAllowCooldown(const struct nitro_hoop_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fnitro__hoop__device_N_RDisable(const struct nitro_hoop_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fnitro__hoop__device_N_RDisallowCooldown(const struct nitro_hoop_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fnitro__hoop__device_N_REnable(const struct nitro_hoop_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fDevices_2fnitro__hoop__device_N_RGetDefaultCooldownDuration(const struct nitro_hoop_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fnitro__hoop__device_N_RIsEnabled(const struct nitro_hoop_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fnitro__hoop__device_N_RSetDefaultCooldownDuration_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fnitro__hoop__device_N_RStartCooldown_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"nitro_hoop_device">();
	}
	static class Unitro_hoop_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Unitro_hoop_device>();
	}
};

}

