#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: nitro_barrel_spawner_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass nitro_barrel_spawner_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class nitro_barrel_spawner_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass nitro_barrel_spawner_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class nitro_barrel_spawner_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<nitro_barrel_spawner_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass nitro_barrel_spawner_device.nitro_barrel_spawner_device
// 0x0060 (0x0120 - 0x00C0)
class Unitro_barrel_spawner_device final : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0xA2BCBF9D_LaunchedEvent;                  // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x98DD5BB7_ExplodedEvent;                  // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x5BDC7A5C_EnableFunction;                 // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC9184E23_DisableFunction;                // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_logic*     __verse_0x6D93709C_GetEnabledStateFunction;        // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_float*     __verse_0xFF99149F_SetLaunchForceMultiplierFunction; // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_float*     __verse_0x8112F6D9_GetLaunchForceMultiplierFunction; // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x83A877D3_AllowRespawnFunction;           // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x5514D75E_DisallowRespawnFunction;        // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_logic*     __verse_0x6C8C8BD2_GetRespawnAllowedFunction;      // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_float*     __verse_0x7EE15A8B_SetRespawnDelayFunction;        // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_float*     __verse_0xEB58E111_GetRespawnDelayFunction;        // 0x0118(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fnitro__barrel__spawner__device_N_RAllowRespawn(const struct nitro_barrel_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fnitro__barrel__spawner__device_N_RDisable(const struct nitro_barrel_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fnitro__barrel__spawner__device_N_RDisallowRespawn(const struct nitro_barrel_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fnitro__barrel__spawner__device_N_REnable(const struct nitro_barrel_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fDevices_2fnitro__barrel__spawner__device_N_RGetLaunchForceMultiplier(const struct nitro_barrel_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fDevices_2fnitro__barrel__spawner__device_N_RGetRespawnDelay(const struct nitro_barrel_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fnitro__barrel__spawner__device_N_RIsEnabled(const struct nitro_barrel_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fnitro__barrel__spawner__device_N_RIsRespawnAllowed(const struct nitro_barrel_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fnitro__barrel__spawner__device_N_RSetLaunchForceMultiplier_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fnitro__barrel__spawner__device_N_RSetRespawnDelay_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"nitro_barrel_spawner_device">();
	}
	static class Unitro_barrel_spawner_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Unitro_barrel_spawner_device>();
	}
};

}

