#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NitroGameplayRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "TargetingSystem_structs.hpp"
#include "ModularGameplay_classes.hpp"


namespace SDK
{

// Class NitroGameplayRuntime.FortGA_NitroBashBase
// 0x0090 (0x0C58 - 0x0BC8)
class UFortGA_NitroBashBase final : public UFortGameplayAbility
{
public:
	struct FScalableFloat                         MinExplosiveSpeedVehicle;                          // 0x0BC8(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         SpeedCheckFrequency;                               // 0x0C00(0x0038)(Edit, NativeAccessSpecifierPublic)
	float                                         MinGeneralSpeedToTrigger;                          // 0x0C38(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AFortAthenaVehicle>      VehicleOnwer;                                      // 0x0C3C(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C44[0x14];                                     // 0x0C44(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnVehicleDestroyedBuiding();
	void BP_TryChangeBashState(bool IsBashable);
	void SpeedCheck();

	float GetOwnerSpeed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGA_NitroBashBase">();
	}
	static class UFortGA_NitroBashBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGA_NitroBashBase>();
	}
};

// Class NitroGameplayRuntime.FortGCNL_Nitro_Active_Base
// 0x0058 (0x0BF0 - 0x0B98)
class AFortGCNL_Nitro_Active_Base final : public AFortGameplayCueNotify_Loop
{
public:
	float                                         IntervalToUpdateTimerHandleForVFX;                 // 0x0B98(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9C[0x4];                                      // 0x0B9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  NitroStateEffectTags;                              // 0x0BA0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          UseEffectDuration;                                 // 0x0BC0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC1[0x3];                                      // 0x0BC1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            NitroStateEffectHandle;                            // 0x0BC4(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BCC[0x4];                                      // 0x0BCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x0BD0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RemainingDuration;                                 // 0x0BD8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UFortAbilitySystemComponent> OwnerAbilitySystemComponent;                       // 0x0BDC(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BE4[0xC];                                      // 0x0BE4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateCurrentSpeed(float NewCurrentSpeed);
	void UpdateDurationAndVFXParameters();
	void UpdateRemainingDuration(float NewRemainingDuration);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGCNL_Nitro_Active_Base">();
	}
	static class AFortGCNL_Nitro_Active_Base* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortGCNL_Nitro_Active_Base>();
	}
};

// Class NitroGameplayRuntime.FortMovementMode_PlayerNitroStateRuntimeData
// 0x0010 (0x0058 - 0x0048)
class UFortMovementMode_PlayerNitroStateRuntimeData final : public UFortMovementMode_BaseExtRuntimeData
{
public:
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_PlayerNitroStateRuntimeData">();
	}
	static class UFortMovementMode_PlayerNitroStateRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_PlayerNitroStateRuntimeData>();
	}
};

// Class NitroGameplayRuntime.FortMovementMode_ExtLogicNitroState
// 0x01A0 (0x02E8 - 0x0148)
class UFortMovementMode_ExtLogicNitroState final : public UFortMovementMode_BaseExtLogic
{
public:
	struct FScalableFloat                         SwimSpeedSpeedMultiplier;                          // 0x0148(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FScalableFloat                         LandSpeedMultiplier;                               // 0x0180(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FScalableFloat                         JumpZVelocityMultiplier;                           // 0x01B8(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FScalableFloat                         JumpHorizontalVelocityOverride;                    // 0x01F0(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FScalableFloat                         JumpHorizontalAccelerationOverride;                // 0x0228(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FScalableFloat                         DotThresholdToApplyJumpBoostTag;                   // 0x0260(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  RequiredTagsToApplyHorizontalJumpBoost;            // 0x0298(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                   GameplayCuesTagsToPush;                            // 0x02B8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C8[0x20];                                     // 0x02C8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ExtLogicNitroState">();
	}
	static class UFortMovementMode_ExtLogicNitroState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ExtLogicNitroState>();
	}
};

// Class NitroGameplayRuntime.FortPawnComponent_NitroPlayerState
// 0x0028 (0x0108 - 0x00E0)
class UFortPawnComponent_NitroPlayerState final : public UFortPawnComponent
{
public:
	TSubclassOf<class UFortMovementMode_ExtLogicNitroState> NitroStateMovementModeExtension;                   // 0x00E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           NitroPlayerStateMovementTag;                       // 0x00E8(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F4[0x14];                                      // 0x00F4(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EndNitroState();
	void HandleControllerChanged(class APawn* Pawn, class AController* OldController, class AController* NewController);
	void StartNitroPlayerStateMovement();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPawnComponent_NitroPlayerState">();
	}
	static class UFortPawnComponent_NitroPlayerState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPawnComponent_NitroPlayerState>();
	}
};

// Class NitroGameplayRuntime.FortWeaponNitroGauntlets
// 0x0038 (0x2098 - 0x2060)
class AFortWeaponNitroGauntlets final : public AFortWeaponRanged
{
public:
	TMulticastInlineDelegate<void(bool bFoundTarget, bool bGroundPunch)> OnUpdatePunchPreview;                              // 0x2060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FTargetingRequestHandle                PunchPreviewAsyncTargetingHandle;                  // 0x2070(0x0004)(BlueprintVisible, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2074[0x4];                                     // 0x2074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTargetingPreset*                       GroundPunchTargetingPreset;                        // 0x2078(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTargetingPreset*                       AirPunchTargetingPreset;                           // 0x2080(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2088[0x10];                                    // 0x2088(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CleanupAsyncTargeting();
	void UpdatePunchPreviewNative();

	bool IsAirPunch() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortWeaponNitroGauntlets">();
	}
	static class AFortWeaponNitroGauntlets* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortWeaponNitroGauntlets>();
	}
};

// Class NitroGameplayRuntime.NirtroBashLayerAnimInstance
// 0x0070 (0x1510 - 0x14A0)
class UNirtroBashLayerAnimInstance final : public UFortPlayerAnimInstanceProxy
{
public:
	bool                                          bIsBash_01;                                        // 0x1498(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBash_02;                                        // 0x1499(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsExitBash;                                       // 0x149A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBounceBack;                                     // 0x149B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTacSprintOrBashing;                             // 0x149C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCurrentlyBashing;                               // 0x149D(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_149E[0x2];                                     // 0x149E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          UpperBodyBash;                                     // 0x14A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          FullBodyBash;                                      // 0x14A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          UpperBodyBashSequenceA;                            // 0x14B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          UpperBodyBashSequenceB;                            // 0x14B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          FullBodyBashSequenceA;                             // 0x14C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          FullBodyBashSequenceB;                             // 0x14C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           TacticalSprintTag;                                 // 0x14D0(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           BounceBackTag;                                     // 0x14DC(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           IsBashingTag;                                      // 0x14E8(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14F4[0x1C];                                    // 0x14F4(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NirtroBashLayerAnimInstance">();
	}
	static class UNirtroBashLayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNirtroBashLayerAnimInstance>();
	}
};

// Class NitroGameplayRuntime.NitroGameplayAnalytics
// 0x0070 (0x0148 - 0x00D8)
class UNitroGameplayAnalytics final : public UGameStateComponent
{
public:
	uint8                                         Pad_D8[0x70];                                      // 0x00D8(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void RegisterNitroAnalytics(const class AFortPlayerController* FortPlayerController, const class FString& Source);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NitroGameplayAnalytics">();
	}
	static class UNitroGameplayAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNitroGameplayAnalytics>();
	}
};

}

