#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NitroUI

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class NitroUI.NitroPlayerInfoWidget
// 0x0028 (0x04B0 - 0x0488)
class UNitroPlayerInfoWidget final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_488[0x10];                                     // 0x0488(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           NitroStateTag;                                     // 0x0498(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4A4[0xC];                                      // 0x04A4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPlayerDeadStateChanged(class AFortPlayerStateAthena* PlayerState, bool bIsDead);
	void OnPlayerStateSet(bool bIsDead);
	void UpdateNitroStatus(bool bIsNitroActive);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NitroPlayerInfoWidget">();
	}
	static class UNitroPlayerInfoWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNitroPlayerInfoWidget>();
	}
};

// Class NitroUI.NitroVehicleFuelGaugeWidget
// 0x00B0 (0x04C8 - 0x0418)
class UNitroVehicleFuelGaugeWidget final : public UUserWidget
{
public:
	uint8                                         Pad_418[0x88];                                     // 0x0418(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           NitroActiveTag;                                    // 0x04A0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           NitroEffectTag;                                    // 0x04AC(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortVehicleFuelGauge*                  TargetFuelGauge;                                   // 0x04B8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C0[0x8];                                      // 0x04C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnFuelValueChanged(float NewFuelValue, bool bIsFuelLow);
	void BP_OnNitroStateChanged(bool bNitroActive);
	void FuelValueChangedHandler(float NewFuelValue, bool bIsFuelLow);
	void OnRefuelingCosmeticsFinished();
	void OnRefuelingCosmeticsStarted(const bool bIsTankFull);
	void OnTankFull();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NitroVehicleFuelGaugeWidget">();
	}
	static class UNitroVehicleFuelGaugeWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNitroVehicleFuelGaugeWidget>();
	}
};

}

