#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NNEDenoiser

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum NNEDenoiser.EResourceName
// NumValues: 0x0006
enum class EResourceName : uint8
{
	Color                                    = 0,
	Albedo                                   = 1,
	Normal                                   = 2,
	Flow                                     = 3,
	Output                                   = 4,
	EResourceName_MAX                        = 5,
};

// Enum NNEDenoiser.EDenoiserRuntimeType
// NumValues: 0x0004
enum class EDenoiserRuntimeType : uint8
{
	CPU                                      = 0,
	GPU                                      = 1,
	RDG                                      = 2,
	EDenoiserRuntimeType_MAX                 = 3,
};

// ScriptStruct NNEDenoiser.TilingConfig
// 0x0010 (0x0010 - 0x0000)
struct FTilingConfig final
{
public:
	int32                                         Alignment;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Overlap;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxSize;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinSize;                                           // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct NNEDenoiser.NNEDenoiserModelIOMappingData
// 0x0018 (0x0020 - 0x0008)
struct FNNEDenoiserModelIOMappingData final : public FTableRowBase
{
public:
	int32                                         TensorIndex;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TensorChannel;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EResourceName                                 Resource;                                          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ResourceChannel;                                   // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameIndex;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

