#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NNEDenoiser

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "NNEDenoiser_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class NNEDenoiser.NNEDenoiserModelData
// 0x00A0 (0x00D8 - 0x0038)
class UNNEDenoiserModelData final : public UDataAsset
{
public:
	TSoftObjectPtr<class UNNEModelData>           ModelData;                                         // 0x0038(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              InputMapping;                                      // 0x0068(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              OutputMapping;                                     // 0x0098(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTilingConfig                          TilingConfig;                                      // 0x00C8(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNEDenoiserModelData">();
	}
	static class UNNEDenoiserModelData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNNEDenoiserModelData>();
	}
};

// Class NNEDenoiser.NNEDenoiserSettings
// 0x0048 (0x00A8 - 0x0060)
class UNNEDenoiserSettings final : public UDeveloperSettingsBackedByCVars
{
public:
	TSoftObjectPtr<class UNNEDenoiserModelData>   DenoiserModelData;                                 // 0x0060(0x0030)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDenoiserRuntimeType                          RuntimeType;                                       // 0x0090(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RuntimeName;                                       // 0x0098(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NNEDenoiserSettings">();
	}
	static class UNNEDenoiserSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNNEDenoiserSettings>();
	}
};

}

