#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: npc_spawner_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass npc_spawner_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class npc_spawner_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass npc_spawner_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class npc_spawner_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<npc_spawner_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass npc_spawner_device.npc_spawner_device
// 0x0040 (0x0100 - 0x00C0)
class Unpc_spawner_device final : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0x8478CED1_SpawnedEvent;                   // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xC0A8DFEA_EliminatedEvent;                // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x5BDC7A5C_EnableFunction;                 // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC9184E23_DisableFunction;                // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x4D1E6968_ResetFunction;                  // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xA1DD012D_SpawnFunction;                  // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x4C54EF27_DespawnFunction;                // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fnpc__spawner__device_N_RDespawnAll_L_N_Qagent_R(TOptional<class USimulation_agent*, true> __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fnpc__spawner__device_N_RDisable(const struct npc_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fnpc__spawner__device_N_REnable(const struct npc_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fnpc__spawner__device_N_RReset(const struct npc_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fnpc__spawner__device_N_RSpawn(const struct npc_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"npc_spawner_device">();
	}
	static class Unpc_spawner_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Unpc_spawner_device>();
	}
};

}

