#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ObjectMixerEditor

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "ObjectMixerEditor_structs.hpp"
#include "EditorConfig_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "UnrealEd_classes.hpp"


namespace SDK
{

// Class ObjectMixerEditor.ObjectMixerEditorListMenuContext
// 0x0020 (0x0050 - 0x0030)
class UObjectMixerEditorListMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectMixerEditorListMenuContext">();
	}
	static class UObjectMixerEditorListMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectMixerEditorListMenuContext>();
	}
};

// Class ObjectMixerEditor.ObjectMixerObjectFilter
// 0x0000 (0x0030 - 0x0030)
class UObjectMixerObjectFilter : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectMixerObjectFilter">();
	}
	static class UObjectMixerObjectFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectMixerObjectFilter>();
	}
};

// Class ObjectMixerEditor.ObjectMixerBlueprintObjectFilter
// 0x0000 (0x0030 - 0x0030)
class UObjectMixerBlueprintObjectFilter final : public UObjectMixerObjectFilter
{
public:
	TSet<class FName> GetColumnsToExclude() const;
	TSet<class FName> GetColumnsToShowByDefault() const;
	TSet<class FName> GetForceAddedColumns() const;
	TSet<class UClass*> GetObjectClassesToFilter() const;
	TSet<TSubclassOf<class AActor>> GetObjectClassesToPlace() const;
	EObjectMixerInheritanceInclusionOptions GetObjectMixerPlacementClassInclusionOptions() const;
	EObjectMixerInheritanceInclusionOptions GetObjectMixerPropertyInheritanceInclusionOptions() const;
	TSet<class FName> GetPropertiesThatRequireListRefresh() const;
	bool GetShowTransientObjects() const;
	bool ShouldIncludeUnsupportedProperties() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectMixerBlueprintObjectFilter">();
	}
	static class UObjectMixerBlueprintObjectFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectMixerBlueprintObjectFilter>();
	}
};

// Class ObjectMixerEditor.ObjectMixerEditorSerializedData
// 0x0080 (0x00B0 - 0x0030)
class UObjectMixerEditorSerializedData final : public UObject
{
public:
	TSet<struct FObjectMixerSerializationDataPerFilter> SerializedDataPerFilter;                           // 0x0030(0x0050)(Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x30];                                      // 0x0080(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectMixerEditorSerializedData">();
	}
	static class UObjectMixerEditorSerializedData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectMixerEditorSerializedData>();
	}
};

// Class ObjectMixerEditor.ObjectMixerEditorSettings
// 0x0008 (0x0068 - 0x0060)
class UObjectMixerEditorSettings final : public UDeveloperSettings
{
public:
	bool                                          bSyncSelection;                                    // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EObjectMixerHybridMode                        HybridRowPolicy;                                   // 0x0061(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectMixerEditorSettings">();
	}
	static class UObjectMixerEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectMixerEditorSettings>();
	}
};

// Class ObjectMixerEditor.ObjectMixerEditorUWidget
// 0x0008 (0x0258 - 0x0250)
class UObjectMixerEditorUWidget final : public UWidget
{
public:
	struct FObjectMixerWidgetUserConfig           ObjectMixerWidgetUserConfig;                       // 0x0250(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectMixerEditorUWidget">();
	}
	static class UObjectMixerEditorUWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectMixerEditorUWidget>();
	}
};

// Class ObjectMixerEditor.ObjectMixerBlueprintFilterFactory
// 0x0008 (0x0090 - 0x0088)
class UObjectMixerBlueprintFilterFactory final : public UFactory
{
public:
	TSubclassOf<class UObject>                    ParentClass;                                       // 0x0088(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectMixerBlueprintFilterFactory">();
	}
	static class UObjectMixerBlueprintFilterFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectMixerBlueprintFilterFactory>();
	}
};

// Class ObjectMixerEditor.ObjectMixerOutlinerModeEditorConfig
// 0x0050 (0x0080 - 0x0030)
class UObjectMixerOutlinerModeEditorConfig final : public UEditorConfigBase
{
public:
	TMap<class FName, struct FObjectMixerOutlinerModeConfig> Browsers;                                          // 0x0030(0x0050)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectMixerOutlinerModeEditorConfig">();
	}
	static class UObjectMixerOutlinerModeEditorConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectMixerOutlinerModeEditorConfig>();
	}
};

}

