#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ObjectMixerEditor

#include "Basic.hpp"

#include "ObjectMixerEditor_structs.hpp"


namespace SDK::Params
{

// Function ObjectMixerEditor.ObjectMixerBlueprintObjectFilter.GetColumnsToExclude
// 0x0050 (0x0050 - 0x0000)
struct ObjectMixerBlueprintObjectFilter_GetColumnsToExclude final
{
public:
	TSet<class FName>                             ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ObjectMixerEditor.ObjectMixerBlueprintObjectFilter.GetColumnsToShowByDefault
// 0x0050 (0x0050 - 0x0000)
struct ObjectMixerBlueprintObjectFilter_GetColumnsToShowByDefault final
{
public:
	TSet<class FName>                             ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ObjectMixerEditor.ObjectMixerBlueprintObjectFilter.GetForceAddedColumns
// 0x0050 (0x0050 - 0x0000)
struct ObjectMixerBlueprintObjectFilter_GetForceAddedColumns final
{
public:
	TSet<class FName>                             ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ObjectMixerEditor.ObjectMixerBlueprintObjectFilter.GetObjectClassesToFilter
// 0x0050 (0x0050 - 0x0000)
struct ObjectMixerBlueprintObjectFilter_GetObjectClassesToFilter final
{
public:
	TSet<class UClass*>                           ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ObjectMixerEditor.ObjectMixerBlueprintObjectFilter.GetObjectClassesToPlace
// 0x0050 (0x0050 - 0x0000)
struct ObjectMixerBlueprintObjectFilter_GetObjectClassesToPlace final
{
public:
	TSet<TSubclassOf<class AActor>>               ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function ObjectMixerEditor.ObjectMixerBlueprintObjectFilter.GetObjectMixerPlacementClassInclusionOptions
// 0x0001 (0x0001 - 0x0000)
struct ObjectMixerBlueprintObjectFilter_GetObjectMixerPlacementClassInclusionOptions final
{
public:
	EObjectMixerInheritanceInclusionOptions       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ObjectMixerEditor.ObjectMixerBlueprintObjectFilter.GetObjectMixerPropertyInheritanceInclusionOptions
// 0x0001 (0x0001 - 0x0000)
struct ObjectMixerBlueprintObjectFilter_GetObjectMixerPropertyInheritanceInclusionOptions final
{
public:
	EObjectMixerInheritanceInclusionOptions       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ObjectMixerEditor.ObjectMixerBlueprintObjectFilter.GetPropertiesThatRequireListRefresh
// 0x0050 (0x0050 - 0x0000)
struct ObjectMixerBlueprintObjectFilter_GetPropertiesThatRequireListRefresh final
{
public:
	TSet<class FName>                             ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ObjectMixerEditor.ObjectMixerBlueprintObjectFilter.GetShowTransientObjects
// 0x0001 (0x0001 - 0x0000)
struct ObjectMixerBlueprintObjectFilter_GetShowTransientObjects final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ObjectMixerEditor.ObjectMixerBlueprintObjectFilter.ShouldIncludeUnsupportedProperties
// 0x0001 (0x0001 - 0x0000)
struct ObjectMixerBlueprintObjectFilter_ShouldIncludeUnsupportedProperties final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

