#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ObjectMixerEditor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum ObjectMixerEditor.EObjectMixerInheritanceInclusionOptions
// NumValues: 0x000A
enum class EObjectMixerInheritanceInclusionOptions : uint8
{
	None                                     = 0,
	IncludeOnlyImmediateParent               = 1,
	IncludeOnlyImmediateChildren             = 2,
	IncludeOnlyImmediateParentAndChildren    = 3,
	IncludeAllParents                        = 4,
	IncludeAllChildren                       = 5,
	IncludeAllParentsAndChildren             = 6,
	IncludeAllParentsAndOnlyImmediateChildren = 7,
	IncludeOnlyImmediateParentAndAllChildren = 8,
	EObjectMixerInheritanceInclusionOptions_MAX = 9,
};

// Enum ObjectMixerEditor.EObjectMixerTreeViewMode
// NumValues: 0x0003
enum class EObjectMixerTreeViewMode : uint8
{
	NoFolders                                = 0,
	Folders                                  = 1,
	EObjectMixerTreeViewMode_MAX             = 2,
};

// Enum ObjectMixerEditor.EObjectMixerHybridMode
// NumValues: 0x0004
enum class EObjectMixerHybridMode : uint8
{
	HybridActor                              = 0,
	HybridComponent                          = 1,
	HybridNone                               = 2,
	EObjectMixerHybridMode_MAX               = 3,
};

// Enum ObjectMixerEditor.EListViewColumnType
// NumValues: 0x0003
enum class EListViewColumnType : uint32
{
	BuiltIn                                  = 0,
	PropertyGenerated                        = 1,
	EListViewColumnType_MAX                  = 2,
};

// ScriptStruct ObjectMixerEditor.ObjectMixerCollectionObjectData
// 0x0028 (0x0028 - 0x0000)
struct FObjectMixerCollectionObjectData final
{
public:
	struct FSoftObjectPath                        ObjectPath;                                        // 0x0000(0x0028)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ObjectMixerEditor.ObjectMixerCollectionObjectSet
// 0x0020 (0x0020 - 0x0000)
struct FObjectMixerCollectionObjectSet final
{
public:
	class FName                                   CollectionName;                                    // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FObjectMixerCollectionObjectData> CollectionObjects;                                 // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct ObjectMixerEditor.ObjectMixerColumnData
// 0x0010 (0x0010 - 0x0000)
struct FObjectMixerColumnData final
{
public:
	class FName                                   ColumnName;                                        // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldBeEnabled;                                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ObjectMixerEditor.ObjectMixerSerializationDataPerFilter
// 0x0070 (0x0070 - 0x0000)
struct FObjectMixerSerializationDataPerFilter final
{
public:
	class FName                                   FilterClassName;                                   // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FObjectMixerCollectionObjectSet> SerializedCollections;                             // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TSet<struct FObjectMixerColumnData>           SerializedColumnData;                              // 0x0020(0x0050)(NativeAccessSpecifierPublic)
};

// ScriptStruct ObjectMixerEditor.ObjectMixerWidgetUserConfig
// 0x0008 (0x0008 - 0x0000)
struct FObjectMixerWidgetUserConfig final
{
public:
	TSubclassOf<class UObjectMixerObjectFilter>   DefaultFilterClass;                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ObjectMixerEditor.ObjectMixerOutlinerModeConfig
// 0x000A (0x000A - 0x0000)
struct FObjectMixerOutlinerModeConfig final
{
public:
	bool                                          bHideTemporaryActors;                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowOnlyActorsInCurrentLevel;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowOnlyActorsInCurrentDataLayers;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowOnlyActorsInCurrentContentBundle;             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowOnlySelectedActors;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideActorComponents;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideLevelInstanceHierarchy;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideUnloadedActors;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideEmptyFolders;                                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlwaysFrameSelection;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ObjectMixerEditor.ObjectMixerSceneOutlinerColumnInfo
// 0x0048 (0x0048 - 0x0000)
struct FObjectMixerSceneOutlinerColumnInfo final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PropertyName;                                      // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ColumnID;                                          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   PropertyDisplayText;                               // 0x0020(0x0010)(NativeAccessSpecifierPublic)
	EListViewColumnType                           PropertyType;                                      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyCategoryName;                              // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanBeHidden;                                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDesiredToBeShownByDefault;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

