#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: objective_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass objective_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class objective_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass objective_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class objective_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<objective_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass objective_device.objective_device
// 0x0040 (0x0100 - 0x00C0)
class Uobjective_device final : public UDevices_creative_device_base
{
public:
	class UDevices_device_health*                 __verse_0x06A0E25A_DeviceHealth;                   // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xB279E5FF_DestroyedEvent;                 // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x670B509D_ShowFunction;                   // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC25BB6EA_HideFunction;                   // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xEB54DC2A_ActivateObjectivePulseFunction; // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x974B9153_DeactivateObjectivePulseFunction; // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x4DE02553_DestroyFunction;                // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_logic*     __verse_0x3A8BEB9C_SetInvulnerableFunction;        // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fobjective__device_N_RActivateObjectivePulse_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fobjective__device_N_RDeactivateObjectivePulse_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fobjective__device_N_RDestroy_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fobjective__device_N_RHide(const struct objective_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fobjective__device_N_RSetInvulnerable_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fobjective__device_N_RShow(const struct objective_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R(const struct FGame_damage_args& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent(const struct objective_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R(const struct FGame_healing_args& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent(const struct objective_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth(const struct objective_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth(const struct objective_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"objective_device">();
	}
	static class Uobjective_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uobjective_device>();
	}
};

}

