#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpenColorIOEditor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OpenColorIO_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function OpenColorIOEditor.OpenColorIOEditorBlueprintLibrary.ApplyColorSpaceTransformToColor
// 0x00A8 (0x00A8 - 0x0000)
struct OpenColorIOEditorBlueprintLibrary_ApplyColorSpaceTransformToColor final
{
public:
	struct FOpenColorIOColorConversionSettings    ConversionSettings;                                // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FLinearColor                           InColor;                                           // 0x0080(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           OutColor;                                          // 0x0090(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00A0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OpenColorIOEditor.OpenColorIOEditorBlueprintLibrary.ApplyColorSpaceTransformToTexture
// 0x0090 (0x0090 - 0x0000)
struct OpenColorIOEditorBlueprintLibrary_ApplyColorSpaceTransformToTexture final
{
public:
	struct FOpenColorIOColorConversionSettings    ConversionSettings;                                // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UTexture*                               InOutTexture;                                      // 0x0080(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OpenColorIOEditor.OpenColorIOEditorBlueprintLibrary.ApplyColorSpaceTransformToTextureCompressed
// 0x0098 (0x0098 - 0x0000)
struct OpenColorIOEditorBlueprintLibrary_ApplyColorSpaceTransformToTextureCompressed final
{
public:
	struct FOpenColorIOColorConversionSettings    ConversionSettings;                                // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ETextureCompressionSettings                   TargetCompression;                                 // 0x0080(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               InOutTexture;                                      // 0x0088(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OpenColorIOEditor.OpenColorIOEditorBlueprintLibrary.SetActiveViewportConfiguration
// 0x0088 (0x0088 - 0x0000)
struct OpenColorIOEditorBlueprintLibrary_SetActiveViewportConfiguration final
{
public:
	struct FOpenColorIODisplayConfiguration       InConfiguration;                                   // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

}

