#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptimusEditor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OptimusCore_structs.hpp"


namespace SDK
{

// ScriptStruct OptimusEditor.OptimusSchemaAction_Resource
// 0x0010 (0x0100 - 0x00F0)
struct FOptimusSchemaAction_Resource final : public FEdGraphSchemaAction
{
public:
	uint8                                         Pad_F0[0x10];                                      // 0x00F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct OptimusEditor.OptimusGraphSchemaAction_NewNode
// 0x0008 (0x00F8 - 0x00F0)
struct FOptimusGraphSchemaAction_NewNode final : public FEdGraphSchemaAction
{
public:
	TSubclassOf<class UOptimusNode>               NodeClass;                                         // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct OptimusEditor.OptimusGraphSchemaAction_NewConstantValueNode
// 0x0018 (0x0108 - 0x00F0)
struct FOptimusGraphSchemaAction_NewConstantValueNode final : public FEdGraphSchemaAction
{
public:
	struct FOptimusDataTypeRef                    DataType;                                          // 0x00F0(0x0014)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct OptimusEditor.OptimusGraphSchemaAction_NewDataInterfaceNode
// 0x0008 (0x00F8 - 0x00F0)
struct FOptimusGraphSchemaAction_NewDataInterfaceNode final : public FEdGraphSchemaAction
{
public:
	TSubclassOf<class UOptimusComputeDataInterface> DataInterfaceClass;                                // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct OptimusEditor.OptimusGraphSchemaAction_NewLoopTerminalNodes
// 0x0000 (0x00F0 - 0x00F0)
struct FOptimusGraphSchemaAction_NewLoopTerminalNodes final : public FEdGraphSchemaAction
{
};

// ScriptStruct OptimusEditor.OptimusGraphSchemaAction_NewFunctionReferenceNode
// 0x0030 (0x0120 - 0x00F0)
struct FOptimusGraphSchemaAction_NewFunctionReferenceNode final : public FEdGraphSchemaAction
{
public:
	uint8                                         Pad_F0[0x30];                                      // 0x00F0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct OptimusEditor.OptimusSchemaAction_Graph
// 0x0018 (0x0108 - 0x00F0)
struct FOptimusSchemaAction_Graph final : public FEdGraphSchemaAction
{
public:
	uint8                                         Pad_F0[0x18];                                      // 0x00F0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct OptimusEditor.OptimusSchemaAction_Binding
// 0x0010 (0x0100 - 0x00F0)
struct FOptimusSchemaAction_Binding final : public FEdGraphSchemaAction
{
public:
	uint8                                         Pad_F0[0x10];                                      // 0x00F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct OptimusEditor.OptimusSchemaAction_Variable
// 0x0010 (0x0100 - 0x00F0)
struct FOptimusSchemaAction_Variable final : public FEdGraphSchemaAction
{
public:
	uint8                                         Pad_F0[0x10];                                      // 0x00F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

