#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptimusCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ComputeFramework_structs.hpp"
#include "ComputeFramework_classes.hpp"
#include "OptimusCore_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class OptimusCore.OptimusRawBufferDataProvider
// 0x0058 (0x0088 - 0x0030)
class UOptimusRawBufferDataProvider : public UComputeDataProvider
{
public:
	uint8                                         Pad_30[0x58];                                      // 0x0030(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusRawBufferDataProvider">();
	}
	static class UOptimusRawBufferDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusRawBufferDataProvider>();
	}
};

// Class OptimusCore.OptimusImplicitPersistentBufferDataProvider
// 0x0028 (0x00B0 - 0x0088)
class UOptimusImplicitPersistentBufferDataProvider final : public UOptimusRawBufferDataProvider
{
public:
	uint8                                         Pad_88[0x28];                                      // 0x0088(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusImplicitPersistentBufferDataProvider">();
	}
	static class UOptimusImplicitPersistentBufferDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusImplicitPersistentBufferDataProvider>();
	}
};

// Class OptimusCore.OptimusAlternativeSelectedObjectProvider
// 0x0000 (0x0030 - 0x0030)
class IOptimusAlternativeSelectedObjectProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusAlternativeSelectedObjectProvider">();
	}
	static class IOptimusAlternativeSelectedObjectProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusAlternativeSelectedObjectProvider>();
	}
};

// Class OptimusCore.OptimusComputeDataInterface
// 0x0000 (0x0030 - 0x0030)
class UOptimusComputeDataInterface : public UComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusComputeDataInterface">();
	}
	static class UOptimusComputeDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusComputeDataInterface>();
	}
};

// Class OptimusCore.OptimusRawBufferDataInterface
// 0x0078 (0x00A8 - 0x0030)
class UOptimusRawBufferDataInterface : public UOptimusComputeDataInterface
{
public:
	struct FShaderValueTypeHandle                 ValueType;                                         // 0x0030(0x0008)(BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOptimusDataDomain                     DataDomain;                                        // 0x0038(0x0040)(BlueprintReadOnly, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UOptimusComponentSourceBinding> ComponentSourceBinding;                            // 0x0078(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOptimusConstantIdentifier             DomainConstantIdentifier;                          // 0x0080(0x0024)(BlueprintReadOnly, Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusRawBufferDataInterface">();
	}
	static class UOptimusRawBufferDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusRawBufferDataInterface>();
	}
};

// Class OptimusCore.OptimusTransientBufferDataInterface
// 0x0008 (0x00B0 - 0x00A8)
class UOptimusTransientBufferDataInterface final : public UOptimusRawBufferDataInterface
{
public:
	bool                                          bZeroInitForAtomicWrites;                          // 0x00A8(0x0001)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusTransientBufferDataInterface">();
	}
	static class UOptimusTransientBufferDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusTransientBufferDataInterface>();
	}
};

// Class OptimusCore.OptimusComponentBindingProvider
// 0x0000 (0x0030 - 0x0030)
class IOptimusComponentBindingProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusComponentBindingProvider">();
	}
	static class IOptimusComponentBindingProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusComponentBindingProvider>();
	}
};

// Class OptimusCore.OptimusComponentBindingReceiver
// 0x0000 (0x0030 - 0x0030)
class IOptimusComponentBindingReceiver final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusComponentBindingReceiver">();
	}
	static class IOptimusComponentBindingReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusComponentBindingReceiver>();
	}
};

// Class OptimusCore.OptimusHalfEdgeDataProvider
// 0x0020 (0x0050 - 0x0030)
class UOptimusHalfEdgeDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusHalfEdgeDataProvider">();
	}
	static class UOptimusHalfEdgeDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusHalfEdgeDataProvider>();
	}
};

// Class OptimusCore.OptimusComputeKernelDataInterface
// 0x0000 (0x0030 - 0x0030)
class IOptimusComputeKernelDataInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusComputeKernelDataInterface">();
	}
	static class IOptimusComputeKernelDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusComputeKernelDataInterface>();
	}
};

// Class OptimusCore.OptimusComputeKernelProvider
// 0x0000 (0x0030 - 0x0030)
class IOptimusComputeKernelProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusComputeKernelProvider">();
	}
	static class IOptimusComputeKernelProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusComputeKernelProvider>();
	}
};

// Class OptimusCore.OptimusTransientBufferDataProvider
// 0x0008 (0x0090 - 0x0088)
class UOptimusTransientBufferDataProvider final : public UOptimusRawBufferDataProvider
{
public:
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusTransientBufferDataProvider">();
	}
	static class UOptimusTransientBufferDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusTransientBufferDataProvider>();
	}
};

// Class OptimusCore.OptimusDataInterfaceProvider
// 0x0000 (0x0030 - 0x0030)
class IOptimusDataInterfaceProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusDataInterfaceProvider">();
	}
	static class IOptimusDataInterfaceProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusDataInterfaceProvider>();
	}
};

// Class OptimusCore.OptimusDeformerInstanceAccessor
// 0x0000 (0x0030 - 0x0030)
class IOptimusDeformerInstanceAccessor final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusDeformerInstanceAccessor">();
	}
	static class IOptimusDeformerInstanceAccessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusDeformerInstanceAccessor>();
	}
};

// Class OptimusCore.OptimusDeprecatedExecutionDataInterface
// 0x0000 (0x0030 - 0x0030)
class IOptimusDeprecatedExecutionDataInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusDeprecatedExecutionDataInterface">();
	}
	static class IOptimusDeprecatedExecutionDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusDeprecatedExecutionDataInterface>();
	}
};

// Class OptimusCore.OptimusExecutionDomainProvider
// 0x0000 (0x0030 - 0x0030)
class IOptimusExecutionDomainProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusExecutionDomainProvider">();
	}
	static class IOptimusExecutionDomainProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusExecutionDomainProvider>();
	}
};

// Class OptimusCore.OptimusGeneratedClassDefiner
// 0x0000 (0x0030 - 0x0030)
class IOptimusGeneratedClassDefiner final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGeneratedClassDefiner">();
	}
	static class IOptimusGeneratedClassDefiner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusGeneratedClassDefiner>();
	}
};

// Class OptimusCore.OptimusNodeAdderPinProvider
// 0x0000 (0x0030 - 0x0030)
class IOptimusNodeAdderPinProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNodeAdderPinProvider">();
	}
	static class IOptimusNodeAdderPinProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNodeAdderPinProvider>();
	}
};

// Class OptimusCore.OptimusPersistentBufferDataInterface
// 0x0010 (0x00B8 - 0x00A8)
class UOptimusPersistentBufferDataInterface final : public UOptimusRawBufferDataInterface
{
public:
	class FName                                   ResourceName;                                      // 0x00A8(0x000C)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusPersistentBufferDataInterface">();
	}
	static class UOptimusPersistentBufferDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusPersistentBufferDataInterface>();
	}
};

// Class OptimusCore.OptimusNodeFunctionLibraryOwner
// 0x0000 (0x0030 - 0x0030)
class IOptimusNodeFunctionLibraryOwner final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNodeFunctionLibraryOwner">();
	}
	static class IOptimusNodeFunctionLibraryOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNodeFunctionLibraryOwner>();
	}
};

// Class OptimusCore.OptimusNodeGraphCollectionOwner
// 0x0000 (0x0030 - 0x0030)
class IOptimusNodeGraphCollectionOwner final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNodeGraphCollectionOwner">();
	}
	static class IOptimusNodeGraphCollectionOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNodeGraphCollectionOwner>();
	}
};

// Class OptimusCore.OptimusNodeGraphProvider
// 0x0000 (0x0030 - 0x0030)
class IOptimusNodeGraphProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNodeGraphProvider">();
	}
	static class IOptimusNodeGraphProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNodeGraphProvider>();
	}
};

// Class OptimusCore.OptimusNodePairProvider
// 0x0000 (0x0030 - 0x0030)
class IOptimusNodePairProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNodePairProvider">();
	}
	static class IOptimusNodePairProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNodePairProvider>();
	}
};

// Class OptimusCore.OptimusNodePinRouter
// 0x0000 (0x0030 - 0x0030)
class IOptimusNodePinRouter final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNodePinRouter">();
	}
	static class IOptimusNodePinRouter* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNodePinRouter>();
	}
};

// Class OptimusCore.OptimusNodeSubGraphReferencer
// 0x0000 (0x0030 - 0x0030)
class IOptimusNodeSubGraphReferencer final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNodeSubGraphReferencer">();
	}
	static class IOptimusNodeSubGraphReferencer* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNodeSubGraphReferencer>();
	}
};

// Class OptimusCore.OptimusNonCollapsibleNode
// 0x0000 (0x0030 - 0x0030)
class IOptimusNonCollapsibleNode final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNonCollapsibleNode">();
	}
	static class IOptimusNonCollapsibleNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNonCollapsibleNode>();
	}
};

// Class OptimusCore.OptimusNonCopyableNode
// 0x0000 (0x0030 - 0x0030)
class IOptimusNonCopyableNode final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNonCopyableNode">();
	}
	static class IOptimusNonCopyableNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNonCopyableNode>();
	}
};

// Class OptimusCore.OptimusOutputBufferWriter
// 0x0000 (0x0030 - 0x0030)
class IOptimusOutputBufferWriter final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusOutputBufferWriter">();
	}
	static class IOptimusOutputBufferWriter* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusOutputBufferWriter>();
	}
};

// Class OptimusCore.OptimusParameterBindingProvider
// 0x0000 (0x0030 - 0x0030)
class IOptimusParameterBindingProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusParameterBindingProvider">();
	}
	static class IOptimusParameterBindingProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusParameterBindingProvider>();
	}
};

// Class OptimusCore.OptimusNode
// 0x00E0 (0x0110 - 0x0030)
class UOptimusNode : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0038(0x0010)(NonTransactional, NativeAccessSpecifierPrivate)
	struct FVector2D                              GraphPosition;                                     // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UOptimusNodePin*>                Pins;                                              // 0x0058(0x0010)(ZeroConstructor, NonTransactional, UObjectWrapper, NativeAccessSpecifierPrivate)
	TSet<class FName>                             ExpandedPins;                                      // 0x0068(0x0050)(NonTransactional, NativeAccessSpecifierPrivate)
	EOptimusDiagnosticLevel                       DiagnosticLevel;                                   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B9[0x57];                                      // 0x00B9(0x0057)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool SetGraphPosition(const struct FVector2D& InPosition);

	class FText GetDisplayName() const;
	struct FVector2D GetGraphPosition() const;
	class FName GetNodeCategory() const;
	class FName GetNodeName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode">();
	}
	static class UOptimusNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode>();
	}
};

// Class OptimusCore.OptimusNode_ComponentSource
// 0x0030 (0x0140 - 0x0110)
class UOptimusNode_ComponentSource final : public UOptimusNode
{
public:
	uint8                                         Pad_110[0x10];                                     // 0x0110(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UOptimusComponentSourceBinding*         Binding;                                           // 0x0120(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FOptimusNode_ComponentSource_DuplicationInfo DuplicationInfo;                                   // 0x0128(0x0018)(DuplicateTransient, NoDestructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_ComponentSource">();
	}
	static class UOptimusNode_ComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_ComponentSource>();
	}
};

// Class OptimusCore.OptimusPathResolver
// 0x0000 (0x0030 - 0x0030)
class IOptimusPathResolver final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusPathResolver">();
	}
	static class IOptimusPathResolver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusPathResolver>();
	}
};

// Class OptimusCore.OptimusPersistentBufferProvider
// 0x0000 (0x0030 - 0x0030)
class IOptimusPersistentBufferProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusPersistentBufferProvider">();
	}
	static class IOptimusPersistentBufferProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusPersistentBufferProvider>();
	}
};

// Class OptimusCore.OptimusPinMutabilityDefiner
// 0x0000 (0x0030 - 0x0030)
class IOptimusPinMutabilityDefiner final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusPinMutabilityDefiner">();
	}
	static class IOptimusPinMutabilityDefiner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusPinMutabilityDefiner>();
	}
};

// Class OptimusCore.OptimusShaderTextProvider
// 0x0000 (0x0030 - 0x0030)
class IOptimusShaderTextProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusShaderTextProvider">();
	}
	static class IOptimusShaderTextProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusShaderTextProvider>();
	}
};

// Class OptimusCore.OptimusNode_ConstantValueGeneratorClass
// 0x0018 (0x0280 - 0x0268)
class UOptimusNode_ConstantValueGeneratorClass final : public UClass
{
public:
	struct FOptimusDataTypeRef                    DataType;                                          // 0x0268(0x0014)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_ConstantValueGeneratorClass">();
	}
	static class UOptimusNode_ConstantValueGeneratorClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_ConstantValueGeneratorClass>();
	}
};

// Class OptimusCore.OptimusUnnamedNodePinProvider
// 0x0000 (0x0030 - 0x0030)
class IOptimusUnnamedNodePinProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusUnnamedNodePinProvider">();
	}
	static class IOptimusUnnamedNodePinProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusUnnamedNodePinProvider>();
	}
};

// Class OptimusCore.OptimusValueProvider
// 0x0000 (0x0030 - 0x0030)
class IOptimusValueProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusValueProvider">();
	}
	static class IOptimusValueProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusValueProvider>();
	}
};

// Class OptimusCore.OptimusNode_DataInterface
// 0x0028 (0x0138 - 0x0110)
class UOptimusNode_DataInterface : public UOptimusNode
{
public:
	uint8                                         Pad_110[0x18];                                     // 0x0110(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    DataInterfaceClass;                                // 0x0128(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOptimusComputeDataInterface*           DataInterfaceData;                                 // 0x0130(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_DataInterface">();
	}
	static class UOptimusNode_DataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_DataInterface>();
	}
};

// Class OptimusCore.OptimusSkinnedMeshVertexAttributeDataInterface
// 0x0010 (0x0040 - 0x0030)
class UOptimusSkinnedMeshVertexAttributeDataInterface final : public UOptimusComputeDataInterface
{
public:
	class FName                                   AttributeName;                                     // 0x0030(0x000C)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkinnedMeshVertexAttributeDataInterface">();
	}
	static class UOptimusSkinnedMeshVertexAttributeDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshVertexAttributeDataInterface>();
	}
};

// Class OptimusCore.OptimusSkinnedMeshVertexAttributeDataProvider
// 0x0018 (0x0048 - 0x0030)
class UOptimusSkinnedMeshVertexAttributeDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMeshComponent;                              // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttributeName;                                     // 0x0038(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkinnedMeshVertexAttributeDataProvider">();
	}
	static class UOptimusSkinnedMeshVertexAttributeDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshVertexAttributeDataProvider>();
	}
};

// Class OptimusCore.OptimusKernelSource
// 0x0010 (0x00B0 - 0x00A0)
class UOptimusKernelSource final : public UComputeKernelSource
{
public:
	class FString                                 Source;                                            // 0x00A0(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusKernelSource">();
	}
	static class UOptimusKernelSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusKernelSource>();
	}
};

// Class OptimusCore.OptimusComponentSource
// 0x0000 (0x0030 - 0x0030)
class UOptimusComponentSource : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusComponentSource">();
	}
	static class UOptimusComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusComponentSource>();
	}
};

// Class OptimusCore.OptimusSceneComponentSource
// 0x0000 (0x0030 - 0x0030)
class UOptimusSceneComponentSource final : public UOptimusComponentSource
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSceneComponentSource">();
	}
	static class UOptimusSceneComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSceneComponentSource>();
	}
};

// Class OptimusCore.OptimusSkinnedMeshComponentSource
// 0x0000 (0x0030 - 0x0030)
class UOptimusSkinnedMeshComponentSource : public UOptimusComponentSource
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkinnedMeshComponentSource">();
	}
	static class UOptimusSkinnedMeshComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshComponentSource>();
	}
};

// Class OptimusCore.OptimusSkeletalMeshComponentSource
// 0x0000 (0x0030 - 0x0030)
class UOptimusSkeletalMeshComponentSource final : public UOptimusSkinnedMeshComponentSource
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkeletalMeshComponentSource">();
	}
	static class UOptimusSkeletalMeshComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkeletalMeshComponentSource>();
	}
};

// Class OptimusCore.OptimusAnimAttributeDataInterface
// 0x0030 (0x0060 - 0x0030)
class UOptimusAnimAttributeDataInterface final : public UOptimusComputeDataInterface
{
public:
	struct FOptimusAnimAttributeArray             AttributeArray;                                    // 0x0030(0x0010)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusAnimAttributeDataInterface">();
	}
	static class UOptimusAnimAttributeDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusAnimAttributeDataInterface>();
	}
};

// Class OptimusCore.OptimusAnimAttributeDataProvider
// 0x0020 (0x0050 - 0x0030)
class UOptimusAnimAttributeDataProvider final : public UComputeDataProvider
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusAnimAttributeDataProvider">();
	}
	static class UOptimusAnimAttributeDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusAnimAttributeDataProvider>();
	}
};

// Class OptimusCore.OptimusClothDataInterface
// 0x0000 (0x0030 - 0x0030)
class UOptimusClothDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusClothDataInterface">();
	}
	static class UOptimusClothDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusClothDataInterface>();
	}
};

// Class OptimusCore.OptimusClothDataProvider
// 0x0008 (0x0038 - 0x0030)
class UOptimusClothDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusClothDataProvider">();
	}
	static class UOptimusClothDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusClothDataProvider>();
	}
};

// Class OptimusCore.OptimusConnectivityDataInterface
// 0x0000 (0x0030 - 0x0030)
class UOptimusConnectivityDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusConnectivityDataInterface">();
	}
	static class UOptimusConnectivityDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusConnectivityDataInterface>();
	}
};

// Class OptimusCore.OptimusConnectivityDataProvider
// 0x0018 (0x0048 - 0x0030)
class UOptimusConnectivityDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusConnectivityDataProvider">();
	}
	static class UOptimusConnectivityDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusConnectivityDataProvider>();
	}
};

// Class OptimusCore.OptimusCopyKernelDataInterface
// 0x0020 (0x0050 - 0x0030)
class UOptimusCopyKernelDataInterface final : public UComputeDataInterface
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UOptimusComponentSourceBinding> ComponentSourceBinding;                            // 0x0038(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NumThreadsExpression;                              // 0x0040(0x0010)(BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusCopyKernelDataInterface">();
	}
	static class UOptimusCopyKernelDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusCopyKernelDataInterface>();
	}
};

// Class OptimusCore.OptimusCopyKernelDataProvider
// 0x0010 (0x0040 - 0x0030)
class UOptimusCopyKernelDataProvider final : public UComputeDataProvider
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusCopyKernelDataProvider">();
	}
	static class UOptimusCopyKernelDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusCopyKernelDataProvider>();
	}
};

// Class OptimusCore.OptimusCustomComputeKernelDataInterface
// 0x0048 (0x0078 - 0x0030)
class UOptimusCustomComputeKernelDataInterface final : public UComputeDataInterface
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UOptimusComponentSourceBinding> ComponentSourceBinding;                            // 0x0038(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NumThreadsExpression;                              // 0x0040(0x0010)(BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOptimusConstantIdentifier             ExecutionDomainConstantIdentifier;                 // 0x0050(0x0024)(BlueprintReadOnly, Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusCustomComputeKernelDataInterface">();
	}
	static class UOptimusCustomComputeKernelDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusCustomComputeKernelDataInterface>();
	}
};

// Class OptimusCore.OptimusImplicitPersistentBufferDataInterface
// 0x0008 (0x00B0 - 0x00A8)
class UOptimusImplicitPersistentBufferDataInterface final : public UOptimusRawBufferDataInterface
{
public:
	bool                                          bZeroInitForAtomicWrites;                          // 0x00A8(0x0001)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusImplicitPersistentBufferDataInterface">();
	}
	static class UOptimusImplicitPersistentBufferDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusImplicitPersistentBufferDataInterface>();
	}
};

// Class OptimusCore.OptimusCustomComputeKernelDataProvider
// 0x0010 (0x0040 - 0x0030)
class UOptimusCustomComputeKernelDataProvider final : public UComputeDataProvider
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusCustomComputeKernelDataProvider">();
	}
	static class UOptimusCustomComputeKernelDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusCustomComputeKernelDataProvider>();
	}
};

// Class OptimusCore.OptimusDebugDrawDataInterface
// 0x0018 (0x0048 - 0x0030)
class UOptimusDebugDrawDataInterface final : public UOptimusComputeDataInterface
{
public:
	bool                                          bIsSupported;                                      // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOptimusDebugDrawParameters            DebugDrawParameters;                               // 0x0034(0x0014)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusDebugDrawDataInterface">();
	}
	static class UOptimusDebugDrawDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusDebugDrawDataInterface>();
	}
};

// Class OptimusCore.OptimusLoopTerminalDataInterface
// 0x0008 (0x0038 - 0x0030)
class UOptimusLoopTerminalDataInterface final : public UOptimusComputeDataInterface
{
public:
	uint32                                        Index_0;                                           // 0x0030(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        Count;                                             // 0x0034(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusLoopTerminalDataInterface">();
	}
	static class UOptimusLoopTerminalDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusLoopTerminalDataInterface>();
	}
};

// Class OptimusCore.OptimusDebugDrawDataProvider
// 0x0020 (0x0050 - 0x0030)
class UOptimusDebugDrawDataProvider final : public UComputeDataProvider
{
public:
	class UPrimitiveComponent*                    PrimitiveComponent;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOptimusDebugDrawParameters            DebugDrawParameters;                               // 0x0038(0x0014)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusDebugDrawDataProvider">();
	}
	static class UOptimusDebugDrawDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusDebugDrawDataProvider>();
	}
};

// Class OptimusCore.OptimusDuplicateVerticesDataInterface
// 0x0000 (0x0030 - 0x0030)
class UOptimusDuplicateVerticesDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusDuplicateVerticesDataInterface">();
	}
	static class UOptimusDuplicateVerticesDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusDuplicateVerticesDataInterface>();
	}
};

// Class OptimusCore.OptimusDuplicateVerticesDataProvider
// 0x0008 (0x0038 - 0x0030)
class UOptimusDuplicateVerticesDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusDuplicateVerticesDataProvider">();
	}
	static class UOptimusDuplicateVerticesDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusDuplicateVerticesDataProvider>();
	}
};

// Class OptimusCore.OptimusGraphDataInterface
// 0x0018 (0x0048 - 0x0030)
class UOptimusGraphDataInterface final : public UComputeDataInterface
{
public:
	TArray<struct FOptimusGraphVariableDescription> Variables;                                         // 0x0030(0x0010)(BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)
	int32                                         ParameterBufferSize;                               // 0x0040(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGraphDataInterface">();
	}
	static class UOptimusGraphDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGraphDataInterface>();
	}
};

// Class OptimusCore.OptimusGraphDataProvider
// 0x0040 (0x0070 - 0x0030)
class UOptimusGraphDataProvider final : public UComputeDataProvider
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         MeshComponent;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FOptimusGraphVariableDescription> Variables;                                         // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UOptimusDeformerInstance*               DeformerInstance;                                  // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGraphDataProvider">();
	}
	static class UOptimusGraphDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGraphDataProvider>();
	}
};

// Class OptimusCore.OptimusHalfEdgeDataInterface
// 0x0000 (0x0030 - 0x0030)
class UOptimusHalfEdgeDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusHalfEdgeDataInterface">();
	}
	static class UOptimusHalfEdgeDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusHalfEdgeDataInterface>();
	}
};

// Class OptimusCore.OptimusLoopTerminalDataProvider
// 0x0008 (0x0038 - 0x0030)
class UOptimusLoopTerminalDataProvider final : public UComputeDataProvider
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusLoopTerminalDataProvider">();
	}
	static class UOptimusLoopTerminalDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusLoopTerminalDataProvider>();
	}
};

// Class OptimusCore.OptimusMorphTargetDataInterface
// 0x0000 (0x0030 - 0x0030)
class UOptimusMorphTargetDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusMorphTargetDataInterface">();
	}
	static class UOptimusMorphTargetDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusMorphTargetDataInterface>();
	}
};

// Class OptimusCore.OptimusMorphTargetDataProvider
// 0x0008 (0x0038 - 0x0030)
class UOptimusMorphTargetDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusMorphTargetDataProvider">();
	}
	static class UOptimusMorphTargetDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusMorphTargetDataProvider>();
	}
};

// Class OptimusCore.OptimusPersistentBufferDataProvider
// 0x0028 (0x00B0 - 0x0088)
class UOptimusPersistentBufferDataProvider final : public UOptimusRawBufferDataProvider
{
public:
	uint8                                         Pad_88[0x28];                                      // 0x0088(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusPersistentBufferDataProvider">();
	}
	static class UOptimusPersistentBufferDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusPersistentBufferDataProvider>();
	}
};

// Class OptimusCore.OptimusSceneDataInterface
// 0x0000 (0x0030 - 0x0030)
class UOptimusSceneDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSceneDataInterface">();
	}
	static class UOptimusSceneDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSceneDataInterface>();
	}
};

// Class OptimusCore.OptimusSceneDataProvider
// 0x0008 (0x0038 - 0x0030)
class UOptimusSceneDataProvider final : public UComputeDataProvider
{
public:
	class USceneComponent*                        SceneComponent;                                    // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSceneDataProvider">();
	}
	static class UOptimusSceneDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSceneDataProvider>();
	}
};

// Class OptimusCore.OptimusSkeletonDataInterface
// 0x0000 (0x0030 - 0x0030)
class UOptimusSkeletonDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkeletonDataInterface">();
	}
	static class UOptimusSkeletonDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkeletonDataInterface>();
	}
};

// Class OptimusCore.OptimusSkeletonDataProvider
// 0x0008 (0x0038 - 0x0030)
class UOptimusSkeletonDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkeletonDataProvider">();
	}
	static class UOptimusSkeletonDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkeletonDataProvider>();
	}
};

// Class OptimusCore.OptimusSkinnedMeshDataInterface
// 0x0000 (0x0030 - 0x0030)
class UOptimusSkinnedMeshDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkinnedMeshDataInterface">();
	}
	static class UOptimusSkinnedMeshDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshDataInterface>();
	}
};

// Class OptimusCore.OptimusSkinnedMeshDataProvider
// 0x0008 (0x0038 - 0x0030)
class UOptimusSkinnedMeshDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkinnedMeshDataProvider">();
	}
	static class UOptimusSkinnedMeshDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshDataProvider>();
	}
};

// Class OptimusCore.OptimusSkinnedMeshExecDataInterface
// 0x0010 (0x0040 - 0x0030)
class UOptimusSkinnedMeshExecDataInterface final : public UOptimusComputeDataInterface
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EOptimusSkinnedMeshExecDomain                 Domain;                                            // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkinnedMeshExecDataInterface">();
	}
	static class UOptimusSkinnedMeshExecDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshExecDataInterface>();
	}
};

// Class OptimusCore.OptimusSkinnedMeshExecDataProvider
// 0x0010 (0x0040 - 0x0030)
class UOptimusSkinnedMeshExecDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOptimusSkinnedMeshExecDomain                 Domain;                                            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkinnedMeshExecDataProvider">();
	}
	static class UOptimusSkinnedMeshExecDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshExecDataProvider>();
	}
};

// Class OptimusCore.OptimusSkinnedMeshWriteDataInterface
// 0x0008 (0x0038 - 0x0030)
class UOptimusSkinnedMeshWriteDataInterface final : public UOptimusComputeDataInterface
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkinnedMeshWriteDataInterface">();
	}
	static class UOptimusSkinnedMeshWriteDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshWriteDataInterface>();
	}
};

// Class OptimusCore.OptimusSkinnedMeshWriteDataProvider
// 0x0010 (0x0040 - 0x0030)
class UOptimusSkinnedMeshWriteDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkinnedMeshWriteDataProvider">();
	}
	static class UOptimusSkinnedMeshWriteDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshWriteDataProvider>();
	}
};

// Class OptimusCore.OptimusNode_AnimAttributeDataInterface
// 0x0000 (0x0138 - 0x0138)
class UOptimusNode_AnimAttributeDataInterface final : public UOptimusNode_DataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_AnimAttributeDataInterface">();
	}
	static class UOptimusNode_AnimAttributeDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_AnimAttributeDataInterface>();
	}
};

// Class OptimusCore.OptimusNode_ComputeKernelBase
// 0x0008 (0x0118 - 0x0110)
class UOptimusNode_ComputeKernelBase : public UOptimusNode
{
public:
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_ComputeKernelBase">();
	}
	static class UOptimusNode_ComputeKernelBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_ComputeKernelBase>();
	}
};

// Class OptimusCore.OptimusNode_ComputeKernelFunctionGeneratorClass
// 0x0078 (0x02E0 - 0x0268)
class UOptimusNode_ComputeKernelFunctionGeneratorClass final : public UClass
{
public:
	class FName                                   Category;                                          // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   KernelName;                                        // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOptimusExecutionDomain                ExecutionDomain;                                   // 0x0280(0x0020)(NativeAccessSpecifierPublic)
	struct FIntVector                             GroupSize;                                         // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOptimusParameterBinding>       InputBindings;                                     // 0x02B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FOptimusParameterBinding>       OutputBindings;                                    // 0x02C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 ShaderSource;                                      // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_ComputeKernelFunctionGeneratorClass">();
	}
	static class UOptimusNode_ComputeKernelFunctionGeneratorClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_ComputeKernelFunctionGeneratorClass>();
	}
};

// Class OptimusCore.OptimusNode_ComputeKernelFunction
// 0x0000 (0x0118 - 0x0118)
class UOptimusNode_ComputeKernelFunction final : public UOptimusNode_ComputeKernelBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_ComputeKernelFunction">();
	}
	static class UOptimusNode_ComputeKernelFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_ComputeKernelFunction>();
	}
};

// Class OptimusCore.OptimusNode_ConstantValue
// 0x0018 (0x0128 - 0x0110)
class UOptimusNode_ConstantValue : public UOptimusNode
{
public:
	uint8                                         Pad_110[0x18];                                     // 0x0110(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_ConstantValue">();
	}
	static class UOptimusNode_ConstantValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_ConstantValue>();
	}
};

// Class OptimusCore.OptimusNode_CustomComputeKernel
// 0x00F8 (0x0210 - 0x0118)
class UOptimusNode_CustomComputeKernel final : public UOptimusNode_ComputeKernelBase
{
public:
	uint8                                         Pad_118[0x20];                                     // 0x0118(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Category;                                          // 0x0138(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOptimusValidatedName                  KernelName;                                        // 0x0144(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FOptimusExecutionDomain                ExecutionDomain;                                   // 0x0150(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FIntVector                             GroupSize;                                         // 0x0170(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOptimus_ShaderBinding>         Parameters;                                        // 0x0180(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	TArray<struct FOptimusParameterBinding>       InputBindings;                                     // 0x0190(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	TArray<struct FOptimusParameterBinding>       OutputBindings;                                    // 0x01A0(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	struct FOptimusParameterBindingArray          InputBindingArray;                                 // 0x01B0(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FOptimusParameterBindingArray          OutputBindingArray;                                // 0x01C0(0x0010)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FOptimusSecondaryInputBindingsGroup> SecondaryInputBindingGroups;                       // 0x01D0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UComputeSource*>                 AdditionalSources;                                 // 0x01E0(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FOptimusShaderText                     ShaderSource;                                      // 0x01F0(0x0020)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_CustomComputeKernel">();
	}
	static class UOptimusNode_CustomComputeKernel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_CustomComputeKernel>();
	}
};

// Class OptimusCore.OptimusNode_FunctionReference
// 0x0050 (0x0160 - 0x0110)
class UOptimusNode_FunctionReference final : public UOptimusNode
{
public:
	uint8                                         Pad_110[0x18];                                     // 0x0110(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UOptimusFunctionNodeGraph> FunctionGraph;                                     // 0x0128(0x0030)(Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UOptimusNodePin>         DefaultComponentPin;                               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_FunctionReference">();
	}
	static class UOptimusNode_FunctionReference* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_FunctionReference>();
	}
};

// Class OptimusCore.OptimusNode_ResourceAccessorBase
// 0x0090 (0x01A0 - 0x0110)
class UOptimusNode_ResourceAccessorBase : public UOptimusNode
{
public:
	uint8                                         Pad_110[0x20];                                     // 0x0110(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UOptimusResourceDescription> ResourceDesc;                                      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EOptimusBufferWriteType                       WriteType;                                         // 0x0138(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOptimusNode_ResourceAccessorBase_DuplicationInfo DuplicationInfo;                                   // 0x0140(0x0060)(DuplicateTransient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_ResourceAccessorBase">();
	}
	static class UOptimusNode_ResourceAccessorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_ResourceAccessorBase>();
	}
};

// Class OptimusCore.OptimusNode_GetResource
// 0x0000 (0x01A0 - 0x01A0)
class UOptimusNode_GetResource final : public UOptimusNode_ResourceAccessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusNode_GetResource">();
	}
	static class UOptimusNode_GetResource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusNode_GetResource>();
	}
};

// Class OptimusCore.OptimusNode_GetVariable
// 0x0050 (0x0160 - 0x0110)
class UOptimusNode_GetVariable final : public UOptimusNode
{
public:
