#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Overlay

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Overlay_structs.hpp"


namespace SDK
{

// Class Overlay.Overlays
// 0x0000 (0x0030 - 0x0030)
class UOverlays : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Overlays">();
	}
	static class UOverlays* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOverlays>();
	}
};

// Class Overlay.BasicOverlays
// 0x0018 (0x0048 - 0x0030)
class UBasicOverlays final : public UOverlays
{
public:
	TArray<struct FOverlayItem>                   Overlays;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAssetImportData*                       AssetImportData;                                   // 0x0040(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, EditorOnly, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BasicOverlays">();
	}
	static class UBasicOverlays* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasicOverlays>();
	}
};

// Class Overlay.LocalizedOverlays
// 0x0060 (0x0090 - 0x0030)
class ULocalizedOverlays : public UOverlays
{
public:
	class UBasicOverlays*                         DefaultOverlays;                                   // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class UBasicOverlays*>    LocaleToOverlaysMap;                               // 0x0038(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)
	class UAssetImportData*                       AssetImportData;                                   // 0x0088(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, EditorOnly, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LocalizedOverlays">();
	}
	static class ULocalizedOverlays* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocalizedOverlays>();
	}
};

}

