#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PapayaTimedEvents

#include "Basic.hpp"

#include "PapayaTimedEvents_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class PapayaTimedEvents.PapayaTimedEvents
// 0x01E0 (0x0600 - 0x0420)
class APapayaTimedEvents final : public AActor
{
public:
	TMap<class FString, class UMediaPlayer*>      MediaPlayerMap;                                    // 0x0420(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	class UPapayaTimedEventsResponderComponent*   MeshEventResponder;                                // 0x0470(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         TimedEventActorTargets;                            // 0x0478(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMediaTimeEventArray                   TimedEventsArray;                                  // 0x0490(0x0120)(Net, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B0[0x18];                                     // 0x05B0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ScreenName;                                        // 0x05C8(0x0010)(Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D8[0x28];                                     // 0x05D8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddTimedEvent_Native(const class FString& EventName, int64 Time, const class FString& EventParam);
	void OnRep_ScreenName(const class FString& PreviousValue);
	void OnRep_TimedEventsArray(const struct FMediaTimeEventArray& PreviousValue);
	void ResetTimedEvents_Native();
	void SetupTimedEvents_Native(const class FString& ScreenName_0);
	void ShutdownTimedEvents_Native();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PapayaTimedEvents">();
	}
	static class APapayaTimedEvents* GetDefaultObj()
	{
		return GetDefaultObjImpl<APapayaTimedEvents>();
	}
};

// Class PapayaTimedEvents.PapayaTimedEventsResponderComponent
// 0x0078 (0x0198 - 0x0120)
class UPapayaTimedEventsResponderComponent final : public UFortEventResponderComponent
{
public:
	uint8                                         Pad_120[0x78];                                     // 0x0120(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PapayaTimedEventsResponderComponent">();
	}
	static class UPapayaTimedEventsResponderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPapayaTimedEventsResponderComponent>();
	}
};

}

