#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperSpriteSheetImporter

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "UnrealEd_classes.hpp"


namespace SDK
{

// Class PaperSpriteSheetImporter.PaperSpriteSheet
// 0x0058 (0x0088 - 0x0030)
class UPaperSpriteSheet final : public UObject
{
public:
	TArray<class FString>                         SpriteNames;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UPaperSprite>>    Sprites;                                           // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	class FString                                 TextureName;                                       // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             Texture;                                           // 0x0060(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NormalMapTextureName;                              // 0x0068(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             NormalMapTexture;                                  // 0x0078(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAssetImportData*                       AssetImportData;                                   // 0x0080(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, EditorOnly, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PaperSpriteSheet">();
	}
	static class UPaperSpriteSheet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperSpriteSheet>();
	}
};

// Class PaperSpriteSheetImporter.PaperSpriteSheetImportFactory
// 0x00C8 (0x0150 - 0x0088)
class UPaperSpriteSheetImportFactory : public UFactory
{
public:
	uint8                                         Pad_88[0xC8];                                      // 0x0088(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PaperSpriteSheetImportFactory">();
	}
	static class UPaperSpriteSheetImportFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperSpriteSheetImportFactory>();
	}
};

// Class PaperSpriteSheetImporter.PaperSpriteSheetReimportFactory
// 0x0020 (0x0170 - 0x0150)
class UPaperSpriteSheetReimportFactory final : public UPaperSpriteSheetImportFactory
{
public:
	uint8                                         Pad_150[0x20];                                     // 0x0150(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PaperSpriteSheetReimportFactory">();
	}
	static class UPaperSpriteSheetReimportFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperSpriteSheetReimportFactory>();
	}
};

}

