#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerformanceCaptureCore

#include "Basic.hpp"

#include "IKRig_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "LiveLinkInterface_structs.hpp"


namespace SDK
{

// Class PerformanceCaptureCore.CaptureCharacter
// 0x0020 (0x04C0 - 0x04A0)
class ACaptureCharacter final : public ASkeletalMeshActor
{
public:
	class ACapturePerformer*                      SourcePerformer;                                   // 0x04A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UIKRetargeter*                          RetargetAsset;                                     // 0x04A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceAllSkeletalMeshesToFollowLeader;             // 0x04B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URetargetComponent*                     RetargetComponent;                                 // 0x04B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	struct FRetargetProfile GetCustomRetargetProfile();
	void SetCustomRetargetProfile(const struct FRetargetProfile& InProfile);
	void SetForceAllSkeletalMeshesToFollowLeader(bool InFollowLeader);
	void SetRetargetAsset(class UIKRetargeter* InRetargetAsset);
	void SetSourcePerformer(class ACapturePerformer* InPerformer);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CaptureCharacter">();
	}
	static class ACaptureCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACaptureCharacter>();
	}
};

// Class PerformanceCaptureCore.CapturePerformer
// 0x0018 (0x04B8 - 0x04A0)
class ACapturePerformer final : public ASkeletalMeshActor
{
public:
	struct FLiveLinkSubjectName                   SubjectName;                                       // 0x04A0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceAllMeshesToFollowLeader;                     // 0x04AC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEvaluateAnimation;                                // 0x04AD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4AE[0xA];                                      // 0x04AE(0x000A)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetEvaluateLiveLinkData();
	void SetEvaluateLiveLinkData(bool bEvaluateLinkLink);
	void SetLiveLinkSubject(const struct FLiveLinkSubjectName& Subject);
	void SetMocapMesh(class USkeletalMesh* MocapMesh);

	struct FLiveLinkSubjectName GetLiveLinkSubject() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CapturePerformer">();
	}
	static class ACapturePerformer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACapturePerformer>();
	}
};

// Class PerformanceCaptureCore.PerformerComponent
// 0x0048 (0x0120 - 0x00D8)
class UPerformerComponent final : public UActorComponent
{
public:
	struct FLiveLinkSubjectName                   SubjectName;                                       // 0x00D8(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FComponentReference                    ControlledSkeletalMesh;                            // 0x00E8(0x0030)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEvaluateAnimation;                                // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceOtherMeshesToFollowControlledMesh;           // 0x0119(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetEvaluateLiveLinkData();
	void SetEvaluateLiveLinkData(bool bEvaluateLinkLink);
	void SetLiveLinkSubject(const struct FLiveLinkSubjectName& Subject);

	struct FLiveLinkSubjectName GetLiveLinkSubject() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PerformerComponent">();
	}
	static class UPerformerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerformerComponent>();
	}
};

// Class PerformanceCaptureCore.RetargetAnimInstance
// 0x0260 (0x0660 - 0x0400)
class URetargetAnimInstance final : public UAnimInstance
{
public:
	struct FAnimNode_RetargetPoseFromMesh         RetargetNode;                                      // 0x03F8(0x0268)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RetargetAnimInstance">();
	}
	static class URetargetAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<URetargetAnimInstance>();
	}
};

// Class PerformanceCaptureCore.RetargetComponent
// 0x0190 (0x0268 - 0x00D8)
class URetargetComponent final : public UActorComponent
{
public:
	struct FComponentReference                    SourceSkeletalMeshComponent;                       // 0x00D8(0x0030)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FComponentReference                    ControlledSkeletalMeshComponent;                   // 0x0108(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceOtherMeshesToFollowControlledMesh;           // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIKRetargeter*                          RetargetAsset;                                     // 0x0140(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRetargetProfile                       CustomRetargetProfile;                             // 0x0148(0x0118)(Edit, BlueprintVisible, Interp, NativeAccessSpecifierPublic)
	uint8                                         Pad_260[0x8];                                      // 0x0260(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FRetargetProfile GetCustomRetargetProfile();
	void SetControlledMesh(class USkeletalMeshComponent* InControlledMesh);
	void SetCustomRetargetProfile(const struct FRetargetProfile& InProfile);
	void SetRetargetAsset(class UIKRetargeter* InRetargetAsset);
	void SetSourcePerformerMesh(class USkeletalMeshComponent* InPerformerMesh);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RetargetComponent">();
	}
	static class URetargetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URetargetComponent>();
	}
};

}

