#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Persona

#include "Basic.hpp"


namespace SDK::Params
{

// Function Persona.AnimationSequenceBrowserContextMenuContext.GetSelectedObjects
// 0x0010 (0x0010 - 0x0000)
struct AnimationSequenceBrowserContextMenuContext_GetSelectedObjects final
{
public:
	TArray<class UObject*>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function Persona.PersonaToolMenuContext.GetAnimationAsset
// 0x0008 (0x0008 - 0x0000)
struct PersonaToolMenuContext_GetAnimationAsset final
{
public:
	class UAnimationAsset*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Persona.PersonaToolMenuContext.GetAnimBlueprint
// 0x0008 (0x0008 - 0x0000)
struct PersonaToolMenuContext_GetAnimBlueprint final
{
public:
	class UAnimBlueprint*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Persona.PersonaToolMenuContext.GetMesh
// 0x0008 (0x0008 - 0x0000)
struct PersonaToolMenuContext_GetMesh final
{
public:
	class USkeletalMesh*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Persona.PersonaToolMenuContext.GetPreviewMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct PersonaToolMenuContext_GetPreviewMeshComponent final
{
public:
	class UDebugSkelMeshComponent*                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Persona.PersonaToolMenuContext.GetSkeleton
// 0x0008 (0x0008 - 0x0000)
struct PersonaToolMenuContext_GetSkeleton final
{
public:
	class USkeleton*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

