#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Persona

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnrealEd_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum Persona.EAnalysisSpace
// NumValues: 0x0005
enum class EAnalysisSpace : uint8
{
	World                                    = 0,
	Fixed                                    = 1,
	Changing                                 = 2,
	Moving                                   = 3,
	EAnalysisSpace_MAX                       = 4,
};

// Enum Persona.EAnalysisLinearAxis
// NumValues: 0x0007
enum class EAnalysisLinearAxis : uint8
{
	PlusX                                    = 0,
	PlusY                                    = 1,
	PlusZ                                    = 2,
	MinusX                                   = 3,
	MinusY                                   = 4,
	MinusZ                                   = 5,
	EAnalysisLinearAxis_MAX                  = 6,
};

// Enum Persona.EEulerCalculationMethod
// NumValues: 0x0003
enum class EEulerCalculationMethod : uint8
{
	AimDirection                             = 0,
	PointDirection                           = 1,
	EEulerCalculationMethod_MAX              = 2,
};

// Enum Persona.EAnalysisEulerAxis
// NumValues: 0x0004
enum class EAnalysisEulerAxis : uint8
{
	Roll                                     = 0,
	Pitch                                    = 1,
	Yaw                                      = 2,
	EAnalysisEulerAxis_MAX                   = 3,
};

// ScriptStruct Persona.PhysicsAssetRenderSettings
// 0x0068 (0x0068 - 0x0000)
struct FPhysicsAssetRenderSettings final
{
public:
	EPhysicsAssetEditorCenterOfMassViewMode       CenterOfMassViewMode;                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicsAssetEditorCollisionViewMode          CollisionViewMode;                                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicsAssetEditorConstraintViewMode         ConstraintViewMode;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConstraintTransformComponentFlags            ConstraintViewportManipulationFlags;               // 0x0003(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConstraintTransformComponentFlags            ConstraintTransformComponentDisplayRelativeToDefaultFlags; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ConstraintDrawSize;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhysicsBlend;                                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideKinematicBodies;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideSimulatedBodies;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideBodyMass;                                     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRenderOnlySelectedConstraints;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowCOM;                                          // 0x0014(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowConstraintsAsPoints;                          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawViolatedLimits;                               // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 BoneUnselectedColor;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 NoCollisionColor;                                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 COMRenderColor;                                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         COMRenderSize;                                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         COMRenderLineThickness;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         COMRenderMassTextOffsetScreenspace;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InfluenceLineLength;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     BoneUnselectedMaterial;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     BoneNoCollisionMaterial;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 HiddenBodies;                                      // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 HiddenConstraints;                                 // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Persona.AnimCurveMetadataEditorClipboardEntry
// 0x0028 (0x0028 - 0x0000)
struct FAnimCurveMetadataEditorClipboardEntry final
{
public:
	class FName                                   CurveName;                                         // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurveMetaData                         MetaData;                                          // 0x0010(0x0018)(NativeAccessSpecifierPublic)
};

// ScriptStruct Persona.AnimCurveMetadataEditorClipboard
// 0x0010 (0x0010 - 0x0000)
struct FAnimCurveMetadataEditorClipboard final
{
public:
	TArray<struct FAnimCurveMetadataEditorClipboardEntry> Entries;                                           // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

}

