#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: physics_tree_device

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "physics_object_base_device_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass physics_tree_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class physics_tree_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass physics_tree_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class physics_tree_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<physics_tree_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass physics_tree_device.physics_tree_device
// 0x0040 (0x0120 - 0x00E0)
class Uphysics_tree_device final : public Uphysics_object_base_device
{
public:
	class UObject*                                __verse_0xCF1C630D_TreeSpawnedEvent;               // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x64A226C6_LogDestroyedEvent;              // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xD3BAA86E_StumpDestroyedEvent;            // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x3374698E_TreeKnockedDownEvent;           // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC5FF236F_ReleaseLogFunction;             // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xCEC37F0C_DestroyLogFunction;             // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x3B9F0C6B_DestroyStumpFunction;           // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fphysics__tree__device_N_RDestroyLog(const struct physics_tree_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fphysics__tree__device_N_RDestroyStump(const struct physics_tree_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fphysics__tree__device_N_RReleaseLog(const struct physics_tree_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"physics_tree_device">();
	}
	static class Uphysics_tree_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uphysics_tree_device>();
	}
};

}

