#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhysicsAssetEditor

#include "Basic.hpp"

#include "UnrealEd_classes.hpp"
#include "Engine_classes.hpp"
#include "AnimGraph_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class PhysicsAssetEditor.PhysicsAssetGraphNode
// 0x0030 (0x00F0 - 0x00C0)
class UPhysicsAssetGraphNode : public UEdGraphNode
{
public:
	uint8                                         Pad_C0[0x30];                                      // 0x00C0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsAssetGraphNode">();
	}
	static class UPhysicsAssetGraphNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsAssetGraphNode>();
	}
};

// Class PhysicsAssetEditor.PhysicsAssetGraphNode_Bone
// 0x0030 (0x0120 - 0x00F0)
class UPhysicsAssetGraphNode_Bone final : public UPhysicsAssetGraphNode
{
public:
	uint8                                         Pad_F0[0x30];                                      // 0x00F0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsAssetGraphNode_Bone">();
	}
	static class UPhysicsAssetGraphNode_Bone* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsAssetGraphNode_Bone>();
	}
};

// Class PhysicsAssetEditor.PhysicsAssetEditorAnimInstance
// 0x0000 (0x0420 - 0x0420)
class UPhysicsAssetEditorAnimInstance final : public UAnimPreviewInstance
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsAssetEditorAnimInstance">();
	}
	static class UPhysicsAssetEditorAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsAssetEditorAnimInstance>();
	}
};

// Class PhysicsAssetEditor.PhysicsAssetEditorPhysicsHandleComponent
// 0x0000 (0x0640 - 0x0640)
class UPhysicsAssetEditorPhysicsHandleComponent final : public UPhysicsHandleComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsAssetEditorPhysicsHandleComponent">();
	}
	static class UPhysicsAssetEditorPhysicsHandleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsAssetEditorPhysicsHandleComponent>();
	}
};

// Class PhysicsAssetEditor.PhysicsAssetEditorSkeletalMeshComponent
// 0x0060 (0x1320 - 0x12C0)
class UPhysicsAssetEditorSkeletalMeshComponent final : public UDebugSkelMeshComponent
{
public:
	uint8                                         Pad_12C0[0x28];                                    // 0x12C0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               ElemSelectedMaterial;                              // 0x12E8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               BoneUnselectedMaterial;                            // 0x12F0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               BoneNoCollisionMaterial;                           // 0x12F8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     BoneMaterialHit;                                   // 0x1300(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1308[0x18];                                    // 0x1308(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsAssetEditorSkeletalMeshComponent">();
	}
	static class UPhysicsAssetEditorSkeletalMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsAssetEditorSkeletalMeshComponent>();
	}
};

// Class PhysicsAssetEditor.PhysicsAssetEditorToolMenuContext
// 0x0010 (0x0040 - 0x0030)
class UPhysicsAssetEditorToolMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsAssetEditorToolMenuContext">();
	}
	static class UPhysicsAssetEditorToolMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsAssetEditorToolMenuContext>();
	}
};

// Class PhysicsAssetEditor.PhysicsAssetGraph
// 0x0080 (0x0130 - 0x00B0)
class UPhysicsAssetGraph final : public UEdGraph
{
public:
	uint8                                         Pad_B0[0x80];                                      // 0x00B0(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsAssetGraph">();
	}
	static class UPhysicsAssetGraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsAssetGraph>();
	}
};

// Class PhysicsAssetEditor.PhysicsAssetGraphNode_Constraint
// 0x0018 (0x0108 - 0x00F0)
class UPhysicsAssetGraphNode_Constraint final : public UPhysicsAssetGraphNode
{
public:
	uint8                                         Pad_F0[0x18];                                      // 0x00F0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsAssetGraphNode_Constraint">();
	}
	static class UPhysicsAssetGraphNode_Constraint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsAssetGraphNode_Constraint>();
	}
};

// Class PhysicsAssetEditor.PhysicsAssetGraphSchema
// 0x0000 (0x0030 - 0x0030)
class UPhysicsAssetGraphSchema final : public UEdGraphSchema
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsAssetGraphSchema">();
	}
	static class UPhysicsAssetGraphSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsAssetGraphSchema>();
	}
};

}

