#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhysicsControlEditor

#include "Basic.hpp"

#include "UnrealEd_classes.hpp"
#include "Engine_classes.hpp"
#include "AnimGraph_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class PhysicsControlEditor.PhysicsControlAssetEditorAnimInstance
// 0x0000 (0x0420 - 0x0420)
class UPhysicsControlAssetEditorAnimInstance final : public UAnimPreviewInstance
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsControlAssetEditorAnimInstance">();
	}
	static class UPhysicsControlAssetEditorAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsControlAssetEditorAnimInstance>();
	}
};

// Class PhysicsControlEditor.PhysicsControlAssetEditorPhysicsHandleComponent
// 0x0000 (0x0640 - 0x0640)
class UPhysicsControlAssetEditorPhysicsHandleComponent final : public UPhysicsHandleComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsControlAssetEditorPhysicsHandleComponent">();
	}
	static class UPhysicsControlAssetEditorPhysicsHandleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsControlAssetEditorPhysicsHandleComponent>();
	}
};

// Class PhysicsControlEditor.PhysicsControlAssetEditorSkeletalMeshComponent
// 0x0060 (0x1320 - 0x12C0)
class UPhysicsControlAssetEditorSkeletalMeshComponent final : public UDebugSkelMeshComponent
{
public:
	uint8                                         Pad_12C0[0x30];                                    // 0x12C0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               ElemSelectedMaterial;                              // 0x12F0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               BoneUnselectedMaterial;                            // 0x12F8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               BoneNoCollisionMaterial;                           // 0x1300(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     BoneMaterialHit;                                   // 0x1308(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1310[0x10];                                    // 0x1310(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsControlAssetEditorSkeletalMeshComponent">();
	}
	static class UPhysicsControlAssetEditorSkeletalMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsControlAssetEditorSkeletalMeshComponent>();
	}
};

// Class PhysicsControlEditor.PhysicsControlAssetEditorToolMenuContext
// 0x0010 (0x0040 - 0x0030)
class UPhysicsControlAssetEditorToolMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsControlAssetEditorToolMenuContext">();
	}
	static class UPhysicsControlAssetEditorToolMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsControlAssetEditorToolMenuContext>();
	}
};

// Class PhysicsControlEditor.PhysicsControlAssetFactory
// 0x0000 (0x0088 - 0x0088)
class UPhysicsControlAssetFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsControlAssetFactory">();
	}
	static class UPhysicsControlAssetFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsControlAssetFactory>();
	}
};

}

