#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerAugmentsUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class PlayerAugmentsUI.FortMobileButtonBehaviorComponent_AugmentsListIconPicker
// 0x0010 (0x0060 - 0x0050)
class UFortMobileButtonBehaviorComponent_AugmentsListIconPicker final : public UFortMobileButtonBehaviorComponent_IconPicker
{
public:
	bool                                          bCachedIsInInventoryView;                          // 0x0050(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           ListViewSprite;                                    // 0x0058(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnAugmentToolViewSwap(const bool bIsInInventoryView);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileButtonBehaviorComponent_AugmentsListIconPicker">();
	}
	static class UFortMobileButtonBehaviorComponent_AugmentsListIconPicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileButtonBehaviorComponent_AugmentsListIconPicker>();
	}
};

// Class PlayerAugmentsUI.FortMobileButtonBehaviorComponent_AugmentsListVisibility
// 0x0008 (0x0058 - 0x0050)
class UFortMobileButtonBehaviorComponent_AugmentsListVisibility : public UFortMobileButtonBehaviorComponent_Visibility
{
public:
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleAugmentToolOpenedStatusChanged(const bool bIsOpened, const bool bInIsInventoryView);
	void HandleAugmentToolViewSwap(const bool bInIsInventoryView);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileButtonBehaviorComponent_AugmentsListVisibility">();
	}
	static class UFortMobileButtonBehaviorComponent_AugmentsListVisibility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileButtonBehaviorComponent_AugmentsListVisibility>();
	}
};

// Class PlayerAugmentsUI.FortMobileButtonBehaviorComponent_AugmentsListVisibility_Swap
// 0x0008 (0x0060 - 0x0058)
class UFortMobileButtonBehaviorComponent_AugmentsListVisibility_Swap final : public UFortMobileButtonBehaviorComponent_AugmentsListVisibility
{
public:
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileButtonBehaviorComponent_AugmentsListVisibility_Swap">();
	}
	static class UFortMobileButtonBehaviorComponent_AugmentsListVisibility_Swap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileButtonBehaviorComponent_AugmentsListVisibility_Swap>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentHUDTimerWidget
// 0x0000 (0x0488 - 0x0488)
class UFortPlayerAugmentHUDTimerWidget : public UFortHUDElementWidget
{
public:
	void HandleAugmentGrantingTimersFinishedForMatch();
	void HandleAugmentGrantingTimersResetForMatch();
	void HandleAugmentSelectorOpenedStatusChanged(const bool bIsOpened, const bool bViewingAugmentInventory);
	void HandleCanSelectAugmentChanged(bool bCanSelectAugment);
	void HandleHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenElementTagContainer);
	void HandleNumPendingAugmentsToGrantUpdated(int8 NumPendingAugmentsToGrant);
	void HandleTimerUpdated(float TimeRemaining, float TimePercentage);
	void OnAugmentGrantingTimersFinishedForMatch();
	void OnAugmentGrantingTimersResetForMatch();
	void OnAugmentSelectorOpenedStatusChanged(const bool bIsOpened);
	void OnCanSelectAugmentChanged(bool bCanSelectAugment);
	void OnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenElementTagContainer);
	void OnMovementModeChanged();
	void OnNumPendingAugmentsToGrantUpdated(int32 NumPendingAugmentsToGrant);
	void OnTimerUpdated(float TimeRemaining, float TimePercentage);

	bool CanEquipSelectionTool() const;
	bool CanSelectAugment() const;
	class FText FormatTime(float TotalSeconds) const;
	int32 GetPendingAugmentsToGrant() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentHUDTimerWidget">();
	}
	static class UFortPlayerAugmentHUDTimerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentHUDTimerWidget>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentHUDSelectionTimerWidget
// 0x0068 (0x04F0 - 0x0488)
class UFortPlayerAugmentHUDSelectionTimerWidget final : public UFortPlayerAugmentHUDTimerWidget
{
public:
	bool                                          bIsAugmentReadyVisible;                            // 0x0488(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsCountdownActive;                                // 0x0489(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsOffline;                                        // 0x048A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_48B[0x5];                                      // 0x048B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           HideTimerHandle;                                   // 0x0490(0x0008)(BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               TimerProgressDMI;                                  // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CountdownStartTimeHF;                              // 0x04A0(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       NativeAugmentTimerText;                            // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       NativeAnimTimerTextCountdownUpdated;               // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       NativeAnimProgressBarCountdownUpdated;             // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnCountdownActivated();
	void SetMobileProgressTimer(float TimePercentage);
	void UpdateCountdown(float TimeRemaining);

	bool IsCountdownVisible() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentHUDSelectionTimerWidget">();
	}
	static class UFortPlayerAugmentHUDSelectionTimerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentHUDSelectionTimerWidget>();
	}
};

// Class PlayerAugmentsUI.FortMobileActionBBE_AugmentShoot
// 0x0018 (0x00A0 - 0x0088)
class UFortMobileActionBBE_AugmentShoot final : public UFortMobileActionButtonBehaviorExtension
{
public:
	class UPaperSprite*                           IconOverrideSprite;                                // 0x0088(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           IconOverrideTag;                                   // 0x0090(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileActionBBE_AugmentShoot">();
	}
	static class UFortMobileActionBBE_AugmentShoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileActionBBE_AugmentShoot>();
	}
};

// Class PlayerAugmentsUI.FortMobileActionButtonBehavior_RerollAugments
// 0x0008 (0x0148 - 0x0140)
class UFortMobileActionButtonBehavior_RerollAugments final : public UFortMobileActionButtonBehavior
{
public:
	class UFortItemDefinition*                    RerollCurrency;                                    // 0x0140(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileActionButtonBehavior_RerollAugments">();
	}
	static class UFortMobileActionButtonBehavior_RerollAugments* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileActionButtonBehavior_RerollAugments>();
	}
};

// Class PlayerAugmentsUI.FortMobilePlayerAugmentTimer
// 0x0020 (0x04E0 - 0x04C0)
class UFortMobilePlayerAugmentTimer final : public UFortMobileHUDElement
{
public:
	TWeakObjectPtr<class UFortControllerComponent_AugmentGrantingSystem> AugmentControllerComponent;                        // 0x04C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UUserWidget>                PlayerAugmentGranterWidgetClass;                   // 0x04C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            PlayerAugmentGranterWidget;                        // 0x04D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonButtonBase*                      Button_PlayerAugmentTimer;                         // 0x04D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BP_OnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenElementTagContainer, bool bIsSelectionItemEquipped, bool bForceCollapse);
	void HandleHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenElementTagContainer);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobilePlayerAugmentTimer">();
	}
	static class UFortMobilePlayerAugmentTimer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobilePlayerAugmentTimer>();
	}
};

// Class PlayerAugmentsUI.FortPickupInteractOverrideComponent_Augments
// 0x0020 (0x0118 - 0x00F8)
class UFortPickupInteractOverrideComponent_Augments final : public UFortPickupInteractOverrideComponent
{
public:
	struct FGameplayTagContainer                  AllowedAugmentGameplayTags;                        // 0x00F8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPickupInteractOverrideComponent_Augments">();
	}
	static class UFortPickupInteractOverrideComponent_Augments* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPickupInteractOverrideComponent_Augments>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentCollectionListEntry
// 0x0020 (0x1900 - 0x18E0)
class UFortPlayerAugmentCollectionListEntry final : public UAthenaCollectionListEntry
{
public:
	class UImage*                                 Image_Background;                                  // 0x18E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ParamName_ItemIcon;                                // 0x18E8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ParamName_IsDiscovered;                            // 0x18F4(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentCollectionListEntry">();
	}
	static class UFortPlayerAugmentCollectionListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentCollectionListEntry>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentCollectionScreen
// 0x0090 (0x08C8 - 0x0838)
class UFortPlayerAugmentCollectionScreen final : public UAthenaCollectionScreenBase
{
public:
	struct FScalableFloat                         AugmentsEnabledViaHotfix;                          // 0x0838(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, TSoftObjectPtr<class UObject>> TagToImageMap;                                     // 0x0870(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_CategoryTitle;                                // 0x08C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentCollectionScreen">();
	}
	static class UFortPlayerAugmentCollectionScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentCollectionScreen>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentCollectionScreenContainer
// 0x0000 (0x06F8 - 0x06F8)
class UFortPlayerAugmentCollectionScreenContainer final : public UAthenaCollectionScreenContainer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentCollectionScreenContainer">();
	}
	static class UFortPlayerAugmentCollectionScreenContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentCollectionScreenContainer>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentCollectionScreenInfoOverlay
// 0x0028 (0x0670 - 0x0648)
class UFortPlayerAugmentCollectionScreenInfoOverlay final : public UAthenaCollectionScreenInfoOverlay
{
public:
	class FName                                   ParamName_Progress;                                // 0x0648(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_654[0x4];                                      // 0x0654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_ItemCategory;                                 // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemCategoryIndicator*             ItemCategoryIndicator;                             // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_UndiscoveredText;                          // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentCollectionScreenInfoOverlay">();
	}
	static class UFortPlayerAugmentCollectionScreenInfoOverlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentCollectionScreenInfoOverlay>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentGranterWidget
// 0x0068 (0x04F0 - 0x0488)
class UFortPlayerAugmentGranterWidget final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         UnblockInteractionWithChoicesTime;                 // 0x0490(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortPlayerAugmentItemDefinition*> AvailableAugmentItemDefinitions;                   // 0x04C8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UWidget*                                Overlay_Reroll;                                    // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4E0[0x10];                                     // 0x04E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleAugmentHighlighted(int32 HighlightedAugmentIndex);
	void HandleAugmentSelectionStarted(const int32 SelectedAugmentIndex);
	void HandleAugmentSelectorOpenedStatusChanged(const bool bIsOpened, const bool bViewingAugmentInventory);
	void HandleAugmentSelectorToolViewSwapped(const bool bViewingAugmentsInventory);
	void HandleAvailableAugmentsForGrantingUpdated(class UFortControllerComponent_AugmentGrantingSystem* GrantingComponent);
	void HandleCanSelectAugmentChanged(bool bCanSelectAugment);
	void HandleNumPendingAugmentsToGrantUpdated(int8 NumPendingAugmentsToGrant);
	void HandleRerollAugments();
	void HandleSelectedAugmentForGrant(class UFortPlayerAugmentItemDefinition* SelectedAugment);
	void HandleTimerUpdated(float TimeRemaining, float TimePercentage);
	void OnAugmentHighlighted(int32 HighlightedAugmentIndex);
	void OnAugmentScrollDownEvent();
	void OnAugmentScrollUpEvent();
	void OnAugmentSelectionStarted(const int32 SelectedAugmentIndex);
	void OnAugmentSelectorOpenedStatusChanged(const bool bIsOpened, const bool bViewingAugmentInventory);
	void OnAugmentSelectorToolViewSwapped(const bool bViewingAugmentInventory);
	void OnCanSelectAugmentChanged(bool bCanSelectAugment);
	void OnInputTypeChanged(const ECommonInputType NewInputType);
	void OnNumPendingAugmentsToGrantUpdated(int32 NumPendingAugmentsToGrant);
	void OnPopulateAvailableAugmentsHUD(const TArray<class UFortPlayerAugmentItemDefinition*>& AugmentItemDefinition);
	void OnRerollAugments();
	void OnSelectedAugmentForGrant(class UFortPlayerAugmentItemDefinition* HighlightedAugment);
	void OnTimerUpdated(float TimeRemaining, float TimePercentage);

	int32 GetPendingAugmentsToGrant() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentGranterWidget">();
	}
	static class UFortPlayerAugmentGranterWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentGranterWidget>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentHUDQuickbarWidget
// 0x0058 (0x0498 - 0x0440)
class UFortPlayerAugmentHUDQuickbarWidget final : public UCommonUserWidget
{
public:
	struct FGameplayTagContainer                  HiddenAugmentGameplayTags;                         // 0x0440(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NumAugmentGrantRoundsForPlaylist;                  // 0x0460(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void OnAugmentsUpdated(const TArray<class UFortPlayerAugmentItemDefinition*>& ActiveAugments);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentHUDQuickbarWidget">();
	}
	static class UFortPlayerAugmentHUDQuickbarWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentHUDQuickbarWidget>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentHUDRerollWidget
// 0x0058 (0x0498 - 0x0440)
class UFortPlayerAugmentHUDRerollWidget final : public UCommonUserWidget
{
public:
	class UCommonLazyImage*                       Image_CurrencyIcon;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortWorldItemDefinition*               RerollCurrency;                                    // 0x0448(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CachedNumFreeRerolls;                              // 0x0450(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   RerollHoldMaterialParamName;                       // 0x0454(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_460[0x8];                                      // 0x0460(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 Image_ProgressBar;                                 // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_OwnedCurrency;                                // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RerollCost;                                   // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_480[0x18];                                     // 0x0480(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EndRerollHoldProgress();
	void HandleAugmentSelectorOpenedStatusChanged(bool bIsOpened, bool bViewingInventory);
	void HandleFreeRerollsUpdated(const int32 NewNumFreeRerolls);
	void HandleRerollAugments();
	void OnFreeRerollsUpdated(const int32 NewNumFreeRerolls);
	void OnRerollAugments();
	void OnUpdateCurrency(const int32 OwnedCurrency, const int32 RerollCost);
	void StartRerollHoldProgress(const float Duration);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentHUDRerollWidget">();
	}
	static class UFortPlayerAugmentHUDRerollWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentHUDRerollWidget>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentInfoEntryWidget
// 0x0060 (0x04A0 - 0x0440)
class UFortPlayerAugmentInfoEntryWidget final : public UCommonUserWidget
{
public:
	class FText                                   RarityTextFormat;                                  // 0x0440(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_AugmentName;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_AugmentRarity;                                // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_AugmentCategory;                              // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemCategoryIndicator*             ItemCategoryIndicator;                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         Image_CategoryAsImage;                             // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_AugmentDescription;                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSocialAvatarIcon*                  Icon_LenderAvatarIcon;                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_LenderAvatarIcon;                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         Image_LenderSquadColor;                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_BorrowingText;                                // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnItemNewOrBorrowedSet(const bool bIsNew, const bool bIsBorrowed);
	void OnItemPinColorSet(const struct FLinearColor& PinColor);
	void OnItemRaritySet(const EFortRarity Rarity, const struct FFortRarityItemData& RarityItemData);
	void UpdateAugment(const class UFortPlayerAugmentItemDefinition* AugmentItemDefinition);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentInfoEntryWidget">();
	}
	static class UFortPlayerAugmentInfoEntryWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInfoEntryWidget>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentInGameCarriedWidget
// 0x0000 (0x0488 - 0x0488)
class UFortPlayerAugmentInGameCarriedWidget final : public UFortHUDElementWidget
{
public:
	void HandleExitBus(class AFortPlayerControllerZone* FortPCZone);
	void OnShowInitialAugment(const class UFortPlayerAugmentItemDefinition* PlayerAugmentItemDefinition);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentInGameCarriedWidget">();
	}
	static class UFortPlayerAugmentInGameCarriedWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInGameCarriedWidget>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentInventoryExtensionRow
// 0x0060 (0x0510 - 0x04B0)
class UFortPlayerAugmentInventoryExtensionRow final : public UAthenaInventoryGroupBase
{
public:
	struct FScalableFloat                         AugmentsEnabledViaHotfix;                          // 0x04B0(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  BlockedGameplayTags;                               // 0x04E8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_508[0x8];                                      // 0x0508(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleAugmentGrantingTimersFinishedForMatch();
	void HandleAugmentGrantingTimersResetForMatch();
	void HandleNumPendingAugmentsToGrantUpdated(int8 NumPendingAugmentsToGrant);
	void HandleTimerUpdated(float TimeRemaining, float TimePercentage);
	void OnAugmentGrantingTimersFinishedForMatch();
	void OnAugmentGrantingTimersResetForMatch();
	void OnNumPendingAugmentsToGrantUpdated(int32 NumPendingAugmentsToGrant);
	void OnTimerUpdated(float TimeRemaining, float TimePercentage);
	void RequestOpenSelector();

	int32 GetPendingAugmentsToGrant() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentInventoryExtensionRow">();
	}
	static class UFortPlayerAugmentInventoryExtensionRow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInventoryExtensionRow>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentInventoryInfoWidget
// 0x0058 (0x05D0 - 0x0578)
class UFortPlayerAugmentInventoryInfoWidget final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RarityTextFormat;                                  // 0x0580(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemName;                                     // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemRarity;                                   // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemCategory;                                 // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemCategoryIndicator*             ItemCategoryIndicator;                             // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemDescription;                              // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSocialAvatarIcon*                  Icon_LenderAvatarIcon;                             // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         Image_LenderSquadColor;                            // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_BorrowingText;                                // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnItemNewOrBorrowedSet(const bool bIsNew, const bool bIsBorrowed);
	void OnItemRaritySet(const EFortRarity Rarity, const struct FFortRarityItemData& RarityItemData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentInventoryInfoWidget">();
	}
	static class UFortPlayerAugmentInventoryInfoWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInventoryInfoWidget>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentInventoryListEntry
// 0x0010 (0x1810 - 0x1800)
class UFortPlayerAugmentInventoryListEntry final : public UCommonButtonBase
{
public:
	uint8                                         Pad_1800[0x10];                                    // 0x1800(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAugmentListItemSet(const class UItemDefinitionBase* ItemDefinition);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentInventoryListEntry">();
	}
	static class UFortPlayerAugmentInventoryListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInventoryListEntry>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentInventoryTab
// 0x01A8 (0x0720 - 0x0578)
class UFortPlayerAugmentInventoryTab final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         AugmentsEnabledViaHotfix;                          // 0x0580(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  HiddenAugmentGameplayTags;                         // 0x05B8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                   TabNameId;                                         // 0x05D8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5E4[0xC];                                      // 0x05E4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x05F0(0x0120)(Edit, NativeAccessSpecifierPrivate)
	class UFortPlayerAugmentInventoryInfoWidget*  AugmentInfo;                                       // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonListView*                        ListView_Augments;                                 // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleAugmentGrantingTimersFinishedForMatch();
	void HandleAugmentGrantingTimersResetForMatch();
	void HandleNumPendingAugmentsToGrantUpdated(int8 NumPendingAugmentsToGrant);
	void HandleTimerUpdated(float TimeRemaining, float TimePercentage);
	void OnAugmentGrantingTimersFinishedForMatch();
	void OnAugmentGrantingTimersResetForMatch();
	void OnAugmentListUpdated(const int32 NumAugments);
	void OnNumPendingAugmentsToGrantUpdated(int32 NumPendingAugmentsToGrant);
	void OnTimerUpdated(float TimeRemaining, float TimePercentage);
	void RequestOpenSelector();

	int32 GetPendingAugmentsToGrant() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentInventoryTab">();
	}
	static class UFortPlayerAugmentInventoryTab* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInventoryTab>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentLobbyWidget
// 0x0000 (0x0440 - 0x0440)
class UFortPlayerAugmentLobbyWidget final : public UCommonUserWidget
{
public:
	void OnShowInitialAugment(const class UFortPlayerAugmentItemDefinition* CarriedAugment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentLobbyWidget">();
	}
	static class UFortPlayerAugmentLobbyWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentLobbyWidget>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentPostMatchUnlocksWidget
// 0x0038 (0x04C0 - 0x0488)
class UFortPlayerAugmentPostMatchUnlocksWidget final : public UFortHUDElementWidget
{
public:
	struct FScalableFloat                         AugmentsEnabledViaHotfix;                          // 0x0488(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void OnShowUnlockedAugments(const TArray<class UFortPlayerAugmentItemDefinition*>& UnlockedAugments);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentPostMatchUnlocksWidget">();
	}
	static class UFortPlayerAugmentPostMatchUnlocksWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentPostMatchUnlocksWidget>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentSpecialAcquiredNotificationWidget
// 0x0098 (0x0520 - 0x0488)
class alignas(0x10) UFortPlayerAugmentSpecialAcquiredNotificationWidget final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_488[0x68];                                     // 0x0488(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPrioritizedWidgetData             PrioritizationData;                                // 0x04F0(0x0002)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4F2[0x6];                                      // 0x04F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TargetGameplayTags;                                // 0x04F8(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_518[0x8];                                      // 0x0518(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CloseWidget();
	void OnEventAdded();
	void OnStompedByOtherWidget();
	void OpenWidget(const class UFortPlayerAugmentItemDefinition* ItemDef);

	class FText ConstructEventDescription(const class UFortPlayerAugmentItemDefinition* ItemDef) const;
	bool HasMoreAugmentEvents() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentSpecialAcquiredNotificationWidget">();
	}
	static class UFortPlayerAugmentSpecialAcquiredNotificationWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentSpecialAcquiredNotificationWidget>();
	}
};

// Class PlayerAugmentsUI.FortPlayerAugmentInfoTouchWidget
// 0x0008 (0x04F0 - 0x04E8)
class UFortPlayerAugmentInfoTouchWidget final : public UFortTouchUserWidget
{
public:
	uint8                                         Pad_4E8[0x8];                                      // 0x04E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAugmentIndexInList(const int32 InAugmentIndexInList);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAugmentInfoTouchWidget">();
	}
	static class UFortPlayerAugmentInfoTouchWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAugmentInfoTouchWidget>();
	}
};

}

