#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: popup_dialog_device

#include "Basic.hpp"


namespace SDK
{

// VerseStruct popup_dialog_device.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct popup_dialog_device::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct popup_dialog_device.tuple_Lmessage_Mint_Mlogic_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lmessage_Mint_Mlogic_R final
{
public:
	class UVerse_message*                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x932BF92E_Elem2 : 1;                      // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};

// VerseStruct popup_dialog_device.tuple_Lmessage_Mint_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lmessage_Mint_R final
{
public:
	class UVerse_message*                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct popup_dialog_device.tuple_Lmessage_Mmessage_M_Kmessage_Magent_R
// 0x0028 (0x0028 - 0x0000)
struct Ftuple_Lmessage_Mmessage_M_Kmessage_Magent_R final
{
public:
	class UVerse_message*                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerse_message*                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UVerse_message*>                 __verse_0x932BF92E_Elem2;                          // 0x0010(0x0010)(InstancedReference, ContainsInstancedReference)
	class USimulation_agent*                      __verse_0xF64C4596_Elem3;                          // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct popup_dialog_device.tuple_Lmessage_Mmessage_M_Kmessage_R
// 0x0020 (0x0020 - 0x0000)
struct Ftuple_Lmessage_Mmessage_M_Kmessage_R final
{
public:
	class UVerse_message*                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerse_message*                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UVerse_message*>                 __verse_0x932BF92E_Elem2;                          // 0x0010(0x0010)(InstancedReference, ContainsInstancedReference)
};

}

