#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: popup_dialog_device

#include "Basic.hpp"

#include "popup_dialog_device_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function popup_dialog_device.popup_dialog_device.$InitCDO
// 0x0720 (0x0720 - 0x0000)
struct popup_dialog_device__InitCDO final
{
public:
	class UDevices_device_event_agent_int*        _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_2;                            // 0x0010(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0020(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_agent*            _ExprResult_4;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_6;                            // 0x0040(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_agent*            _ExprResult_8;                                     // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_9;                                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_10;                           // 0x0070(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x0080(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_agent*            _ExprResult_12;                                    // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_13;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_14;                           // 0x00A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x00B0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_16;                                    // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_17;                               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_18;                           // 0x00D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_19;                                    // 0x00E0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_20;                                    // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_21;                               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_22;                           // 0x0100(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_23;                                    // 0x0110(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_24;                                    // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_25;                               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_26;                           // 0x0130(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_27;                                    // 0x0140(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_28;                                    // 0x0150(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_29;                               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_30;                           // 0x0160(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_31;                                    // 0x0170(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_32;                                    // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_33;                               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_34;                           // 0x0190(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_35;                                    // 0x01A0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_36;                                    // 0x01B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_37;                               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_38;                           // 0x01C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_39;                                    // 0x01D0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_message*   _ExprResult_40;                                    // 0x01E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_41;                               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_42;                           // 0x01F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_43;                                    // 0x0200(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_string*    _ExprResult_44;                                    // 0x0210(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_45;                               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_46;                           // 0x0220(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_47;                                    // 0x0230(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_message*   _ExprResult_48;                                    // 0x0240(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_49;                               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_50;                           // 0x0250(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_51;                                    // 0x0260(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_string*    _ExprResult_52;                                    // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_53;                               // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_54;                           // 0x0280(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_55;                                    // 0x0290(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type* _ExprResult_56;                                    // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_57;                               // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_58;                           // 0x02B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_59;                                    // 0x02C0(0x0010)(HasGetValueTypeHash)
	TArray<class UClass*>                         _ArchetypeFieldValue_60;                           // 0x02D0(0x0010)(ContainsInstancedReference)
	TArray<class UClass*>                         _ExprResult_61;                                    // 0x02E0(0x0010)(ContainsInstancedReference)
	class UDevices_device_function_set_params_by_type_const* _ExprResult_62;                                    // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_63;                               // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_64;                           // 0x0300(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_65;                                    // 0x0310(0x0010)(HasGetValueTypeHash)
	TOptional<class UClass*>                      _ArchetypeFieldValue_66;                           // 0x0320(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UClass*>                      _ExprResult_67;                                    // 0x0330(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UClass*>                         _ArchetypeFieldValue_68;                           // 0x0340(0x0010)(ContainsInstancedReference)
	TArray<class UClass*>                         _ExprResult_69;                                    // 0x0350(0x0010)(ContainsInstancedReference)
	class UDevices_device_function_set_int*       _ExprResult_70;                                    // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_71;                               // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_72;                           // 0x0370(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_73;                                    // 0x0380(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_agent_int*        _ExprResult_74;                                    // 0x0390(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_75;                               // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_76;                           // 0x03A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_77;                                    // 0x03B0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_agent*            _ExprResult_78;                                    // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_79;                               // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_80;                           // 0x03D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_81;                                    // 0x03E0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_agent*            _ExprResult_82;                                    // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_83;                               // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_84;                           // 0x0400(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_85;                                    // 0x0410(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_agent*            _ExprResult_86;                                    // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_87;                               // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_88;                           // 0x0430(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_89;                                    // 0x0440(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_90;                                    // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_91;                               // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_92;                           // 0x0460(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_93;                                    // 0x0470(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_94;                                    // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_95;                               // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_96;                           // 0x0490(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_97;                                    // 0x04A0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_98;                                    // 0x04B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_99;                               // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_100;                          // 0x04C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_101;                                   // 0x04D0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_102;                                   // 0x04E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_103;                              // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_104;                          // 0x04F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_105;                                   // 0x0500(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_106;                                   // 0x0510(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_107;                              // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_108;                          // 0x0520(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_109;                                   // 0x0530(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_110;                                   // 0x0540(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_111;                              // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_112;                          // 0x0550(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_113;                                   // 0x0560(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_message*   _ExprResult_114;                                   // 0x0570(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_115;                              // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_116;                          // 0x0580(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_117;                                   // 0x0590(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_string*    _ExprResult_118;                                   // 0x05A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_119;                              // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_120;                          // 0x05B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_121;                                   // 0x05C0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_message*   _ExprResult_122;                                   // 0x05D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_123;                              // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_124;                          // 0x05E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_125;                                   // 0x05F0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_string*    _ExprResult_126;                                   // 0x0600(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_127;                              // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_128;                          // 0x0610(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_129;                                   // 0x0620(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type* _ExprResult_130;                                   // 0x0630(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_131;                              // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_132;                          // 0x0640(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_133;                                   // 0x0650(0x0010)(HasGetValueTypeHash)
	TArray<class UClass*>                         _ArchetypeFieldValue_134;                          // 0x0660(0x0010)(ContainsInstancedReference)
	TArray<class UClass*>                         _ExprResult_135;                                   // 0x0670(0x0010)(ContainsInstancedReference)
	class UDevices_device_function_set_params_by_type_const* _ExprResult_136;                                   // 0x0680(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_137;                              // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_138;                          // 0x0690(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_139;                                   // 0x06A0(0x0010)(HasGetValueTypeHash)
	TOptional<class UClass*>                      _ArchetypeFieldValue_140;                          // 0x06B0(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UClass*>                      _ExprResult_141;                                   // 0x06C0(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UClass*>                         _ArchetypeFieldValue_142;                          // 0x06D0(0x0010)(ContainsInstancedReference)
	TArray<class UClass*>                         _ExprResult_143;                                   // 0x06E0(0x0010)(ContainsInstancedReference)
	class UDevices_device_function_set_int*       _ExprResult_144;                                   // 0x06F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_145;                              // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_146;                          // 0x0700(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_147;                                   // 0x0710(0x0010)(HasGetValueTypeHash)
};

// Function popup_dialog_device.popup_dialog_device._L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RDisable
// 0x0068 (0x0068 - 0x0000)
struct popup_dialog_device__L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RDisable final
{
public:
	struct popup_dialog_device::Ftuple_L_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct popup_dialog_device::Ftuple_L_R        _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct popup_dialog_device::Ftuple_L_R        _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function popup_dialog_device.popup_dialog_device._L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_REnable
// 0x0068 (0x0068 - 0x0000)
struct popup_dialog_device__L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_REnable final
{
public:
	struct popup_dialog_device::Ftuple_L_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct popup_dialog_device::Ftuple_L_R        _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct popup_dialog_device::Ftuple_L_R        _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function popup_dialog_device.popup_dialog_device._L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RGetButtonText_L_Nint_R
// 0x00E8 (0x00E8 - 0x0000)
struct popup_dialog_device__L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RGetButtonText_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	class UDevices_function_parameter_string*     __verse_0x454067E3_StringResult_2;                 // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UDevices_function_parameter_string*, true> _FallibleType_0;                                   // 0x0020(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UDevices_function_parameter_base*, true> _ExprResultStack_1;                                // 0x0028(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UDevices_function_parameter_base*, true> _ExprResult_2;                                     // 0x0030(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0x00000000__3;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
	TArray<class UDevices_function_parameter_int*> _ExprResult_4;                                     // 0x0058(0x0010)(ContainsInstancedReference)
	class UDevices_function_parameter_int*        _ExprResult_5;                                     // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_6;                                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ArchetypeFieldValue_7;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_function_parameter_string*     __verse_0x454067E3_StringResult_6;                 // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UDevices_function_parameter_string*, true> _FallibleType_8;                                   // 0x0088(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UDevices_function_parameter_base*, true> _ExprResultStack_9;                                // 0x0090(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UDevices_function_parameter_base*, true> _ExprResult_10;                                    // 0x0098(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0x00000000__7;                             // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x00A8(0x0018)(HasGetValueTypeHash)
	TArray<class UDevices_function_parameter_int*> _ExprResult_12;                                    // 0x00C0(0x0010)(ContainsInstancedReference)
	class UDevices_function_parameter_int*        _ExprResult_13;                                    // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_14;                               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ArchetypeFieldValue_15;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function popup_dialog_device.popup_dialog_device._L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RGetDescriptionText
// 0x0068 (0x0068 - 0x0000)
struct popup_dialog_device__L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RGetDescriptionText final
{
public:
	struct popup_dialog_device::Ftuple_L_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	class UDevices_device_function_get_string*    __verse_0x00000000__1;                             // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0020(0x0018)(HasGetValueTypeHash)
	struct popup_dialog_device::Ftuple_L_R        _ExprResult_1;                                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function_get_string*    __verse_0x00000000__2;                             // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct popup_dialog_device::Ftuple_L_R        _ExprResult_3;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function popup_dialog_device.popup_dialog_device._L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RGetTitleText
// 0x0068 (0x0068 - 0x0000)
struct popup_dialog_device__L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RGetTitleText final
{
public:
	struct popup_dialog_device::Ftuple_L_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	class UDevices_device_function_get_string*    __verse_0x00000000__1;                             // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0020(0x0018)(HasGetValueTypeHash)
	struct popup_dialog_device::Ftuple_L_R        _ExprResult_1;                                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function_get_string*    __verse_0x00000000__2;                             // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct popup_dialog_device::Ftuple_L_R        _ExprResult_3;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function popup_dialog_device.popup_dialog_device._L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RHide
// 0x0068 (0x0068 - 0x0000)
struct popup_dialog_device__L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RHide final
{
public:
	struct popup_dialog_device::Ftuple_L_R        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct popup_dialog_device::Ftuple_L_R        _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct popup_dialog_device::Ftuple_L_R        _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function popup_dialog_device.popup_dialog_device._L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RHide_L_Nagent_R
// 0x0058 (0x0058 - 0x0000)
struct popup_dialog_device__L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RHide_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
};

// Function popup_dialog_device.popup_dialog_device._L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RSetAllButtons_L_N_Kmessage_R
// 0x01B0 (0x01B0 - 0x0000)
struct popup_dialog_device__L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RSetAllButtons_L_N_Kmessage_R final
{
public:
	TArray<class UVerse_message*>                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	TOptional<int64>                              _ExprResultStack_0;                                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResult_1;                                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UVerse_message*>                 __verse_0x00000000__2;                             // 0x0028(0x0010)(ContainsInstancedReference)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
	int64                                         _ExprResult_4;                                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UVerse_message*>                 __verse_0x00000000__4;                             // 0x0060(0x0010)(ContainsInstancedReference)
	struct FVerseIntRange                         _ForIterable_5;                                    // 0x0070(0x0010)(NoDestructor)
	int64                                         _ExprResult_6;                                     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UVerse_message*>                 __verse_0x00000000__7;                             // 0x0088(0x0010)(ContainsInstancedReference)
	int64                                         __verse_0x98DC86C6_Index_8;                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerse_message*                         __verse_0x6BF89572_TextElement_11;                 // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerse_message*, true>        _ExprResultStack_7;                                // 0x00A8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_8;                          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x00B8(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Lmessage_Mint_R                 _ExprResult_10;                                    // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<int64>                              _ExprResultStack_11;                               // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ExprResult_12;                                    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UVerse_message*>                 __verse_0x00000000__13;                            // 0x00F8(0x0010)(ContainsInstancedReference)
	EVerseTrue                                    _InvokeSureResultDummy_13;                         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_14;                                        // 0x0110(0x0018)(HasGetValueTypeHash)
	int64                                         _ExprResult_15;                                    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UVerse_message*>                 __verse_0x00000000__15;                            // 0x0130(0x0010)(ContainsInstancedReference)
	struct FVerseIntRange                         _ForIterable_16;                                   // 0x0140(0x0010)(NoDestructor)
	int64                                         _ExprResult_17;                                    // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UVerse_message*>                 __verse_0x00000000__18;                            // 0x0158(0x0010)(ContainsInstancedReference)
	int64                                         __verse_0x98DC86C6_Index_19;                       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerse_message*                         __verse_0x6BF89572_TextElement_22;                 // 0x0170(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerse_message*, true>        _ExprResultStack_18;                               // 0x0178(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_19;                         // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_20;                                        // 0x0188(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Lmessage_Mint_R                 _ExprResult_21;                                    // 0x01A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function popup_dialog_device.popup_dialog_device._L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RSetAndShow_L_Nmessage_M_Nmessage_M_N_Kmessage_M_Nagent_R
// 0x0128 (0x0128 - 0x0000)
struct popup_dialog_device__L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RSetAndShow_L_Nmessage_M_Nmessage_M_N_Kmessage_M_Nagent_R final
{
public:
	struct Ftuple_Lmessage_Mmessage_M_Kmessage_Magent_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0028)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0050(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_4;                          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0070(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_6;                          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0090(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_8;                          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x00B0(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_10;                         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x00D0(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_12;                         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_13;                                        // 0x00F0(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_14;                         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_15;                                        // 0x0110(0x0018)(HasGetValueTypeHash)
};

// Function popup_dialog_device.popup_dialog_device._L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RSetAndShow_L_Nmessage_M_Nmessage_M_N_Kmessage_R
// 0x0128 (0x0128 - 0x0000)
struct popup_dialog_device__L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RSetAndShow_L_Nmessage_M_Nmessage_M_N_Kmessage_R final
{
public:
	struct Ftuple_Lmessage_Mmessage_M_Kmessage_R  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0028(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_4;                          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0068(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_6;                          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0088(0x0018)(HasGetValueTypeHash)
	struct popup_dialog_device::Ftuple_L_R        _ExprResult_8;                                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_9;                          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_10;                                        // 0x00A8(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_11;                         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_12;                                        // 0x00C8(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_13;                         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_14;                                        // 0x00E8(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_15;                         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_16;                                        // 0x0108(0x0018)(HasGetValueTypeHash)
	struct popup_dialog_device::Ftuple_L_R        _ExprResult_17;                                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function popup_dialog_device.popup_dialog_device._L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RSetButtonCount_L_Nint_R
// 0x0058 (0x0058 - 0x0000)
struct popup_dialog_device__L_2fFortnite_2ecom_2fDevices_2fpopup__dialog__device_N_RSetButtonCount_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_function_set_int*       __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
