#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: powerup_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass powerup_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class powerup_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass powerup_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class powerup_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<powerup_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass powerup_device.powerup_device
// 0x0050 (0x0110 - 0x00C0)
#pragma pack(push, 0x1)
class alignas(0x10) Upowerup_device : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0x6DAE2196_ItemPickedUpEvent;              // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xA1DD012D_SpawnFunction;                  // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x4C54EF27_DespawnFunction;                // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x10934645_PickupFunction;                 // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_float*     __verse_0x0C89567F_SetDurationFunction;            // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_float*     __verse_0x9A79D9A2_GetDurationFunction;            // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0xA21855F0_HasEffectFunction;              // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0xB331FA22_GetRemainingTimeFunction;       // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_logic*     __verse_0x1FC9D043_IsSpawnedFunction;              // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fpowerup__device_N_RDespawn(const struct powerup_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fDevices_2fpowerup__device_N_RGetDuration(const struct powerup_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fDevices_2fpowerup__device_N_RGetRemainingTime_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fpowerup__device_N_RHasEffect_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fpowerup__device_N_RIsSpawned(const struct powerup_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fpowerup__device_N_RPickup(const struct powerup_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fpowerup__device_N_RPickup_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fpowerup__device_N_RSetDuration_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fpowerup__device_N_RSpawn(const struct powerup_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"powerup_device">();
	}
	static class Upowerup_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Upowerup_device>();
	}
};
#pragma pack(pop)

}

