#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PropertyEditor

#include "Basic.hpp"

#include "PropertyEditor_structs.hpp"


namespace SDK::Params
{

// Function PropertyEditor.EditConditionTestObject.StaticGetBoolFunction
// 0x0001 (0x0001 - 0x0000)
struct EditConditionTestObject_StaticGetBoolFunction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PropertyEditor.EditConditionTestObject.StaticGetByteEnumFunction
// 0x0001 (0x0001 - 0x0000)
struct EditConditionTestObject_StaticGetByteEnumFunction final
{
public:
	EditConditionByteEnum                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PropertyEditor.EditConditionTestObject.StaticGetDoubleFunction
// 0x0008 (0x0008 - 0x0000)
struct EditConditionTestObject_StaticGetDoubleFunction final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PropertyEditor.EditConditionTestObject.StaticGetEnumFunction
// 0x0004 (0x0004 - 0x0000)
struct EditConditionTestObject_StaticGetEnumFunction final
{
public:
	EditConditionTestEnum                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PropertyEditor.EditConditionTestObject.StaticGetIntegerFunction
// 0x0004 (0x0004 - 0x0000)
struct EditConditionTestObject_StaticGetIntegerFunction final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PropertyEditor.EditConditionTestObject.StaticGetSoftClassPtrFunction
// 0x0030 (0x0030 - 0x0000)
struct EditConditionTestObject_StaticGetSoftClassPtrFunction final
{
public:
	TSoftClassPtr<class UClass>                   ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PropertyEditor.EditConditionTestObject.StaticGetUintBitfieldFunction
// 0x0001 (0x0001 - 0x0000)
struct EditConditionTestObject_StaticGetUintBitfieldFunction final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PropertyEditor.EditConditionTestObject.StaticGetUObjectPtrFunction
// 0x0008 (0x0008 - 0x0000)
struct EditConditionTestObject_StaticGetUObjectPtrFunction final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PropertyEditor.EditConditionTestObject.StaticGetWeakObjectPtrFunction
// 0x0008 (0x0008 - 0x0000)
struct EditConditionTestObject_StaticGetWeakObjectPtrFunction final
{
public:
	TWeakObjectPtr<class UObject>                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PropertyEditor.EditConditionTestObject.GetBoolFunction
// 0x0001 (0x0001 - 0x0000)
struct EditConditionTestObject_GetBoolFunction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PropertyEditor.EditConditionTestObject.GetByteEnumFunction
// 0x0001 (0x0001 - 0x0000)
struct EditConditionTestObject_GetByteEnumFunction final
{
public:
	EditConditionByteEnum                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PropertyEditor.EditConditionTestObject.GetDoubleFunction
// 0x0008 (0x0008 - 0x0000)
struct EditConditionTestObject_GetDoubleFunction final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PropertyEditor.EditConditionTestObject.GetEnumFunction
// 0x0004 (0x0004 - 0x0000)
struct EditConditionTestObject_GetEnumFunction final
{
public:
	EditConditionTestEnum                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PropertyEditor.EditConditionTestObject.GetIntegerFunction
// 0x0004 (0x0004 - 0x0000)
struct EditConditionTestObject_GetIntegerFunction final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PropertyEditor.EditConditionTestObject.GetSoftClassPtrFunction
// 0x0030 (0x0030 - 0x0000)
struct EditConditionTestObject_GetSoftClassPtrFunction final
{
public:
	TSoftClassPtr<class UClass>                   ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PropertyEditor.EditConditionTestObject.GetUintBitfieldFunction
// 0x0001 (0x0001 - 0x0000)
struct EditConditionTestObject_GetUintBitfieldFunction final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PropertyEditor.EditConditionTestObject.GetUObjectPtrFunction
// 0x0008 (0x0008 - 0x0000)
struct EditConditionTestObject_GetUObjectPtrFunction final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PropertyEditor.EditConditionTestObject.GetWeakObjectPtrFunction
// 0x0008 (0x0008 - 0x0000)
struct EditConditionTestObject_GetWeakObjectPtrFunction final
{
public:
	TWeakObjectPtr<class UObject>                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

