#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PropertyEditor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "PropertyEditor_structs.hpp"
#include "EditorConfig_classes.hpp"


namespace SDK
{

// Class PropertyEditor.DetailRowMenuContext
// 0x0030 (0x0060 - 0x0030)
class UDetailRowMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DetailRowMenuContext">();
	}
	static class UDetailRowMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDetailRowMenuContext>();
	}
};

// Class PropertyEditor.DetailRowMenuContextPrivate
// 0x0010 (0x0040 - 0x0030)
class UDetailRowMenuContextPrivate final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DetailRowMenuContextPrivate">();
	}
	static class UDetailRowMenuContextPrivate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDetailRowMenuContextPrivate>();
	}
};

// Class PropertyEditor.DetailsConfig
// 0x0050 (0x0080 - 0x0030)
class UDetailsConfig final : public UEditorConfigBase
{
public:
	TMap<class FName, struct FDetailsViewConfig>  Views;                                             // 0x0030(0x0050)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DetailsConfig">();
	}
	static class UDetailsConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDetailsConfig>();
	}
};

// Class PropertyEditor.EditConditionTestObject
// 0x0060 (0x0090 - 0x0030)
class UEditConditionTestObject final : public UObject
{
public:
	bool                                          BoolProperty;                                      // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EditConditionTestEnum                         EnumProperty;                                      // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EditConditionByteEnum                         ByteEnumProperty;                                  // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DoubleProperty;                                    // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IntegerProperty;                                   // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         UintBitfieldProperty : 1;                          // 0x004C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                UObjectPtr;                                        // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   SoftClassPtr;                                      // 0x0058(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UObject>                 WeakObjectPtr;                                     // 0x0088(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static bool StaticGetBoolFunction();
	static EditConditionByteEnum StaticGetByteEnumFunction();
	static double StaticGetDoubleFunction();
	static EditConditionTestEnum StaticGetEnumFunction();
	static int32 StaticGetIntegerFunction();
	static TSoftClassPtr<class UClass> StaticGetSoftClassPtrFunction();
	static uint8 StaticGetUintBitfieldFunction();
	static class UObject* StaticGetUObjectPtrFunction();
	static TWeakObjectPtr<class UObject> StaticGetWeakObjectPtrFunction();

	void StaticVoidFunction();

	bool GetBoolFunction() const;
	EditConditionByteEnum GetByteEnumFunction() const;
	double GetDoubleFunction() const;
	EditConditionTestEnum GetEnumFunction() const;
	int32 GetIntegerFunction() const;
	TSoftClassPtr<class UClass> GetSoftClassPtrFunction() const;
	uint8 GetUintBitfieldFunction() const;
	class UObject* GetUObjectPtrFunction() const;
	TWeakObjectPtr<class UObject> GetWeakObjectPtrFunction() const;
	void VoidFunction() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditConditionTestObject">();
	}
	static class UEditConditionTestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditConditionTestObject>();
	}
};

// Class PropertyEditor.PropertyEditorSinglePropertyTestClass
// 0x0018 (0x0048 - 0x0030)
class UPropertyEditorSinglePropertyTestClass final : public UObject
{
public:
	struct FVector                                Vector;                                            // 0x0030(0x0018)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropertyEditorSinglePropertyTestClass">();
	}
	static class UPropertyEditorSinglePropertyTestClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyEditorSinglePropertyTestClass>();
	}
};

}

