#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PropertyAccessNode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BlueprintGraph_classes.hpp"


namespace SDK
{

// Class PropertyAccessNode.K2Node_PropertyAccess
// 0x0110 (0x01D0 - 0x00C0)
class UK2Node_PropertyAccess final : public UK2Node
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Path;                                              // 0x00C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class FText                                   TextPath;                                          // 0x00D8(0x0010)(NativeAccessSpecifierPrivate)
	struct FEdGraphPinType                        ResolvedPinType;                                   // 0x00E8(0x0070)(NoDestructor, NativeAccessSpecifierPrivate)
	class FName                                   GeneratedPropertyName;                             // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ContextId;                                         // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_170[0x60];                                     // 0x0170(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_PropertyAccess">();
	}
	static class UK2Node_PropertyAccess* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_PropertyAccess>();
	}
};

}

