#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProxyTableUncooked

#include "Basic.hpp"

#include "ProxyTableUncooked_structs.hpp"
#include "BlueprintGraph_classes.hpp"


namespace SDK
{

// Class ProxyTableUncooked.K2Node_EvaluateProxy
// 0x0020 (0x00E0 - 0x00C0)
class UK2Node_EvaluateProxy final : public UK2Node
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UProxyAsset*                            Proxy;                                             // 0x00C8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x10];                                      // 0x00D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_EvaluateProxy">();
	}
	static class UK2Node_EvaluateProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_EvaluateProxy>();
	}
};

// Class ProxyTableUncooked.K2Node_EvaluateProxy2
// 0x0028 (0x00E8 - 0x00C0)
class UK2Node_EvaluateProxy2 final : public UK2Node
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UProxyAsset*                            Proxy;                                             // 0x00C8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EEvaluateProxyMode                            Mode;                                              // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D4[0x14];                                      // 0x00D4(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_EvaluateProxy2">();
	}
	static class UK2Node_EvaluateProxy2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_EvaluateProxy2>();
	}
};

}

