#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProxyTable

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Chooser_structs.hpp"
#include "ProxyTable_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ProxyTable.ChooserParameterProxyTable
// 0x0000 (0x0030 - 0x0030)
class IChooserParameterProxyTable final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterProxyTable">();
	}
	static class IChooserParameterProxyTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChooserParameterProxyTable>();
	}
};

// Class ProxyTable.ProxyAsset
// 0x0090 (0x00C0 - 0x0030)
class UProxyAsset final : public UObject
{
public:
	uint8                                         Pad_30[0x48];                                      // 0x0030(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    Type;                                              // 0x0078(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EObjectChooserResultType                      ResultType;                                        // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInstancedStruct>               ContextData;                                       // 0x0088(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       ProxyTable;                                        // 0x0098(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    ContextClass;                                      // 0x00B8(0x0008)(ZeroConstructor, Deprecated, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProxyAsset">();
	}
	static class UProxyAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProxyAsset>();
	}
};

// Class ProxyTable.ProxyTable
// 0x0078 (0x00A8 - 0x0030)
class UProxyTable final : public UObject
{
public:
	TArray<struct FGuid>                          Keys;                                              // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRuntimeProxyValue>             RuntimeValues;                                     // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FProxyEntry>                    Entries;                                           // 0x0068(0x0010)(Edit, ZeroConstructor, EditorOnly, NativeAccessSpecifierPublic)
	TArray<class UProxyTable*>                    InheritEntriesFrom;                                // 0x0078(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x20];                                      // 0x0088(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProxyTable">();
	}
	static class UProxyTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProxyTable>();
	}
};

// Class ProxyTable.ProxyTableFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class UProxyTableFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UObject* EvaluateProxyAsset(const class UObject* ContextObject, const class UProxyAsset* Proxy, TSubclassOf<class UObject> ObjectClass);
	static class UObject* EvaluateProxyTable(const class UObject* ContextObject, const class UProxyTable* ProxyTable, class FName Key);
	static struct FInstancedStruct MakeLookupProxy(class UProxyAsset* Proxy);
	static struct FInstancedStruct MakeLookupProxyWithOverrideTable(class UProxyAsset* Proxy, class UProxyTable* ProxyTable);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProxyTableFunctionLibrary">();
	}
	static class UProxyTableFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProxyTableFunctionLibrary>();
	}
};

}

