#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PythonScriptPlugin

#include "Basic.hpp"


namespace SDK
{

// Enum PythonScriptPlugin.EPyTestEnum
// NumValues: 0x0003
enum class EPyTestEnum : uint8
{
	One                                      = 0,
	Two                                      = 1,
	EPyTestEnum_MAX                          = 2,
};

// Enum PythonScriptPlugin.EPythonLogOutputType
// NumValues: 0x0004
enum class EPythonLogOutputType : uint8
{
	Info                                     = 0,
	Warning                                  = 1,
	Error                                    = 2,
	EPythonLogOutputType_MAX                 = 3,
};

// Enum PythonScriptPlugin.EPythonCommandFlags
// NumValues: 0x0003
enum class EPythonCommandFlags : uint8
{
	None                                     = 0,
	Unattended                               = 1,
	EPythonCommandFlags_MAX                  = 2,
};

// Enum PythonScriptPlugin.EPythonCommandExecutionMode
// NumValues: 0x0004
enum class EPythonCommandExecutionMode : uint8
{
	ExecuteFile                              = 0,
	ExecuteStatement                         = 1,
	EvaluateStatement                        = 2,
	EPythonCommandExecutionMode_MAX          = 3,
};

// Enum PythonScriptPlugin.EPythonFileExecutionScope
// NumValues: 0x0003
enum class EPythonFileExecutionScope : uint8
{
	Private                                  = 0,
	Public                                   = 1,
	EPythonFileExecutionScope_MAX            = 2,
};

// Enum PythonScriptPlugin.ETypeHintingMode
// NumValues: 0x0004
enum class ETypeHintingMode : uint8
{
	Off                                      = 0,
	AutoCompletion                           = 1,
	TypeChecker                              = 2,
	ETypeHintingMode_MAX                     = 3,
};

// ScriptStruct PythonScriptPlugin.PyTestStruct
// 0x0158 (0x0158 - 0x0000)
struct FPyTestStruct
{
public:
	bool                                          Bool;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Int;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Float;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPyTestEnum                                   Enum;                                              // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 String;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0030(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TFieldPath<class FProperty>                   FieldPath;                                         // 0x0040(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<class FStructProperty>             StructFieldPath;                                   // 0x0070(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         StringArray;                                       // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TSet<class FString>                           StringSet;                                         // 0x00B0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    StringIntMap;                                      // 0x0100(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         LegacyInt;                                         // 0x0150(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BoolInstanceOnly;                                  // 0x0154(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BoolDefaultsOnly;                                  // 0x0155(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BoolMutable;                                       // 0x0156(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_157[0x1];                                      // 0x0157(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct PythonScriptPlugin.PythonLogOutputEntry
// 0x0018 (0x0018 - 0x0000)
struct FPythonLogOutputEntry final
{
public:
	EPythonLogOutputType                          Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Output;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct PythonScriptPlugin.PyTestChildStruct
// 0x0000 (0x0158 - 0x0158)
struct FPyTestChildStruct final : public FPyTestStruct
{
};

// ScriptStruct PythonScriptPlugin.PyTestClassSparseData
// 0x0004 (0x0004 - 0x0000)
struct FPyTestClassSparseData final
{
public:
	int32                                         IntFromSparseData;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

