#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PythonScriptPlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "BlueprintGraph_classes.hpp"
#include "PythonScriptPlugin_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class PythonScriptPlugin.PyTestInterface
// 0x0000 (0x0030 - 0x0030)
class IPyTestInterface : public IInterface
{
public:
	int32 FuncInterface(const int32 InValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PyTestInterface">();
	}
	static class IPyTestInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPyTestInterface>();
	}
};

// Class PythonScriptPlugin.PyTestChildInterface
// 0x0000 (0x0030 - 0x0030)
class IPyTestChildInterface final : public IPyTestInterface
{
public:
	int32 FuncInterfaceChild(const int32 InValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PyTestChildInterface">();
	}
	static class IPyTestChildInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPyTestChildInterface>();
	}
};

// Class PythonScriptPlugin.PyTestOtherInterface
// 0x0000 (0x0030 - 0x0030)
class IPyTestOtherInterface final : public IInterface
{
public:
	int32 FuncInterfaceOther(const int32 InValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PyTestOtherInterface">();
	}
	static class IPyTestOtherInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPyTestOtherInterface>();
	}
};

// Class PythonScriptPlugin.K2Node_ExecutePythonScript
// 0x0020 (0x0168 - 0x0148)
class UK2Node_ExecutePythonScript final : public UK2Node_CallFunction
{
public:
	TArray<class FName>                           Inputs;                                            // 0x0148(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class FName>                           Outputs;                                           // 0x0158(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_ExecutePythonScript">();
	}
	static class UK2Node_ExecutePythonScript* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_ExecutePythonScript>();
	}
};

// Class PythonScriptPlugin.PyTestStructLibrary
// 0x0000 (0x0030 - 0x0030)
class UPyTestStructLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FPyTestStruct AddFloat(const struct FPyTestStruct& InStruct, const float InValue);
	static struct FPyTestStruct AddInt(const struct FPyTestStruct& InStruct, const int32 InValue);
	static struct FPyTestStruct AddStr(const struct FPyTestStruct& InStruct, const class FString& InValue);
	static void ClearBoolMutable(const struct FPyTestStruct& InStruct);
	static void ClearBoolMutableViaRef(struct FPyTestStruct& InStruct);
	static int32 GetConstantValue();
	static bool IsBoolSet(const struct FPyTestStruct& InStruct);
	static bool LegacyIsBoolSet(const struct FPyTestStruct& InStruct);
	static void SetBoolMutable(const struct FPyTestStruct& InStruct);
	static void SetBoolMutableViaRef(struct FPyTestStruct& InStruct);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PyTestStructLibrary">();
	}
	static class UPyTestStructLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPyTestStructLibrary>();
	}
};

// Class PythonScriptPlugin.PyTestObject
// 0x0450 (0x0480 - 0x0030)
class UPyTestObject : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          Bool;                                              // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Int;                                               // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Float;                                             // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPyTestEnum                                   Enum;                                              // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 String;                                            // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0060(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0070(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TFieldPath<class FProperty>                   FieldPath;                                         // 0x0080(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<class FStructProperty>             StructFieldPath;                                   // 0x00B0(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         StringArray;                                       // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TSet<class FString>                           StringSet;                                         // 0x00F0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    StringIntMap;                                      // 0x0140(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TDelegate<void(int32 InValue)>                Delegate;                                          // 0x0190(0x0014)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& InStr)> MulticastDelegate;                                 // 0x01A8(0x0010)(Edit, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FPyTestStruct                          Struct;                                            // 0x01B8(0x0158)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FPyTestStruct>                  StructArray;                                       // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FPyTestChildStruct                     ChildStruct;                                       // 0x0320(0x0158)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          BoolInstanceOnly;                                  // 0x0478(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BoolDefaultsOnly;                                  // 0x0479(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_47A[0x6];                                      // 0x047A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void EmitScriptError();
	static void EmitScriptWarning();
	static int32 GetConstantValue();
	static TArray<int32> ReturnArray();
	static TFieldPath<class FProperty> ReturnFieldPath();
	static TMap<int32, bool> ReturnMap();
	static TSet<int32> ReturnSet();

	void FuncTakingFieldPath(const TFieldPath<class FProperty>& InFieldPath);
	void FuncTakingPyTestStructDefault(const struct FPyTestStruct& InStruct);

	int32 CallFuncBlueprintImplementable(const int32 InValue) const;
	bool CallFuncBlueprintImplementablePackedGetter(int32* OutValue) const;
	int32 CallFuncBlueprintNative(const int32 InValue) const;
	void CallFuncBlueprintNativeRef(struct FPyTestStruct& InOutStruct) const;
	int32 DelegatePropertyCallback(const int32 InValue) const;
	int32 FuncBlueprintImplementable(const int32 InValue) const;
	bool FuncBlueprintImplementablePackedGetter(int32* OutValue) const;
	int32 FuncBlueprintNative(const int32 InValue) const;
	void FuncBlueprintNativeRef(struct FPyTestStruct& InOutStruct) const;
	void FuncTakingPyTestChildStruct(const struct FPyTestChildStruct& InStruct) const;
	int32 FuncTakingPyTestDelegate(const TDelegate<void(int32 InValue)>& InDelegate, const int32 InValue) const;
	void FuncTakingPyTestStruct(const struct FPyTestStruct& InStruct) const;
	void LegacyFuncTakingPyTestStruct(const struct FPyTestStruct& InStruct) const;
	void MulticastDelegatePropertyCallback(const class FString& InStr) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PyTestObject">();
	}
	static class UPyTestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPyTestObject>();
	}
};

// Class PythonScriptPlugin.PyTestChildObject
// 0x0000 (0x0480 - 0x0480)
class UPyTestChildObject final : public UPyTestObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PyTestChildObject">();
	}
	static class UPyTestChildObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPyTestChildObject>();
	}
};

// Class PythonScriptPlugin.LegacyPyTestObject
// 0x0000 (0x0480 - 0x0480)
class ULegacyPyTestObject final : public UPyTestObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LegacyPyTestObject">();
	}
	static class ULegacyPyTestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyPyTestObject>();
	}
};

// Class PythonScriptPlugin.PyTestObjectLibrary
// 0x0000 (0x0030 - 0x0030)
class UPyTestObjectLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetOtherConstantValue();
	static bool IsBoolSet(const class UPyTestObject* InObj);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PyTestObjectLibrary">();
	}
	static class UPyTestObjectLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPyTestObjectLibrary>();
	}
};

// Class PythonScriptPlugin.PyTestStructDelegate
// 0x0010 (0x0040 - 0x0030)
class UPyTestStructDelegate final : public UObject
{
public:
	TMulticastInlineDelegate<void(struct FPyTestStruct& PyStruct)> OnNameCollisionTestDelegate;                       // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PyTestStructDelegate">();
	}
	static class UPyTestStructDelegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPyTestStructDelegate>();
	}
};

// Class PythonScriptPlugin.PyTestVectorDelegate
// 0x0010 (0x0040 - 0x0030)
class UPyTestVectorDelegate final : public UObject
{
public:
	TMulticastInlineDelegate<void(struct FVector2D& Vec)> OnNameCollisionTestDelegate;                       // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PyTestVectorDelegate">();
	}
	static class UPyTestVectorDelegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPyTestVectorDelegate>();
	}
};

// Class PythonScriptPlugin.PyTestTypeHint
// 0x02F0 (0x0320 - 0x0030)
class UPyTestTypeHint final : public UObject
{
public:
	bool                                          BoolProp;                                          // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IntProp;                                           // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatProp;                                         // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPyTestEnum                                   EnumProp;                                          // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StringProp;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NameProp;                                          // 0x0050(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TextProp;                                          // 0x0060(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TFieldPath<class FProperty>                   FieldPathProp;                                     // 0x0070(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPyTestStruct                          StructProp;                                        // 0x00A0(0x0158)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UPyTestObject*                          ObjectProp;                                        // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         StrArrayProp;                                      // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           NameArrayProp;                                     // 0x0210(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FText>                           TextArrayProp;                                     // 0x0220(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        ObjectArrayProp;                                   // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TSet<class FString>                           SetProp;                                           // 0x0240(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<int32, class FString>                    MapProp;                                           // 0x0290(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TDelegate<void(int32 InValue)>                DelegateProp;                                      // 0x02E0(0x0014)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& InStr)> MulticastDelegateProp;                             // 0x02F8(0x0010)(Edit, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TDelegate<void(float InDeltaTime)>            SlateTickDelegate;                                 // 0x0308(0x0014)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool CheckStaticFunction(bool Param1, int32 Param2, double Param3, const class FString& Param4);
	static int32 CheckTupleReturnType(class FString& InOutString);
	static int32 GetIntConst();
	static class FString GetStringConst();

	TArray<class FText> CheckArrayTypeHints(const TArray<class FString>& Param1, const TArray<class FName>& Param2, const TArray<class FText>& Param3, const TArray<class UObject*>& Param4);
	bool CheckBoolTypeHints(bool bParam1, bool bParam2, bool bParam3);
	TDelegate<void(int32 InValue)> CheckDelegateTypeHints(const TDelegate<void(int32 InValue)>& Param1);
	EPyTestEnum CheckEnumTypeHints(EPyTestEnum Param1, EPyTestEnum Param2);
	TFieldPath<class FProperty> CheckFieldPathTypeHints(const TFieldPath<class FProperty> Param1);
	double CheckFloatTypeHints(float Param1, double Param2, float Param3, double Param4);
	int32 CheckIntegerTypeHints(uint8 Param1, int32 Param2, int64 Param3);
	TMap<class FString, class UObject*> CheckMapTypeHints(const TMap<int32, class FString>& Param1, const TMap<int32, class FName>& Param2, const TMap<int32, class FText>& Param3, const TMap<int32, class UObject*>& Param4);
	class FName CheckNameTypeHints(const class FName& Param1, const class FName& Param2);
	class UPyTestObject* CheckObjectTypeHints(const class UPyTestObject* Param1, const class UPyTestObject* Param4);
	TSet<class FName> CheckSetTypeHints(const TSet<class FString>& Param1, const TSet<class FName>& Param2, const TSet<class UObject*>& Param3);
	class FString CheckStringTypeHints(const class FString& Param1, const class FString& Param2);
	struct FPyTestStruct CheckStructTypeHints(const struct FPyTestStruct& Param1, const struct FPyTestStruct& Param2);
	class FText CheckTextTypeHints(const class FText& Param1, const class FText& Param2);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PyTestTypeHint">();
	}
	static class UPyTestTypeHint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPyTestTypeHint>();
	}
};

// Class PythonScriptPlugin.PythonOnlineDocsCommandlet
// 0x0000 (0x0088 - 0x0088)
class UPythonOnlineDocsCommandlet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PythonOnlineDocsCommandlet">();
	}
	static class UPythonOnlineDocsCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPythonOnlineDocsCommandlet>();
	}
};

// Class PythonScriptPlugin.PythonScriptCommandlet
// 0x0000 (0x0088 - 0x0088)
class UPythonScriptCommandlet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PythonScriptCommandlet">();
	}
	static class UPythonScriptCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPythonScriptCommandlet>();
	}
};

// Class PythonScriptPlugin.PythonScriptLibrary
// 0x0000 (0x0030 - 0x0030)
class UPythonScriptLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool ExecutePythonCommand(const class FString& PythonCommand);
	static bool ExecutePythonCommandEx(const class FString& PythonCommand, class FString* CommandResult, TArray<struct FPythonLogOutputEntry>* LogOutput, const EPythonCommandExecutionMode ExecutionMode, const EPythonFileExecutionScope FileExecutionScope);
	static bool ExecutePythonScript(const class FString& PythonScript, const TArray<class FString>& PythonInputs, const TArray<class FString>& PythonOutputs);
	static bool IsPythonAvailable();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PythonScriptLibrary">();
	}
	static class UPythonScriptLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPythonScriptLibrary>();
	}
};

// Class PythonScriptPlugin.PythonScriptPluginSettings
// 0x0070 (0x00D0 - 0x0060)
class UPythonScriptPluginSettings final : public UDeveloperSettings
{
public:
	TArray<class FString>                         StartupScripts;                                    // 0x0060(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FDirectoryPath>                 AdditionalPaths;                                   // 0x0070(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bIsolateInterpreterEnvironment;                    // 0x0080(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeveloperMode;                                    // 0x0081(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRunPipInstallOnStartup;                           // 0x0082(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPipStrictHashCheck;                               // 0x0083(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOfflineOnly;                                      // 0x0084(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OverrideIndexURL;                                  // 0x0088(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoteExecution;                                  // 0x0098(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RemoteExecutionMulticastGroupEndpoint;             // 0x00A0(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RemoteExecutionMulticastBindAddress;               // 0x00B0(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RemoteExecutionSendBufferSizeBytes;                // 0x00C0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RemoteExecutionReceiveBufferSizeBytes;             // 0x00C4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         RemoteExecutionMulticastTtl;                       // 0x00C8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PythonScriptPluginSettings">();
	}
	static class UPythonScriptPluginSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPythonScriptPluginSettings>();
	}
};

// Class PythonScriptPlugin.PythonScriptPluginUserSettings
// 0x0008 (0x0068 - 0x0060)
class UPythonScriptPluginUserSettings final : public UDeveloperSettings
{
public:
	bool                                          bDeveloperMode;                                    // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETypeHintingMode                              TypeHintingMode;                                   // 0x0061(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableContentBrowserIntegration;                  // 0x0062(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PythonScriptPluginUserSettings">();
	}
	static class UPythonScriptPluginUserSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPythonScriptPluginUserSettings>();
	}
};

// Class PythonScriptPlugin.PythonResourceOwner
// 0x0000 (0x0030 - 0x0030)
class IPythonResourceOwner final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PythonResourceOwner">();
	}
	static class IPythonResourceOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPythonResourceOwner>();
	}
};

// Class PythonScriptPlugin.PythonObjectHandle
// 0x0008 (0x0038 - 0x0030)
class UPythonObjectHandle final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PythonObjectHandle">();
	}
	static class UPythonObjectHandle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPythonObjectHandle>();
	}
};

// Class PythonScriptPlugin.PythonCallableForDelegate
// 0x0008 (0x0038 - 0x0030)
class UPythonCallableForDelegate final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PythonCallableForDelegate">();
	}
	static class UPythonCallableForDelegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPythonCallableForDelegate>();
	}
};

// Class PythonScriptPlugin.PythonGeneratedEnum
// 0x0008 (0x0078 - 0x0070)
class UPythonGeneratedEnum final : public UEnum
{
public:
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PythonGeneratedEnum">();
	}
	static class UPythonGeneratedEnum* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPythonGeneratedEnum>();
	}
};

// Class PythonScriptPlugin.PythonGeneratedClass
// 0x0008 (0x0270 - 0x0268)
class UPythonGeneratedClass final : public UClass
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PythonGeneratedClass">();
	}
	static class UPythonGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPythonGeneratedClass>();
	}
};

// Class PythonScriptPlugin.PythonGeneratedStruct
// 0x0008 (0x00E8 - 0x00E0)
class UPythonGeneratedStruct final : public UScriptStruct
{
public:
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PythonGeneratedStruct">();
	}
	static class UPythonGeneratedStruct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPythonGeneratedStruct>();
	}
};

}

