#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PythonScriptPlugin

#include "Basic.hpp"

#include "PythonScriptPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PythonScriptPlugin.PyTestInterface.FuncInterface
// 0x0008 (0x0008 - 0x0000)
struct PyTestInterface_FuncInterface final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestChildInterface.FuncInterfaceChild
// 0x0008 (0x0008 - 0x0000)
struct PyTestChildInterface_FuncInterfaceChild final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestOtherInterface.FuncInterfaceOther
// 0x0008 (0x0008 - 0x0000)
struct PyTestOtherInterface_FuncInterfaceOther final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestStructLibrary.AddFloat
// 0x02B8 (0x02B8 - 0x0000)
struct PyTestStructLibrary_AddFloat final
{
public:
	struct FPyTestStruct                          InStruct;                                          // 0x0000(0x0158)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         InValue;                                           // 0x0158(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPyTestStruct                          ReturnValue;                                       // 0x0160(0x0158)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestStructLibrary.AddInt
// 0x02B8 (0x02B8 - 0x0000)
struct PyTestStructLibrary_AddInt final
{
public:
	struct FPyTestStruct                          InStruct;                                          // 0x0000(0x0158)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         InValue;                                           // 0x0158(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPyTestStruct                          ReturnValue;                                       // 0x0160(0x0158)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestStructLibrary.AddStr
// 0x02C0 (0x02C0 - 0x0000)
struct PyTestStructLibrary_AddStr final
{
public:
	struct FPyTestStruct                          InStruct;                                          // 0x0000(0x0158)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 InValue;                                           // 0x0158(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPyTestStruct                          ReturnValue;                                       // 0x0168(0x0158)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestStructLibrary.ClearBoolMutable
// 0x0158 (0x0158 - 0x0000)
struct PyTestStructLibrary_ClearBoolMutable final
{
public:
	struct FPyTestStruct                          InStruct;                                          // 0x0000(0x0158)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestStructLibrary.ClearBoolMutableViaRef
// 0x0158 (0x0158 - 0x0000)
struct PyTestStructLibrary_ClearBoolMutableViaRef final
{
public:
	struct FPyTestStruct                          InStruct;                                          // 0x0000(0x0158)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestStructLibrary.GetConstantValue
// 0x0004 (0x0004 - 0x0000)
struct PyTestStructLibrary_GetConstantValue final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestStructLibrary.IsBoolSet
// 0x0160 (0x0160 - 0x0000)
struct PyTestStructLibrary_IsBoolSet final
{
public:
	struct FPyTestStruct                          InStruct;                                          // 0x0000(0x0158)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0158(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PythonScriptPlugin.PyTestStructLibrary.LegacyIsBoolSet
// 0x0160 (0x0160 - 0x0000)
struct PyTestStructLibrary_LegacyIsBoolSet final
{
public:
	struct FPyTestStruct                          InStruct;                                          // 0x0000(0x0158)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0158(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PythonScriptPlugin.PyTestStructLibrary.SetBoolMutable
// 0x0158 (0x0158 - 0x0000)
struct PyTestStructLibrary_SetBoolMutable final
{
public:
	struct FPyTestStruct                          InStruct;                                          // 0x0000(0x0158)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestStructLibrary.SetBoolMutableViaRef
// 0x0158 (0x0158 - 0x0000)
struct PyTestStructLibrary_SetBoolMutableViaRef final
{
public:
	struct FPyTestStruct                          InStruct;                                          // 0x0000(0x0158)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.GetConstantValue
// 0x0004 (0x0004 - 0x0000)
struct PyTestObject_GetConstantValue final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.ReturnArray
// 0x0010 (0x0010 - 0x0000)
struct PyTestObject_ReturnArray final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.ReturnFieldPath
// 0x0030 (0x0030 - 0x0000)
struct PyTestObject_ReturnFieldPath final
{
public:
	TFieldPath<class FProperty>                   ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.ReturnMap
// 0x0050 (0x0050 - 0x0000)
struct PyTestObject_ReturnMap final
{
public:
	TMap<int32, bool>                             ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.ReturnSet
// 0x0050 (0x0050 - 0x0000)
struct PyTestObject_ReturnSet final
{
public:
	TSet<int32>                                   ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.FuncTakingFieldPath
// 0x0030 (0x0030 - 0x0000)
struct PyTestObject_FuncTakingFieldPath final
{
public:
	TFieldPath<class FProperty>                   InFieldPath;                                       // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.FuncTakingPyTestStructDefault
// 0x0158 (0x0158 - 0x0000)
struct PyTestObject_FuncTakingPyTestStructDefault final
{
public:
	struct FPyTestStruct                          InStruct;                                          // 0x0000(0x0158)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.CallFuncBlueprintImplementable
// 0x0008 (0x0008 - 0x0000)
struct PyTestObject_CallFuncBlueprintImplementable final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.CallFuncBlueprintImplementablePackedGetter
// 0x0008 (0x0008 - 0x0000)
struct PyTestObject_CallFuncBlueprintImplementablePackedGetter final
{
public:
	int32                                         OutValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PythonScriptPlugin.PyTestObject.CallFuncBlueprintNative
// 0x0008 (0x0008 - 0x0000)
struct PyTestObject_CallFuncBlueprintNative final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.CallFuncBlueprintNativeRef
// 0x0158 (0x0158 - 0x0000)
struct PyTestObject_CallFuncBlueprintNativeRef final
{
public:
	struct FPyTestStruct                          InOutStruct;                                       // 0x0000(0x0158)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.DelegatePropertyCallback
// 0x0008 (0x0008 - 0x0000)
struct PyTestObject_DelegatePropertyCallback final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.FuncBlueprintImplementable
// 0x0008 (0x0008 - 0x0000)
struct PyTestObject_FuncBlueprintImplementable final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.FuncBlueprintImplementablePackedGetter
// 0x0008 (0x0008 - 0x0000)
struct PyTestObject_FuncBlueprintImplementablePackedGetter final
{
public:
	int32                                         OutValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PythonScriptPlugin.PyTestObject.FuncBlueprintNative
// 0x0008 (0x0008 - 0x0000)
struct PyTestObject_FuncBlueprintNative final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.FuncBlueprintNativeRef
// 0x0158 (0x0158 - 0x0000)
struct PyTestObject_FuncBlueprintNativeRef final
{
public:
	struct FPyTestStruct                          InOutStruct;                                       // 0x0000(0x0158)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.FuncTakingPyTestChildStruct
// 0x0158 (0x0158 - 0x0000)
struct PyTestObject_FuncTakingPyTestChildStruct final
{
public:
	struct FPyTestChildStruct                     InStruct;                                          // 0x0000(0x0158)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.FuncTakingPyTestDelegate
// 0x001C (0x001C - 0x0000)
struct PyTestObject_FuncTakingPyTestDelegate final
{
public:
	TDelegate<void(int32 InValue)>                InDelegate;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InValue;                                           // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.FuncTakingPyTestStruct
// 0x0158 (0x0158 - 0x0000)
struct PyTestObject_FuncTakingPyTestStruct final
{
public:
	struct FPyTestStruct                          InStruct;                                          // 0x0000(0x0158)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.LegacyFuncTakingPyTestStruct
// 0x0158 (0x0158 - 0x0000)
struct PyTestObject_LegacyFuncTakingPyTestStruct final
{
public:
	struct FPyTestStruct                          InStruct;                                          // 0x0000(0x0158)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObject.MulticastDelegatePropertyCallback
// 0x0010 (0x0010 - 0x0000)
struct PyTestObject_MulticastDelegatePropertyCallback final
{
public:
	class FString                                 InStr;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObjectLibrary.GetOtherConstantValue
// 0x0004 (0x0004 - 0x0000)
struct PyTestObjectLibrary_GetOtherConstantValue final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestObjectLibrary.IsBoolSet
// 0x0010 (0x0010 - 0x0000)
struct PyTestObjectLibrary_IsBoolSet final
{
public:
	const class UPyTestObject*                    InObj;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PythonScriptPlugin.PyTestTypeHint.CheckStaticFunction
// 0x0028 (0x0028 - 0x0000)
struct PyTestTypeHint_CheckStaticFunction final
{
public:
	bool                                          Param1;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param2;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Param3;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param4;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PythonScriptPlugin.PyTestTypeHint.CheckTupleReturnType
// 0x0018 (0x0018 - 0x0000)
struct PyTestTypeHint_CheckTupleReturnType final
{
public:
	class FString                                 InOutString;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PythonScriptPlugin.PyTestTypeHint.GetIntConst
// 0x0004 (0x0004 - 0x0000)
struct PyTestTypeHint_GetIntConst final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestTypeHint.GetStringConst
// 0x0010 (0x0010 - 0x0000)
struct PyTestTypeHint_GetStringConst final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestTypeHint.CheckArrayTypeHints
// 0x0050 (0x0050 - 0x0000)
struct PyTestTypeHint_CheckArrayTypeHints final
{
public:
	TArray<class FString>                         Param1;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FName>                           Param2;                                            // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FText>                           Param3;                                            // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        Param4;                                            // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FText>                           ReturnValue;                                       // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestTypeHint.CheckBoolTypeHints
// 0x0004 (0x0004 - 0x0000)
struct PyTestTypeHint_CheckBoolTypeHints final
{
public:
	bool                                          bParam1;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bParam2;                                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bParam3;                                           // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestTypeHint.CheckDelegateTypeHints
// 0x0028 (0x0028 - 0x0000)
struct PyTestTypeHint_CheckDelegateTypeHints final
{
public:
	TDelegate<void(int32 InValue)>                Param1;                                            // 0x0000(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 InValue)>                ReturnValue;                                       // 0x0014(0x0014)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestTypeHint.CheckEnumTypeHints
// 0x0003 (0x0003 - 0x0000)
struct PyTestTypeHint_CheckEnumTypeHints final
{
public:
	EPyTestEnum                                   Param1;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPyTestEnum                                   Param2;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPyTestEnum                                   ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestTypeHint.CheckFieldPathTypeHints
// 0x0060 (0x0060 - 0x0000)
struct PyTestTypeHint_CheckFieldPathTypeHints final
{
public:
	TFieldPath<class FProperty>                   Param1;                                            // 0x0000(0x0030)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<class FProperty>                   ReturnValue;                                       // 0x0030(0x0030)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestTypeHint.CheckFloatTypeHints
// 0x0028 (0x0028 - 0x0000)
struct PyTestTypeHint_CheckFloatTypeHints final
{
public:
	float                                         Param1;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Param2;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Param3;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Param4;                                            // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestTypeHint.CheckIntegerTypeHints
// 0x0018 (0x0018 - 0x0000)
struct PyTestTypeHint_CheckIntegerTypeHints final
{
public:
	uint8                                         Param1;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param2;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Param3;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PythonScriptPlugin.PyTestTypeHint.CheckMapTypeHints
// 0x0190 (0x0190 - 0x0000)
struct PyTestTypeHint_CheckMapTypeHints final
{
public:
	TMap<int32, class FString>                    Param1;                                            // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, class FName>                      Param2;                                            // 0x0050(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, class FText>                      Param3;                                            // 0x00A0(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, class UObject*>                   Param4;                                            // 0x00F0(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, class UObject*>           ReturnValue;                                       // 0x0140(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestTypeHint.CheckNameTypeHints
// 0x0024 (0x0024 - 0x0000)
struct PyTestTypeHint_CheckNameTypeHints final
{
public:
	class FName                                   Param1;                                            // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Param2;                                            // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestTypeHint.CheckObjectTypeHints
// 0x0018 (0x0018 - 0x0000)
struct PyTestTypeHint_CheckObjectTypeHints final
{
public:
	const class UPyTestObject*                    Param1;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UPyTestObject*                    Param4;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPyTestObject*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestTypeHint.CheckSetTypeHints
// 0x0140 (0x0140 - 0x0000)
struct PyTestTypeHint_CheckSetTypeHints final
{
public:
	TSet<class FString>                           Param1;                                            // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSet<class FName>                             Param2;                                            // 0x0050(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSet<class UObject*>                          Param3;                                            // 0x00A0(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x00F0(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestTypeHint.CheckStringTypeHints
// 0x0030 (0x0030 - 0x0000)
struct PyTestTypeHint_CheckStringTypeHints final
{
public:
	class FString                                 Param1;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param2;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestTypeHint.CheckStructTypeHints
// 0x0408 (0x0408 - 0x0000)
struct PyTestTypeHint_CheckStructTypeHints final
{
public:
	struct FPyTestStruct                          Param1;                                            // 0x0000(0x0158)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPyTestStruct                          Param2;                                            // 0x0158(0x0158)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPyTestStruct                          ReturnValue;                                       // 0x02B0(0x0158)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PyTestTypeHint.CheckTextTypeHints
// 0x0030 (0x0030 - 0x0000)
struct PyTestTypeHint_CheckTextTypeHints final
{
public:
	class FText                                   Param1;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   Param2;                                            // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PythonScriptPlugin.PythonScriptLibrary.ExecutePythonCommand
// 0x0018 (0x0018 - 0x0000)
struct PythonScriptLibrary_ExecutePythonCommand final
{
public:
	class FString                                 PythonCommand;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PythonScriptPlugin.PythonScriptLibrary.ExecutePythonCommandEx
// 0x0038 (0x0038 - 0x0000)
struct PythonScriptLibrary_ExecutePythonCommandEx final
{
public:
	class FString                                 PythonCommand;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CommandResult;                                     // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPythonLogOutputEntry>          LogOutput;                                         // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	EPythonCommandExecutionMode                   ExecutionMode;                                     // 0x0030(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPythonFileExecutionScope                     FileExecutionScope;                                // 0x0031(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0032(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PythonScriptPlugin.PythonScriptLibrary.ExecutePythonScript
// 0x0038 (0x0038 - 0x0000)
struct PythonScriptLibrary_ExecutePythonScript final
{
public:
	class FString                                 PythonScript;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         PythonInputs;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         PythonOutputs;                                     // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PythonScriptPlugin.PythonScriptLibrary.IsPythonAvailable
// 0x0001 (0x0001 - 0x0000)
struct PythonScriptLibrary_IsPythonAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

