#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: race_checkpoint_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass race_checkpoint_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class race_checkpoint_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass race_checkpoint_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class race_checkpoint_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<race_checkpoint_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass race_checkpoint_device.race_checkpoint_device
// 0x0030 (0x00F0 - 0x00C0)
class Urace_checkpoint_device final : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0x457F7F32_CheckpointBecomesCurrentForTheFirstTimeEvent; // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xD2D57907_CheckpointBecomesCurrentEvent;  // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xFE3C8649_CheckpointCompletedEvent;       // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x5BDC7A5C_EnableFunction;                 // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC9184E23_DisableFunction;                // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x2D2E17AF_SetAsCurrentCheckpointFunction; // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2frace__checkpoint__device_N_RDisable(const struct race_checkpoint_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2frace__checkpoint__device_N_REnable(const struct race_checkpoint_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2frace__checkpoint__device_N_RSetAsCurrentCheckpoint_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"race_checkpoint_device">();
	}
	static class Urace_checkpoint_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Urace_checkpoint_device>();
	}
};

}

