#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RazerChromaDevices

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RazerChromaDevices.RazerChromaFunctionLibrary.Conv_RazerChromaDeviceTypesToString
// 0x0018 (0x0018 - 0x0000)
struct RazerChromaFunctionLibrary_Conv_RazerChromaDeviceTypesToString final
{
public:
	int32                                         DeviceTypes;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RazerChromaDevices.RazerChromaFunctionLibrary.GetTotalDuration
// 0x0010 (0x0010 - 0x0000)
struct RazerChromaFunctionLibrary_GetTotalDuration final
{
public:
	const class URazerChromaAnimationAsset*       Anim;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RazerChromaDevices.RazerChromaFunctionLibrary.IsAnimationPlaying
// 0x0010 (0x0010 - 0x0000)
struct RazerChromaFunctionLibrary_IsAnimationPlaying final
{
public:
	const class URazerChromaAnimationAsset*       Anim;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RazerChromaDevices.RazerChromaFunctionLibrary.IsChromaAnimationPaused
// 0x0010 (0x0010 - 0x0000)
struct RazerChromaFunctionLibrary_IsChromaAnimationPaused final
{
public:
	const class URazerChromaAnimationAsset*       Anim;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RazerChromaDevices.RazerChromaFunctionLibrary.IsChromaRuntimeAvailable
// 0x0001 (0x0001 - 0x0000)
struct RazerChromaFunctionLibrary_IsChromaRuntimeAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RazerChromaDevices.RazerChromaFunctionLibrary.PauseChromaAnimation
// 0x0008 (0x0008 - 0x0000)
struct RazerChromaFunctionLibrary_PauseChromaAnimation final
{
public:
	const class URazerChromaAnimationAsset*       AnimToPause;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RazerChromaDevices.RazerChromaFunctionLibrary.PlayChromaAnimation
// 0x0010 (0x0010 - 0x0000)
struct RazerChromaFunctionLibrary_PlayChromaAnimation final
{
public:
	const class URazerChromaAnimationAsset*       AnimToPlay;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLooping;                                          // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RazerChromaDevices.RazerChromaFunctionLibrary.ResumeChromaAnimation
// 0x0010 (0x0010 - 0x0000)
struct RazerChromaFunctionLibrary_ResumeChromaAnimation final
{
public:
	const class URazerChromaAnimationAsset*       AnimToResume;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RazerChromaDevices.RazerChromaFunctionLibrary.SetAllDevicesStaticColor
// 0x0008 (0x0008 - 0x0000)
struct RazerChromaFunctionLibrary_SetAllDevicesStaticColor final
{
public:
	struct FColor                                 ColorToSet;                                        // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeviceTypes;                                       // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RazerChromaDevices.RazerChromaFunctionLibrary.SetEventName
// 0x0018 (0x0018 - 0x0000)
struct RazerChromaFunctionLibrary_SetEventName final
{
public:
	class FString                                 name;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function RazerChromaDevices.RazerChromaFunctionLibrary.SetIdleAnimation
// 0x0008 (0x0008 - 0x0000)
struct RazerChromaFunctionLibrary_SetIdleAnimation final
{
public:
	const class URazerChromaAnimationAsset*       NewIdleAnimation;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RazerChromaDevices.RazerChromaFunctionLibrary.SetUseIdleAnimation
// 0x0001 (0x0001 - 0x0000)
struct RazerChromaFunctionLibrary_SetUseIdleAnimation final
{
public:
	bool                                          bUseIdleAnimation;                                 // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RazerChromaDevices.RazerChromaFunctionLibrary.StopChromaAnimation
// 0x0008 (0x0008 - 0x0000)
struct RazerChromaFunctionLibrary_StopChromaAnimation final
{
public:
	const class URazerChromaAnimationAsset*       AnimToStop;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RazerChromaDevices.RazerChromaFunctionLibrary.UseForwardChromaEvents
// 0x0001 (0x0001 - 0x0000)
struct RazerChromaFunctionLibrary_UseForwardChromaEvents final
{
public:
	bool                                          bToggle;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

