#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: real_time_clock_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass real_time_clock_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class real_time_clock_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass real_time_clock_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class real_time_clock_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<real_time_clock_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass real_time_clock_device.real_time_clock_device
// 0x0030 (0x00F0 - 0x00C0)
class Ureal_time_clock_device final : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0x160BDC0E_DurationElapsedEvent;           // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x8038B37E_TimeReachedEvent;               // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xF703EB38_EnablingAfterTimeReachedEvent;  // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xCA596B69_EnablingBeforeTimeReachedEvent; // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x5BDC7A5C_EnableFunction;                 // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC9184E23_DisableFunction;                // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2freal__time__clock__device_N_RDisable(const struct real_time_clock_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2freal__time__clock__device_N_REnable(const struct real_time_clock_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"real_time_clock_device">();
	}
	static class Ureal_time_clock_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ureal_time_clock_device>();
	}
};

}

