#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RemoteSessionEditor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class RemoteSessionEditor.RemoteSessionStreamSettings
// 0x0008 (0x0038 - 0x0030)
class URemoteSessionStreamSettings final : public UObject
{
public:
	bool                                          bIsVerticalSplitterOrientation;                    // 0x0030(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowCheckered;                                    // 0x0031(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bScaleToFit;                                       // 0x0032(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemoteSessionStreamSettings">();
	}
	static class URemoteSessionStreamSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoteSessionStreamSettings>();
	}
};

// Class RemoteSessionEditor.RemoteSessionStreamWidgetUserData
// 0x0028 (0x0058 - 0x0030)
class URemoteSessionStreamWidgetUserData final : public UAssetUserData
{
public:
	TSubclassOf<class UUserWidget>                WidgetClass;                                       // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Size;                                              // 0x0038(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         Port;                                              // 0x0050(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemoteSessionStreamWidgetUserData">();
	}
	static class URemoteSessionStreamWidgetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoteSessionStreamWidgetUserData>();
	}
};

}

