#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ResolveTurretRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class ResolveTurretRuntime.FortPlayerAnimInstance_AntiVehMountedTurret
// 0x0040 (0x14E0 - 0x14A0)
class UFortPlayerAnimInstance_AntiVehMountedTurret final : public UFortPlayerAnimInstanceProxy
{
public:
	struct FVector                                HandAttachL;                                       // 0x1498(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HandAttachR;                                       // 0x14B0(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   HandAttachBoneNameL;                               // 0x14C8(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   HandAttachBoneNameR;                               // 0x14D4(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAnimInstance_AntiVehMountedTurret">();
	}
	static class UFortPlayerAnimInstance_AntiVehMountedTurret* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAnimInstance_AntiVehMountedTurret>();
	}
};

// Class ResolveTurretRuntime.FortVehicleAnimInstance_AntiVehMountedTurret
// 0x0010 (0x06E0 - 0x06D0)
class UFortVehicleAnimInstance_AntiVehMountedTurret final : public UFortMountedTurretAnimInstance
{
public:
	float                                         YawDeltaSmoothed;                                  // 0x06D0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D4[0xC];                                      // 0x06D4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAnimInstance_AntiVehMountedTurret">();
	}
	static class UFortVehicleAnimInstance_AntiVehMountedTurret* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleAnimInstance_AntiVehMountedTurret>();
	}
};

// Class ResolveTurretRuntime.FortVehicleAnimInstance_SevenMountedTurret
// 0x0010 (0x06E0 - 0x06D0)
class UFortVehicleAnimInstance_SevenMountedTurret final : public UFortMountedTurretAnimInstance
{
public:
	float                                         YawDeltaSmoothed;                                  // 0x06D0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D4[0xC];                                      // 0x06D4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAnimInstance_SevenMountedTurret">();
	}
	static class UFortVehicleAnimInstance_SevenMountedTurret* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleAnimInstance_SevenMountedTurret>();
	}
};

}

