#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewindDebugger

#include "Basic.hpp"

#include "RewindDebugger_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class RewindDebugger.RewindDebuggerSettings
// 0x0030 (0x0090 - 0x0060)
class URewindDebuggerSettings final : public UDeveloperSettings
{
public:
	ERewindDebuggerCameraMode                     CameraMode;                                        // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldAutoEject;                                  // 0x0064(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldAutoRecordOnPIE;                            // 0x0065(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaybackRate;                                      // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowEmptyObjectTracks;                            // 0x006C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           HiddenTrackTypes;                                  // 0x0070(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	class FString                                 DebugTargetActor;                                  // 0x0080(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RewindDebuggerSettings">();
	}
	static class URewindDebuggerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<URewindDebuggerSettings>();
	}
};

}

