#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewindDebuggerVLog

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "RewindDebuggerVLog_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "LogVisualizer_classes.hpp"


namespace SDK
{

// Class RewindDebuggerVLog.VLogDetailsObject
// 0x0010 (0x0040 - 0x0030)
class UVLogDetailsObject final : public UObject
{
public:
	TArray<struct FVisualLogDetails>              VisualLogDetails;                                  // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VLogDetailsObject">();
	}
	static class UVLogDetailsObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVLogDetailsObject>();
	}
};

// Class RewindDebuggerVLog.RewindDebuggerVLogSettings
// 0x0058 (0x00B8 - 0x0060)
class URewindDebuggerVLogSettings final : public UDeveloperSettings
{
public:
	uint8                                         DisplayVerbosity;                                  // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FName>                             DisplayCategories;                                 // 0x0068(0x0050)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RewindDebuggerVLogSettings">();
	}
	static class URewindDebuggerVLogSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<URewindDebuggerVLogSettings>();
	}
};

// Class RewindDebuggerVLog.VLogRenderingActor
// 0x00A0 (0x04C8 - 0x0428)
class AVLogRenderingActor final : public AVisualLoggerRenderingActorBase
{
public:
	uint8                                         Pad_428[0xA0];                                     // 0x0428(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VLogRenderingActor">();
	}
	static class AVLogRenderingActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVLogRenderingActor>();
	}
};

}

