#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RigLogicEditor

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "UnrealEd_classes.hpp"


namespace SDK
{

// Class RigLogicEditor.DNAAssetImportUI
// 0x0030 (0x0060 - 0x0030)
class UDNAAssetImportUI final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FileName;                                          // 0x0050(0x0010)(Edit, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ResetToDefault();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DNAAssetImportUI">();
	}
	static class UDNAAssetImportUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDNAAssetImportUI>();
	}
};

// Class RigLogicEditor.DNAAssetImportFactory
// 0x0030 (0x00B8 - 0x0088)
class UDNAAssetImportFactory final : public UFactory
{
public:
	uint8                                         Pad_88[0x20];                                      // 0x0088(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UDNAAssetImportUI*                      ImportUI;                                          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDNAAssetImportUI*                      OriginalImportUI;                                  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DNAAssetImportFactory">();
	}
	static class UDNAAssetImportFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDNAAssetImportFactory>();
	}
};

}

