#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RigVMEditor

#include "Basic.hpp"

#include "RigVMEditor_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RigVMEditor.RigVMEditorMenuContext.GetGraphMenuContext
// 0x0018 (0x0018 - 0x0000)
struct RigVMEditorMenuContext_GetGraphMenuContext final
{
public:
	struct FRigVMEditorGraphMenuContext           ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function RigVMEditor.RigVMEditorMenuContext.GetRigVMBlueprint
// 0x0008 (0x0008 - 0x0000)
struct RigVMEditorMenuContext_GetRigVMBlueprint final
{
public:
	class URigVMBlueprint*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RigVMEditor.RigVMEditorMenuContext.GetRigVMHost
// 0x0008 (0x0008 - 0x0000)
struct RigVMEditorMenuContext_GetRigVMHost final
{
public:
	class URigVMHost*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RigVMEditor.RigVMEditorMenuContext.IsAltDown
// 0x0001 (0x0001 - 0x0000)
struct RigVMEditorMenuContext_IsAltDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RigVMEditor.RigVMEditorBlueprintLibrary.GetAssetsWithFilter_ForBlueprint
// 0x0030 (0x0030 - 0x0000)
struct RigVMEditorBlueprintLibrary_GetAssetsWithFilter_ForBlueprint final
{
public:
	TSubclassOf<class URigVMBlueprint>            InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAssetData& AssetData)> InAssetDataFilter;                                 // 0x0008(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAssetData>                     ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function RigVMEditor.RigVMEditorBlueprintLibrary.GetController
// 0x0010 (0x0010 - 0x0000)
struct RigVMEditorBlueprintLibrary_GetController final
{
public:
	class URigVMBlueprint*                        InBlueprint;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URigVMController*                       ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RigVMEditor.RigVMEditorBlueprintLibrary.GetModel
// 0x0010 (0x0010 - 0x0000)
struct RigVMEditorBlueprintLibrary_GetModel final
{
public:
	class URigVMBlueprint*                        InBlueprint;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URigVMGraph*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RigVMEditor.RigVMEditorBlueprintLibrary.LoadAssets
// 0x0010 (0x0010 - 0x0000)
struct RigVMEditorBlueprintLibrary_LoadAssets final
{
public:
	TArray<class URigVMBlueprint*>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function RigVMEditor.RigVMEditorBlueprintLibrary.LoadAssetsByClass
// 0x0018 (0x0018 - 0x0000)
struct RigVMEditorBlueprintLibrary_LoadAssetsByClass final
{
public:
	TSubclassOf<class URigVMBlueprint>            InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class URigVMBlueprint*>                ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function RigVMEditor.RigVMEditorBlueprintLibrary.LoadAssetsWithAssetDataAndBlueprintFilters_ForBlueprint
// 0x0040 (0x0040 - 0x0000)
struct RigVMEditorBlueprintLibrary_LoadAssetsWithAssetDataAndBlueprintFilters_ForBlueprint final
{
public:
	TSubclassOf<class URigVMBlueprint>            InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAssetData& AssetData)> InAssetDataFilter;                                 // 0x0008(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class URigVMBlueprint* Blueprint, const TArray<struct FRigVMBlueprintLoadLogEntry>& LogDuringLoad)> InBlueprintFilter;                                 // 0x001C(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class URigVMBlueprint*>                ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function RigVMEditor.RigVMEditorBlueprintLibrary.LoadAssetsWithAssetDataAndNodeFilters_ForBlueprint
// 0x0040 (0x0040 - 0x0000)
struct RigVMEditorBlueprintLibrary_LoadAssetsWithAssetDataAndNodeFilters_ForBlueprint final
{
public:
	TSubclassOf<class URigVMBlueprint>            InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAssetData& AssetData)> InAssetDataFilter;                                 // 0x0008(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class URigVMBlueprint* Blueprint, class URigVMNode* Node)> InNodeFilter;                                      // 0x001C(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class URigVMBlueprint*>                ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function RigVMEditor.RigVMEditorBlueprintLibrary.LoadAssetsWithAssetDataFilter_ForBlueprint
// 0x0030 (0x0030 - 0x0000)
struct RigVMEditorBlueprintLibrary_LoadAssetsWithAssetDataFilter_ForBlueprint final
{
public:
	TSubclassOf<class URigVMBlueprint>            InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAssetData& AssetData)> InAssetDataFilter;                                 // 0x0008(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URigVMBlueprint*>                ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function RigVMEditor.RigVMEditorBlueprintLibrary.LoadAssetsWithBlueprintFilter_ForBlueprint
// 0x0030 (0x0030 - 0x0000)
struct RigVMEditorBlueprintLibrary_LoadAssetsWithBlueprintFilter_ForBlueprint final
{
public:
	TSubclassOf<class URigVMBlueprint>            InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class URigVMBlueprint* Blueprint, const TArray<struct FRigVMBlueprintLoadLogEntry>& LogDuringLoad)> InBlueprintFilter;                                 // 0x0008(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URigVMBlueprint*>                ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function RigVMEditor.RigVMEditorBlueprintLibrary.LoadAssetsWithNodeFilter_ForBlueprint
// 0x0030 (0x0030 - 0x0000)
struct RigVMEditorBlueprintLibrary_LoadAssetsWithNodeFilter_ForBlueprint final
{
public:
	TSubclassOf<class URigVMBlueprint>            InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class URigVMBlueprint* Blueprint, class URigVMNode* Node)> InNodeFilter;                                      // 0x0008(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URigVMBlueprint*>                ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function RigVMEditor.RigVMEditorBlueprintLibrary.RecompileVM
// 0x0008 (0x0008 - 0x0000)
struct RigVMEditorBlueprintLibrary_RecompileVM final
{
public:
	class URigVMBlueprint*                        InBlueprint;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RigVMEditor.RigVMEditorBlueprintLibrary.RecompileVMIfRequired
// 0x0008 (0x0008 - 0x0000)
struct RigVMEditorBlueprintLibrary_RecompileVMIfRequired final
{
public:
	class URigVMBlueprint*                        InBlueprint;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RigVMEditor.RigVMEditorBlueprintLibrary.RequestAutoVMRecompilation
// 0x0008 (0x0008 - 0x0000)
struct RigVMEditorBlueprintLibrary_RequestAutoVMRecompilation final
{
public:
	class URigVMBlueprint*                        InBlueprint;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

