#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RigVMEditor

#include "Basic.hpp"

#include "BlueprintGraph_classes.hpp"
#include "RigVM_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class RigVMEditor.RigVMEdGraphNodeSpawner
// 0x0008 (0x0108 - 0x0100)
class URigVMEdGraphNodeSpawner : public UBlueprintNodeSpawner
{
public:
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMEdGraphNodeSpawner">();
	}
	static class URigVMEdGraphNodeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<URigVMEdGraphNodeSpawner>();
	}
};

// Class RigVMEditor.RigVMEdGraphEnumNodeSpawner
// 0x0008 (0x0110 - 0x0108)
class URigVMEdGraphEnumNodeSpawner final : public URigVMEdGraphNodeSpawner
{
public:
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMEdGraphEnumNodeSpawner">();
	}
	static class URigVMEdGraphEnumNodeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<URigVMEdGraphEnumNodeSpawner>();
	}
};

// Class RigVMEditor.RigVMEdGraphFunctionRefNodeSpawner
// 0x0190 (0x0298 - 0x0108)
class URigVMEdGraphFunctionRefNodeSpawner final : public URigVMEdGraphNodeSpawner
{
public:
	struct FRigVMGraphFunctionHeader              ReferencedPublicFunctionHeader;                    // 0x0108(0x0160)(Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsLocalFunction;                                  // 0x0268(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        AssetPath;                                         // 0x0270(0x0028)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMEdGraphFunctionRefNodeSpawner">();
	}
	static class URigVMEdGraphFunctionRefNodeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<URigVMEdGraphFunctionRefNodeSpawner>();
	}
};

// Class RigVMEditor.RigVMEdGraphInvokeEntryNodeSpawner
// 0x0020 (0x0128 - 0x0108)
class URigVMEdGraphInvokeEntryNodeSpawner final : public URigVMEdGraphNodeSpawner
{
public:
	uint8                                         Pad_108[0x20];                                     // 0x0108(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMEdGraphInvokeEntryNodeSpawner">();
	}
	static class URigVMEdGraphInvokeEntryNodeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<URigVMEdGraphInvokeEntryNodeSpawner>();
	}
};

// Class RigVMEditor.RigVMEdGraphTemplateNodeSpawner
// 0x0018 (0x0120 - 0x0108)
class URigVMEdGraphTemplateNodeSpawner final : public URigVMEdGraphNodeSpawner
{
public:
	class FName                                   TemplateNotation;                                  // 0x0108(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_114[0xC];                                      // 0x0114(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMEdGraphTemplateNodeSpawner">();
	}
	static class URigVMEdGraphTemplateNodeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<URigVMEdGraphTemplateNodeSpawner>();
	}
};

// Class RigVMEditor.RigVMEdGraphUnitNodeSpawner
// 0x0018 (0x0120 - 0x0108)
class URigVMEdGraphUnitNodeSpawner final : public URigVMEdGraphNodeSpawner
{
public:
	class UScriptStruct*                          StructTemplate;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   MethodName;                                        // 0x0110(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMEdGraphUnitNodeSpawner">();
	}
	static class URigVMEdGraphUnitNodeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<URigVMEdGraphUnitNodeSpawner>();
	}
};

// Class RigVMEditor.RigVMEdGraphVariableNodeSpawner
// 0x0058 (0x0160 - 0x0108)
class URigVMEdGraphVariableNodeSpawner final : public URigVMEdGraphNodeSpawner
{
public:
	uint8                                         Pad_108[0x58];                                     // 0x0108(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMEdGraphVariableNodeSpawner">();
	}
	static class URigVMEdGraphVariableNodeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<URigVMEdGraphVariableNodeSpawner>();
	}
};

// Class RigVMEditor.RigVMDetailsViewWrapperObject
// 0x0028 (0x0058 - 0x0030)
class URigVMDetailsViewWrapperObject : public UObject
{
public:
	uint8                                         Pad_30[0x4];                                       // 0x0030(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UObject>                 SubjectPtr;                                        // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x1C];                                      // 0x003C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMDetailsViewWrapperObject">();
	}
	static class URigVMDetailsViewWrapperObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<URigVMDetailsViewWrapperObject>();
	}
};

// Class RigVMEditor.RigVMEditorMenuContext
// 0x0028 (0x0058 - 0x0030)
class URigVMEditorMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FRigVMEditorGraphMenuContext GetGraphMenuContext();

	class URigVMBlueprint* GetRigVMBlueprint() const;
	class URigVMHost* GetRigVMHost() const;
	bool IsAltDown() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMEditorMenuContext">();
	}
	static class URigVMEditorMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<URigVMEditorMenuContext>();
	}
};

// Class RigVMEditor.RigVMEditorBlueprintLibrary
// 0x0000 (0x0030 - 0x0030)
class URigVMEditorBlueprintLibrary : public UBlueprintFunctionLibrary
{
public:
	static TArray<struct FAssetData> GetAssetsWithFilter_ForBlueprint(TSubclassOf<class URigVMBlueprint> InClass, TDelegate<void(const struct FAssetData& AssetData)> InAssetDataFilter);
	static class URigVMController* GetController(class URigVMBlueprint* InBlueprint);
	static class URigVMGraph* GetModel(class URigVMBlueprint* InBlueprint);
	static TArray<class URigVMBlueprint*> LoadAssets();
	static TArray<class URigVMBlueprint*> LoadAssetsByClass(TSubclassOf<class URigVMBlueprint> InClass);
	static TArray<class URigVMBlueprint*> LoadAssetsWithAssetDataAndBlueprintFilters_ForBlueprint(TSubclassOf<class URigVMBlueprint> InClass, TDelegate<void(const struct FAssetData& AssetData)> InAssetDataFilter, TDelegate<void(class URigVMBlueprint* Blueprint, const TArray<struct FRigVMBlueprintLoadLogEntry>& LogDuringLoad)> InBlueprintFilter);
	static TArray<class URigVMBlueprint*> LoadAssetsWithAssetDataAndNodeFilters_ForBlueprint(TSubclassOf<class URigVMBlueprint> InClass, TDelegate<void(const struct FAssetData& AssetData)> InAssetDataFilter, TDelegate<void(class URigVMBlueprint* Blueprint, class URigVMNode* Node)> InNodeFilter);
	static TArray<class URigVMBlueprint*> LoadAssetsWithAssetDataFilter_ForBlueprint(TSubclassOf<class URigVMBlueprint> InClass, TDelegate<void(const struct FAssetData& AssetData)> InAssetDataFilter);
	static TArray<class URigVMBlueprint*> LoadAssetsWithBlueprintFilter_ForBlueprint(TSubclassOf<class URigVMBlueprint> InClass, TDelegate<void(class URigVMBlueprint* Blueprint, const TArray<struct FRigVMBlueprintLoadLogEntry>& LogDuringLoad)> InBlueprintFilter);
	static TArray<class URigVMBlueprint*> LoadAssetsWithNodeFilter_ForBlueprint(TSubclassOf<class URigVMBlueprint> InClass, TDelegate<void(class URigVMBlueprint* Blueprint, class URigVMNode* Node)> InNodeFilter);
	static void RecompileVM(class URigVMBlueprint* InBlueprint);
	static void RecompileVMIfRequired(class URigVMBlueprint* InBlueprint);
	static void RequestAutoVMRecompilation(class URigVMBlueprint* InBlueprint);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMEditorBlueprintLibrary">();
	}
	static class URigVMEditorBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<URigVMEditorBlueprintLibrary>();
	}
};

}

