#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RockVehicle_Test

#include "Basic.hpp"

#include "RockVehicle_Test_structs.hpp"


namespace SDK::Params
{

// Function RockVehicle_Test.FortCheatManager_RockVehicleTests.RockVehiclePhysicsReplayPlay
// 0x0010 (0x0010 - 0x0000)
struct FortCheatManager_RockVehicleTests_RockVehiclePhysicsReplayPlay final
{
public:
	class FString                                 FileName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RockVehicle_Test.FortCheatManager_RockVehicleTests.RockVehiclePhysicsTest
// 0x0010 (0x0010 - 0x0000)
struct FortCheatManager_RockVehicleTests_RockVehiclePhysicsTest final
{
public:
	class FString                                 TestName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function RockVehicle_Test.RockVehicle_ReplicatedTestComponent.NotifyTestComplete
// 0x0010 (0x0010 - 0x0000)
struct RockVehicle_ReplicatedTestComponent_NotifyTestComplete final
{
public:
	struct FRockVehicle_PhysicsErrorLog           ErrorLog;                                          // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
};

// Function RockVehicle_Test.RockVehicle_ReplicatedTestComponent.RunTest
// 0x0018 (0x0018 - 0x0000)
struct RockVehicle_ReplicatedTestComponent_RunTest final
{
public:
	class FString                                 InName;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTrackIdx;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

