#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RockVehicleRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "RockVehicleRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "VehicleAudioRuntime_classes.hpp"
#include "SrirachaRanch_classes.hpp"


namespace SDK
{

// Class RockVehicleRuntime.RockVehicle_InteractionOverrideComponent
// 0x0000 (0x00E8 - 0x00E8)
class URockVehicle_InteractionOverrideComponent final : public UFortVehicleInteractionOverrideComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicle_InteractionOverrideComponent">();
	}
	static class URockVehicle_InteractionOverrideComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicle_InteractionOverrideComponent>();
	}
};

// Class RockVehicleRuntime.FortCheatManager_RockVehicle
// 0x0000 (0x0030 - 0x0030)
class UFortCheatManager_RockVehicle final : public UChildCheatManager
{
public:
	void RockVehicleSetBalboaVelocity(float X, float Y, float Z);
	void RockVehicleSetLocation(float X, float Y, float Z);
	void RockVehicleSetRotation(float Pitch, float Yaw, float Roll);
	void RockVehicleSetVelocity(float X, float Y, float Z);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_RockVehicle">();
	}
	static class UFortCheatManager_RockVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_RockVehicle>();
	}
};

// Class RockVehicleRuntime.RockVehicle
// 0x0240 (0x25C0 - 0x2380)
class ARockVehicle final : public AFortAthenaSKVehicle
{
public:
	float                                         InputSwivelPitch;                                  // 0x2380(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InputSwivelYaw;                                    // 0x2384(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bInputReverseCamera : 1;                           // 0x2388(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHasDoubleJumped : 1;                              // 0x2388(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHasDodged : 1;                                    // 0x2388(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          bFreeLookCamera;                                   // 0x2389(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_238A[0x6];                                     // 0x238A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bFreeCam)> OnFreeCamToggled;                                  // 0x2390(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_23A0[0x1];                                     // 0x23A0(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockRuntimeConfigOverrides            RockRuntimeConfigs;                                // 0x23A1(0x0004)(Net, Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_23A5[0x1B];                                    // 0x23A5(0x001B)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class FName Socket, float ImpactSpeed, struct FHitResult& OutHit)> OnSpringImpact;                                    // 0x23C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_23D0[0x78];                                    // 0x23D0(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class URockVehicleAnalyticsComponent*         RockAnalyticsComp;                                 // 0x2448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class URockVehicleAbility*>            VehicleAbilities;                                  // 0x2450(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSoftClassPtr<class UClass>>           VehicleAbilityTickOrder;                           // 0x2460(0x0010)(Edit, ZeroConstructor, Config, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class AFortVehicleAudioController*            CachedVehicleAudioController;                      // 0x2470(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URockVehicleAbility_Supersonic*         SupersonicAbility;                                 // 0x2478(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URockVehicleAnimInstance*               RockAnimInstance;                                  // 0x2480(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortAthenaVehicleInputState           PendingDriverInputState;                           // 0x2488(0x0040)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FFortAthenaVehicleInputState           PrevDriverInputState;                              // 0x24C8(0x0040)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                EnterExitImpulse;                                  // 0x2508(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2520[0xA0];                                    // 0x2520(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_FreeLookCamera();
	void ServerSetLegacyDamageValues(bool bDamageFriendlyVehicles, bool bDamageOtherVehicles, bool bDamageOwnVehicle, bool bDamageAllowedFromOtherVehicle);
	void ServerToggleFreeCam();

	const struct FRockRuntimeConfigOverrides GetCurrentRockRuntimeConfigOverrides() const;
	struct FFortAthenaVehicleInputState GetDriverInput() const;
	float GetThrottleState() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicle">();
	}
	static class ARockVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARockVehicle>();
	}
};

// Class RockVehicleRuntime.RockVehicleAbility
// 0x0010 (0x00E8 - 0x00D8)
class URockVehicleAbility : public UActorComponent
{
public:
	class ARockVehicle*                           Vehicle;                                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ActiveSeconds;                                     // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LastDeactivationTimeSeconds;                       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	float GetActiveSeconds() const;
	float GetInactiveSeconds() const;
	class ARockVehicle* GetVehicle() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleAbility">();
	}
	static class URockVehicleAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility>();
	}
};

// Class RockVehicleRuntime.RockVehicleAbility_Physics
// 0x0058 (0x0140 - 0x00E8)
class URockVehicleAbility_Physics : public URockVehicleAbility
{
public:
	bool                                          bShouldStayActive;                                 // 0x00E8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortAthenaVehicleInputState           InputState;                                        // 0x00F0(0x0040)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_130[0x10];                                     // 0x0130(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleAbility_Physics">();
	}
	static class URockVehicleAbility_Physics* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_Physics>();
	}
};

// Class RockVehicleRuntime.RockVehicleAbility_AirControl
// 0x0060 (0x01A0 - 0x0140)
class URockVehicleAbility_AirControl final : public URockVehicleAbility_Physics
{
public:
	uint8                                         Pad_140[0x18];                                     // 0x0140(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TorqueAccel;                                       // 0x0158(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TorqueDamping;                                     // 0x0170(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisableForDodgeTime;                               // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnyWheelsOnGround;                                // 0x018C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDodgeActive;                                      // 0x018D(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoUprightActive;                                // 0x018E(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_18F[0x1];                                      // 0x018F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class URockVehicleAbility_Dodge*              DodgeAbility;                                      // 0x0190(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URockVehicleAbility_AutoUpright*        AutoUprightAbility;                                // 0x0198(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleAbility_AirControl">();
	}
	static class URockVehicleAbility_AirControl* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_AirControl>();
	}
};

// Class RockVehicleRuntime.RockVehicleAbility_AutoUpright
// 0x0148 (0x0288 - 0x0140)
class URockVehicleAbility_AutoUpright final : public URockVehicleAbility_Physics
{
public:
	uint8                                         Pad_140[0x18];                                     // 0x0140(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockScalableFloat                     RollTorque;                                        // 0x0158(0x0040)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FRockScalableFloat                     PitchTorque;                                       // 0x0198(0x0040)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FRockScalableFloat                     PushForce;                                         // 0x01D8(0x0040)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FRockScalableFloat                     MinActiveSeconds;                                  // 0x0218(0x0040)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class URockVehicleAbility_Dodge*              DodgeAbility;                                      // 0x0258(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         LastWorldContactFrame;                             // 0x0260(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LastContactNormal;                                 // 0x0268(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWheelsOnGround;                                   // 0x0280(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAnyWheelsOnGround;                                // 0x0281(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDodgeActive;                                      // 0x0282(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBodyContact;                                      // 0x0283(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimeSinceLastBodyContact;                          // 0x0284(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleAbility_AutoUpright">();
	}
	static class URockVehicleAbility_AutoUpright* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_AutoUpright>();
	}
};

// Class RockVehicleRuntime.RockVehicleAbility_Boost
// 0x0078 (0x01B8 - 0x0140)
class URockVehicleAbility_Boost final : public URockVehicleAbility_Physics
{
public:
	uint8                                         Pad_140[0x18];                                     // 0x0140(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockScalableFloat                     BoostAccel;                                        // 0x0158(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnBoostFailed;                                     // 0x0198(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class URockVehicleBoostTank*                  BoostTank;                                         // 0x01A8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasBoost;                                         // 0x01B0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleAbility_Boost">();
	}
	static class URockVehicleAbility_Boost* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_Boost>();
	}
};

// Class RockVehicleRuntime.RockVehicleBoostTank
// 0x00A8 (0x0180 - 0x00D8)
class URockVehicleBoostTank final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(float DeltaSeconds)> OnSecondsChanged;                                  // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     StartSeconds;                                      // 0x00E8(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     MaxSeconds;                                        // 0x0128(0x0040)(Edit, BlueprintVisible, Net, NativeAccessSpecifierPublic)
	ERockBoostLogic                               BoostLogic;                                        // 0x0168(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BoostRechargeRate;                                 // 0x016C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostRechargeDelay;                                // 0x0170(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondsRemaining;                                  // 0x0174(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GiveBoost(float Seconds);
	void OnRep_SecondsRemaining(float PrevValue);

	float GetMaxBoostInSeconds() const;
	float GetPercentRemaining() const;
	bool HasBoost() const;
	bool IsBoostFull() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleBoostTank">();
	}
	static class URockVehicleBoostTank* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleBoostTank>();
	}
};

// Class RockVehicleRuntime.RockVehicleAbility_Dodge
// 0x0430 (0x0570 - 0x0140)
class URockVehicleAbility_Dodge final : public URockVehicleAbility_Physics
{
public:
	uint8                                         Pad_140[0x18];                                     // 0x0140(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockDodgeImpulse                      ForwardImpulse;                                    // 0x0158(0x0080)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockDodgeImpulse                      BackwardImpulse;                                   // 0x01D8(0x0080)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockDodgeImpulse                      SideImpulse;                                       // 0x0258(0x0080)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     MinTimeAfterJump;                                  // 0x02D8(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     MinTorqueTime;                                     // 0x0318(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     MaxTorqueTime;                                     // 0x0358(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     ForwardTorque;                                     // 0x0398(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     SideTorque;                                        // 0x03D8(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     ZLiftTime;                                         // 0x0418(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     ZLiftAccel;                                        // 0x0458(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     ZDampingTime;                                      // 0x0498(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     ZDamping;                                          // 0x04D8(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     InputThreshold;                                    // 0x0518(0x0040)(NativeAccessSpecifierPublic)
	struct FVector2D                              DodgeInput;                                        // 0x0558(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWheelsOnGround;                                   // 0x0568(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleAbility_Dodge">();
	}
	static class URockVehicleAbility_Dodge* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_Dodge>();
	}
};

// Class RockVehicleRuntime.RockVehicleAbility_DoubleJump
// 0x0060 (0x01A0 - 0x0140)
class URockVehicleAbility_DoubleJump final : public URockVehicleAbility_Physics
{
public:
	uint8                                         Pad_140[0x18];                                     // 0x0140(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockScalableFloat                     JumpVelocity;                                      // 0x0158(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class URockVehicleAbility_Jump*               JumpAbility;                                       // 0x0198(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleAbility_DoubleJump">();
	}
	static class URockVehicleAbility_DoubleJump* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_DoubleJump>();
	}
};

// Class RockVehicleRuntime.RockVehicleAbility_Flip
// 0x0128 (0x0268 - 0x0140)
class URockVehicleAbility_Flip final : public URockVehicleAbility_Physics
{
public:
	uint8                                         Pad_140[0x18];                                     // 0x0140(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockScalableFloat                     Impulse;                                           // 0x0158(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     Torque;                                            // 0x0198(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     Duration;                                          // 0x01D8(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     ContactNormalThresholdDegrees;                     // 0x0218(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bWheelsOnGround;                                   // 0x0258(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_259[0xF];                                      // 0x0259(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleAbility_Flip">();
	}
	static class URockVehicleAbility_Flip* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_Flip>();
	}
};

// Class RockVehicleRuntime.RockVehicleAbility_GroundTrails
// 0x0058 (0x0140 - 0x00E8)
class URockVehicleAbility_GroundTrails final : public URockVehicleAbility
{
public:
	struct FGroundTrailsMap                       GroundTrailsMap;                                   // 0x00E8(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           GroundTrailSockets;                                // 0x0100(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UNiagaraSystem*                         HandbrakeSystem;                                   // 0x0110(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UNiagaraComponent*>              GroundTrailComponents;                             // 0x0118(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UNiagaraComponent*>              HandbrakeComponents;                               // 0x0128(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSurfaceChanged(EPhysicalSurface NewSurface);
	void SetEnabled(bool bValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleAbility_GroundTrails">();
	}
	static class URockVehicleAbility_GroundTrails* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_GroundTrails>();
	}
};

// Class RockVehicleRuntime.RockVehicleAbility_Jump
// 0x0118 (0x0258 - 0x0140)
class URockVehicleAbility_Jump final : public URockVehicleAbility_Physics
{
public:
	uint8                                         Pad_140[0x18];                                     // 0x0140(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockScalableFloat                     JumpVelocity;                                      // 0x0158(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     JumpAccel;                                         // 0x0198(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     MinJumpSeconds;                                    // 0x01D8(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     MaxJumpSeconds;                                    // 0x0218(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleAbility_Jump">();
	}
	static class URockVehicleAbility_Jump* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_Jump>();
	}
};

// Class RockVehicleRuntime.RockVehicleAbility_StickyWheels
// 0x00B8 (0x01F8 - 0x0140)
class URockVehicleAbility_StickyWheels final : public URockVehicleAbility_Physics
{
public:
	uint8                                         Pad_140[0x18];                                     // 0x0140(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockScalableFloat                     StickyForceScaleGround;                            // 0x0158(0x0040)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FRockScalableFloat                     StickyForceScaleWall;                              // 0x0198(0x0040)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FVector                                ContactNormal;                                     // 0x01D8(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Scale;                                             // 0x01F0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAnyWheelsOnGround;                                // 0x01F4(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleAbility_StickyWheels">();
	}
	static class URockVehicleAbility_StickyWheels* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_StickyWheels>();
	}
};

// Class RockVehicleRuntime.RockVehicleAbility_Supersonic
// 0x00F8 (0x01E0 - 0x00E8)
class URockVehicleAbility_Supersonic final : public URockVehicleAbility
{
public:
	TMulticastInlineDelegate<void()>              OnTrailsActivate;                                  // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnTrailsDeactivate;                                // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     TurnOffTime;                                       // 0x0108(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FRockScalableFloat                     TurnOnTime;                                        // 0x0148(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bUseTurnOnTimeRequirement;                         // 0x0188(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockScalableFloat                     TurnOffSpeedBuffer;                                // 0x0190(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         TimeBelowSupersonic;                               // 0x01D0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WorldTimeSupersonicExceeded;                       // 0x01D4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D8[0x8];                                      // 0x01D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleAbility_Supersonic">();
	}
	static class URockVehicleAbility_Supersonic* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAbility_Supersonic>();
	}
};

// Class RockVehicleRuntime.RockVehicleAnalyticsComponent
// 0x0038 (0x0110 - 0x00D8)
class URockVehicleAnalyticsComponent final : public UActorComponent
{
public:
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRockVehicleAnalyticsSession           CurrentSession;                                    // 0x00E0(0x0028)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	class ARockVehicle*                           Vehicle;                                           // 0x0108(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnDodged(class UActorComponent* InComp, bool bInReset);
	void OnDoubleJumped(class UActorComponent* InComp, bool bInReset);
	void OnJumped(class UActorComponent* InComp, bool bInReset);
	void OnPawnEnteredSeat(const TScriptInterface<class IFortVehicleInterface>& InVehicle, class AFortPawn* InPlayerPawn, int32 InSeatIndex);
	void OnPawnExitedSeat(const TScriptInterface<class IFortVehicleInterface>& InVehicle, class AFortPawn* InPlayerPawn, int32 InSeatIndex);
	void OnSupersonicEnd(class UActorComponent* InComp);
	void OnSupersonicStart(class UActorComponent* InComp, bool bInReset);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleAnalyticsComponent">();
	}
	static class URockVehicleAnalyticsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAnalyticsComponent>();
	}
};

// Class RockVehicleRuntime.RockVehicleAnimInstance
// 0x0180 (0x0830 - 0x06B0)
class URockVehicleAnimInstance final : public UFortVehicleAnimInstance
{
public:
	struct FBouncyChassisState                    BouncyChassis;                                     // 0x06B0(0x000C)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FRockVehicleWheelAnimInfo              WheelInfoFR;                                       // 0x06BC(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FRockVehicleWheelAnimInfo              WheelInfoFL;                                       // 0x06D0(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FRockVehicleWheelAnimInfo              WheelInfoBR;                                       // 0x06E4(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FRockVehicleWheelAnimInfo              WheelInfoBL;                                       // 0x06F8(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         WheelLerpSpeed;                                    // 0x070C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_710[0x120];                                    // 0x0710(0x0120)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleAnimInstance">();
	}
	static class URockVehicleAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleAnimInstance>();
	}
};

// Class RockVehicleRuntime.RockVehicleAudioController
// 0x00F0 (0x0668 - 0x0578)
class ARockVehicleAudioController final : public AFortVehicleAudioController
{
public:
	struct FRuntimeFloatCurve                     SideSpeedToSkidVolume;                             // 0x0578(0x0088)(Edit, NativeAccessSpecifierPublic)
	float                                         SurfaceTypeInterpSpeed;                            // 0x0600(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_604[0x4];                                      // 0x0604(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        TireSurfaceComponent;                              // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        AirLoopComponent;                                  // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        SuperSonicComponent;                               // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInWater;                                          // 0x0620(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioMotorModelComponent*              MotorModel;                                        // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ARockVehicle*                           CachedVehicle;                                     // 0x0630(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_638[0x30];                                     // 0x0638(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInAirUpdated(const bool bNewInAir);
	void SetBoosting(const bool bNewBoosting);
	void SetSurfaceTypeParam(const float NewSurfaceParam);

	class UAudioMotorModelComponent* GetMotorSimComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleAudioController">();
	}
	static class ARockVehicleAudioController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARockVehicleAudioController>();
	}
};

// Class RockVehicleRuntime.RockVehicleCameraMode
// 0x0200 (0x2060 - 0x1E60)
class URockVehicleCameraMode final : public UFortCameraMode_AthenaVehicle
{
public:
	float                                         SwivelPitchMax;                                    // 0x1E58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwivelYawMax;                                      // 0x1E5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundNormalInterpRate;                            // 0x1E60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundNormalAirInterpRate;                         // 0x1E64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundYawRate;                                     // 0x1E68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WallYawRate;                                       // 0x1E6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpToGroundTime;                                // 0x1E70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpToAirTime;                                   // 0x1E74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AverageVelocityInterpRate;                         // 0x1E78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E7C[0x4];                                     // 0x1E7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     AirRotationInterpRateForSpeed;                     // 0x1E80(0x0088)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	float                                         FocusOffsetInterpRate;                             // 0x1F08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceSpeedScale;                                // 0x1F0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceOffsetMin;                                 // 0x1F10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceOffsetMax;                                 // 0x1F14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceInterpRate;                                // 0x1F18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSpeedFOVOffset;                                 // 0x1F1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SupersonicFOVOffset;                               // 0x1F20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FOVInterpRate;                                     // 0x1F24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRockCameraSettings                    CameraSettings;                                    // 0x1F28(0x001C)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F44[0x4];                                     // 0x1F44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARockVehicle*                           VehicleTarget;                                     // 0x1F48(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URockVehicleAbility_Jump*               JumpAbility;                                       // 0x1F50(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1F58[0x108];                                   // 0x1F58(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleCameraMode">();
	}
	static class URockVehicleCameraMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleCameraMode>();
	}
};

// Class RockVehicleRuntime.RockVehicleConfigs
// 0x0668 (0x1048 - 0x09E0)
class URockVehicleConfigs final : public UFortPhysicsVehicleConfigs
{
public:
	struct FRockVehicleAxleConfig                 FrontAxle;                                         // 0x09E0(0x0034)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FRockVehicleAxleConfig                 BackAxle;                                          // 0x0A14(0x0034)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FRockVehicleDriveConfig                Drive;                                             // 0x0A48(0x0550)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	struct FRockVehicleDemoConfig                 DemolitionConfiguration;                           // 0x0F98(0x0028)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     MaxLinearSpeed;                                    // 0x0FC0(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRockScalableFloat                     SupersonicSpeed;                                   // 0x1000(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         MaxAngularSpeed;                                   // 0x1040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SafeBuildingLandingDegrees;                        // 0x1044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleConfigs">();
	}
	static class URockVehicleConfigs* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleConfigs>();
	}
};

// Class RockVehicleRuntime.RockVehicleManager
// 0x0020 (0x0440 - 0x0420)
class ARockVehicleManager final : public AActor
{
public:
	uint8                                         Pad_420[0x10];                                     // 0x0420(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARockVehicle*>                   RockVehicles;                                      // 0x0430(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleManager">();
	}
	static class ARockVehicleManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARockVehicleManager>();
	}
};

// Class RockVehicleRuntime.RockVehicleWorldSubsystem
// 0x0008 (0x0040 - 0x0038)
class URockVehicleWorldSubsystem final : public UWorldSubsystem
{
public:
	class ARockVehicleManager*                    VehicleManager;                                    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicleWorldSubsystem">();
	}
	static class URockVehicleWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicleWorldSubsystem>();
	}
};

// Class RockVehicleRuntime.StreamingRadioPlayerComponent_Rock
// 0x0000 (0x05D8 - 0x05D8)
class UStreamingRadioPlayerComponent_Rock final : public UStreamingRadioPlayerComponent
{
public:
	void VehicleExploded(const class AController* LastDamageInstigator, class AFortAthenaVehicle* Vehicle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StreamingRadioPlayerComponent_Rock">();
	}
	static class UStreamingRadioPlayerComponent_Rock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStreamingRadioPlayerComponent_Rock>();
	}
};

}

