#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RockVehicle_Test

#include "Basic.hpp"

#include "RockVehicle_Test_structs.hpp"
#include "FunctionalTesting_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class RockVehicle_Test.RockVehicle_PhysicsLog
// 0x00A0 (0x00D0 - 0x0030)
class URockVehicle_PhysicsLog final : public UObject
{
public:
	class FString                                 ActorArchetype;                                    // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRockVehicle_PhysicsReplayRigidBodyState InitialRBState;                                    // 0x0040(0x0070)(NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   BodyName;                                          // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastFrame;                                         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRockVehicle_PhysicsLogFrame>   Frames;                                            // 0x00C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicle_PhysicsLog">();
	}
	static class URockVehicle_PhysicsLog* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicle_PhysicsLog>();
	}
};

// Class RockVehicle_Test.RockVehicle_PhysicsReplay
// 0x0020 (0x0050 - 0x0030)
class URockVehicle_PhysicsReplay final : public UObject
{
public:
	class FString                                 URL;                                               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class URockVehicle_PhysicsLog*>        Logs;                                              // 0x0040(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicle_PhysicsReplay">();
	}
	static class URockVehicle_PhysicsReplay* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicle_PhysicsReplay>();
	}
};

// Class RockVehicle_Test.RockVehicle_PhysicsReplayTrack
// 0x0070 (0x00A0 - 0x0030)
class URockVehicle_PhysicsReplayTrack final : public UObject
{
public:
	class AActor*                                 Actor;                                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Shadow;                                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URockVehicle_PhysicsLog*                RecordLog;                                         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URockVehicle_PhysicsLog*                PlaybackLog;                                       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRockVehicle_MappedPhysicsErrorLog     ErrorLogs;                                         // 0x0050(0x0050)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicle_PhysicsReplayTrack">();
	}
	static class URockVehicle_PhysicsReplayTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicle_PhysicsReplayTrack>();
	}
};

// Class RockVehicle_Test.RockVehicle_PhysicsReplaySession
// 0x0018 (0x0048 - 0x0030)
class URockVehicle_PhysicsReplaySession final : public UObject
{
public:
	TArray<class URockVehicle_PhysicsReplayTrack*> Tracks;                                            // 0x0030(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	int32                                         CurrentFrame;                                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartedGameTime;                                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicle_PhysicsReplaySession">();
	}
	static class URockVehicle_PhysicsReplaySession* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicle_PhysicsReplaySession>();
	}
};

// Class RockVehicle_Test.RockVehicle_PhysicsClientReplaySession
// 0x0028 (0x0058 - 0x0030)
class URockVehicle_PhysicsClientReplaySession final : public UObject
{
public:
	class URockVehicle_PhysicsReplayTrack*        Track;                                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRockVehicle_PhysicsErrorLog           ErrorLog;                                          // 0x0038(0x0010)(NativeAccessSpecifierPublic)
	int32                                         CurrentFrame;                                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartedGameTime;                                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastGameTime;                                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicle_PhysicsClientReplaySession">();
	}
	static class URockVehicle_PhysicsClientReplaySession* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicle_PhysicsClientReplaySession>();
	}
};

// Class RockVehicle_Test.FortCheatManager_RockVehicleTests
// 0x0030 (0x0060 - 0x0030)
class UFortCheatManager_RockVehicleTests final : public UChildCheatManager
{
public:
	TArray<class FString>                         TestFiles;                                         // 0x0030(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class URockVehicle_PhysicsReplay*             CurrentUe3Replay;                                  // 0x0040(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URockVehicle_PhysicsReplay*             CurrentFNReplay;                                   // 0x0048(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URockVehicle_PhysicsReplaySession*      ReplaySession;                                     // 0x0050(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URockVehicle_ReplicatedTestComponent*   CurrentTestComponent;                              // 0x0058(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void RockVehiclePhysicsReplayPlay(const class FString& FileName);
	void RockVehiclePhysicsTest(const class FString& TestName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_RockVehicleTests">();
	}
	static class UFortCheatManager_RockVehicleTests* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_RockVehicleTests>();
	}
};

// Class RockVehicle_Test.RockVehicle_FuncTest_PhysicsReplay
// 0x00A8 (0x0610 - 0x0568)
class ARockVehicle_FuncTest_PhysicsReplay final : public AFunctionalTest
{
public:
	class FString                                 TestFileNameContains;                              // 0x0568(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_578[0x70];                                     // 0x0578(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	class URockVehicle_PhysicsReplay*             CurrentUe3Replay;                                  // 0x05E8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URockVehicle_PhysicsReplay*             CurrentFNReplay;                                   // 0x05F0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URockVehicle_PhysicsReplaySession*      ReplaySession;                                     // 0x05F8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URockVehicle_ReplicatedTestComponent*   CurrentTestComponent;                              // 0x0600(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_608[0x8];                                      // 0x0608(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicle_FuncTest_PhysicsReplay">();
	}
	static class ARockVehicle_FuncTest_PhysicsReplay* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARockVehicle_FuncTest_PhysicsReplay>();
	}
};

// Class RockVehicle_Test.RockVehicle_ReplicatedTestComponent
// 0x0048 (0x0120 - 0x00D8)
class URockVehicle_ReplicatedTestComponent final : public UActorComponent
{
public:
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FileName;                                          // 0x00F0(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TrackIdx;                                          // 0x0100(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URockVehicle_PhysicsClientReplaySession* ClientReplaySession;                               // 0x0108(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URockVehicle_PhysicsReplay*             ClientFNReplay;                                    // 0x0110(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void NotifyTestComplete(const struct FRockVehicle_PhysicsErrorLog& ErrorLog);
	void RunTest(const class FString& InName, int32 InTrackIdx);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RockVehicle_ReplicatedTestComponent">();
	}
	static class URockVehicle_ReplicatedTestComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URockVehicle_ReplicatedTestComponent>();
	}
};

}

