#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RubberBandPitchShifter

#include "Basic.hpp"

#include "RubberBandPitchShifter_structs.hpp"
#include "HarmonixDsp_classes.hpp"


namespace SDK
{

// Class RubberBandPitchShifter.RubberBandPitchShifterConfig
// 0x00C8 (0x00F8 - 0x0030)
class URubberBandPitchShifterConfig final : public UStretcherAndPitchShifterConfig
{
public:
	bool                                          bAllowPoolGrowthInEditor;                          // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlatformStretcherCounts               DefaultStretcherCounts;                            // 0x0034(0x0018)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FPlatformStretcherCounts               SwitchStretcherCounts;                             // 0x004C(0x0018)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FPlatformStretcherCounts               PS4StretcherCounts;                                // 0x0064(0x0018)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FPlatformStretcherCounts               PS5StretcherCounts;                                // 0x007C(0x0018)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FPlatformStretcherCounts               XboxOneStretcherCounts;                            // 0x0094(0x0018)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FPlatformStretcherCounts               XSXStretcherCounts;                                // 0x00AC(0x0018)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FPlatformStretcherCounts               AndroidStretcherCounts;                            // 0x00C4(0x0018)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FPlatformStretcherCounts               IOSStretcherCounts;                                // 0x00DC(0x0018)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RubberBandPitchShifterConfig">();
	}
	static class URubberBandPitchShifterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<URubberBandPitchShifterConfig>();
	}
};

}

