#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveTheWorldUI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CommonUILegacy_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SaveTheWorldUI_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "SlateCore_structs.hpp"
#include "SaveTheWorldRuntime_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class SaveTheWorldUI.BottomBar_STW
// 0x0008 (0x0448 - 0x0440)
class UBottomBar_STW final : public UCommonUserWidget
{
public:
	class UBoundActionBarSTW*                     BoundActionBar_STW;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BottomBar_STW">();
	}
	static class UBottomBar_STW* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBottomBar_STW>();
	}
};

// Class SaveTheWorldUI.BoundActionBarWithSecondaryBar
// 0x0020 (0x0380 - 0x0360)
class UBoundActionBarWithSecondaryBar : public UCommonBoundActionBar
{
public:
	class UDynamicEntryBox*                       SecondaryActionBar;                                // 0x0360(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FDataTableRowHandle>            SecondaryActionBarInputActions;                    // 0x0368(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCommonButtonBase>          SecondaryActionBarButtonClassOverride;             // 0x0378(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BoundActionBarWithSecondaryBar">();
	}
	static class UBoundActionBarWithSecondaryBar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBoundActionBarWithSecondaryBar>();
	}
};

// Class SaveTheWorldUI.BoundActionBarSTW
// 0x0018 (0x0398 - 0x0380)
class UBoundActionBarSTW final : public UBoundActionBarWithSecondaryBar
{
public:
	uint8                                         Pad_380[0x18];                                     // 0x0380(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BoundActionBarSTW">();
	}
	static class UBoundActionBarSTW* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBoundActionBarSTW>();
	}
};

// Class SaveTheWorldUI.FortEventStoreOfferDetailsScreen
// 0x0038 (0x0A18 - 0x09E0)
class UFortEventStoreOfferDetailsScreen final : public UFortStoreFrontOfferDetailsWidgetBase
{
public:
	struct FDataTableRowHandle                    BackAction;                                        // 0x09E0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    UndoAction;                                        // 0x09F8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsPurchasing;                                     // 0x0A10(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A11[0x7];                                      // 0x0A11(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_HandleScreenClosed();
	void HandleBack(bool* bPassThrough);
	void HandleUndo(bool* bPassThrough);
	void SetIsPurchasing(bool bNewIsPurchasing);

	bool GetIsPurchasing() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventStoreOfferDetailsScreen">();
	}
	static class UFortEventStoreOfferDetailsScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventStoreOfferDetailsScreen>();
	}
};

// Class SaveTheWorldUI.FortOutpostSubscreenBase
// 0x0018 (0x06D0 - 0x06B8)
class UFortOutpostSubscreenBase : public UCommonActivatablePanelLegacy
{
public:
	struct FDataTableRowHandle                    BackActionInputRowHandle;                          // 0x06B8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void BP_HandleBackAction(bool* bPassThrough);
	void HandleBackAction(bool* bPassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortOutpostSubscreenBase">();
	}
	static class UFortOutpostSubscreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortOutpostSubscreenBase>();
	}
};

// Class SaveTheWorldUI.FortIronCityContentScreen
// 0x0000 (0x06D0 - 0x06D0)
class UFortIronCityContentScreen final : public UFortOutpostSubscreenBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortIronCityContentScreen">();
	}
	static class UFortIronCityContentScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortIronCityContentScreen>();
	}
};

// Class SaveTheWorldUI.FortItemManagementItemPopupMenu_STW
// 0x0008 (0x06E0 - 0x06D8)
class UFortItemManagementItemPopupMenu_STW final : public UFortPopupMenu_Legacy
{
public:
	uint8                                         Pad_6D8[0x8];                                      // 0x06D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCompareAction();
	void HandleItemChanged(bool bItemChanged, bool bAmmoChanged, bool bIngredientsChanged);
	void MulchItem();

	class UFortItemManagementItemTileButton_STW* GetHostButton() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemManagementItemPopupMenu_STW">();
	}
	static class UFortItemManagementItemPopupMenu_STW* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemManagementItemPopupMenu_STW>();
	}
};

// Class SaveTheWorldUI.FortModalMenu_STW
// 0x0008 (0x0580 - 0x0578)
class UFortModalMenu_STW final : public UCommonActivatableWidget
{
public:
	TWeakObjectPtr<class UObject>                 ContextProvidingObject;                            // 0x0578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetContextProvider(const class UObject* InContextProvidingObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortModalMenu_STW">();
	}
	static class UFortModalMenu_STW* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortModalMenu_STW>();
	}
};

// Class SaveTheWorldUI.FortOutpostPermissionsScreen
// 0x0008 (0x06D8 - 0x06D0)
class UFortOutpostPermissionsScreen final : public UFortOutpostSubscreenBase
{
public:
	uint8                                         Pad_6D0[0x8];                                      // 0x06D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortOutpostPermissionsScreen">();
	}
	static class UFortOutpostPermissionsScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortOutpostPermissionsScreen>();
	}
};

// Class SaveTheWorldUI.FortOutpostScreenStormShieldBase
// 0x0000 (0x06D0 - 0x06D0)
class UFortOutpostScreenStormShieldBase final : public UFortOutpostSubscreenBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortOutpostScreenStormShieldBase">();
	}
	static class UFortOutpostScreenStormShieldBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortOutpostScreenStormShieldBase>();
	}
};

// Class SaveTheWorldUI.FortQuestMapViewer
// 0x0080 (0x04C0 - 0x0440)
class UFortQuestMapViewer final : public UCommonUserWidget
{
public:
	uint8                                         Pad_440[0x10];                                     // 0x0440(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_PageRight;                                  // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PageLeft;                                   // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Page;                                         // 0x0468(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                               SizeBox_Viewer;                                    // 0x0470(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCanvasPanel*                           CanvasPanel_Cosmetic;                              // 0x0478(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortQuestMapScreen*                    ParentScreen;                                      // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortQuestMapNodeLayout*                NodeLayout;                                        // 0x0488(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_490[0x30];                                     // 0x0490(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleLayoutOutroAnimationFinished();
	void OnPlayLayoutFadeInAnimation();
	void OnPlayLayoutOutroAnimation(EViewerNavigationDirection TravelDirection);
	void OnTryUpdateUserWidgetColor(class UUserWidget* Widget, const struct FSlateColor& OverrideColor);
	void UpdateViewerData();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQuestMapViewer">();
	}
	static class UFortQuestMapViewer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuestMapViewer>();
	}
};

// Class SaveTheWorldUI.FortStoreOpeningCardPack
// 0x0060 (0x05D8 - 0x0578)
class UFortStoreOpeningCardPack final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EFortStoreState                               CachedStoreState;                                  // 0x0580(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreSummary*                      Store_Summary;                                     // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FCard>                          CachedCards;                                       // 0x0590(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortStoreSummaryItemButton> CardItemWidgetType;                                // 0x05A0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCommonButtonStyle>         CardItemWidgetStyle;                               // 0x05A8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UFortStoreSummaryItemButton*>    CachedCardArraySinglePack;                         // 0x05B0(0x0010)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UFortStoreSummaryItemButton*>    CachedCardArrayMultiplePacks;                      // 0x05C0(0x0010)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D0[0x8];                                      // 0x05D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleInputMethodChanged_BP(ECommonInputType CommonInput);
	void HandleStoreStateChange_BP(EFortStoreState NewState);
	void HandleSummaryAdd();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortStoreOpeningCardPack">();
	}
	static class UFortStoreOpeningCardPack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortStoreOpeningCardPack>();
	}
};

// Class SaveTheWorldUI.FortUIStateWidget_Cinematic
// 0x0008 (0x0598 - 0x0590)
class UFortUIStateWidget_Cinematic final : public UFortUIStateWidgetBase
{
public:
	uint8                                         Pad_590[0x8];                                      // 0x0590(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIStateWidget_Cinematic">();
	}
	static class UFortUIStateWidget_Cinematic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIStateWidget_Cinematic>();
	}
};

// Class SaveTheWorldUI.FortUIStateWidget_STW
// 0x0038 (0x05C8 - 0x0590)
class UFortUIStateWidget_STW : public UFortUIStateWidgetBase
{
public:
	class UMainMenu_STW*                          MainMenu_STW;                                      // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortActivatableChatWidget*             ChatWidget_STW;                                    // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBottomBar_STW*                         BottomBar_STW;                                     // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    OpenChatAction;                                    // 0x05A8(0x0018)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C0[0x8];                                      // 0x05C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIStateWidget_STW">();
	}
	static class UFortUIStateWidget_STW* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIStateWidget_STW>();
	}
};

// Class SaveTheWorldUI.MgmtTabsScreen_STW
// 0x0008 (0x0580 - 0x0578)
class UMgmtTabsScreen_STW final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MgmtTabsScreen_STW">();
	}
	static class UMgmtTabsScreen_STW* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMgmtTabsScreen_STW>();
	}
};

// Class SaveTheWorldUI.ObjectivesPage
// 0x0030 (0x06E8 - 0x06B8)
class UObjectivesPage final : public UCommonActivatablePanelLegacy
{
public:
	struct FDataTableRowHandle                    LeaveInventoryInputHandle;                         // 0x06B8(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    BackInputHandle;                                   // 0x06D0(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)

public:
	void BackAction(bool* bPassthrough);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectivesPage">();
	}
	static class UObjectivesPage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectivesPage>();
	}
};

// Class SaveTheWorldUI.STWDeathWidget
// 0x0048 (0x0738 - 0x06F0)
class USTWDeathWidget final : public UFortActivatablePanel
{
public:
	struct FDataTableRowHandle                    PreviousTeammateActionRowHandle;                   // 0x06F0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    NextTeammateActionRowHandle;                       // 0x0708(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    RespawnActionRowHandle;                            // 0x0720(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)

public:
	void DisableAndHideNavActions();
	void DisableAndHideRespawnAction();
	void EnableAndShowNavActions();
	void HandleNextTeammateAction(bool* bPassThrough);
	void HandlePreviousTeammateAction(bool* bPassThrough);
	void HandleRespawnAction(bool* bPassThrough);
	void ToggleRespawnAction(bool bEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"STWDeathWidget">();
	}
	static class USTWDeathWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTWDeathWidget>();
	}
};

// Class SaveTheWorldUI.XpBoostsRootWidget
// 0x0040 (0x06F8 - 0x06B8)
class UXpBoostsRootWidget final : public UCommonActivatablePanelLegacy
{
public:
	uint8                                         Pad_6B8[0x8];                                      // 0x06B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    BackInputActionRowHandle;                          // 0x06C0(0x0018)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ShowLeaderboardInputActionRowHandle;               // 0x06D8(0x0018)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bCanShowLeaderboard;                               // 0x06F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6F1[0x7];                                      // 0x06F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleBack(bool* bPassThrough);
	void HandleShowLeaderboard(bool* bPassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XpBoostsRootWidget">();
	}
	static class UXpBoostsRootWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXpBoostsRootWidget>();
	}
};

// Class SaveTheWorldUI.FortArmoryScreen
// 0x0028 (0x05A0 - 0x0578)
class UFortArmoryScreen final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    BackActionRowHandle;                               // 0x0580(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_598[0x8];                                      // 0x0598(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCustomBackAction();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortArmoryScreen">();
	}
	static class UFortArmoryScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortArmoryScreen>();
	}
};

// Class SaveTheWorldUI.FortArmoryScreen_Legacy
// 0x0000 (0x06F0 - 0x06F0)
class UFortArmoryScreen_Legacy final : public UFortActivatablePanel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortArmoryScreen_Legacy">();
	}
	static class UFortArmoryScreen_Legacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortArmoryScreen_Legacy>();
	}
};

// Class SaveTheWorldUI.FortCommandScreen
// 0x0068 (0x05E0 - 0x0578)
class UFortCommandScreen final : public UCommonActivatableWidget
{
public:
	struct FDataTableRowHandle                    ShowAllStatsActionData;                            // 0x0578(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    InspectHeroActionData;                             // 0x0590(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   ProfileScreenClass;                                // 0x05A8(0x0030)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D8[0x8];                                      // 0x05D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleShowAllStats();
	void HandleUpgradeInspectHero();

	void ShowBoostsScreen() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCommandScreen">();
	}
	static class UFortCommandScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCommandScreen>();
	}
};

// Class SaveTheWorldUI.FortCollectionBookGenericRewardWidget
// 0x0018 (0x0458 - 0x0440)
class UFortCollectionBookGenericRewardWidget : public UCommonUserWidget
{
public:
	uint8                                         bUpdateVisibilityBasedOnRewardExistence : 1;       // 0x0440(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ESlateVisibility                              VisibilityWhenNoRewardSpecified;                   // 0x0444(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESlateVisibility                              VisibilityWhenRewardSpecified;                     // 0x0445(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_446[0x2];                                      // 0x0446(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCollectionBookRewardCardWidget*    RewardCardWidget;                                  // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECollectionBookRewardStatus                   RewardStatus;                                      // 0x0450(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearRewards();
	void OnRewardStatusChanged(ECollectionBookRewardStatus NewStatus);
	void SetCurrentItemToDisplay(class UFortItem* ItemToDisplay);
	void SetRewards(const struct FFortRewardInfo& Rewards);
	void SetRewardStatus(ECollectionBookRewardStatus Status);

	ECollectionBookRewardStatus GetRewardStatus() const;
	bool HasRewards() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookGenericRewardWidget">();
	}
	static class UFortCollectionBookGenericRewardWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookGenericRewardWidget>();
	}
};

// Class SaveTheWorldUI.FortCollectionBookHelpWidget
// 0x0000 (0x06F0 - 0x06F0)
class UFortCollectionBookHelpWidget final : public UFortActivatablePanel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookHelpWidget">();
	}
	static class UFortCollectionBookHelpWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookHelpWidget>();
	}
};

// Class SaveTheWorldUI.FortCollectionBookItemPopupMenu
// 0x0008 (0x06E0 - 0x06D8)
class UFortCollectionBookItemPopupMenu final : public UFortPopupMenu_Legacy
{
public:
	uint8                                         Pad_6D8[0x8];                                      // 0x06D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CanItemBePurchased();
	bool CanItemBeUnslotted();
	void HandleItemChanged(bool bItemChanged, bool bAmmoChanged, bool bIngredientsChanged);
	void HandleItemUpdated();

	class UFortCollectionBookSlotButton* GetHostButton() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookItemPopupMenu">();
	}
	static class UFortCollectionBookItemPopupMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookItemPopupMenu>();
	}
};

// Class SaveTheWorldUI.FortCollectionBookOverviewWidget
// 0x0048 (0x0488 - 0x0440)
class UFortCollectionBookOverviewWidget final : public UCommonUserWidget
{
public:
	TMulticastInlineDelegate<void(class UFortCollectionBookPage* SelectedPage)> OnCollectionBookPageSelected;                      // 0x0440(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFortCollectionBookPage* ClickedPage)> OnCollectionBookPageClicked;                       // 0x0450(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortCollectionBookPage*                LastSelectedPage;                                  // 0x0460(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCollectionBookCategory*            LastSelectedCategory;                              // 0x0468(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortCollectionBookCategory*>    CategoryObjectPool;                                // 0x0470(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UCommonTreeView*                        PageTreeViewWidget;                                // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandlePagesChanged(class UFortCollectionBookManager* CBManager);
	void OnActivated();
	void OnDeactivated();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookOverviewWidget">();
	}
	static class UFortCollectionBookOverviewWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookOverviewWidget>();
	}
};

// Class SaveTheWorldUI.FortCollectionBookPageCompletionRewardWidget
// 0x0000 (0x0458 - 0x0458)
class UFortCollectionBookPageCompletionRewardWidget final : public UFortCollectionBookGenericRewardWidget
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookPageCompletionRewardWidget">();
	}
	static class UFortCollectionBookPageCompletionRewardWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookPageCompletionRewardWidget>();
	}
};

// Class SaveTheWorldUI.FortCollectionBookPageDetailsWidget
// 0x0070 (0x04B0 - 0x0440)
class UFortCollectionBookPageDetailsWidget final : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                       PageCompletionText;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortMaterialProgressBar*               ProgressBar;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCollectionBookPageCompletionRewardWidget* PageRewardWidget;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      RewardDetailsButton;                               // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCollectionBookPage*                DetailsPage;                                       // 0x0460(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   RewardDetailsModalWidgetClass;                     // 0x0468(0x0030)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   ModalTitle;                                        // 0x0498(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	class UFortCollectionBookRewardModalWidget*   RewardDetailsModalWidget;                          // 0x04A8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnDetailsPageChanged(const class UFortCollectionBookPage* InNewDetailsPage);
	void OnPageProgressionUpdated(int32 TotalFilledSlots, int32 TotalSlots, EFortCollectionBookState State);
	void OnSlotItemComplete(const class UFortAccountItem* SlottedItem, class FName SlotId);
	void OnUnslotItemComplete(const class UFortAccountItem* SlottedItem, const class UFortAccountItem* OldItem, class FName SlotId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookPageDetailsWidget">();
	}
	static class UFortCollectionBookPageDetailsWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookPageDetailsWidget>();
	}
};

// Class SaveTheWorldUI.FortCollectionBookPageListWidget
// 0x0030 (0x1830 - 0x1800)
class UFortCollectionBookPageListWidget final : public UCommonButtonBase
{
public:
	uint8                                         Pad_1800[0x8];                                     // 0x1800(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       PageNameWidget;                                    // 0x1808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonNumericTextBlock*                AvailableSlotsWidget;                              // 0x1810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       PageCompletionWidget;                              // 0x1818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UObject>                 AssociatedPageOrCategory;                          // 0x1820(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsExpanded;                                       // 0x1828(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1829[0x7];                                     // 0x1829(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCategoryDetailsUpdated(int32 AvailableSlots, int32 FilledSlots, int32 TotalSlots);
	void OnPageDetailsUpdated(int32 AvailableSlots, int32 FilledSlots, int32 TotalSlots, EFortCollectionBookState State);
	void OnSlottedItemOperationComplete(const class UFortAccountItem* SlottedItem, class FName SlotId);
	void SetupAsCategory(class UFortCollectionBookCategory* Category);
	void SetupAsPage(class UFortCollectionBookPage* Page);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookPageListWidget">();
	}
	static class UFortCollectionBookPageListWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookPageListWidget>();
	}
};

// Class SaveTheWorldUI.FortCollectionBookPicker
// 0x0030 (0x05A8 - 0x0578)
class UFortCollectionBookPicker final : public UFortItemPickerBase
{
public:
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortMulchConfirmationModalWidget> MulchConfirmationModalClass;                       // 0x0580(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_588[0x10];                                     // 0x0588(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItem*                       CurrentSlottedItem;                                // 0x0598(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortMulchConfirmationModalWidget*      MulchConfirmationModal;                            // 0x05A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HideMulchConfirmationModal();
	void NotifyPanelActivated();
	void NotifyPanelDeactivated();
	void OnCollectComplete();
	void ShowMulchConfirmationModal();
	void ShowMulchDialogForItem(class UFortItem* ItemToMulch);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookPicker">();
	}
	static class UFortCollectionBookPicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookPicker>();
	}
};

// Class SaveTheWorldUI.FortCollectionBookPrimaryPanel
// 0x00E0 (0x0658 - 0x0578)
class UFortCollectionBookPrimaryPanel final : public UCommonActivatableWidget
{
public:
	TMulticastInlineDelegate<void(class UFortCollectionBookPage* SelectedPage)> OnCollectionBookPageSelectedDelegate;              // 0x0578(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFortCollectionBookPage* ClickedPage)> OnCollectionBookPageClickedDelegate;               // 0x0588(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFortCollectionBookSection* ClickedSection)> OnCollectionBookSectionClickedDelegate;            // 0x0598(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    BackActionRowHandle;                               // 0x05A8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    SummonInfoPanelActionRowHandle;                    // 0x05C0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UFortCollectionBookOverviewWidget*      OverviewWidget;                                    // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTileView*                        SectionTileViewWidget;                             // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECollectionBookPrimaryNavTarget               CurrentNavTarget;                                  // 0x05E8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E9[0x7];                                      // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCollectionBookSection*             LastClickedSection;                                // 0x05F0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                LastSelectedWidget;                                // 0x05F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_600[0x58];                                     // 0x0600(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void NavigateToTarget(ECollectionBookPrimaryNavTarget NavTarget);
	void OnBackActionExecuted();
	void OnCollectionBookPageClicked(const class UFortCollectionBookPage* ClickedPage);
	void OnCollectionBookPageSelected(const class UFortCollectionBookPage* SelectedPage);
	void OnCollectionBookSectionClicked(const class UFortCollectionBookSection* ClickedSection);
	void OnInputMethodChanged(ECommonInputType CurrentInputType);
	void OnSummonInfoPanelExecuted(bool* bPassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookPrimaryPanel">();
	}
	static class UFortCollectionBookPrimaryPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookPrimaryPanel>();
	}
};

// Class SaveTheWorldUI.FortCollectionBookPrimaryPanel_Legacy
// 0x00D0 (0x0788 - 0x06B8)
class UFortCollectionBookPrimaryPanel_Legacy final : public UCommonActivatablePanelLegacy
{
public:
	TMulticastInlineDelegate<void(class UFortCollectionBookPage* SelectedPage)> OnCollectionBookPageSelectedDelegate;              // 0x06B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFortCollectionBookPage* ClickedPage)> OnCollectionBookPageClickedDelegate;               // 0x06C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFortCollectionBookSection* ClickedSection)> OnCollectionBookSectionClickedDelegate;            // 0x06D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    BackActionRowHandle;                               // 0x06E8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    SummonInfoPanelActionRowHandle;                    // 0x0700(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UFortCollectionBookOverviewWidget*      OverviewWidget;                                    // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTileView*                        SectionTileViewWidget;                             // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECollectionBookPrimaryNavTarget               CurrentNavTarget;                                  // 0x0728(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_729[0x7];                                      // 0x0729(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCollectionBookSection*             LastClickedSection;                                // 0x0730(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_738[0x50];                                     // 0x0738(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBackActionExecuted(bool* bPassThrough);
	void OnCollectionBookPageClicked(const class UFortCollectionBookPage* ClickedPage);
	void OnCollectionBookPageSelected(const class UFortCollectionBookPage* SelectedPage);
	void OnCollectionBookSectionClicked(const class UFortCollectionBookSection* ClickedSection);
	void OnInputMethodChanged(ECommonInputType CurrentInputType);
	void OnSummonInfoPanelExecuted(bool* bPassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookPrimaryPanel_Legacy">();
	}
	static class UFortCollectionBookPrimaryPanel_Legacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookPrimaryPanel_Legacy>();
	}
};

// Class SaveTheWorldUI.FortCollectionBookProgressionRewardDetailInspectWidget
// 0x0020 (0x0460 - 0x0440)
class UFortCollectionBookProgressionRewardDetailInspectWidget final : public UCommonUserWidget
{
public:
	class UCommonNumericTextBlock*                LevelTextWidget;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortRewardInfoWidget*                  RewardWidget;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                CheckmarkImage;                                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_458[0x8];                                      // 0x0458(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnXPRequiredChanged(int32 NewXPRequired);
	void SetAssociatedLevel(int32 Level);

	int32 GetXPRequired() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookProgressionRewardDetailInspectWidget">();
	}
	static class UFortCollectionBookProgressionRewardDetailInspectWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookProgressionRewardDetailInspectWidget>();
	}
};

// Class SaveTheWorldUI.FortCollectionBookProgressionRewardsModalWidget
// 0x0070 (0x0728 - 0x06B8)
class UFortCollectionBookProgressionRewardsModalWidget final : public UCommonActivatablePanelLegacy
{
public:
	TSoftClassPtr<class UClass>                   RewardWidgetClass;                                 // 0x06B8(0x0030)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMargin                                RewardWidgetPadding;                               // 0x06E8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	int32                                         NumRewardsToShow;                                  // 0x06F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6FC[0x4];                                      // 0x06FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBox*                           RewardBoxWidget;                                   // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                           MajorRewardBoxWidget;                              // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       XPTextWidget;                                      // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonNumericTextBlock*                LevelTextWidget;                                   // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonGroupBase*                 ButtonGroup;                                       // 0x0720(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Dismiss();
	void InspectItemBP(class UFortItem* Item);
	void OnLevelProgressionSet(int32 CurrentLevel, float NextLvlPct, int32 MaxAchievedLevel);
	void OnSelectedButtonChanged(class UCommonButtonBase* SelectedButton, int32 ButtonIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookProgressionRewardsModalWidget">();
	}
	static class UFortCollectionBookProgressionRewardsModalWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookProgressionRewardsModalWidget>();
	}
};

// Class SaveTheWorldUI.FortCollectionBookProgressionRewardsPreviewWidget
// 0x0010 (0x0450 - 0x0440)
class UFortCollectionBookProgressionRewardsPreviewWidget final : public UCommonUserWidget
{
public:
	class UFortCollectionBookProgressionRewardWidget* NextRewardWidget;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCollectionBookProgressionRewardWidget* NextMajorRewardWidget;                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookProgressionRewardsPreviewWidget">();
	}
	static class UFortCollectionBookProgressionRewardsPreviewWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookProgressionRewardsPreviewWidget>();
	}
};

// Class SaveTheWorldUI.FortCollectionBookProgressionRewardWidget
// 0x0010 (0x0468 - 0x0458)
class UFortCollectionBookProgressionRewardWidget final : public UFortCollectionBookGenericRewardWidget
{
public:
	class UCommonNumericTextBlock*                LevelTextWidget;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       DisplayNameWidget;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetAssociatedLevel(int32 Level);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookProgressionRewardWidget">();
	}
	static class UFortCollectionBookProgressionRewardWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookProgressionRewardWidget>();
	}
};

// Class SaveTheWorldUI.FortCollectionBookProgressWidget
// 0x0068 (0x04A8 - 0x0440)
class UFortCollectionBookProgressWidget final : public UCommonUserWidget
{
public:
	int32                                         CachedXPLevel;                                     // 0x0440(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CachedXPCompletionPct;                             // 0x0444(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   RewardDetailsModalWidgetClass;                     // 0x0448(0x0030)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCollectionBookProgressionRewardsPreviewWidget* ProgressionRewardsPreviewWidget;                   // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       XPTextWidget;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonNumericTextBlock*                LevelTextWidget;                                   // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      DetailsButtonWidget;                               // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCollectionBookPageDetailsWidget*   PageDetailsWidget;                                 // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCollectionBookProgressionRewardsModalWidget* DetailsModalWidget;                                // 0x04A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleDetailsModalWidgetDeactivated();
	void OnCollectionBookLevelChanged(int32 NewLevel);
	void OnCollectionBookLevelProgressionChanged(float NewCompletionPct);
	void OnCollectionBookPageSelected(const class UFortCollectionBookPage* SelectedPage);
	void OnCollectionBookPreviewXPChange(float PreviewCompletionPct);
	void OnInventoryUpdated();
	void OnSlottedItemOperationComplete(const class UFortAccountItem* ItemSlotted, class FName SlotId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookProgressWidget">();
	}
	static class UFortCollectionBookProgressWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookProgressWidget>();
	}
};

// Class SaveTheWorldUI.FortCollectionBookRecycleSlotResultsWidget
// 0x0018 (0x0458 - 0x0440)
class UFortCollectionBookRecycleSlotResultsWidget final : public UCommonUserWidget
{
public:
	class UPanelWidget*                           RecycleResultsWidget;                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortItemCardSize                             ItemCardSize;                                      // 0x0448(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItem*                       ItemToRecycle;                                     // 0x0450(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetCurrentItemToRecycle(class UFortAccountItem* InItemToRecycle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookRecycleSlotResultsWidget">();
	}
	static class UFortCollectionBookRecycleSlotResultsWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookRecycleSlotResultsWidget>();
	}
};

// Class SaveTheWorldUI.FortCollectionBookRewardCardWidget
// 0x0098 (0x04D8 - 0x0440)
class UFortCollectionBookRewardCardWidget final : public UCommonUserWidget
{
public:
	TMulticastInlineDelegate<void(class UFortItem* DisplayedItem)> OnDisplayedItemChangedEvent;                       // 0x0440(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortMultiSizeItemCard*                 ItemCardWidget;                                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                MultiItemRewardOverlay;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                ChoiceRewardOverlay;                               // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                CheckmarkImage;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         UpdateCardInterval;                                // 0x0470(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortItemCardSize                             ItemCardSize;                                      // 0x0474(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisplayAsRewardCard;                              // 0x0475(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_476[0x2];                                      // 0x0476(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRewardInfo                        RepresentedRewards;                                // 0x0478(0x0040)(Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortItem*>                      DummyItems;                                        // 0x04B8(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FTimerHandle                           UpdateCardTimer;                                   // 0x04C8(0x0008)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4D0[0x8];                                      // 0x04D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearRewards();
	void SetRewards(const struct FFortRewardInfo& Rewards);

	bool HasRewards() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookRewardCardWidget">();
	}
	static class UFortCollectionBookRewardCardWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookRewardCardWidget>();
	}
};

// Class SaveTheWorldUI.FortCollectionBookRewardModalWidget
// 0x0060 (0x0718 - 0x06B8)
class UFortCollectionBookRewardModalWidget final : public UCommonActivatablePanelLegacy
{
public:
	class UCommonTextBlock*                       TitleWidget;                                       // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortRewardInfoWidget*                  RewardWidget;                                      // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
