#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: score_manager_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass score_manager_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class score_manager_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass score_manager_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class score_manager_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<score_manager_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass score_manager_device.score_manager_device
// 0x0070 (0x0130 - 0x00C0)
class Uscore_manager_device final : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0xD4D6CCF5_MaxTriggersEvent;               // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x5614AC82_ScoreOutputEvent;               // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x5BDC7A5C_EnableFunction;                 // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC9184E23_DisableFunction;                // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x4D1E6968_ResetFunction;                  // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x5BB90C4F_ActivateFunction;               // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x3FD2E9AE_IncrementFunction;              // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x96E8FCF3_DecrementFunction;              // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type* __verse_0x14074D7E_AwardScoreFunction;             // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_int*       __verse_0xAF5527A7_SetScoreAwardFunction;          // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_int*       __verse_0xE5CF35B4_GetScoreAwardFunction;          // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC8A2BD09_SetToAgentScoreFunction;        // 0x0118(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0xA126CF24_GetCurrentScoreFunction;        // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fscore__manager__device_N_RActivate(const struct score_manager_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fscore__manager__device_N_RActivate_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fscore__manager__device_N_RAwardScore_L_Nagent_M_Nint_R(const struct score_manager_device::Ftuple_Lagent_Mint_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fscore__manager__device_N_RDecrement(const struct score_manager_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fscore__manager__device_N_RDecrement_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fscore__manager__device_N_RDisable(const struct score_manager_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fscore__manager__device_N_RDisable_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fscore__manager__device_N_REnable(const struct score_manager_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fscore__manager__device_N_REnable_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fDevices_2fscore__manager__device_N_RGetCurrentScore_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fDevices_2fscore__manager__device_N_RGetScoreAward(const struct score_manager_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fscore__manager__device_N_RIncrement(const struct score_manager_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fscore__manager__device_N_RIncrement_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fscore__manager__device_N_RReset(const struct score_manager_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fscore__manager__device_N_RReset_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fscore__manager__device_N_RSetScoreAward_L_Nint_R(int64 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fscore__manager__device_N_RSetToAgentScore_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"score_manager_device">();
	}
	static class Uscore_manager_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uscore_manager_device>();
	}
};

}

