#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScoutDroneRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ScoutDroneRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "TargetingSystem_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "ModularGameplay_classes.hpp"


namespace SDK
{

// Class ScoutDroneRuntime.FortGameplayAbility_ScoutDrone_Dive
// 0x0230 (0x0DF8 - 0x0BC8)
class UFortGameplayAbility_ScoutDrone_Dive final : public UFortGameplayAbility
{
public:
	uint8                                         Pad_BC8[0x10];                                     // 0x0BC8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortScoutDroneDiveTransitionData      EaseInData;                                        // 0x0BD8(0x0040)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FFortScoutDroneDiveTransitionData      EaseOutData;                                       // 0x0C18(0x0040)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C58[0x8];                                      // 0x0C58(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DiveUpdateInterval;                                // 0x0C60(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DiveSpeedIncrease;                                 // 0x0C98(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinSpeedToDive;                                    // 0x0CD0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinDistToGround;                                   // 0x0D08(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TargetPitchToDive;                                 // 0x0D40(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DivingGravityScale;                                // 0x0D78(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxSpeedDivingGravityScale;                        // 0x0DB0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_DE8[0x10];                                     // 0x0DE8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnDroneStartedDiving();
	void BP_OnDroneStoppedDiving();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayAbility_ScoutDrone_Dive">();
	}
	static class UFortGameplayAbility_ScoutDrone_Dive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayAbility_ScoutDrone_Dive>();
	}
};

// Class ScoutDroneRuntime.FortGameplayAbility_ScoutDrone_TargetingBase
// 0x0058 (0x0C20 - 0x0BC8)
class UFortGameplayAbility_ScoutDrone_TargetingBase : public UFortGameplayAbility
{
public:
	class UTargetingPreset*                       TargetingPreset;                                   // 0x0BC8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTargetingRequestHandle                AsyncTargetingHandle;                              // 0x0BD0(0x0004)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BD4[0x4];                                      // 0x0BD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TargetingTimerHandle;                              // 0x0BD8(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TargetingInterval;                                 // 0x0BE0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bUseControllerAsInstigator;                        // 0x0C18(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C19[0x7];                                      // 0x0C19(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnTargetsFound(const struct FTargetingRequestHandle& TargetingHandle);
	void StartTargeting();
	void StopTargeting();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayAbility_ScoutDrone_TargetingBase">();
	}
	static class UFortGameplayAbility_ScoutDrone_TargetingBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayAbility_ScoutDrone_TargetingBase>();
	}
};

// Class ScoutDroneRuntime.FortGameplayAbility_ScoutDrone_SpeedBoost
// 0x0150 (0x0D70 - 0x0C20)
class UFortGameplayAbility_ScoutDrone_SpeedBoost final : public UFortGameplayAbility_ScoutDrone_TargetingBase
{
public:
	struct FGameplayTag                           DoorBashCueTag;                                    // 0x0C20(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C2C[0x4];                                      // 0x0C2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            DamageGameplayEffectClass;                         // 0x0C30(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           DoorBashPawnLaunchGameplayCueTag;                  // 0x0C38(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C44[0x4];                                      // 0x0C44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DoorBashEnabledHotfix;                             // 0x0C48(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DoorBashSphereRadiusForPawnLaunch;                 // 0x0C80(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DoorBashScalarForPawnLaunch;                       // 0x0CB8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<EObjectTypeQuery>                      DoorBashCollisionTypesForPawn;                     // 0x0CF0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DoorBashEnabled;                                   // 0x0D00(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DamageOnBoostEnabled;                              // 0x0D38(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	void OnBoostedIntoActor(const struct FHitResult& HitResult);
	void OnDoorBashed(const struct FHitResult& HitResult, class UFortBuildingWallDoorComponent* BashedDoor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayAbility_ScoutDrone_SpeedBoost">();
	}
	static class UFortGameplayAbility_ScoutDrone_SpeedBoost* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayAbility_ScoutDrone_SpeedBoost>();
	}
};

// Class ScoutDroneRuntime.FortScoutDroneAnalyticsComponent
// 0x00D8 (0x01B8 - 0x00E0)
class UFortScoutDroneAnalyticsComponent final : public UFortControllerComponent
{
public:
	float                                         SessionStartTime;                                  // 0x00E0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SessionLength;                                     // 0x00E4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinSessionLength;                                  // 0x00E8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                         DistanceTraveled;                                  // 0x0120(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumberOfContainersInteractedWith;                  // 0x0124(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           DismissalReason;                                   // 0x0128(0x000C)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumberOfItemsPickedUp;                             // 0x0134(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FString>                         DBNOCarriedPlayers;                                // 0x0138(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	int32                                         NumberOfEnemiesPassivelyMarked;                    // 0x0148(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumberOfEnemiesMarkedOnCaw;                        // 0x014C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumberOfCaws;                                      // 0x0150(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_154[0xC];                                      // 0x0154(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DistanceTraveledUpdateInterval;                    // 0x0160(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           DistanceTraveledUpdateTimerHandle;                 // 0x0198(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                LastRecorderDroneLocation;                         // 0x01A0(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortScoutDroneAnalyticsComponent">();
	}
	static class UFortScoutDroneAnalyticsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortScoutDroneAnalyticsComponent>();
	}
};

// Class ScoutDroneRuntime.FortScoutDroneAnimInstance
// 0x0220 (0x0710 - 0x04F0)
class UFortScoutDroneAnimInstance final : public UFortBaseAnimInstance
{
public:
	class UFortScoutDroneMovementComponent*       FortScoutDroneMovementComponent;                   // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        YawDeltaLastTick;                                  // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ActorCurrentRotationTick;                          // 0x0500(0x0018)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	double                                        YawDeltaCurrentTick;                               // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ActorRotationLastTick;                             // 0x0520(0x0018)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          IsFlying;                                          // 0x0538(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentVelocity;                                   // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        LastVelocity;                                      // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Velocity;                                          // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ForwardInputAlpha;                                 // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        StrafeInputAlpha;                                  // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               DroneRotation;                                     // 0x0568(0x0018)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	double                                        Acceleration;                                      // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortScoutDrone*                        ScoutDrone;                                        // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsBoosting;                                        // 0x0590(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDiving;                                          // 0x0591(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_592[0x6];                                      // 0x0592(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AimPitch;                                          // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        NegativeAimPitch;                                  // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               FinalFanRotationL;                                 // 0x05A8(0x0018)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               FinalFanRotationR;                                 // 0x05C0(0x0018)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	double                                        FanIdleSpeed;                                      // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        FanAuthoredSpeed;                                  // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        FanIdleAuthoredSpeed;                              // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        FanBwdSpeed;                                       // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        FanFwdSpeed;                                       // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        TurnNoiseAlpha;                                    // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        LeanAlpha;                                         // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        TurnAlpha;                                         // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsColliding;                                       // 0x0618(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFlyingBwd;                                       // 0x0619(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldExitFromFlying;                              // 0x061A(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldExitFromDiving;                              // 0x061B(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EarlyIntoLoop;                                     // 0x061C(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61D[0x3];                                      // 0x061D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AccelerationZ;                                     // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLeftStrafe;                                      // 0x0628(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WasStrafing;                                       // 0x0629(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62A[0x6];                                      // 0x062A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GroundDistance;                                    // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasDivingConditionBeenMet;                         // 0x0638(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsItemAttached;                                    // 0x0639(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPlayerAttached;                                  // 0x063A(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_63B[0x5];                                      // 0x063B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FlapTime;                                          // 0x0640(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FlapRandomPick;                                    // 0x0648(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFlapSmall;                                       // 0x064C(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64D[0x3];                                      // 0x064D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FlapRandomMaxRange;                                // 0x0650(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_654[0x4];                                      // 0x0654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FlapSmallTimeThreshold;                            // 0x0658(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        FlapBigTimeThreshold;                              // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        FlapSmallResetDelayDuration;                       // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        FlapBigResetDelayDuration;                         // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFlapBig;                                         // 0x0678(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_679[0x7];                                      // 0x0679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        VerticalInputAlpha;                                // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WasVerticalUp;                                     // 0x0688(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFlyingVerticalUp;                                // 0x0689(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldExitFromBoostOutro;                          // 0x068A(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasSpawned;                                        // 0x068B(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldExitFromSpawning;                            // 0x068C(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldAllowTransition;                             // 0x068D(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StateRuleFromBoostOutroToFlying;                   // 0x068E(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WasBoosting;                                       // 0x068F(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         SpeedBoostForceBoostVelocity;                      // 0x0690(0x0038)(BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	struct FScalableFloat                         SpeedBoostMaxSpeedIncrease;                        // 0x06C8(0x0038)(BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	bool                                          IsFlappingTime;                                    // 0x0700(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_701[0xF];                                      // 0x0701(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortScoutDroneAnimInstance">();
	}
	static class UFortScoutDroneAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortScoutDroneAnimInstance>();
	}
};

// Class ScoutDroneRuntime.FortScoutDroneGlove
// 0x0050 (0x1910 - 0x18C0)
class AFortScoutDroneGlove final : public AFortWeapon
{
public:
	struct FScalableFloat                         HoldToDeployTime;                                  // 0x18C0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_18F8[0x18];                                    // 0x18F8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortScoutDroneGlove">();
	}
	static class AFortScoutDroneGlove* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortScoutDroneGlove>();
	}
};

// Class ScoutDroneRuntime.FortGameplayAbility_ScoutDrone_Activate
// 0x0020 (0x0BE8 - 0x0BC8)
class UFortGameplayAbility_ScoutDrone_Activate final : public UFortGameplayAbility
{
public:
	TSubclassOf<class AFortScoutDrone>            RCActorClass;                                      // 0x0BC8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                SpawnOffset;                                       // 0x0BD0(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayAbility_ScoutDrone_Activate">();
	}
	static class UFortGameplayAbility_ScoutDrone_Activate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayAbility_ScoutDrone_Activate>();
	}
};

// Class ScoutDroneRuntime.FortGameplayAbility_ScoutDrone_Dismiss
// 0x0018 (0x0BE0 - 0x0BC8)
class UFortGameplayAbility_ScoutDrone_Dismiss final : public UFortGameplayAbility
{
public:
	struct FScoutDroneDeferredDestructionData     DismissDelayData;                                  // 0x0BC8(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)

public:
	class AFortScoutDrone* GetControlledDrone();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayAbility_ScoutDrone_Dismiss">();
	}
	static class UFortGameplayAbility_ScoutDrone_Dismiss* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayAbility_ScoutDrone_Dismiss>();
	}
};

// Class ScoutDroneRuntime.FortGameplayAbility_ScoutDrone_MarkPotentialTargets
// 0x0160 (0x0D80 - 0x0C20)
class UFortGameplayAbility_ScoutDrone_MarkPotentialTargets final : public UFortGameplayAbility_ScoutDrone_TargetingBase
{
public:
	struct FIndicatedActorData                    IndicatedActorData;                                // 0x0C20(0x0118)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D38[0x10];                                     // 0x0D38(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxNumberOfPotentialTargets;                       // 0x0D48(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	void OnStartHighlightingTarget(class AActor* Target);
	void OnStoppedHighlightingTarget(class AActor* Target);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayAbility_ScoutDrone_MarkPotentialTargets">();
	}
	static class UFortGameplayAbility_ScoutDrone_MarkPotentialTargets* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayAbility_ScoutDrone_MarkPotentialTargets>();
	}
};

// Class ScoutDroneRuntime.ScoutDronePassiveMarkPayload
// 0x0008 (0x0038 - 0x0030)
class UScoutDronePassiveMarkPayload final : public UObject
{
public:
	struct FScoutDroneStatusData                  TargetStatus;                                      // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ScoutDronePassiveMarkPayload">();
	}
	static class UScoutDronePassiveMarkPayload* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScoutDronePassiveMarkPayload>();
	}
};

// Class ScoutDroneRuntime.FortGameplayAbility_ScoutDrone_PassiveMark
// 0x0258 (0x0E78 - 0x0C20)
class UFortGameplayAbility_ScoutDrone_PassiveMark final : public UFortGameplayAbility_ScoutDrone_TargetingBase
{
public:
	struct FScoutDroneStatusData                  CurrentTargetStatus;                               // 0x0C20(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FStenciledActorData                    StenciledActorData;                                // 0x0C28(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FIndicatedActorData                    IndicatedActorData;                                // 0x0CC8(0x0118)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ActorTargetingRange;                               // 0x0DE0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeToConfirmTarget;                               // 0x0E18(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class AActor*                                 CurrentTarget;                                     // 0x0E50(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           TargetConfirmationTimerHandle;                     // 0x0E58(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScoutDronePassiveMarkPayload*          PayloadCache;                                      // 0x0E60(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E68[0x10];                                     // 0x0E68(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnTargetStatusChanged(class AActor* ActiveTarget);
	void OnActorIndicatorExpired(class AActor* IndicatedActor);
	void OnRep_CurrentTargetStatus();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayAbility_ScoutDrone_PassiveMark">();
	}
	static class UFortGameplayAbility_ScoutDrone_PassiveMark* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayAbility_ScoutDrone_PassiveMark>();
	}
};

// Class ScoutDroneRuntime.ScoutDronePickUpTargetsPayload
// 0x0018 (0x0048 - 0x0030)
class UScoutDronePickUpTargetsPayload final : public UObject
{
public:
	struct FScoutDronePickupTargets               PickUpTargets;                                     // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ScoutDronePickUpTargetsPayload">();
	}
	static class UScoutDronePickUpTargetsPayload* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScoutDronePickUpTargetsPayload>();
	}
};

// Class ScoutDroneRuntime.FortGameplayAbility_ScoutDrone_PickUp
// 0x0098 (0x0CB8 - 0x0C20)
class UFortGameplayAbility_ScoutDrone_PickUp final : public UFortGameplayAbility_ScoutDrone_TargetingBase
{
public:
	uint8                                         Pad_C20[0x8];                                      // 0x0C20(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxNumberOfItemsToGrab;                            // 0x0C28(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UScoutDronePickUpTargetsPayload*        PayloadCache;                                      // 0x0C60(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         PickupToggleCooldownDuration;                      // 0x0C68(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_CA0[0x10];                                     // 0x0CA0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            AttachedPawnGEClass;                               // 0x0CB0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ServerConfirmTargets();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayAbility_ScoutDrone_PickUp">();
	}
	static class UFortGameplayAbility_ScoutDrone_PickUp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayAbility_ScoutDrone_PickUp>();
	}
};

// Class ScoutDroneRuntime.FortGameplayAbility_ScoutDrone_Tether
// 0x00A0 (0x0C68 - 0x0BC8)
class UFortGameplayAbility_ScoutDrone_Tether final : public UFortGameplayAbility
{
public:
	struct FScalableFloat                         WarningRange;                                      // 0x0BC8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SignalLossRange;                                   // 0x0C00(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bIsInWarningRange;                                 // 0x0C38(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsInSignalLossRange;                              // 0x0C39(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C3A[0x6];                                      // 0x0C3A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TetheringTimerHandle;                              // 0x0C40(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           TetheringReportTimerHandle;                        // 0x0C48(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScoutDroneDeferredDestructionData     DismissDelayData;                                  // 0x0C50(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)

public:
	void Client_SetIsInSignalLossRange(bool bValue);
	void Client_SetIsInWarningRange(bool bValue);
	void StartCheckingDistances();
	void StopCheckingDistances();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayAbility_ScoutDrone_Tether">();
	}
	static class UFortGameplayAbility_ScoutDrone_Tether* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayAbility_ScoutDrone_Tether>();
	}
};

// Class ScoutDroneRuntime.FortAthenaMutator_ScoutDrone
// 0x0048 (0x0518 - 0x04D0)
class AFortAthenaMutator_ScoutDrone final : public AFortAthenaMutator
{
public:
	struct FGameplayTagContainer                  DroneAllowedInteractionTags;                       // 0x04D0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  DroneBlockedInteractionTags;                       // 0x04F0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bIsControllingDrone;                               // 0x0510(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnViewTargetChanged(class AFortPlayerController* PlayerController, class AActor* OldViewTarget, class AActor* NewViewTarget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_ScoutDrone">();
	}
	static class AFortAthenaMutator_ScoutDrone* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_ScoutDrone>();
	}
};

// Class ScoutDroneRuntime.FortChargingSet_ScoutDroneEnergy
// 0x00C8 (0x0118 - 0x0050)
class UFortChargingSet_ScoutDroneEnergy final : public UFortChargingSet_Base
{
public:
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayAttributeData             Energy;                                            // 0x0058(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             MaxEnergy;                                         // 0x0080(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             EnergyChargeRate;                                  // 0x00A8(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             ServerTimeEnergyIncrements;                        // 0x00D0(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F8[0x20];                                      // 0x00F8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_Energy(const struct FFortGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortChargingSet_ScoutDroneEnergy">();
	}
	static class UFortChargingSet_ScoutDroneEnergy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortChargingSet_ScoutDroneEnergy>();
	}
};

// Class ScoutDroneRuntime.FortScoutDrone
// 0x0200 (0x09E0 - 0x07E0)
class AFortScoutDrone final : public ACharacter
{
public:
	uint8                                         Pad_7D8[0x58];                                     // 0x07D8(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsDiving;                                         // 0x0830(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_831[0x7];                                      // 0x0831(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DivingEnabled;                                     // 0x0838(0x0038)(BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	bool                                          bIsSpeedBoosting;                                  // 0x0870(0x0001)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_871[0x7];                                      // 0x0871(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      NSScoutDroneIdle_Native;                           // 0x0878(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortScoutDronePickupManager*           PickupManagerComponent_Native;                     // 0x0880(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>                TeamMateIndicatorMarkerWidgetClass;                // 0x0888(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAudioComponent*                        DroneMotorLoopComponent;                           // 0x0890(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAudioComponent*                        DroneThrustSoundComponent;                         // 0x0898(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BaseMaxFlySpeed;                                   // 0x08A0(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  DefaultTags;                                       // 0x08D8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_8F8[0x8];                                      // 0x08F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            AbilitySystemComponent;                            // 0x0900(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActorComponent_Affiliation*        AffiliationComponent;                              // 0x0908(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAbilitySet*                        StartupAbilitySet;                                 // 0x0910(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortPawn*                              ControllingPlayerPawn;                             // 0x0918(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortHealthSet*                         HealthSet;                                         // 0x0920(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortChargingSet_ScoutDroneEnergy*      EnergySet;                                         // 0x0928(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LifespanAfterDeath;                                // 0x0930(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortAttributeInitializationKey        AttributeInitKey;                                  // 0x0934(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	EPhysicalSurface                              PrimarySurfaceType;                                // 0x094C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFortBaseWeaponDamage                         WeaponResponseType;                                // 0x094D(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPlayedDeath;                                      // 0x094E(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_94F[0x1];                                      // 0x094F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScoutDroneDeferredDestructionData     OutOfHealthDismissDelayData;                       // 0x0950(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FScoutDroneDeferredDestructionData     OutOfEnergyDismissDelayData;                       // 0x0968(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnTeamIndexChanged;                                // 0x0980(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortScoutDronePawnOverrideComponent> PawnOverrideComponentClass;                        // 0x0990(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundBase*                             DroneMotorLoopSound;                               // 0x0998(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundBase*                             DroneThrusterSound;                                // 0x09A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAudioParameterComponent*               AudioParameter;                                    // 0x09A8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   LocallyViewedPawnAudioParamName;                   // 0x09B0(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   IsEnemyAudioParamName;                             // 0x09BC(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ThrustAmountAudioParamName;                        // 0x09C8(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ThrustSoundThreshold;                              // 0x09D4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9D8[0x8];                                      // 0x09D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GameplayCue_Damage(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GetForwardAndRightDotProducts_Native(float* OutForwardDot, float* OutRightDot);
	void OnDamagePlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnRep_ControllingPlayerPawn();
	void SetAffiliationAudio();
	void SetTeamMatesIndicator(bool bState);
	void SetupGameplayAudioParameters();

	class AFortPawn* GetControllingPlayerPawn() const;
	struct FRotator GetDeltaRotator() const;
	float GetHealthPercentage() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortScoutDrone">();
	}
	static class AFortScoutDrone* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortScoutDrone>();
	}
};

// Class ScoutDroneRuntime.FortScoutDroneCameraMode
// 0x0008 (0x01F0 - 0x01E8)
class UFortScoutDroneCameraMode final : public UFort3PCameraMode
{
public:
	bool                                          bShouldInterpolateLocation;                        // 0x01E8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShouldInterpolateRotation;                        // 0x01E9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortScoutDroneCameraMode">();
	}
	static class UFortScoutDroneCameraMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortScoutDroneCameraMode>();
	}
};

// Class ScoutDroneRuntime.ScoutDroneDeferredDestructionPayload
// 0x0018 (0x0048 - 0x0030)
class UScoutDroneDeferredDestructionPayload final : public UObject
{
public:
	struct FScoutDroneDeferredDestructionData     DeferredDestructionData;                           // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ScoutDroneDeferredDestructionPayload">();
	}
	static class UScoutDroneDeferredDestructionPayload* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScoutDroneDeferredDestructionPayload>();
	}
};

// Class ScoutDroneRuntime.FortScoutDroneControllingComponent
// 0x02E8 (0x03C8 - 0x00E0)
class UFortScoutDroneControllingComponent final : public UFortControllerComponent
{
public:
	uint8                                         Pad_E0[0x30];                                      // 0x00E0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        DroneInputComponent;                               // 0x0110(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortScoutDrone*                        ControlledDrone;                                   // 0x0118(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 OriginalDroneOwner;                                // 0x0120(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortInputMappingContext*               DroneInputContext;                                 // 0x0128(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FScoutDroneInputTriggerableEvent> InputTriggerableEvents;                            // 0x0130(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UInputAction*                           MoveUpAction;                                      // 0x0140(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInputAction*                           MoveAction;                                        // 0x0148(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInputAction*                           DismissAction;                                     // 0x0150(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UGameplayEffect>            DroneCooldownEffectClass;                          // 0x0158(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_160[0x18];                                     // 0x0160(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStenciledActorData                    OwningActorStencilData;                            // 0x0178(0x00A0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScoutDroneDeferredDestructionData     CurrentDestructionData;                            // 0x0218(0x0018)(Net, Transient, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortCameraMode>            FirstPersonCameraModeOverride;                     // 0x0230(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortCameraMode>            ThirdPersonCameraModeOverride;                     // 0x0238(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayAbilitySpec                   FakeCameraAbilitySpec;                             // 0x0240(0x00F0)(Transient, NativeAccessSpecifierPrivate)
	TArray<class FName>                           LegacyInputActionsToBlock;                         // 0x0330(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class UScoutDroneDeferredDestructionPayload*  DismissPayloadCache;                               // 0x0340(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DismissButtonPressCooldown;                        // 0x0348(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_380[0x8];                                      // 0x0380(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParams            PlayerToDroneTransitionParams;                     // 0x0388(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_398[0x8];                                      // 0x0398(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  InterruptingPlayerTags;                            // 0x03A0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C0[0x8];                                      // 0x03C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnDestructionStarted(bool bInstantDestruction, const struct FGameplayTag& DismissalReason);
	void BP_OnDismissalStarted(bool bInstantDismissal, const struct FGameplayTag& DismissalReason);
	void BP_OnDroneDestroyed(const struct FGameplayTag& DismissalReason);
	void BP_OnPlayerInteractLongUseChanged(bool bInteracting, bool bLongUseInteractionCompleted);
	void BP_OnPlayerShortInteract();
	void OnControlledDroneDestroyed(class AActor* InControlledDrone);
	void OnOwningPlayerStartedDBNO();
	void OnPlayerInterruptionTagsChanged(const struct FGameplayTag& Tag, int32 NewCount);
	void OnRep_ControlledDrone();
	void OnRep_CurrentDestructionData();
	void OnWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void ServerRequestDroneDismissal();

	class AFortScoutDrone* GetControlledDrone() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortScoutDroneControllingComponent">();
	}
	static class UFortScoutDroneControllingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortScoutDroneControllingComponent>();
	}
};

// Class ScoutDroneRuntime.FortScoutDroneCooldownMagnitudeCalculation
// 0x0038 (0x0080 - 0x0048)
class UFortScoutDroneCooldownMagnitudeCalculation final : public UFortGameplayModMagnitudeCalculation
{
public:
