#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScriptableEditorWidgets

#include "Basic.hpp"


namespace SDK::Params
{

// Function ScriptableEditorWidgets.PropertyViewBase.SetObject
// 0x0008 (0x0008 - 0x0000)
struct PropertyViewBase_SetObject final
{
public:
	class UObject*                                NewObject;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ScriptableEditorWidgets.PropertyViewBase.GetObject
// 0x0008 (0x0008 - 0x0000)
struct PropertyViewBase_GetObject final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ScriptableEditorWidgets.SinglePropertyView.SetNameOverride
// 0x0010 (0x0010 - 0x0000)
struct SinglePropertyView_SetNameOverride final
{
public:
	class FText                                   NewPropertyName;                                   // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
};

// Function ScriptableEditorWidgets.SinglePropertyView.SetPropertyName
// 0x000C (0x000C - 0x0000)
struct SinglePropertyView_SetPropertyName final
{
public:
	class FName                                   NewPropertyName;                                   // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ScriptableEditorWidgets.SinglePropertyView.GetNameOverride
// 0x0010 (0x0010 - 0x0000)
struct SinglePropertyView_GetNameOverride final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ScriptableEditorWidgets.SinglePropertyView.GetPropertyName
// 0x000C (0x000C - 0x0000)
struct SinglePropertyView_GetPropertyName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

