#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScriptableEditorWidgets

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class ScriptableEditorWidgets.PropertyViewBase
// 0x0080 (0x02D0 - 0x0250)
class UPropertyViewBase : public UWidget
{
public:
	TSoftObjectPtr<class UObject>                 Object;                                            // 0x0250(0x0030)(Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSoftObjectPath                        SoftObjectPath;                                    // 0x0280(0x0028)(ZeroConstructor, Deprecated, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoLoadAsset;                                    // 0x02A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class FName PropertyName)> OnPropertyChanged;                                 // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C0[0x10];                                     // 0x02C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetObject(class UObject* NewObject);

	class UObject* GetObject() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropertyViewBase">();
	}
	static class UPropertyViewBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyViewBase>();
	}
};

// Class ScriptableEditorWidgets.DetailsView
// 0x0060 (0x0330 - 0x02D0)
class UDetailsView final : public UPropertyViewBase
{
public:
	uint8                                         Pad_2D0[0x8];                                      // 0x02D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAllowFiltering;                                   // 0x02D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowFavoriteSystem;                              // 0x02D9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowModifiedPropertiesOption;                     // 0x02DA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowKeyablePropertiesOption;                      // 0x02DB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowAnimatedPropertiesOption;                     // 0x02DC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ColumnWidth;                                       // 0x02E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowScrollBar;                                    // 0x02E4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceHiddenPropertyVisibility;                    // 0x02E5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E6[0x2];                                      // 0x02E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ViewIdentifier;                                    // 0x02E8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CategoriesToShow;                                  // 0x02F8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           PropertiesToShow;                                  // 0x0308(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_318[0x10];                                     // 0x0318(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bShowOnlyAllowed;                                  // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DetailsView">();
	}
	static class UDetailsView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDetailsView>();
	}
};

// Class ScriptableEditorWidgets.SinglePropertyView
// 0x0030 (0x0300 - 0x02D0)
class USinglePropertyView final : public UPropertyViewBase
{
public:
	class FName                                   PropertyName;                                      // 0x02D0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NameOverride;                                      // 0x02E0(0x0010)(Edit, AdvancedDisplay, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F0[0x10];                                     // 0x02F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetNameOverride(const class FText& NewPropertyName);
	void SetPropertyName(class FName NewPropertyName);

	class FText GetNameOverride() const;
	class FName GetPropertyName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SinglePropertyView">();
	}
	static class USinglePropertyView* GetDefaultObj()
	{
		return GetDefaultObjImpl<USinglePropertyView>();
	}
};

}

