#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SequencerAnimTools

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "InteractiveToolsFramework_classes.hpp"
#include "UnrealEd_classes.hpp"


namespace SDK
{

// Class SequencerAnimTools.BaseSequencerAnimTool
// 0x0000 (0x0030 - 0x0030)
class IBaseSequencerAnimTool final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseSequencerAnimTool">();
	}
	static class IBaseSequencerAnimTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBaseSequencerAnimTool>();
	}
};

// Class SequencerAnimTools.MotionTrailToolBuilder
// 0x0000 (0x0030 - 0x0030)
class UMotionTrailToolBuilder final : public UInteractiveToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotionTrailToolBuilder">();
	}
	static class UMotionTrailToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionTrailToolBuilder>();
	}
};

// Class SequencerAnimTools.MotionTrailTool
// 0x01E8 (0x02A0 - 0x00B8)
class alignas(0x10) UMotionTrailTool final : public UMultiSelectionTool
{
public:
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UTransformProxy*                        TransformProxy;                                    // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCombinedTransformGizmo*                TransformGizmo;                                    // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x178];                                     // 0x00D8(0x0178)(Fixing Size After Last Property [ Dumper-7 ])
	class USingleClickInputBehavior*              LeftClickBehavior;                                 // 0x0250(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USingleClickInputBehavior*              RightClickBehavior;                                // 0x0258(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_260[0x40];                                     // 0x0260(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotionTrailTool">();
	}
	static class UMotionTrailTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionTrailTool>();
	}
};

// Class SequencerAnimTools.SequencerPivotToolBuilder
// 0x0000 (0x0030 - 0x0030)
class USequencerPivotToolBuilder final : public UInteractiveToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SequencerPivotToolBuilder">();
	}
	static class USequencerPivotToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<USequencerPivotToolBuilder>();
	}
};

// Class SequencerAnimTools.SequencerPivotTool
// 0x01A8 (0x0260 - 0x00B8)
class alignas(0x10) USequencerPivotTool final : public UMultiSelectionTool
{
public:
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USingleClickInputBehavior*              ClickBehavior;                                     // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTransformProxy*                        TransformProxy;                                    // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCombinedTransformGizmo*                TransformGizmo;                                    // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x180];                                     // 0x00E0(0x0180)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SequencerPivotTool">();
	}
	static class USequencerPivotTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<USequencerPivotTool>();
	}
};

// Class SequencerAnimTools.SequencerToolsEditMode
// 0x0000 (0x0150 - 0x0150)
class USequencerToolsEditMode final : public UBaseLegacyWidgetEdMode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SequencerToolsEditMode">();
	}
	static class USequencerToolsEditMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<USequencerToolsEditMode>();
	}
};

}

