#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sequencer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "TimeManagement_structs.hpp"
#include "Engine_classes.hpp"
#include "MovieScene_structs.hpp"
#include "SequencerCore_classes.hpp"
#include "Sequencer_structs.hpp"


namespace SDK
{

// Class Sequencer.MotionTrailToolOptions
// 0x0090 (0x00C0 - 0x0030)
class UMotionTrailToolOptions final : public UObject
{
public:
	bool                                          bShowTrails;                                       // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           TrailColor;                                        // 0x0034(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowFullTrail;                                    // 0x0044(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TrailThickness;                                    // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FramesBefore;                                      // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FramesAfter;                                       // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bShowKeys;                                         // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowFrameNumber;                                  // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           KeyColor;                                          // 0x005C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        KeySize;                                           // 0x0070(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowMarks;                                        // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           MarkColor;                                         // 0x007C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MarkSize;                                          // 0x0090(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLockMarksToFrames;                                // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SecondsPerMark;                                    // 0x00A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotionTrailToolOptions">();
	}
	static class UMotionTrailToolOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionTrailToolOptions>();
	}
};

// Class Sequencer.MovieSceneCopyableBinding
// 0x0370 (0x03A0 - 0x0030)
class UMovieSceneCopyableBinding final : public UObject
{
public:
	TArray<class UObject*>                        SpawnableObjectTemplates;                          // 0x0030(0x0010)(ZeroConstructor, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic)
	int32                                         NumSpawnableObjectTemplates;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneTrack*>               Tracks;                                            // 0x0048(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FMovieSceneBinding                     Binding;                                           // 0x0058(0x0038)(ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMovieSceneSpawnable                   Spawnable;                                         // 0x0090(0x0180)(NativeAccessSpecifierPublic)
	struct FMovieScenePossessable                 Possessable;                                       // 0x0210(0x0138)(NativeAccessSpecifierPublic)
	TArray<class FString>                         BoundObjectNames;                                  // 0x0348(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           FolderPath;                                        // 0x0358(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           Tags;                                              // 0x0368(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UMovieSceneCustomBinding*>       CustomBindings;                                    // 0x0378(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic)
	int32                                         NumCustomBindings;                                 // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 PreviewSpawnableBindings;                          // 0x0390(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCopyableBinding">();
	}
	static class UMovieSceneCopyableBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCopyableBinding>();
	}
};

// Class Sequencer.MovieSceneCopyableTrack
// 0x0020 (0x0050 - 0x0030)
class UMovieSceneCopyableTrack final : public UObject
{
public:
	class UMovieSceneTrack*                       Track;                                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRootTrack;                                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCameraCutTrack;                                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           FolderPath;                                        // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneCopyableTrack">();
	}
	static class UMovieSceneCopyableTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCopyableTrack>();
	}
};

// Class Sequencer.SequencerKeyActor
// 0x0020 (0x0440 - 0x0420)
class ASequencerKeyActor final : public AActor
{
public:
	class UStaticMeshComponent*                   KeyMeshComponent;                                  // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 AssociatedActor;                                   // 0x0428(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMovieScene3DTransformSection*          TrackSection;                                      // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         KeyTime;                                           // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SequencerKeyActor">();
	}
	static class ASequencerKeyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASequencerKeyActor>();
	}
};

// Class Sequencer.MovieSceneKeyStructType
// 0x00C0 (0x01A0 - 0x00E0)
class UMovieSceneKeyStructType final : public UScriptStruct
{
public:
	TFieldPath<class FArrayProperty>              SourceTimesProperty;                               // 0x00E0(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<class FArrayProperty>              SourceValuesProperty;                              // 0x0110(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<class FStructProperty>             DestTimeProperty;                                  // 0x0140(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<class FProperty>                   DestValueProperty;                                 // 0x0170(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneKeyStructType">();
	}
	static class UMovieSceneKeyStructType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneKeyStructType>();
	}
};

// Class Sequencer.SequencerMeshTrail
// 0x0040 (0x0460 - 0x0420)
class ASequencerMeshTrail final : public AActor
{
public:
	uint8                                         Pad_420[0x40];                                     // 0x0420(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SequencerMeshTrail">();
	}
	static class ASequencerMeshTrail* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASequencerMeshTrail>();
	}
};

// Class Sequencer.SequencerModuleOutlinerScriptingObject
// 0x0000 (0x0050 - 0x0050)
class USequencerModuleOutlinerScriptingObject final : public USequencerOutlinerScriptingObject
{
public:
	struct FFrameNumber GetNextKey(const TArray<struct FSequencerViewModelScriptingStruct>& InNodes, const struct FFrameNumber& FrameNumber, EMovieSceneTimeUnit TimeUnit) const;
	struct FFrameNumber GetPreviousKey(const TArray<struct FSequencerViewModelScriptingStruct>& InNodes, const struct FFrameNumber& FrameNumber, EMovieSceneTimeUnit TimeUnit) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SequencerModuleOutlinerScriptingObject">();
	}
	static class USequencerModuleOutlinerScriptingObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<USequencerModuleOutlinerScriptingObject>();
	}
};

// Class Sequencer.SequencerModuleScriptingLayer
// 0x0000 (0x0038 - 0x0038)
class USequencerModuleScriptingLayer final : public USequencerScriptingLayer
{
public:
	class USequencerModuleOutlinerScriptingObject* GetOutliner();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SequencerModuleScriptingLayer">();
	}
	static class USequencerModuleScriptingLayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USequencerModuleScriptingLayer>();
	}
};

// Class Sequencer.SequencerSettingsContainer
// 0x0000 (0x0030 - 0x0030)
class USequencerSettingsContainer final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SequencerSettingsContainer">();
	}
	static class USequencerSettingsContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USequencerSettingsContainer>();
	}
};

// Class Sequencer.SequencerSettings
// 0x0150 (0x0180 - 0x0030)
class USequencerSettings final : public UObject
{
public:
	EAutoChangeMode                               AutoChangeMode;                                    // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAllowEditsMode                               AllowEditsMode;                                    // 0x0031(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EKeyGroupMode                                 KeyGroupMode;                                      // 0x0032(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMovieSceneKeyInterpolation                   KeyInterpolation;                                  // 0x0033(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoSetTrackDefaults;                             // 0x0034(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESequencerSpawnPosition                       SpawnPosition;                                     // 0x0035(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCreateSpawnableCameras;                           // 0x0036(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowRangeSlider;                                  // 0x0037(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsSnapEnabled;                                    // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSnapKeyTimesToInterval;                           // 0x0039(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSnapKeyTimesToKeys;                               // 0x003A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSnapSectionTimesToInterval;                       // 0x003B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSnapSectionTimesToSections;                       // 0x003C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSnapKeysAndSectionsToPlayRange;                   // 0x003D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSnapPlayTimeToKeys;                               // 0x003E(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSnapPlayTimeToSections;                           // 0x003F(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSnapPlayTimeToMarkers;                            // 0x0040(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSnapPlayTimeToInterval;                           // 0x0041(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSnapPlayTimeToPressedKey;                         // 0x0042(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSnapPlayTimeToDraggedKey;                         // 0x0043(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSnapCurveValueToInterval;                         // 0x0050(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowSelectedNodesOnly;                            // 0x0051(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRewindOnRecord;                                   // 0x0052(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLeftMouseDragDoesMarquee;                         // 0x0053(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESequencerZoomPosition                        ZoomPosition;                                      // 0x0054(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoScrollEnabled;                                // 0x0055(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLinkCurveEditorTimeRange;                         // 0x0056(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSynchronizeCurveEditorSelection;                  // 0x0057(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsolateCurveEditorToSelection;                    // 0x0058(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESequencerLoopMode                            LoopMode;                                          // 0x0059(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bResetPlayheadWhenNavigating;                      // 0x005A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bKeepCursorInPlayRangeWhileScrubbing;              // 0x005B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bKeepPlayRangeInSectionBounds;                     // 0x005C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         ZeroPadFrames;                                     // 0x005D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameNumber                           JumpFrameIncrement;                                // 0x0060(0x0004)(Edit, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowLayerBars;                                    // 0x0064(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowKeyBars;                                      // 0x0065(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInfiniteKeyAreas;                                 // 0x0066(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowChannelColors;                                // 0x0067(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowInfoButton;                                   // 0x0068(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowTickLines;                                    // 0x0069(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowSequencerToolbar;                             // 0x006A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowMarkedFrames;                                 // 0x006B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 KeyAreaCurveExtents;                               // 0x0070(0x0010)(Edit, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         KeyAreaHeightWithCurves;                           // 0x0080(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ReduceKeysTolerance;                               // 0x0084(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDeleteKeysWhenTrimming;                           // 0x0088(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisableSectionsAfterBaking;                       // 0x0089(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           MarkedFrameColor;                                  // 0x008C(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FColor>                         SectionColorTints;                                 // 0x00A0(0x0010)(Edit, ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	bool                                          bCleanPlaybackMode;                                // 0x00B0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bActivateRealtimeViewports;                        // 0x00B1(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEvaluateSubSequencesInIsolation;                  // 0x00B2(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRerunConstructionScripts;                         // 0x00B3(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowDebugVisualization;                           // 0x00B4(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bVisualizePreAndPostRoll;                          // 0x00B5(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCompileDirectorOnEvaluate;                        // 0x00B6(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B7[0x1];                                       // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        TrajectoryPathCap;                                 // 0x00B8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFrameNumberDisplayFormats                    FrameNumberDisplayFormat;                          // 0x00BC(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MovieRendererName;                                 // 0x00C0(0x0010)(Edit, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoExpandNodesOnSelection;                       // 0x00D0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRestoreOriginalViewportOnCameraCutUnlock;         // 0x00D1(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TreeViewWidth;                                     // 0x00D4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ViewDensity;                                       // 0x00D8(0x000C)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         TrackFilters;                                      // 0x00E8(0x0010)(Edit, ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	TArray<struct FColumnVisibilitySetting>       ColumnVisibilitySettings;                          // 0x00F8(0x0010)(Edit, ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_108[0x78];                                     // 0x0108(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SequencerSettings">();
	}
	static class USequencerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USequencerSettings>();
	}
};

// Class Sequencer.SequencerTimeChangeUndoRedoProxy
// 0x0028 (0x0058 - 0x0030)
class USequencerTimeChangeUndoRedoProxy final : public UObject
{
public:
	struct FQualifiedFrameTime                    Time;                                              // 0x0030(0x0010)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTimeWasSet;                                       // 0x0040(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x17];                                      // 0x0041(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SequencerTimeChangeUndoRedoProxy">();
	}
	static class USequencerTimeChangeUndoRedoProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<USequencerTimeChangeUndoRedoProxy>();
	}
};

// Class Sequencer.SequencerToolMenuContext
// 0x0010 (0x0040 - 0x0030)
class USequencerToolMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SequencerToolMenuContext">();
	}
	static class USequencerToolMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<USequencerToolMenuContext>();
	}
};

// Class Sequencer.SequencerTrackFilterExtension
// 0x0000 (0x0030 - 0x0030)
class USequencerTrackFilterExtension : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SequencerTrackFilterExtension">();
	}
	static class USequencerTrackFilterExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<USequencerTrackFilterExtension>();
	}
};

}

