#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SequenceRecorder

#include "Basic.hpp"


namespace SDK
{

// Enum SequenceRecorder.ETimecodeBoneMode
// NumValues: 0x0004
enum class ETimecodeBoneMode : uint8
{
	All                                      = 0,
	Root                                     = 1,
	UserDefined                              = 2,
	MAX                                      = 3,
};

// Enum SequenceRecorder.EAudioRecordingMode
// NumValues: 0x0003
enum class EAudioRecordingMode : uint8
{
	None                                     = 0,
	AudioTrack                               = 1,
	EAudioRecordingMode_MAX                  = 2,
};

// ScriptStruct SequenceRecorder.ActorRecordingSettings
// 0x0018 (0x0018 - 0x0000)
struct FActorRecordingSettings final
{
public:
	TArray<class UObject*>                        Settings;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SequenceRecorder.TimecodeBoneMethod
// 0x0010 (0x0010 - 0x0000)
struct FTimecodeBoneMethod final
{
public:
	ETimecodeBoneMode                             BoneMode;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BoneName;                                          // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SequenceRecorder.SequenceRecorderActorFilter
// 0x0010 (0x0010 - 0x0000)
struct FSequenceRecorderActorFilter final
{
public:
	TArray<TSubclassOf<class AActor>>             ActorClassesToRecord;                              // 0x0000(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct SequenceRecorder.PropertiesToRecordForActorClass
// 0x0018 (0x0018 - 0x0000)
struct FPropertiesToRecordForActorClass final
{
public:
	TSubclassOf<class AActor>                     Class;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           Properties;                                        // 0x0008(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, NativeAccessSpecifierPublic)
};

// ScriptStruct SequenceRecorder.PropertiesToRecordForClass
// 0x0018 (0x0018 - 0x0000)
struct FPropertiesToRecordForClass final
{
public:
	TSubclassOf<class UActorComponent>            Class;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           Properties;                                        // 0x0008(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, NativeAccessSpecifierPublic)
};

// ScriptStruct SequenceRecorder.SettingsForActorClass
// 0x0010 (0x0010 - 0x0000)
struct FSettingsForActorClass final
{
public:
	TSubclassOf<class AActor>                     Class;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecordToPossessable;                              // 0x0008(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

