#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SequencerCore

#include "Basic.hpp"

#include "SequencerCore_structs.hpp"


namespace SDK::Params
{

// Function SequencerCore.SequencerOutlinerScriptingObject.SetSelection
// 0x0010 (0x0010 - 0x0000)
struct SequencerOutlinerScriptingObject_SetSelection final
{
public:
	TArray<struct FSequencerViewModelScriptingStruct> InSelection;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function SequencerCore.SequencerOutlinerScriptingObject.GetChildren
// 0x0040 (0x0040 - 0x0000)
struct SequencerOutlinerScriptingObject_GetChildren final
{
public:
	struct FSequencerViewModelScriptingStruct     Node;                                              // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
	class FName                                   TypeName;                                          // 0x0020(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSequencerViewModelScriptingStruct> ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SequencerCore.SequencerOutlinerScriptingObject.GetRootNode
// 0x0020 (0x0020 - 0x0000)
struct SequencerOutlinerScriptingObject_GetRootNode final
{
public:
	struct FSequencerViewModelScriptingStruct     ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SequencerCore.SequencerOutlinerScriptingObject.GetSelection
// 0x0010 (0x0010 - 0x0000)
struct SequencerOutlinerScriptingObject_GetSelection final
{
public:
	TArray<struct FSequencerViewModelScriptingStruct> ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SequencerCore.SequencerViewModelStructExtensions.GetLabel
// 0x0030 (0x0030 - 0x0000)
struct SequencerViewModelStructExtensions_GetLabel final
{
public:
	struct FSequencerViewModelScriptingStruct     ViewModel;                                         // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SequencerCore.SequencerViewModelStructExtensions.GetPath
// 0x0030 (0x0030 - 0x0000)
struct SequencerViewModelStructExtensions_GetPath final
{
public:
	struct FSequencerViewModelScriptingStruct     ViewModel;                                         // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

