#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: service_station_device

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "service_station_device_structs.hpp"
#include "VerseFortnite_0_structs.hpp"


namespace SDK::Params
{

// Function service_station_device.service_station_device.$InitCDO
// 0x03E0 (0x03E0 - 0x0000)
struct service_station_device__InitCDO final
{
public:
	class UDevices_device_health*                 _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_event_vehicle*          _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_4;                            // 0x0020(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0030(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_vehicle*          _ExprResult_6;                                     // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_7;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_8;                            // 0x0050(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_9;                                     // 0x0060(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_vehicle*          _ExprResult_10;                                    // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_11;                               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_12;                           // 0x0080(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_13;                                    // 0x0090(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_vehicle*          _ExprResult_14;                                    // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_15;                               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_16;                           // 0x00B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_17;                                    // 0x00C0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_vehicle*          _ExprResult_18;                                    // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_19;                               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_20;                           // 0x00E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_21;                                    // 0x00F0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_vehicle*          _ExprResult_22;                                    // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_23;                               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_24;                           // 0x0110(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_25;                                    // 0x0120(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_26;                                    // 0x0130(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_27;                               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_28;                           // 0x0140(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_29;                                    // 0x0150(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_30;                                    // 0x0160(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_31;                               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_32;                           // 0x0170(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_33;                                    // 0x0180(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_logic*     _ExprResult_34;                                    // 0x0190(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_35;                               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_36;                           // 0x01A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_37;                                    // 0x01B0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_logic*     _ExprResult_38;                                    // 0x01C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_39;                               // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_40;                           // 0x01D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_41;                                    // 0x01E0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_health*                 _ExprResult_42;                                    // 0x01F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_43;                               // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_event_vehicle*          _ExprResult_44;                                    // 0x0200(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_45;                               // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_46;                           // 0x0210(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_47;                                    // 0x0220(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_vehicle*          _ExprResult_48;                                    // 0x0230(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_49;                               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_50;                           // 0x0240(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_51;                                    // 0x0250(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_vehicle*          _ExprResult_52;                                    // 0x0260(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_53;                               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_54;                           // 0x0270(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_55;                                    // 0x0280(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_vehicle*          _ExprResult_56;                                    // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_57;                               // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_58;                           // 0x02A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_59;                                    // 0x02B0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_vehicle*          _ExprResult_60;                                    // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_61;                               // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_62;                           // 0x02D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_63;                                    // 0x02E0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_vehicle*          _ExprResult_64;                                    // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_65;                               // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_66;                           // 0x0300(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_67;                                    // 0x0310(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_68;                                    // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_69;                               // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_70;                           // 0x0330(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_71;                                    // 0x0340(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_72;                                    // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_73;                               // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_74;                           // 0x0360(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_75;                                    // 0x0370(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_logic*     _ExprResult_76;                                    // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_77;                               // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_78;                           // 0x0390(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_79;                                    // 0x03A0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_logic*     _ExprResult_80;                                    // 0x03B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_81;                               // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_82;                           // 0x03C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_83;                                    // 0x03D0(0x0010)(HasGetValueTypeHash)
};

// Function service_station_device.service_station_device._L_2fFortnite_2ecom_2fDevices_2fservice__station__device_N_RIsAnyVehicleInside
// 0x0058 (0x0058 - 0x0000)
struct service_station_device__L_2fFortnite_2ecom_2fDevices_2fservice__station__device_N_RIsAnyVehicleInside final
{
public:
	struct service_station_device::Ftuple_L_R     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_0 : 1;                                 // 0x0003(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<uint8>                              _ExprResultStack_1;                                // 0x0004(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x0006(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function_get_logic*     __verse_0x00000000__2;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0010(0x0018)(HasGetValueTypeHash)
	struct service_station_device::Ftuple_L_R     _ExprResult_4;                                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_5 : 1;                                 // 0x0029(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<uint8>                              _ExprResultStack_6;                                // 0x002A(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_7 : 1;                                 // 0x002C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function_get_logic*     __verse_0x00000000__4;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x0038(0x0018)(HasGetValueTypeHash)
	struct service_station_device::Ftuple_L_R     _ExprResult_9;                                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function service_station_device.service_station_device._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R
// 0x0068 (0x0068 - 0x0000)
struct service_station_device__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R final
{
public:
	struct FGame_damage_args                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, NoDestructor)
	class UDevices_device_health*                 __verse_0x00000000__1;                             // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0028(0x0018)(HasGetValueTypeHash)
	class UDevices_device_health*                 __verse_0x00000000__2;                             // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0050(0x0018)(HasGetValueTypeHash)
};

// Function service_station_device.service_station_device._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R
// 0x0058 (0x0058 - 0x0000)
struct service_station_device__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_health*                 __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	class UDevices_device_health*                 __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
};

// Function service_station_device.service_station_device._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent
// 0x0060 (0x0060 - 0x0000)
struct service_station_device__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent final
{
public:
	struct service_station_device::Ftuple_L_R     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_health*                 __verse_0x00000000__1;                             // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct service_station_device::Ftuple_L_R     _ExprResult_1;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_health*                 __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
	struct service_station_device::Ftuple_L_R     _ExprResult_3;                                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function service_station_device.service_station_device._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth
// 0x0060 (0x0060 - 0x0000)
struct service_station_device__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth final
{
public:
	struct service_station_device::Ftuple_L_R     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_health*                 __verse_0x00000000__1;                             // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct service_station_device::Ftuple_L_R     _ExprResult_1;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_health*                 __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
	struct service_station_device::Ftuple_L_R     _ExprResult_3;                                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function service_station_device.service_station_device._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth
// 0x0060 (0x0060 - 0x0000)
struct service_station_device__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth final
{
public:
	struct service_station_device::Ftuple_L_R     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_health*                 __verse_0x00000000__1;                             // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct service_station_device::Ftuple_L_R     _ExprResult_1;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_health*                 __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
	struct service_station_device::Ftuple_L_R     _ExprResult_3;                                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function service_station_device.service_station_device._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R
// 0x0058 (0x0058 - 0x0000)
struct service_station_device__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_health*                 __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	class UDevices_device_health*                 __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
};

// Function service_station_device.service_station_device._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R
// 0x0058 (0x0058 - 0x0000)
struct service_station_device__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_health*                 __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	class UDevices_device_health*                 __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
};

// Function service_station_device.service_station_device._L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable
// 0x0068 (0x0068 - 0x0000)
struct service_station_device__L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable final
{
public:
	struct service_station_device::Ftuple_L_R     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct service_station_device::Ftuple_L_R     _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct service_station_device::Ftuple_L_R     _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function service_station_device.service_station_device._L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable
// 0x0068 (0x0068 - 0x0000)
struct service_station_device__L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable final
{
public:
	struct service_station_device::Ftuple_L_R     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct service_station_device::Ftuple_L_R     _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct service_station_device::Ftuple_L_R     _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function service_station_device.service_station_device._L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled
// 0x0058 (0x0058 - 0x0000)
struct service_station_device__L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled final
{
public:
	struct service_station_device::Ftuple_L_R     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_0 : 1;                                 // 0x0003(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<uint8>                              _ExprResultStack_1;                                // 0x0004(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x0006(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function_get_logic*     __verse_0x00000000__2;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0010(0x0018)(HasGetValueTypeHash)
	struct service_station_device::Ftuple_L_R     _ExprResult_4;                                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_5 : 1;                                 // 0x0029(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<uint8>                              _ExprResultStack_6;                                // 0x002A(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_7 : 1;                                 // 0x002C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function_get_logic*     __verse_0x00000000__4;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x0038(0x0018)(HasGetValueTypeHash)
	struct service_station_device::Ftuple_L_R     _ExprResult_9;                                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

