#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SharedWeaponAnimsRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class SharedWeaponAnimsRuntime.ChapWormChooserData
// 0x0010 (0x0048 - 0x0038)
class UChapWormChooserData final : public UFortItemChooserData
{
public:
	bool                                          bIsOverpower;                                      // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           OPTagName;                                         // 0x003C(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChapWormChooserData">();
	}
	static class UChapWormChooserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChapWormChooserData>();
	}
};

// Class SharedWeaponAnimsRuntime.FlexLegendChooserData
// 0x0018 (0x0050 - 0x0038)
class UFlexLegendChooserData final : public UFortItemChooserData
{
public:
	bool                                          bIsTargetingCustom;                                // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayUpperBodyTargetingCustom;                     // 0x0039(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x16];                                      // 0x003A(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlexLegendChooserData">();
	}
	static class UFlexLegendChooserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlexLegendChooserData>();
	}
};

// Class SharedWeaponAnimsRuntime.RATTPistolChooserData
// 0x0010 (0x0048 - 0x0038)
class URATTPistolChooserData final : public UFortItemChooserData
{
public:
	bool                                          bPlayUpperBodyTargetingCustom;                     // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0xF];                                       // 0x0039(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RATTPistolChooserData">();
	}
	static class URATTPistolChooserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<URATTPistolChooserData>();
	}
};

}

