#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidewaysCodeRuntime

#include "Basic.hpp"

#include "GameFeatures_classes.hpp"
#include "SidewaysCodeRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "PlayspaceSystem_classes.hpp"


namespace SDK
{

// Class SidewaysCodeRuntime.SidewaysCheatManager
// 0x0000 (0x0030 - 0x0030)
class USidewaysCheatManager final : public UChildCheatManager
{
public:
	void SetSidewaysState(ESidewaysState SidewaysState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SidewaysCheatManager">();
	}
	static class USidewaysCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidewaysCheatManager>();
	}
};

// Class SidewaysCodeRuntime.FortControllerComponent_Sideways
// 0x0008 (0x00E8 - 0x00E0)
class UFortControllerComponent_Sideways final : public UFortControllerComponent
{
public:
	struct FTimerHandle                           UpdateClosestSidewaysHandle;                       // 0x00E0(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortControllerComponent_Sideways">();
	}
	static class UFortControllerComponent_Sideways* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerComponent_Sideways>();
	}
};

// Class SidewaysCodeRuntime.PlayspaceComponent_SidewaysDimension
// 0x0128 (0x0258 - 0x0130)
class UPlayspaceComponent_SidewaysDimension final : public UFortPlayspaceComponent
{
public:
	uint8                                         Pad_130[0x120];                                    // 0x0130(0x0120)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaAIServiceLoot*                   CachedAIServiceLoot;                               // 0x0250(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayspaceComponent_SidewaysDimension">();
	}
	static class UPlayspaceComponent_SidewaysDimension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceComponent_SidewaysDimension>();
	}
};

// Class SidewaysCodeRuntime.PlayspaceComponent_SidewaysEncounter
// 0x0000 (0x0130 - 0x0130)
class UPlayspaceComponent_SidewaysEncounter final : public UFortPlayspaceComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayspaceComponent_SidewaysEncounter">();
	}
	static class UPlayspaceComponent_SidewaysEncounter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceComponent_SidewaysEncounter>();
	}
};

// Class SidewaysCodeRuntime.SidewaysStateComponent
// 0x0028 (0x0100 - 0x00D8)
class USidewaysStateComponent : public UGameFrameworkComponent
{
public:
	ESidewaysState                                SidewaysState;                                     // 0x00D8(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASidewaysPlayspace*                     SidewaysPlayspace;                                 // 0x00E0(0x0008)(Net, ZeroConstructor, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class USidewaysStateComponent* SidewaysStateComponent, class ASidewaysPlayspace* SidewaysPlayspace, ESidewaysState OldState, ESidewaysState NewState)> OnSidewaysStateChangedDelegate;                    // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleSidewaysStateChanged(class ASidewaysPlayspace* NewSidewaysPlayspace, ESidewaysState OldState, ESidewaysState NewState);
	void OnRep_SidewaysPlayspace(class ASidewaysPlayspace* NewSidewaysPlayspace);
	void OnRep_SidewaysState(ESidewaysState LastSidewaysState);
	void SetSidewaysState(ESidewaysState NewState, class ASidewaysPlayspace* NewSidewaysPlayspace);

	ESidewaysState GetSidewaysState() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SidewaysStateComponent">();
	}
	static class USidewaysStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidewaysStateComponent>();
	}
};

// Class SidewaysCodeRuntime.SidewaysStateComponent_Player
// 0x0078 (0x0178 - 0x0100)
class USidewaysStateComponent_Player final : public USidewaysStateComponent
{
public:
	TSoftObjectPtr<class UMaterialParameterCollection> SidewaysMaterialParameterCollection;               // 0x0100(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   SidewaysBubbleLocationParameterNamesForLocalPlayers[0x2]; // 0x0130(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   SidewaysBubbleRadiusParameterNamesForLocalPlayers[0x2]; // 0x0148(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ExtraCorruptionRadius;                             // 0x0160(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinRadiusToHaveAnyCorruption;                      // 0x0164(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxRadiusForScalingExtraCorruptionRadius;          // 0x0168(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         UpdateFrequency;                                   // 0x016C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_170[0x8];                                      // 0x0170(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SidewaysStateComponent_Player">();
	}
	static class USidewaysStateComponent_Player* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidewaysStateComponent_Player>();
	}
};

// Class SidewaysCodeRuntime.SidewaysFeatureAction_HoldGlobalData
// 0x0060 (0x0090 - 0x0030)
class USidewaysFeatureAction_HoldGlobalData final : public UGameFeatureAction
{
public:
	TSoftObjectPtr<class UMaterialParameterCollection> SidewaysMaterialParameterCollection;               // 0x0030(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   SidewaysBubbleLocationParameterNamesForLocalPlayers[0x2]; // 0x0060(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   SidewaysBubbleRadiusParameterNamesForLocalPlayers[0x2]; // 0x0078(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SidewaysFeatureAction_HoldGlobalData">();
	}
	static class USidewaysFeatureAction_HoldGlobalData* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidewaysFeatureAction_HoldGlobalData>();
	}
};

// Class SidewaysCodeRuntime.SidewaysLibrary
// 0x0000 (0x0030 - 0x0030)
class USidewaysLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class USidewaysStateComponent* GetSidewaysStateComponent(const class AActor* Owner);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SidewaysLibrary">();
	}
	static class USidewaysLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidewaysLibrary>();
	}
};

// Class SidewaysCodeRuntime.SidewaysPlayspace
// 0x0000 (0x0848 - 0x0848)
class ASidewaysPlayspace final : public AFortPlayspace
{
public:
	void NotifySizeChanged();
	void RefreshActorsInSideways();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SidewaysPlayspace">();
	}
	static class ASidewaysPlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASidewaysPlayspace>();
	}
};

// Class SidewaysCodeRuntime.SidewaysVolume
// 0x0000 (0x04D0 - 0x04D0)
class ASidewaysVolume final : public AGameplayVolume
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SidewaysVolume">();
	}
	static class ASidewaysVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASidewaysVolume>();
	}
};

}

