#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkeletalMeshModelingTools

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnrealEd_structs.hpp"
#include "UnrealEd_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SkeletalMeshModelingTools_structs.hpp"
#include "MeshModelingToolsEditorOnlyExp_classes.hpp"


namespace SDK
{

// Class SkeletalMeshModelingTools.SkeletalMeshModelingToolsEditorMode
// 0x0020 (0x0170 - 0x0150)
class USkeletalMeshModelingToolsEditorMode final : public UBaseLegacyWidgetEdMode
{
public:
	uint8                                         Pad_150[0x20];                                     // 0x0150(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkeletalMeshModelingToolsEditorMode">();
	}
	static class USkeletalMeshModelingToolsEditorMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkeletalMeshModelingToolsEditorMode>();
	}
};

// Class SkeletalMeshModelingTools.SkeletonFromStaticMeshFactory
// 0x0028 (0x00B0 - 0x0088)
class USkeletonFromStaticMeshFactory final : public UFactory
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RootPosition;                                      // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERootBonePositionReference                    PositionReference;                                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkeletonFromStaticMeshFactory">();
	}
	static class USkeletonFromStaticMeshFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkeletonFromStaticMeshFactory>();
	}
};

// Class SkeletalMeshModelingTools.SkeletalMeshFromStaticMeshFactory
// 0x0138 (0x01C0 - 0x0088)
class USkeletalMeshFromStaticMeshFactory final : public UFactory
{
public:
	uint8                                         Pad_88[0x118];                                     // 0x0088(0x0118)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeleton*                              Skeleton;                                          // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMesh;                                        // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BindBoneName;                                      // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkeletalMeshFromStaticMeshFactory">();
	}
	static class USkeletalMeshFromStaticMeshFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkeletalMeshFromStaticMeshFactory>();
	}
};

// Class SkeletalMeshModelingTools.StaticMeshToSkeletalMeshConvertOptions
// 0x00D8 (0x0108 - 0x0030)
class UStaticMeshToSkeletalMeshConvertOptions final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDirectoryPath                         DestinationPath;                                   // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EReferenceSkeletonImportOption                SkeletonImportOption;                              // 0x0048(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERootBonePlacementOptions                     RootBonePlacement;                                 // 0x004C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        Skeleton;                                          // 0x0050(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SkeletalMesh;                                      // 0x0078(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         BindingBoneName;                                   // 0x00A0(0x0014)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PrefixToRemove;                                    // 0x00B8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SkeletalMeshPrefixToAdd;                           // 0x00C8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SkeletalMeshSuffixToAdd;                           // 0x00D8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SkeletonPrefixToAdd;                               // 0x00E8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SkeletonSuffixToAdd;                               // 0x00F8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StaticMeshToSkeletalMeshConvertOptions">();
	}
	static class UStaticMeshToSkeletalMeshConvertOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStaticMeshToSkeletalMeshConvertOptions>();
	}
};

// Class SkeletalMeshModelingTools.SkeletalMeshEditorContextObject
// 0x00F0 (0x0120 - 0x0030)
class USkeletalMeshEditorContextObject final : public USkeletalMeshEditorContextObjectBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	ESkeletonDrawMode                             SkeletonDrawMode;                                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_41[0xDF];                                      // 0x0041(0x00DF)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkeletalMeshEditorContextObject">();
	}
	static class USkeletalMeshEditorContextObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkeletalMeshEditorContextObject>();
	}
};

// Class SkeletalMeshModelingTools.SkeletalMeshGizmoWrapper
// 0x0010 (0x0048 - 0x0038)
class USkeletalMeshGizmoWrapper final : public USkeletalMeshGizmoWrapperBase
{
public:
	class UTransformGizmo*                        TransformGizmo;                                    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletonTransformProxy*                TransformProxy;                                    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkeletalMeshGizmoWrapper">();
	}
	static class USkeletalMeshGizmoWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkeletalMeshGizmoWrapper>();
	}
};

// Class SkeletalMeshModelingTools.SkeletalMeshGizmoContextObject
// 0x0008 (0x0038 - 0x0030)
class USkeletalMeshGizmoContextObject final : public USkeletalMeshGizmoContextObjectBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkeletalMeshGizmoContextObject">();
	}
	static class USkeletalMeshGizmoContextObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkeletalMeshGizmoContextObject>();
	}
};

}

