#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: skydive_volume_device

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"
#include "effect_volume_device_classes.hpp"


namespace SDK
{

// VerseClass skydive_volume_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class skydive_volume_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass skydive_volume_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class skydive_volume_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<skydive_volume_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass skydive_volume_device.skydive_volume_device
// 0x0040 (0x0110 - 0x00D0)
class Uskydive_volume_device final : public Ueffect_volume_device
{
public:
	class UObject*                                __verse_0x4DE856BF_AgentEntersEvent;               // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x8B9DBCF4_AgentExitsEvent;                // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x7BCB71B4_ZoneOccupiedEvent;              // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xEBEEF4FD_ZoneEmptiedEvent;               // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x80C82D86_EnableVolumeLockingFunction;    // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xE8D17258_DisableVolumeLockingFunction;   // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0xB2AEAE78_IsAgentInVolumeFunction;        // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fskydive__volume__device_N_RDisableVolumeLocking(const struct skydive_volume_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fskydive__volume__device_N_REnableVolumeLocking(const struct skydive_volume_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fskydive__volume__device_N_RIsInVolume_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"skydive_volume_device">();
	}
	static class Uskydive_volume_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uskydive_volume_device>();
	}
};

}

