#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialUMG

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct SocialUMG.SocialChatMessageEntryTextStyle
// 0x0080 (0x0080 - 0x0000)
struct FSocialChatMessageEntryTextStyle final
{
public:
	struct FSlateFontInfo                         FontInfo;                                          // 0x0000(0x0070)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ColorAndOpacity;                                   // 0x0070(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SocialUMG.SocialChatMessageEntryStyle
// 0x0180 (0x0180 - 0x0000)
struct FSocialChatMessageEntryStyle final
{
public:
	struct FSocialChatMessageEntryTextStyle       SenderNameStyle;                                   // 0x0000(0x0080)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSocialChatMessageEntryTextStyle       ChannelNameStyle;                                  // 0x0080(0x0080)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSocialChatMessageEntryTextStyle       MessageTextStyle;                                  // 0x0100(0x0080)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

}

