#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SolarisEditor

#include "Basic.hpp"

#include "UnrealEd_classes.hpp"
#include "SolarisEditor_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class SolarisEditor.GatherTextFromVerseCommandlet
// 0x0000 (0x00F8 - 0x00F8)
class UGatherTextFromVerseCommandlet final : public UGatherTextCommandletBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GatherTextFromVerseCommandlet">();
	}
	static class UGatherTextFromVerseCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGatherTextFromVerseCommandlet>();
	}
};

// Class SolarisEditor.SolEditorSettings
// 0x0010 (0x0040 - 0x0030)
class USolEditorSettings final : public UObject
{
public:
	TArray<struct FVerseClassAlias>               VerseClassAliases;                                 // 0x0030(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SolEditorSettings">();
	}
	static class USolEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USolEditorSettings>();
	}
};

// Class SolarisEditor.SolEditorUserSettings
// 0x0040 (0x00A0 - 0x0060)
class USolEditorUserSettings final : public UDeveloperSettings
{
public:
	uint8                                         bPromptForRetryOnFailedBuild : 1;                  // 0x0060(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bIgnorePendingLinkTasksOnPIE : 1;                  // 0x0060(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDirectoryPath>                 ScriptTemplateDirectories;                         // 0x0068(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	class FString                                 CustomScriptEditorCommandLine;                     // 0x0078(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_88[0x10];                                      // 0x0088(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableContentBrowserIntegration;                  // 0x0098(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SolEditorUserSettings">();
	}
	static class USolEditorUserSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USolEditorUserSettings>();
	}
};

// Class SolarisEditor.SolEditorSanitizationSettings
// 0x0028 (0x0058 - 0x0030)
class USolEditorSanitizationSettings final : public UObject
{
public:
	bool                                          bDisablePathValidation;                            // 0x0030(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHideInvalidHyperlinks;                            // 0x0031(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         AnyPatternRequiredList;                            // 0x0038(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	class FString                                 ReplaceServerPathPattern;                          // 0x0048(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SolEditorSanitizationSettings">();
	}
	static class USolEditorSanitizationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USolEditorSanitizationSettings>();
	}
};

// Class SolarisEditor.VerseEditorSettings
// 0x0008 (0x0068 - 0x0060)
class UVerseEditorSettings final : public UDeveloperSettings
{
public:
	bool                                          bUseInsidersVSCodeIfAvailable;                     // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseEditorSettings">();
	}
	static class UVerseEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseEditorSettings>();
	}
};

// Class SolarisEditor.UVersePrototypeAssetObject
// 0x0000 (0x0030 - 0x0030)
class UUVersePrototypeAssetObject final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVersePrototypeAssetObject">();
	}
	static class UUVersePrototypeAssetObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVersePrototypeAssetObject>();
	}
};

}

