#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoundCueTemplates

#include "Basic.hpp"

#include "SoundCueTemplates_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class SoundCueTemplates.SoundCueTemplate
// 0x0000 (0x05F8 - 0x05F8)
class USoundCueTemplate : public USoundCue
{
public:
	void AddSoundWavesToTemplate(const TArray<class UObject*>& SelectedObjects);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SoundCueTemplate">();
	}
	static class USoundCueTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundCueTemplate>();
	}
};

// Class SoundCueTemplates.SoundCueContainer
// 0x0078 (0x0670 - 0x05F8)
class USoundCueContainer final : public USoundCueTemplate
{
public:
	ESoundContainerType                           ContainerType;                                     // 0x05F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLooping;                                          // 0x05F9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5FA[0x6];                                      // 0x05FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class USoundWave*>                       Variations;                                        // 0x0600(0x0050)(Edit, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FVector2D                              PitchModulation;                                   // 0x0650(0x0010)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              VolumeModulation;                                  // 0x0660(0x0010)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SoundCueContainer">();
	}
	static class USoundCueContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundCueContainer>();
	}
};

// Class SoundCueTemplates.SoundCueDistanceCrossfade
// 0x0018 (0x0610 - 0x05F8)
class USoundCueDistanceCrossfade final : public USoundCueTemplate
{
public:
	bool                                          bLooping;                                          // 0x05F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5F9[0x7];                                      // 0x05F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSoundCueCrossfadeInfo>         Variations;                                        // 0x0600(0x0010)(Edit, ZeroConstructor, EditorOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SoundCueDistanceCrossfade">();
	}
	static class USoundCueDistanceCrossfade* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundCueDistanceCrossfade>();
	}
};

// Class SoundCueTemplates.SoundCueTemplateSettings
// 0x0018 (0x0078 - 0x0060)
class USoundCueTemplateSettings final : public UDeveloperSettings
{
public:
	TArray<struct FSoundCueTemplateQualitySettings> QualityLevels;                                     // 0x0060(0x0010)(Edit, ZeroConstructor, Config, EditorOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SoundCueTemplateSettings">();
	}
	static class USoundCueTemplateSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundCueTemplateSettings>();
	}
};

}

