#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SourdoughBreadGameplayRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum SourdoughBreadGameplayRuntime.ESourdoughBreadPatrolPattern
// NumValues: 0x0004
enum class ESourdoughBreadPatrolPattern : uint8
{
	Wander                                   = 0,
	Circle                                   = 1,
	Num                                      = 2,
	ESourdoughBreadPatrolPattern_MAX         = 3,
};

// ScriptStruct SourdoughBreadGameplayRuntime.SourdoughBreadPatrolState
// 0x0020 (0x0020 - 0x0000)
struct FSourdoughBreadPatrolState final
{
public:
	bool                                          bPatrolActive;                                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasFinishedActivation;                            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              PatrolDirection;                                   // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

