#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SourdoughBreadGameplayRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "SourdoughBreadGameplayRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class SourdoughBreadGameplayRuntime.SourdoughBreadChaser
// 0x01B8 (0x0ED8 - 0x0D20)
class ASourdoughBreadChaser final : public ABuildingGameplayActor
{
public:
	class USourdoughBreadMovementComponent*       SourdoughBreadMovementComponent;                   // 0x0D20(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCapsuleComponent*                      CapsuleComponent;                                  // 0x0D28(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESourdoughBreadPatrolPattern                  PatrolPattern;                                     // 0x0D30(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D31[0x7];                                      // 0x0D31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         PatrolCircleTurnSpeed;                             // 0x0D38(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_D70[0x8];                                      // 0x0D70(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         PatrolNewDirectionMin;                             // 0x0D78(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_DB0[0x8];                                      // 0x0DB0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         PatrolNewDirectionMax;                             // 0x0DB8(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_DF0[0x8];                                      // 0x0DF0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         BounceNewDirectionMin;                             // 0x0DF8(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_E30[0x8];                                      // 0x0E30(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         BounceNewDirectionMax;                             // 0x0E38(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_E70[0x8];                                      // 0x0E70(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MinTimeBetweenTurns;                               // 0x0E78(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_EB0[0x8];                                      // 0x0EB0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSourdoughBreadPatrolState             PatrolState;                                       // 0x0EB8(0x0020)(Net, Transient, NoDestructor, NativeAccessSpecifierPublic)

public:
	void ClearPatrolDestination();
	void OnBounceHit(const struct FHitResult& Hit);
	void RandomNewPatrolDestination();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SourdoughBreadChaser">();
	}
	static class ASourdoughBreadChaser* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASourdoughBreadChaser>();
	}
};

// Class SourdoughBreadGameplayRuntime.SourdoughBreadMovementComponent
// 0x0380 (0x07D0 - 0x0450)
class USourdoughBreadMovementComponent final : public UFortProjectileMovementComponent
{
public:
	struct FScalableFloat                         InitialActivatingSpeed;                            // 0x0450(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DesiredPatrolSpeed;                                // 0x0490(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C8[0x8];                                      // 0x04C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         PatrolAcceleration;                                // 0x04D0(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_508[0x8];                                      // 0x0508(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         PatrolTurnSpeed;                                   // 0x0510(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_548[0x8];                                      // 0x0548(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         PostImpactTurnSpeed;                               // 0x0550(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_588[0x8];                                      // 0x0588(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         PostImpactTurnTime;                                // 0x0590(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C8[0x8];                                      // 0x05C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         ErrorCorrectionTurnSpeed;                          // 0x05D0(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_608[0x8];                                      // 0x0608(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DesiredHeightAboveGround;                          // 0x0610(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_648[0x8];                                      // 0x0648(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DriftDownSpeed;                                    // 0x0650(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_688[0x8];                                      // 0x0688(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         LiftThresholdDistance;                             // 0x0690(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_6C8[0x8];                                      // 0x06C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         LiftAcceleration;                                  // 0x06D0(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_708[0x8];                                      // 0x0708(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         BrakingAcceleration;                               // 0x0710(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_748[0x8];                                      // 0x0748(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         NetCorrectionThresholdDist;                        // 0x0750(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_788[0x8];                                      // 0x0788(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	ECollisionChannel                             FindGroundTraceChannel;                            // 0x0790(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_791[0x3F];                                     // 0x0791(0x003F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SourdoughBreadMovementComponent">();
	}
	static class USourdoughBreadMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USourdoughBreadMovementComponent>();
	}
};

}

