#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksSongTemplatesEditor

#include "Basic.hpp"


namespace SDK::Params
{

// Function SparksSongTemplatesEditor.SparksSongTemplatesEditorSubsystem.CreateJamEmoteItemDefsForSong
// 0x0018 (0x0018 - 0x0000)
struct SparksSongTemplatesEditorSubsystem_CreateJamEmoteItemDefsForSong final
{
public:
	class USparksSongItemDefinition*              SongItemDef;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USparksJamEmoteItemDefinition*>  ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksSongTemplatesEditor.SparksSongTemplatesEditorSubsystem.CreateMultipleSongItemDefs
// 0x0018 (0x0018 - 0x0000)
struct SparksSongTemplatesEditorSubsystem_CreateMultipleSongItemDefs final
{
public:
	int32                                         StartId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndId;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USparksSongItemDefinition*>      ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksSongTemplatesEditor.SparksSongTemplatesEditorSubsystem.CreateSongItemDef
// 0x0010 (0x0010 - 0x0000)
struct SparksSongTemplatesEditorSubsystem_CreateSongItemDef final
{
public:
	int32                                         Id;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USparksSongItemDefinition*              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

