#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksSongTemplatesEditor

#include "Basic.hpp"

#include "FortniteVersion_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EditorSubsystem_classes.hpp"


namespace SDK
{

// Class SparksSongTemplatesEditor.SparksSongTemplatesEditorSubsystem
// 0x0060 (0x0098 - 0x0038)
class USparksSongTemplatesEditorSubsystem final : public UEditorSubsystem
{
public:
	struct FDirectoryPath                         SongItemsDirectory;                                // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         JamEmoteItemsDirectory;                            // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SongItemNameFormat;                                // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 JamEmoteItemNameFormat;                            // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USparksSongItemDefinition*              SongItemTemplate;                                  // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USparksJamEmoteItemDefinition*          JamEmoteItemTemplate;                              // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortReleaseVersion                    FortReleaseVersion;                                // 0x0088(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CreateJamEmoteItemDefsForAllLegacySongs() const;
	TArray<class USparksJamEmoteItemDefinition*> CreateJamEmoteItemDefsForSong(class USparksSongItemDefinition* SongItemDef) const;
	TArray<class USparksSongItemDefinition*> CreateMultipleSongItemDefs(int32 StartId, int32 EndId) const;
	class USparksSongItemDefinition* CreateSongItemDef(int32 Id) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksSongTemplatesEditorSubsystem">();
	}
	static class USparksSongTemplatesEditorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksSongTemplatesEditorSubsystem>();
	}
};

}

