#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksAlbumArtRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct SparksAlbumArtRuntime.SparksBakedAlbumArt
// 0x0058 (0x0060 - 0x0008)
struct FSparksBakedAlbumArt final : public FTableRowBase
{
public:
	class FName                                   SongShortName;                                     // 0x0008(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              AlbumArt;                                          // 0x0018(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              LastUpdatedTime;                                   // 0x0048(0x0008)(Edit, ZeroConstructor, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ImportedFromUrl;                                   // 0x0050(0x0010)(Edit, ZeroConstructor, EditorOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

