#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksCosmeticsRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "SparksCoreRuntime_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SparksCosmeticsRuntime.SparksCosmeticsCheatManager
// 0x0000 (0x0030 - 0x0030)
class USparksCosmeticsCheatManager final : public UChildCheatManager
{
public:
	void GrantSparksCosmeticsLoadedAssets() const;
	void GrantSparksSongsLoadedAssets(bool bIncludeSongsWithoutCatalogData) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksCosmeticsCheatManager">();
	}
	static class USparksCosmeticsCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksCosmeticsCheatManager>();
	}
};

// Class SparksCosmeticsRuntime.SparksInstrumentPreviewActor
// 0x0058 (0x0680 - 0x0628)
class ASparksInstrumentPreviewActor final : public AFortItemPreviewActor
{
public:
	uint8                                         Pad_628[0x10];                                     // 0x0628(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USparksInstrumentItemDefBase> ItemDef;                                           // 0x0638(0x0030)(BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(TScriptInterface<class IFortUICameraFrameTargetInterface> Object)> OnSettingsChangedDelegate;                         // 0x0668(0x0014)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_67C[0x4];                                      // 0x067C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FSparksVariantChoices GetCurrentChoices() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksInstrumentPreviewActor">();
	}
	static class ASparksInstrumentPreviewActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASparksInstrumentPreviewActor>();
	}
};

// Class SparksCosmeticsRuntime.SparksItemPreviewOffPawnActor
// 0x0000 (0x0680 - 0x0680)
class ASparksItemPreviewOffPawnActor final : public AFortItemPreviewOffPawnActor
{
public:
	ESparksInstrumentType GetInstrumentType();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksItemPreviewOffPawnActor">();
	}
	static class ASparksItemPreviewOffPawnActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASparksItemPreviewOffPawnActor>();
	}
};

// Class SparksCosmeticsRuntime.SparksItemPreviewOnPawnActor
// 0x0000 (0x0980 - 0x0980)
class ASparksItemPreviewOnPawnActor final : public AFortItemPreviewOnPawnActor
{
public:
	class UNiagaraComponent*                      ActiveAura;                                        // 0x0978(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksItemPreviewOnPawnActor">();
	}
	static class ASparksItemPreviewOnPawnActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASparksItemPreviewOnPawnActor>();
	}
};

// Class SparksCosmeticsRuntime.SparksPlayerStateComponent
// 0x0008 (0x00E0 - 0x00D8)
class USparksPlayerStateComponent final : public UPlayerStateComponent
{
public:
	ESparksInstrumentType                         SparksInstrumentChoice;                            // 0x00D8(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetSparksInstrumentChoice(ESparksInstrumentType Instrument);

	ESparksInstrumentType GetSparksInstrumentChoice() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksPlayerStateComponent">();
	}
	static class USparksPlayerStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksPlayerStateComponent>();
	}
};

// Class SparksCosmeticsRuntime.SparksSongPreviewActor
// 0x0030 (0x0450 - 0x0420)
class ASparksSongPreviewActor final : public AActor
{
public:
	uint8                                         Pad_420[0x10];                                     // 0x0420(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SongShortName;                                     // 0x0430(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BoundsScale;                                       // 0x043C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_440[0x10];                                     // 0x0440(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSongTextureLoaded(class UTexture2D* CoverArt);
	void StartSongPreview();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksSongPreviewActor">();
	}
	static class ASparksSongPreviewActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASparksSongPreviewActor>();
	}
};

}

