#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksCoreCosmeticsRuntime

#include "Basic.hpp"

#include "SparksCoreRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct SparksCoreCosmeticsRuntime.SparksVariantChoice
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FSparksVariantChoice final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SparksCoreCosmeticsRuntime.SparksVariantChoices
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FSparksVariantChoices final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SparksCoreCosmeticsRuntime.NameList
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FNameList final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SparksCoreCosmeticsRuntime.SparksCosmeticLoadoutData
// 0x0100 (0x0100 - 0x0000)
struct FSparksCosmeticLoadoutData final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSparksVariantChoices                  AuraChoices;                                       // 0x0050(0x0050)(Transient, NativeAccessSpecifierPublic)
	TMap<ESparksInstrumentType, struct FSparksVariantChoices> InstrumentVariantChoices;                          // 0x00A0(0x0050)(Transient, NativeAccessSpecifierPublic)
	TArray<class USparksSongItemDefinition*>      JamSongChoices;                                    // 0x00F0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
};

}

