#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksCoreCosmeticsRuntime

#include "Basic.hpp"

#include "SparksCoreRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "SparksCoreCosmeticsRuntime_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SparksCoreCosmeticsRuntime.FortAnimNotifyState_SpawnSparksProp
// 0x0060 (0x02C0 - 0x0260)
class UFortAnimNotifyState_SpawnSparksProp final : public UFortAnimNotifyState_SpawnProp
{
public:
	class UNiagaraComponent*                      SpawnedNiagaraComponent;                           // 0x0260(0x0008)(ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESparksInstrumentType                         InstrumentType;                                    // 0x0268(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldUseLeftHandMesh;                             // 0x0269(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldUseAuxiliaryMesh;                            // 0x026A(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26B[0x5];                                      // 0x026B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      SkipActorsWithTag;                                 // 0x0270(0x0048)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InitNewNotify(ESparksInstrumentType InType, bool InLeftHand, bool InAuxMesh, class FName InSocketName, const struct FGameplayTagQuery& InSkipActorsWithTag, int32 InPropId, class USkeletalMesh* InDefaultMesh) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnimNotifyState_SpawnSparksProp">();
	}
	static class UFortAnimNotifyState_SpawnSparksProp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimNotifyState_SpawnSparksProp>();
	}
};

// Class SparksCoreCosmeticsRuntime.SparksAccountItemDefinition
// 0x0018 (0x0938 - 0x0920)
class USparksAccountItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	uint8                                         Pad_920[0x8];                                      // 0x0920(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	ESparksAccountItemSubtype                     SubType;                                           // 0x0928(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_929[0x3];                                      // 0x0929(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Slot;                                              // 0x092C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	ESparksInstrumentType GetInstrumentType() const;
	ESparksAccountItemSubtype GetItemSubtype() const;
	void GetVariantChannelOptionNames(const struct FGameplayTag& ChannelTag, class FText* OutChannelName, TArray<class FString>* OutNames) const;
	void GetVariantChannelTags(TArray<struct FGameplayTag>* OutChannelTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksAccountItemDefinition">();
	}
	static class USparksAccountItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksAccountItemDefinition>();
	}
};

// Class SparksCoreCosmeticsRuntime.SparksAuraItemDefinition
// 0x00C0 (0x09F8 - 0x0938)
class USparksAuraItemDefinition final : public USparksAccountItemDefinition
{
public:
	TSoftObjectPtr<class UNiagaraSystem>          StartSystem;                                       // 0x0938(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StartSystemAttachPoint;                            // 0x0968(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_974[0x4];                                      // 0x0974(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          SustainSystem;                                     // 0x0978(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SustainSystemAttachPoint;                          // 0x09A8(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9B4[0x4];                                      // 0x09B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          StopSystem;                                        // 0x09B8(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StopSystemAttachPoint;                             // 0x09E8(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9F4[0x4];                                      // 0x09F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksAuraItemDefinition">();
	}
	static class USparksAuraItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksAuraItemDefinition>();
	}
};

// Class SparksCoreCosmeticsRuntime.SparksCosmeticCatalog
// 0x00F8 (0x01D0 - 0x00D8)
class USparksCosmeticCatalog final : public UGameStateComponent
{
public:
	bool                                          bDefsAreInitialized;                               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class USparksAccountItemDefinition*> ItemDefinitionMap;                                 // 0x00E0(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<struct FPrimaryAssetId, class USparksAccountItemDefinition*> AssetIDMap;                                        // 0x0130(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_180[0x50];                                     // 0x0180(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USparksCosmeticCatalog* GetSparksCosmeticCatalog(const class UObject* WorldContextObject);

	class USparksAccountItemDefinition* GetItemDefFromAssetID(const struct FPrimaryAssetId& AssetID);

	const TArray<class FName> GetActiveItemDefNamesForSubtype(ESparksAccountItemSubtype SubType) const;
	const TArray<class FName> GetActiveItemDefNamesForSubtypeAndInstrument(ESparksAccountItemSubtype SubType, ESparksInstrumentType Instrument) const;
	class USparksAccountItemDefinition* GetItemDef(class FName InItemName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksCosmeticCatalog">();
	}
	static class USparksCosmeticCatalog* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksCosmeticCatalog>();
	}
};

// Class SparksCoreCosmeticsRuntime.SparksCosmeticComponent
// 0x03F0 (0x04C8 - 0x00D8)
class USparksCosmeticComponent final : public UPawnComponent
{
public:
	TMulticastInlineDelegate<void(class USparksAccountItemDefinition* ItemDef)> CosmeticItemChanged;                               // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(ESparksAccountItemSubtype Subtype, ESparksInstrumentType InstrumentType)> CosmeticChoiceChanged;                             // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnLoadoutFilled;                                   // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bIsLoadoutFilled;                                  // 0x0108(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x57];                                     // 0x0109(0x0057)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSparksCosmeticLoadoutData             CurrentLoadout;                                    // 0x0160(0x0100)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_260[0x8];                                      // 0x0260(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      ActiveAura;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPrimaryAssetId                        DefaultAuraItemDefID;                              // 0x0270(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USparksAuraItemDefinition*              AuraItemDef;                                       // 0x0288(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<ESparksInstrumentType, struct FPrimaryAssetId> DefaultInstrumentDefIDs;                           // 0x0290(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<ESparksInstrumentType, class USparksInstrumentItemDefBase*> InstrumentDefs;                                    // 0x02E0(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_330[0x80];                                     // 0x0330(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ESparksInstrumentType, struct FPrimaryAssetId> DefaultSpotlightAnimDefIDs;                        // 0x03B0(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<ESparksInstrumentType, class USparksSpotlightAnimDefinition*> SpotlightAnimDefs;                                 // 0x0400(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_450[0x60];                                     // 0x0450(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           AllValidJamTracksShortNameCache;                   // 0x04B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          HasCachedValidJamTracks;                           // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AuraStart();
	void AuraStop();
	void Debug_BP_ShowCosmeticPicker(bool bShow);
	void DebugForceAuraState(bool bShouldBeActive);
	void DoCacheValidJamTracks();
	void GetCosmeticItems(TArray<class USparksAccountItemDefinition*>* ItemDefs);
	class FName GetEquippedJamSongShortnameForIndex(int32 Index_0);
	class FString GetEquippedJamSongUIDForIndex(int32 Index_0);
	class FName GetOwnedJamSongShortnameForIndex(int32 Index_0);
	int32 GetOwnedJamTracksCount();
	void OnMaterialOverridesCleared(class AFortPlayerPawn* Pawn);
	void OnWeaponChanged(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void RefreshMCP();
	void SetActiveAuraItemDef(class USparksAuraItemDefinition* NewAuraItemDef);
	void SetActiveInstrumentItemDef(class USparksInstrumentItemDefBase* InstrumentItemDef);
	void SetActiveItemDef(class USparksAccountItemDefinition* NewItemDef);
	void SetActiveSpotlightAnimDef(class USparksSpotlightAnimDefinition* NewSpotlightDef);
	void SetAuraState(bool bShouldBeActive);
	void SetVariantChoice(ESparksAccountItemSubtype Subtype, ESparksInstrumentType InstrumentType, const struct FGameplayTag& VariantChannel, const class FString& Value);

	ESparksAccountItemSubtype GetAccountItemTypeFromInstrumentType(ESparksInstrumentType Instrument) const;
	bool GetChoice(struct FSparksVariantChoice* OutChoice, ESparksAccountItemSubtype Subtype, ESparksInstrumentType InstrumentType, const struct FGameplayTag& VariantChannel) const;
	const class USparksAccountItemDefinition* GetCosmeticItem(ESparksAccountItemSubtype SubType, ESparksInstrumentType Instrument) const;
	int32 GetEquippedJamTracksCount() const;
	bool GetInstrumentAuxiliaryCosmetics(ESparksInstrumentType InstrumentType, class USkeletalMesh** OutMesh, class UMaterialInstance** OutMaterial, class UMaterialInstance** OutMaterial2) const;
	bool GetInstrumentAuxiliaryVFX(ESparksInstrumentType InstrumentType, class UFXSystemAsset** OutFX, class FName* OutAuxFXSocket) const;
	bool GetInstrumentCosmetics(ESparksInstrumentType InstrumentType, class USkeletalMesh** OutMesh, class UMaterialInstance** OutMaterial, class USkeletalMesh** OutLHMesh, class UMaterialInstance** OutLHMaterial) const;
	bool GetInstrumentVFX(ESparksInstrumentType InstrumentType, class UFXSystemAsset** OutFX, class UFXSystemAsset** OutLHFX, class FName* OutMainFXSocket, class FName* OutLHFXSocket) const;
	class ULevelSequence* GetSpotlightAnim(ESparksInstrumentType InstrumentType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksCosmeticComponent">();
	}
	static class USparksCosmeticComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksCosmeticComponent>();
	}
};

// Class SparksCoreCosmeticsRuntime.SparksCosmeticsSettings
// 0x00D0 (0x0118 - 0x0048)
class USparksCosmeticsSettings final : public UPrimaryDataAsset
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AFortItemPreviewActor>      SparksCosmeticPreviewActorClass;                   // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AFortItemPreviewActor>      SparksPreviewCameraActorClass;                     // 0x0058(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AFortItemPreviewActor>      SparksAuraPreviewActorClass;                       // 0x0060(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AFortItemPreviewActor>      SparksAuraDisplayActorClass;                       // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AFortItemPreviewActor>      SparksSongPreviewActorClass;                       // 0x0070(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     SparksSongPrefabActorClass;                        // 0x0078(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCosmeticLoadoutSchema*                 SparksLoadoutSchema;                               // 0x0080(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortUICameraFrameTargetBounds         GuitarCameraFramingBounds;                         // 0x0088(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FFortUICameraFrameTargetBounds         BassCameraFramingBounds;                           // 0x00A8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FFortUICameraFrameTargetBounds         DrumCameraFramingBounds;                           // 0x00C8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FFortUICameraFrameTargetBounds         MicCameraFramingBounds;                            // 0x00E8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FPrimaryAssetId>                RandomCharacters;                                  // 0x0108(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksCosmeticsSettings">();
	}
	static class USparksCosmeticsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksCosmeticsSettings>();
	}
};

// Class SparksCoreCosmeticsRuntime.SparksCosmetics_BPFL
// 0x0000 (0x0030 - 0x0030)
class USparksCosmetics_BPFL final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksCosmetics_BPFL">();
	}
	static class USparksCosmetics_BPFL* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksCosmetics_BPFL>();
	}
};

// Class SparksCoreCosmeticsRuntime.SparksInstrumentComponentBase
// 0x0010 (0x00E8 - 0x00D8)
class USparksInstrumentComponentBase final : public UActorComponent
{
public:
	TArray<class UNiagaraComponent*>              SpawnedCosmeticVFX;                                // 0x00D8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	void DestroySpawnedVFX();

	ESparksInstrumentType GetInstrumentType() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksInstrumentComponentBase">();
	}
	static class USparksInstrumentComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksInstrumentComponentBase>();
	}
};

// Class SparksCoreCosmeticsRuntime.SparksInstrumentItemDefBase
// 0x0208 (0x0B40 - 0x0938)
class USparksInstrumentItemDefBase : public USparksAccountItemDefinition
{
public:
	TSoftObjectPtr<class USkeletalMesh>           Mesh;                                              // 0x0938(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>           LeftHandMesh;                                      // 0x0968(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>           AuxiliaryMesh;                                     // 0x0998(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstance>       Material;                                          // 0x09C8(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstance>       LeftHandMaterial;                                  // 0x09F8(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstance>       AuxiliaryMaterial;                                 // 0x0A28(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstance>       AuxiliaryMaterial2;                                // 0x0A58(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFXSystemAsset>          MainFXSystem;                                      // 0x0A88(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFXSystemAsset>          LHFXSystem;                                        // 0x0AB8(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFXSystemAsset>          AuxFXSystem;                                       // 0x0AE8(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MainFXSocket;                                      // 0x0B18(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LHFXSocket;                                        // 0x0B24(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AuxFXSocket;                                       // 0x0B30(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B3C[0x4];                                      // 0x0B3C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFXSystemAsset* GetAuxFXSystem(const struct FSparksVariantChoices& Choices) const;
	class UMaterialInstance* GetAuxiliaryMaterial(const struct FSparksVariantChoices& Choices) const;
	class UMaterialInstance* GetAuxiliaryMaterial2(const struct FSparksVariantChoices& Choices) const;
	class USkeletalMesh* GetAuxiliaryMesh(const struct FSparksVariantChoices& Choices) const;
	class UMaterialInstance* GetLeftHandMaterial(const struct FSparksVariantChoices& Choices) const;
	class USkeletalMesh* GetLeftHandMesh(const struct FSparksVariantChoices& Choices) const;
	class UFXSystemAsset* GetLHFXSystem(const struct FSparksVariantChoices& Choices) const;
	class UFXSystemAsset* GetMainFXSystem(const struct FSparksVariantChoices& Choices) const;
	class UMaterialInstance* GetMaterial(const struct FSparksVariantChoices& Choices) const;
	class USkeletalMesh* GetMesh(const struct FSparksVariantChoices& Choices) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksInstrumentItemDefBase">();
	}
	static class USparksInstrumentItemDefBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksInstrumentItemDefBase>();
	}
};

// Class SparksCoreCosmeticsRuntime.SparksGuitarItemDefinition
// 0x0000 (0x0B40 - 0x0B40)
class USparksGuitarItemDefinition final : public USparksInstrumentItemDefBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksGuitarItemDefinition">();
	}
	static class USparksGuitarItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksGuitarItemDefinition>();
	}
};

// Class SparksCoreCosmeticsRuntime.SparksBassItemDefinition
// 0x0000 (0x0B40 - 0x0B40)
class USparksBassItemDefinition final : public USparksInstrumentItemDefBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksBassItemDefinition">();
	}
	static class USparksBassItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksBassItemDefinition>();
	}
};

// Class SparksCoreCosmeticsRuntime.SparksDrumItemDefinition
// 0x0000 (0x0B40 - 0x0B40)
class USparksDrumItemDefinition final : public USparksInstrumentItemDefBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksDrumItemDefinition">();
	}
	static class USparksDrumItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksDrumItemDefinition>();
	}
};

// Class SparksCoreCosmeticsRuntime.SparksMicItemDefinition
// 0x0000 (0x0B40 - 0x0B40)
class USparksMicItemDefinition final : public USparksInstrumentItemDefBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksMicItemDefinition">();
	}
	static class USparksMicItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksMicItemDefinition>();
	}
};

// Class SparksCoreCosmeticsRuntime.SparksKeyboardItemDefinition
// 0x0000 (0x0B40 - 0x0B40)
class USparksKeyboardItemDefinition final : public USparksInstrumentItemDefBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksKeyboardItemDefinition">();
	}
	static class USparksKeyboardItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksKeyboardItemDefinition>();
	}
};

// Class SparksCoreCosmeticsRuntime.SparksJamEmoteItemDefinition
// 0x0010 (0x0BC0 - 0x0BB0)
class USparksJamEmoteItemDefinition final : public UAthenaDanceItemDefinition
{
public:
	class USparksSongItemDefinition*              SongItemDef;                                       // 0x0BB0(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFMJamLoopType                                LoopType;                                          // 0x0BB8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BB9[0x7];                                      // 0x0BB9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	EFMJamLoopType GetJamLoopType() const;
	const class UCatalogData* GetJamSongMetaData(const class UObject* WorldContextObject) const;
	class FName GetJamSongShortName(const class UObject* WorldContextObject) const;
	class USparksSongItemDefinition* GetSongItemDef() const;
	bool IsJamLoopEnabled(const class AFortPlayerController* PlayerController) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksJamEmoteItemDefinition">();
	}
	static class USparksJamEmoteItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksJamEmoteItemDefinition>();
	}
};

// Class SparksCoreCosmeticsRuntime.SparksSongItemDefinition
// 0x00D8 (0x0A10 - 0x0938)
class USparksSongItemDefinition final : public USparksAccountItemDefinition
{
public:
	uint8                                         Pad_938[0x8];                                      // 0x0938(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USparksJamEmoteItemDefinition> JamEmote_Vox;                                      // 0x0940(0x0030)(Edit, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USparksJamEmoteItemDefinition> JamEmote_Lead;                                     // 0x0970(0x0030)(Edit, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USparksJamEmoteItemDefinition> JamEmote_Bass;                                     // 0x09A0(0x0030)(Edit, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USparksJamEmoteItemDefinition> JamEmote_Drum;                                     // 0x09D0(0x0030)(Edit, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DebugShortNameOverride;                            // 0x0A00(0x000C)(ZeroConstructor, Transient, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0C[0x4];                                      // 0x0A0C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksSongItemDefinition">();
	}
	static class USparksSongItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksSongItemDefinition>();
	}
};

// Class SparksCoreCosmeticsRuntime.SparksSpotlightAnimDefinition
// 0x0038 (0x0970 - 0x0938)
class USparksSpotlightAnimDefinition : public USparksAccountItemDefinition
{
public:
	TSoftObjectPtr<class ULevelSequence>          SpotlightSequence;                                 // 0x0938(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESparksInstrumentType                         InstrumentType;                                    // 0x0968(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_969[0x7];                                      // 0x0969(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksSpotlightAnimDefinition">();
	}
	static class USparksSpotlightAnimDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksSpotlightAnimDefinition>();
	}
};

// Class SparksCoreCosmeticsRuntime.SparksGuitarSpotlightDefinition
// 0x0000 (0x0970 - 0x0970)
class USparksGuitarSpotlightDefinition final : public USparksSpotlightAnimDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksGuitarSpotlightDefinition">();
	}
	static class USparksGuitarSpotlightDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksGuitarSpotlightDefinition>();
	}
};

// Class SparksCoreCosmeticsRuntime.SparksDrumSpotlightDefinition
// 0x0000 (0x0970 - 0x0970)
class USparksDrumSpotlightDefinition final : public USparksSpotlightAnimDefinition
{
public:
	static class UClass* StaticClass()
	{
