#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksSongPlayerRuntime

#include "Basic.hpp"

#include "EpicMediaBasePlayer_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function SparksSongPlayerRuntime.SparksMediaStreamer.OnSongDataDownloaded
// 0x0010 (0x0010 - 0x0000)
struct SparksMediaStreamer_OnSongDataDownloaded final
{
public:
	class UCatalogData*                           CatalogData;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SparksSongPlayerRuntime.SparksMediaStreamer.OnVideoError
// 0x0001 (0x0001 - 0x0000)
struct SparksMediaStreamer_OnVideoError final
{
public:
	EBaseMediaTerminalErrorReason                 Reason;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksSongPlayerRuntime.SparksMediaStreamer.OnVideoOpenFailed
// 0x0010 (0x0010 - 0x0000)
struct SparksMediaStreamer_OnVideoOpenFailed final
{
public:
	class FString                                 FailedURL;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksSongPlayerRuntime.SparksSongPlayerSubsystem.PlaySongByCatalogData
// 0x0068 (0x0068 - 0x0000)
struct SparksSongPlayerSubsystem_PlaySongByCatalogData final
{
public:
	const class UCatalogData*                     CatalogData;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortMusicPlayerParams                 Params_0;                                          // 0x0008(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function SparksSongPlayerRuntime.SparksSongPlayerSubsystem.PlaySongByItemDef
// 0x0068 (0x0068 - 0x0000)
struct SparksSongPlayerSubsystem_PlaySongByItemDef final
{
public:
	const class USparksSongItemDefinition*        ItemDef;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortMusicPlayerParams                 Params_0;                                          // 0x0008(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function SparksSongPlayerRuntime.SparksSongPlayerSubsystem.PlaySongByShortName
// 0x0070 (0x0070 - 0x0000)
struct SparksSongPlayerSubsystem_PlaySongByShortName final
{
public:
	class FName                                   ShortName;                                         // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMusicPlayerParams                 Params_0;                                          // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function SparksSongPlayerRuntime.SparksSongPlayerSubsystem.StopSong
// 0x0008 (0x0008 - 0x0000)
struct SparksSongPlayerSubsystem_StopSong final
{
public:
	float                                         FadeOutTimeSeconds;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClearPendingSong;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SparksSongPlayerRuntime.SparksSongPreviewerComponent.StartPreviewByCatalogData
// 0x0008 (0x0008 - 0x0000)
struct SparksSongPreviewerComponent_StartPreviewByCatalogData final
{
public:
	const class UCatalogData*                     CatalogData;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksSongPlayerRuntime.SparksSongPreviewerComponent.StartPreviewByShortName
// 0x000C (0x000C - 0x0000)
struct SparksSongPreviewerComponent_StartPreviewByShortName final
{
public:
	class FName                                   ShortName;                                         // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksSongPlayerRuntime.SparksSongPreviewerComponent.StopCurrentPreview
// 0x0001 (0x0001 - 0x0000)
struct SparksSongPreviewerComponent_StopCurrentPreview final
{
public:
	bool                                          bWithFadeout;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksSongPlayerRuntime.SparksSongPreviewerComponent.GetCurrentPreview
// 0x0008 (0x0008 - 0x0000)
struct SparksSongPreviewerComponent_GetCurrentPreview final
{
public:
	const class UCatalogData*                     ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksSongPlayerRuntime.SparksSongPreviewerComponent.IsPlayingCurrentPreview
// 0x0001 (0x0001 - 0x0000)
struct SparksSongPreviewerComponent_IsPlayingCurrentPreview final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksSongPlayerRuntime.SparksSongPreviewerComponent.IsPlayingPreviewForSong
// 0x0010 (0x0010 - 0x0000)
struct SparksSongPreviewerComponent_IsPlayingPreviewForSong final
{
public:
	class FName                                   Song;                                              // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

