#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksCoreUI

#include "Basic.hpp"

#include "SparksCoreUI_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function SparksCoreUI.DynamicUISceneRequestCoordinatorComponent.Get
// 0x0010 (0x0010 - 0x0000)
struct DynamicUISceneRequestCoordinatorComponent_Get final
{
public:
	class APlayerController*                      Controller;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicUISceneRequestCoordinatorComponent* ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreUI.DynamicUISceneRequestCoordinatorComponent.AddSceneK2
// 0x0020 (0x0020 - 0x0000)
struct DynamicUISceneRequestCoordinatorComponent_AddSceneK2 final
{
public:
	struct FDynamicUISceneRequest                 Request;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FDynamicUISceneRequestHandle           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreUI.DynamicUISceneRequestCoordinatorComponent.AddScenesK2
// 0x0028 (0x0028 - 0x0000)
struct DynamicUISceneRequestCoordinatorComponent_AddScenesK2 final
{
public:
	const class UObject*                          Requester;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UDynamicUIScene*>                Scenes;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FDynamicUISceneRequestHandle           ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreUI.DynamicUISceneRequestCoordinatorComponent.RemoveSceneK2
// 0x0010 (0x0010 - 0x0000)
struct DynamicUISceneRequestCoordinatorComponent_RemoveSceneK2 final
{
public:
	struct FDynamicUISceneRequestHandle           Request;                                           // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreUI.DynamicUISceneRequestUtilities.IsValid
// 0x0018 (0x0018 - 0x0000)
struct DynamicUISceneRequestUtilities_IsValid final
{
public:
	struct FDynamicUISceneRequestHandle           Request;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SparksCoreUI.DynamicUISceneRequestUtilities.Reset
// 0x0010 (0x0010 - 0x0000)
struct DynamicUISceneRequestUtilities_Reset final
{
public:
	struct FDynamicUISceneRequestHandle           Request;                                           // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreUI.SparksDynamicUIDirector.HandleCursorModeChanging
// 0x0010 (0x0010 - 0x0000)
struct SparksDynamicUIDirector_HandleCursorModeChanging final
{
public:
	bool                                          bCursorModeEnabled;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActionName;                                        // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreUI.SparksQuestScreenContainer.EventRouterToggleQuestList
// 0x0001 (0x0001 - 0x0000)
struct SparksQuestScreenContainer_EventRouterToggleQuestList final
{
public:
	struct FSparksQuestScreenToggleEvent          PayLoad;                                           // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function SparksCoreUI.SparksQuestScreenContainer.HandleToggleQuestListFromMapVisibility
// 0x0001 (0x0001 - 0x0000)
struct SparksQuestScreenContainer_HandleToggleQuestListFromMapVisibility final
{
public:
	bool                                          bMapVisible;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreUI.SparksQuestScreenContainer.InitEventRouterBindings
// 0x0008 (0x0008 - 0x0000)
struct SparksQuestScreenContainer_InitEventRouterBindings final
{
public:
	class UGameplayEventRouterComponent*          NewEventRouter;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreUI.SparksQuestScreenContainer.SetQuestScreenVisible
// 0x0001 (0x0001 - 0x0000)
struct SparksQuestScreenContainer_SetQuestScreenVisible final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreUI.SparksSocialAvatarIcon.BP_SetSocialUserFromPlayerState
// 0x0008 (0x0008 - 0x0000)
struct SparksSocialAvatarIcon_BP_SetSocialUserFromPlayerState final
{
public:
	const class AFortPlayerState*                 PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreUI.SparksSongFilterVM.Initialize
// 0x0048 (0x0048 - 0x0000)
struct SparksSongFilterVM_Initialize final
{
public:
	class APlayerController*                      InOwningController;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  InSortTags;                                        // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  InFilterTags;                                      // 0x0028(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreUI.SparksSongItemDetailsVM.OnSongCatalogRetrieved
// 0x0001 (0x0001 - 0x0000)
struct SparksSongItemDetailsVM_OnSongCatalogRetrieved final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

