#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksCMS

#include "Basic.hpp"

#include "SparksCMS_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SparksCMS.CatalogData
// 0x01D0 (0x0200 - 0x0030)
class UCatalogData final : public UObject
{
public:
	bool                                          bFromHotfix;                                       // 0x0030(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0xF];                                       // 0x0031(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSparksSongCatalogEntry                DataEntry;                                         // 0x0040(0x01B0)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UCatalogData* Song, bool bSucceeded)> OnSongConsolidated;                                // 0x01F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void ClearConsolidatedData();
	void ConsolidateData();
	bool IsFromHotfix();

	class FName GetShortname() const;
	struct FGameplayTag GetTagForAgeRating() const;
	bool IsEnabled() const;
	bool IsEnabledForJam() const;
	bool IsEnabledForPilgrim() const;
	bool IsEpicOwned() const;
	bool IsLicensed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CatalogData">();
	}
	static class UCatalogData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCatalogData>();
	}
};

// Class SparksCMS.SparksSongCatalog
// 0x0148 (0x0180 - 0x0038)
class USparksSongCatalog final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_38[0x30];                                      // 0x0038(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class UCatalogData*>      CatalogByUid;                                      // 0x0068(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<class FString, class UCatalogData*>      CatalogByShortName;                                // 0x00B8(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<class FString, class UCatalogData*>      CatalogByTemplateId;                               // 0x0108(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UCatalogData*>                   CatalogObjectPool;                                 // 0x0158(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UUpdateManager*                         HFManager;                                         // 0x0168(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(bool bSucceeded)> OnSongCatalogRetrieved;                            // 0x0170(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void OnCalendarActiveEventsChanged(const TArray<class FString>& ActiveEventFlags);
	void RequestSongCatalog();
	void SetCMSSuffix(const class FString& InCMSSuffix);

	class UCatalogData* GetSongByShortName(const class FString& InShortName) const;
	class UCatalogData* GetSongByTemplateID(const class FString& InTemplateId) const;
	class UCatalogData* GetSongByUID(const class FString& InUID) const;
	void GetSongList(ESongSortMethod SortMethod, ESongSortDirection SortDirection, const struct FGameplayTagQuery& TagQuery, TArray<class UCatalogData*>& OutResults) const;
	bool IsSongDisabled(class FName SongShortName) const;
	bool IsSongFeatured(class FName SongShortName) const;
	bool IsSongSpotlighted(class FName SongShortName) const;
	bool PlayerHasSongEntitlement(const class AFortPlayerController* Player, class FName SongShortName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksSongCatalog">();
	}
	static class USparksSongCatalog* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksSongCatalog>();
	}
};

}

