#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksMusicPlayspaceRuntime

#include "Basic.hpp"

#include "PlayspaceSystem_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "SparksMusicPlayspaceRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "FMCoreRuntime_structs.hpp"
#include "SparksCoreRuntime_structs.hpp"


namespace SDK
{

// Class SparksMusicPlayspaceRuntime.PlayspaceComponent_LipSyncAssetManager
// 0x0028 (0x0100 - 0x00D8)
class UPlayspaceComponent_LipSyncAssetManager : public UPlayspaceComponent
{
public:
	TMulticastInlineDelegate<void(TSoftObjectPtr<class UAnimSequence> LipSyncAnimSequence, TArray<class APlayerState*>& PlayerStates)> OnLipSyncAnimChanged;                              // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x18];                                      // 0x00E8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TSoftObjectPtr<class UAnimSequence> TryGetLipSyncAnimAssetForPlayer(const class APlayerState* PlayerState) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayspaceComponent_LipSyncAssetManager">();
	}
	static class UPlayspaceComponent_LipSyncAssetManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceComponent_LipSyncAssetManager>();
	}
};

// Class SparksMusicPlayspaceRuntime.PlayspaceComponent_SparksPerfMem
// 0x0010 (0x00E8 - 0x00D8)
class UPlayspaceComponent_SparksPerfMem final : public UPlayspaceComponent
{
public:
	uint8                                         Pad_D8[0x10];                                      // 0x00D8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void StartTrackingServerPerf(const struct FSparksServerPerfMemSettings& Settings);
	void StopTrackingServerPerf();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayspaceComponent_SparksPerfMem">();
	}
	static class UPlayspaceComponent_SparksPerfMem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceComponent_SparksPerfMem>();
	}
};

// Class SparksMusicPlayspaceRuntime.SparksMusicPlayspaceInteractorInterface
// 0x0000 (0x0030 - 0x0030)
class ISparksMusicPlayspaceInteractorInterface : public IInterface
{
public:
	void EnteredSparksMusicPlayspace(class ASparksMusicPlayspace* Playspace);
	void ExitedSparksMusicPlayspace(class ASparksMusicPlayspace* Playspace);

	bool AllowedToEnterMusicPlayspace(class ASparksMusicPlayspace* Playspace) const;
	bool DoesSparksMusicPlayspaceInteratorHaveTag(const struct FGameplayTag& Tag) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksMusicPlayspaceInteractorInterface">();
	}
	static class ISparksMusicPlayspaceInteractorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISparksMusicPlayspaceInteractorInterface>();
	}
};

// Class SparksMusicPlayspaceRuntime.SparksMusicPlayerInterface
// 0x0000 (0x0030 - 0x0030)
class ISparksMusicPlayerInterface final : public ISparksMusicPlayspaceInteractorInterface
{
public:
	bool IsSparksMusicPlayerPlaying() const;
	bool IsSparksMusicPlayerPlayingWithKey() const;
	bool ShouldAutoRegister() const;
	void SparksMusicPlayerAddedToMusicPlayspace(class ASparksMusicPlayspace* Playspace) const;
	void SparksMusicPlayerRemovedFromMusicPlayspace(class ASparksMusicPlayspace* Playspace) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksMusicPlayerInterface">();
	}
	static class ISparksMusicPlayerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISparksMusicPlayerInterface>();
	}
};

// Class SparksMusicPlayspaceRuntime.SparksMusicPlayspace
// 0x00B0 (0x08F8 - 0x0848)
class ASparksMusicPlayspace : public AFortPlayspace
{
public:
	TMulticastInlineDelegate<void(TScriptInterface<class IMidiEventDriverInterface> MidiEventDriver)> OnMidiEventDriverChanged;                          // 0x0848(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_858[0x18];                                     // 0x0858(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(TScriptInterface<class IMidiEventDriverInterface> MidiEventDriver, class UParsedMidiEventData* ParsedMidiEventData)> OnMidiEventDataParsed;                             // 0x0870(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_880[0x18];                                     // 0x0880(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSparksPlayspaceInteractor>     Interactors;                                       // 0x0898(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UAudioComponent*                        MetasoundPlayer;                                   // 0x08A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        MetasoundMixer;                                    // 0x08B0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMusicClockComponent*                   MusicClock;                                        // 0x08B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSparksPlayspaceMusicPlayer>    MusicPlayers;                                      // 0x08C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class USparksMusicPlayspaceAudioState*        AudioState;                                        // 0x08D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USparksCameraDirectorComponent*         CameraDirector;                                    // 0x08D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayspaceComponent_PlayerManager*      PlayerManagerComp;                                 // 0x08E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayspaceComponent_LipSyncAssetManager* LipSyncManager;                                    // 0x08E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayspaceComponent_SparksPerfMem*      PerfMemComp;                                       // 0x08F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class ASparksMusicPlayspace* GetSparksMusicPlayspaceOfClass(TSubclassOf<class ASparksMusicPlayspace> PlayspaceType, const class UObject* WorldContextObject, class AActor* Actor, bool bMatchChildTypes);
	static class ASparksMusicPlayspace* GetSparksMusicPlayspaceOfClassByLocation(TSubclassOf<class ASparksMusicPlayspace> PlayspaceType, const class UObject* WorldContextObject, struct FVector* Location, bool bMatchChildTypes);

	bool AddInteractor(class UObject* Interactor, class AActor* ForActor);
	bool AddMusicPlayer(class UObject* Interactor, class AActor* ForActor);
	void BP_RemovePlayspaceUser(class AController* Controller);
	void BPEvent_OnIntialized();
	void BPEvent_OnUserAdded(const struct FPlayspaceUser& User, const class APlayerState* PlayerState);
	void BPEvent_OnUserRemoved(const struct FPlayspaceUser& User, const class APlayerState* PlayerState);
	void OnBeatEvent(int32 BeatNumber, int32 BeatInBar);
	void OnMeasureEvent(int32 MeasureNumber);
	bool RemoveInteractor(class UObject* Interactor, class AActor* ForActor);
	bool RemoveMusicPlayer(class UObject* MusicPlayer, class AActor* ForActor);

	TArray<class APlayerState*> BP_GetAllPlayerStates() const;
	class UGameplayEventRouterComponent* BP_GetOwnedEventRouter() const;
	bool DoesPlayerHaveInstrument(const class APlayerState* PlayerState, const ESparksInstrumentType InstrumentType) const;
	TArray<class AController*> GetAllPlayerControllers() const;
	TArray<class APawn*> GetAllPlayerPawns() const;
	TArray<class UObject*> GetMusicPlayers() const;
	bool HasGameplayTag(const struct FGameplayTag& CheckForTag) const;
	bool IsAnyMusicPlaying() const;
	bool IsAnyMusicPlayingWithKey() const;
	TScriptInterface<class IMidiEventDriverInterface> TryGetMidiEventDriverForPlayerState(const class APlayerState* PlayerState) const;
	TArray<TScriptInterface<class IMidiEventDriverInterface>> TryGetMidiEventDrivers() const;
	bool TryGetMusicKeyAndMode(EMusicKey* OutMusicKey, EMusicKeyMode* OutMusicKeyMode) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksMusicPlayspace">();
	}
	static class ASparksMusicPlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASparksMusicPlayspace>();
	}
};

// Class SparksMusicPlayspaceRuntime.SparksMusicPlayspaceAudioState
// 0x0008 (0x00E0 - 0x00D8)
class USparksMusicPlayspaceAudioState final : public UActorComponent
{
public:
	EMusicKey                                     CurrentKey;                                        // 0x00D8(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMusicKeyMode                                 CurrentMode;                                       // 0x00D9(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentTempo;                                      // 0x00DC(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnRep_OnKeyChanged();
	void OnRep_OnModeChanged();
	void OnRep_OnTempoChanged();
	void TriggerKeyChange(EMusicKey InKey);
	void TriggerModeChange(EMusicKeyMode InMode);
	void TriggerTempoChange(int32 Bpm);

	void GetCurrentAudioState(EMusicKey* OutKey, EMusicKeyMode* OutKeyMode, int32* OutTempo) const;
	EMusicKey GetCurrentKey() const;
	EMusicKeyMode GetCurrentKeyMode() const;
	int32 GetCurrentTempo() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksMusicPlayspaceAudioState">();
	}
	static class USparksMusicPlayspaceAudioState* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksMusicPlayspaceAudioState>();
	}
};

}

