#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksCoreUI

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct SparksCoreUI.DynamicUISceneRequest
// 0x0010 (0x0010 - 0x0000)
struct FDynamicUISceneRequest final
{
public:
	class UObject*                                Requester;                                         // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicUIScene*                        Scene;                                             // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SparksCoreUI.DynamicUISceneRequestData
// 0x0018 (0x0018 - 0x0000)
struct FDynamicUISceneRequestData final
{
public:
	struct FDynamicUISceneRequest                 Request;                                           // 0x0000(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SparksCoreUI.DynamicUISceneRequestHandle
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FDynamicUISceneRequestHandle final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SparksCoreUI.SparksQuestScreenToggleEvent
// 0x0001 (0x0001 - 0x0000)
struct FSparksQuestScreenToggleEvent final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

