#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialMetricsCore

#include "Basic.hpp"

#include "SpatialMetricsCore_structs.hpp"
#include "WorldMetricsCore_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SpatialMetricsCore.SpatialMetricInterface
// 0x0028 (0x0058 - 0x0030)
class USpatialMetricInterface : public UWorldMetricInterface
{
public:
	struct FSpatialMetricProperties               Properties;                                        // 0x0030(0x0028)(Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricInterface">();
	}
	static class USpatialMetricInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricInterface>();
	}
};

// Class SpatialMetricsCore.SpatialMetricsContextInterface
// 0x0000 (0x0030 - 0x0030)
class ISpatialMetricsContextInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsContextInterface">();
	}
	static class ISpatialMetricsContextInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISpatialMetricsContextInterface>();
	}
};

// Class SpatialMetricsCore.SpatialMetricsActorIndexerSubscriber
// 0x0000 (0x0030 - 0x0030)
class ISpatialMetricsActorIndexerSubscriber final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsActorIndexerSubscriber">();
	}
	static class ISpatialMetricsActorIndexerSubscriber* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISpatialMetricsActorIndexerSubscriber>();
	}
};

// Class SpatialMetricsCore.SpatialMetricsLocationIndexerSubscriber
// 0x0000 (0x0030 - 0x0030)
class ISpatialMetricsLocationIndexerSubscriber final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsLocationIndexerSubscriber">();
	}
	static class ISpatialMetricsLocationIndexerSubscriber* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISpatialMetricsLocationIndexerSubscriber>();
	}
};

// Class SpatialMetricsCore.SpatialMetricBase
// 0x1028 (0x1080 - 0x0058)
class USpatialMetricBase : public USpatialMetricInterface
{
public:
	uint8                                         Pad_58[0x1020];                                    // 0x0058(0x1020)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SamplingFrequencyInSeconds;                        // 0x1078(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_107C[0x4];                                     // 0x107C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricBase">();
	}
	static class USpatialMetricBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricBase>();
	}
};

// Class SpatialMetricsCore.SpatialMetricsActorIndexer
// 0x01C0 (0x01F0 - 0x0030)
class USpatialMetricsActorIndexer final : public UWorldMetricsExtension
{
public:
	uint8                                         Pad_30[0x1B8];                                     // 0x0030(0x01B8)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IndexCacheSize;                                    // 0x01E8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsActorIndexer">();
	}
	static class USpatialMetricsActorIndexer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsActorIndexer>();
	}
};

// Class SpatialMetricsCore.SpatialMetricsEditorContext
// 0x0010 (0x0040 - 0x0030)
class USpatialMetricsEditorContext final : public UWorldMetricsExtension
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpatialPrecision;                                  // 0x0038(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsEditorContext">();
	}
	static class USpatialMetricsEditorContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsEditorContext>();
	}
};

// Class SpatialMetricsCore.SpatialMetricsLocationIndexer
// 0x0120 (0x0150 - 0x0030)
class USpatialMetricsLocationIndexer final : public UWorldMetricsExtension
{
public:
	uint8                                         Pad_30[0x120];                                     // 0x0030(0x0120)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsLocationIndexer">();
	}
	static class USpatialMetricsLocationIndexer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsLocationIndexer>();
	}
};

// Class SpatialMetricsCore.SpatialMetricsPlayerContext
// 0x0018 (0x0048 - 0x0030)
class USpatialMetricsPlayerContext final : public UWorldMetricsExtension
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpatialPrecision;                                  // 0x0040(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPlayerPawnPossessionChanged(class APawn* OldPawn, class APawn* NewPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsPlayerContext">();
	}
	static class USpatialMetricsPlayerContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsPlayerContext>();
	}
};

// Class SpatialMetricsCore.SpatialMetricsSubsystem
// 0x0048 (0x0080 - 0x0038)
class USpatialMetricsSubsystem final : public UWorldSubsystem
{
public:
	TArray<class USpatialMetricInterface*>        Metrics;                                           // 0x0038(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FSoftClassPath>                 AllowedMetricClasses;                              // 0x0048(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TArray<struct FSoftClassPath>                 BlockedMetricClasses;                              // 0x0058(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x1];                                       // 0x0068(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAutoCreateConnectorServer;                        // 0x0069(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6A[0x16];                                      // 0x006A(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsSubsystem">();
	}
	static class USpatialMetricsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsSubsystem>();
	}
};

// Class SpatialMetricsCore.TestMetric
// 0x0028 (0x10A8 - 0x1080)
class UTestMetric final : public USpatialMetricBase
{
public:
	uint8                                         Pad_1080[0x28];                                    // 0x1080(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TestMetric">();
	}
	static class UTestMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestMetric>();
	}
};

}

