#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialMetricsExperimental

#include "Basic.hpp"

#include "WorldMetricsCore_classes.hpp"
#include "SpatialMetricsExperimental_structs.hpp"
#include "SpatialMetricsCore_classes.hpp"


namespace SDK
{

// Class SpatialMetricsExperimental.LevelPackageDiskSizeMetric
// 0x03A0 (0x03F8 - 0x0058)
class ULevelPackageDiskSizeMetric final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_58[0x390];                                     // 0x0058(0x0390)(Fixing Size After Last Property [ Dumper-7 ])
	class USpatialMetricsPackageMetadataProvider* IoStorePackageHandler;                             // 0x03E8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EIoDispatcherChunkTypeFlags                   ChunkTypeFlags;                                    // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelPackageDiskSizeMetric">();
	}
	static class ULevelPackageDiskSizeMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelPackageDiskSizeMetric>();
	}
};

// Class SpatialMetricsExperimental.SceneGraphComponentCountMetric
// 0x0008 (0x1088 - 0x1080)
class USceneGraphComponentCountMetric final : public USpatialMetricBase
{
public:
	uint8                                         Pad_1080[0x8];                                     // 0x1080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SceneGraphComponentCountMetric">();
	}
	static class USceneGraphComponentCountMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USceneGraphComponentCountMetric>();
	}
};

// Class SpatialMetricsExperimental.SceneGraphEntityCountMetric
// 0x0008 (0x1088 - 0x1080)
class USceneGraphEntityCountMetric final : public USpatialMetricBase
{
public:
	uint8                                         Pad_1080[0x8];                                     // 0x1080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SceneGraphEntityCountMetric">();
	}
	static class USceneGraphEntityCountMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USceneGraphEntityCountMetric>();
	}
};

// Class SpatialMetricsExperimental.SpatialMetricsPackageMetadataProvider
// 0x0008 (0x0038 - 0x0030)
class USpatialMetricsPackageMetadataProvider final : public UWorldMetricsExtension
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsPackageMetadataProvider">();
	}
	static class USpatialMetricsPackageMetadataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsPackageMetadataProvider>();
	}
};

}

