#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialMetricsEditor

#include "Basic.hpp"

#include "SpatialMetricsEditor_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "SpatialMetricsCore_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SpatialMetricsEditor.SpatialMetricsProfilerPerProjectUserSettings
// 0x0078 (0x00D8 - 0x0060)
class USpatialMetricsProfilerPerProjectUserSettings final : public UDeveloperSettings
{
public:
	bool                                          bDeveloperMode;                                    // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsNetworkEventNotificationEnabled;                // 0x0061(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMetricHeatmapColorProperties   HeatmapColorProperties;                            // 0x0064(0x0024)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	TMap<struct FSoftClassPath, struct FSpatialMetricProfilingSettings> MetricProfilingSettings;                           // 0x0088(0x0050)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsProfilerPerProjectUserSettings">();
	}
	static class USpatialMetricsProfilerPerProjectUserSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsProfilerPerProjectUserSettings>();
	}
};

// Class SpatialMetricsEditor.SpatialMetricsProfilerSettings
// 0x0050 (0x00B0 - 0x0060)
class USpatialMetricsProfilerSettings final : public UDeveloperSettings
{
public:
	TSet<class FName>                             AnalyticsMetadataAllowList;                        // 0x0060(0x0050)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsProfilerSettings">();
	}
	static class USpatialMetricsProfilerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsProfilerSettings>();
	}
};

// Class SpatialMetricsEditor.SpatialMetricsProfilerSubsystem
// 0x0108 (0x0140 - 0x0038)
class USpatialMetricsProfilerSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_38[0x108];                                     // 0x0038(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsProfilerSubsystem">();
	}
	static class USpatialMetricsProfilerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsProfilerSubsystem>();
	}
};

}

