#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SqueegeeUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_classes.hpp"
#include "SqueegeeUI_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class SqueegeeUI.FortContentGateDetailsWidget
// 0x0008 (0x0468 - 0x0460)
class UFortContentGateDetailsWidget final : public UFortSqueegeeWidget
{
public:
	class UFortContentGateRatingWidget*           ContentGateRatingWidget;                           // 0x0460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnShowGamemodeDescription(const class FString& ActivityTitle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContentGateDetailsWidget">();
	}
	static class UFortContentGateDetailsWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentGateDetailsWidget>();
	}
};

// Class SqueegeeUI.FortContentGateRatingWidget
// 0x0000 (0x0460 - 0x0460)
class UFortContentGateRatingWidget final : public UFortSqueegeeWidget
{
public:
	void OnLabelUpdated(bool bLabelEnabled, const class FText& LabelText, const class FText& LabelNumber);
	void OnStyleUpdated(const struct FSqueegeeStyleParams& StyleParams);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContentGateRatingWidget">();
	}
	static class UFortContentGateRatingWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentGateRatingWidget>();
	}
};

// Class SqueegeeUI.FortContentManagementDetails
// 0x0038 (0x0498 - 0x0460)
class UFortContentManagementDetails final : public UFortSqueegeeWidget
{
public:
	class UFortContentGateRatingWidget*           ContentGateRatingWidget;                           // 0x0460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_468[0x30];                                     // 0x0468(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);
	void OnShowActivityData(const class FText& ActivityDisplayName, const class FText& ActivityDescription, const class FString& CreatorName, const class FText& LinkCode, const bool IsCreative, const struct FDateTime& UnlockTime, class UFortGameActivity* GameActivity);
	void OnShowWeaponData();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContentManagementDetails">();
	}
	static class UFortContentManagementDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentManagementDetails>();
	}
};

// Class SqueegeeUI.FortContentManagementButton
// 0x0030 (0x1830 - 0x1800)
class UFortContentManagementButton final : public UCommonButtonBase
{
public:
	uint8                                         Pad_1800[0x30];                                    // 0x1800(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnChangeManagementState(EFortContentManagementState NewState);
	void OnShowError(const class FText& ErrorText);
	void OnShowGameActivity(const class UFortGameActivity* NewGameActivity);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContentManagementButton">();
	}
	static class UFortContentManagementButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentManagementButton>();
	}
};

// Class SqueegeeUI.FortContentManagementLabelWidget
// 0x0008 (0x0420 - 0x0418)
class UFortContentManagementLabelWidget final : public UUserWidget
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSetLabel(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContentManagementLabelWidget">();
	}
	static class UFortContentManagementLabelWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentManagementLabelWidget>();
	}
};

// Class SqueegeeUI.FortContentManagementEntryLabelObject
// 0x0010 (0x0040 - 0x0030)
class UFortContentManagementEntryLabelObject final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContentManagementEntryLabelObject">();
	}
	static class UFortContentManagementEntryLabelObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentManagementEntryLabelObject>();
	}
};

// Class SqueegeeUI.FortContentManagementEntryDataObject
// 0x0040 (0x0070 - 0x0030)
class UFortContentManagementEntryDataObject final : public UObject
{
public:
	uint8                                         Pad_30[0x40];                                      // 0x0030(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContentManagementEntryDataObject">();
	}
	static class UFortContentManagementEntryDataObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentManagementEntryDataObject>();
	}
};

// Class SqueegeeUI.FortContentManagementListView
// 0x0000 (0x0D80 - 0x0D80)
class UFortContentManagementListView final : public UCommonListView
{
public:
	TSubclassOf<class UFortContentManagementLabelWidget> LabelWidget;                                       // 0x0D78(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContentManagementListView">();
	}
	static class UFortContentManagementListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentManagementListView>();
	}
};

// Class SqueegeeUI.FortContentManagementList
// 0x0070 (0x04D0 - 0x0460)
class UFortContentManagementList final : public UFortSqueegeeWidget
{
public:
	class FText                                   WeaponLabelText;                                   // 0x0460(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   GameModeLabelText;                                 // 0x0470(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	class UFortContentManagementListView*         ContentManagementListView;                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_488[0x18];                                     // 0x0488(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortGameActivity*>              CachedActivities;                                  // 0x04A0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4B0[0x20];                                     // 0x04B0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnNextUnlockPageRequestCompleted(bool bSuccess);
	void RequestNextUnlockPage();
	void ResetUnlockList();

	bool CanRequestNextUnlockPage() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContentManagementList">();
	}
	static class UFortContentManagementList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentManagementList>();
	}
};

// Class SqueegeeUI.FortContentManagementScreen
// 0x0018 (0x06E0 - 0x06C8)
class UFortContentManagementScreen final : public UFortPinScreen
{
public:
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x06C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortContentManagementList*             ContentManagementList;                             // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortContentManagementDetails*          ContentManagementDetails;                          // 0x06D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ExitScreen();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContentManagementScreen">();
	}
	static class UFortContentManagementScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContentManagementScreen>();
	}
};

// Class SqueegeeUI.SqueegeeUIGameFeatureAction
// 0x0050 (0x0080 - 0x0030)
class USqueegeeUIGameFeatureAction final : public UFortUIGameFeatureAction
{
public:
	TArray<struct FSqueegeeInjectionData>         SqueegeeWidgetInjections;                          // 0x0030(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSqueegeeTextData>              SqueegeTexts;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   SqueegeeIntroModalClass;                           // 0x0050(0x0030)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SqueegeeUIGameFeatureAction">();
	}
	static class USqueegeeUIGameFeatureAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USqueegeeUIGameFeatureAction>();
	}
};

}

