#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SrirachaRanch

#include "Basic.hpp"

#include "SrirachaRanch_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "EpicMediaBasePlayer_structs.hpp"
#include "EpicStreamMediaSource_structs.hpp"


namespace SDK
{

// Class SrirachaRanch.FakeRadioPlayerComponent
// 0x0080 (0x0160 - 0x00E0)
class UFakeRadioPlayerComponent final : public UFortPawnComponent
{
public:
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFakeRadioStart;                                  // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFakeRadioStop;                                   // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bReplicatedRadioIsActive;                          // 0x0108(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FSrirachaInputMappingData> InputMappingData;                                  // 0x0110(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void NativeOnPawnEnterSeat(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void OnRep_RadioIsActive();
	void ServerToggleRadioActive();
	void ToggleRadioActive();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FakeRadioPlayerComponent">();
	}
	static class UFakeRadioPlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFakeRadioPlayerComponent>();
	}
};

// Class SrirachaRanch.StreamingRadioAudioShapeComponent
// 0x0058 (0x01D8 - 0x0180)
class UStreamingRadioAudioShapeComponent final : public UFortAudioShapeComponent
{
public:
	float                                         Radius;                                            // 0x0180(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStreamingRadioPlayerComponent*         RadioPlayer;                                       // 0x0188(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_190[0x48];                                     // 0x0190(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StreamingRadioAudioShapeComponent">();
	}
	static class UStreamingRadioAudioShapeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStreamingRadioAudioShapeComponent>();
	}
};

// Class SrirachaRanch.SrirachaRanchComponentTemplateWrapper
// 0x0008 (0x0040 - 0x0038)
class USrirachaRanchComponentTemplateWrapper final : public UDataAsset
{
public:
	class UMediaSoundComponent*                   MediaSoundPlayerTemplate;                          // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SrirachaRanchComponentTemplateWrapper">();
	}
	static class USrirachaRanchComponentTemplateWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<USrirachaRanchComponentTemplateWrapper>();
	}
};

// Class SrirachaRanch.StreamingRadioPlayerComponent
// 0x04F8 (0x05D8 - 0x00E0)
class UStreamingRadioPlayerComponent : public UFortPawnComponent
{
public:
	uint8                                         Pad_E0[0x10];                                      // 0x00E0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EPrimitiveCrosstalkFunctions, struct FPrimitiveCrosstalkNameArray> SupportedFunctions;                                // 0x00F0(0x0050)(Edit, EditFixedSize, Transient, EditConst, NoClear, EditorOnly, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, struct FSrirachaInputMappingData> InputMappingData;                                  // 0x0140(0x0050)(Edit, EditFixedSize, DisableEditOnInstance, NoClear, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, struct FSrirachaInputMappingData> RadialMenuInputMappingData;                        // 0x0190(0x0050)(Edit, EditFixedSize, DisableEditOnInstance, NoClear, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UStreamingRadioPlayerComponent* Component, struct FAthenaRadioStation& AffectedSource)> OnSourceLoading;                                   // 0x01E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UStreamingRadioPlayerComponent* Component, struct FAthenaRadioStation& AffectedSource)> OnSourcePlayed;                                    // 0x01F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UStreamingRadioPlayerComponent* Component, struct FAthenaRadioStation& AffectedSource)> OnSourceStopped;                                   // 0x0200(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UStreamingRadioPlayerComponent* Component, struct FAthenaRadioStation& AffectedSource)> OnSourceFailed;                                    // 0x0210(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(struct FFortMediaInBandMetadata& Metadata)> OnMetadataChanged;                                 // 0x0220(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UStreamingRadioPlayerComponent* Component, struct FAthenaRadioStation& AffectedSource)> OnRadioExplicitStop;                               // 0x0230(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         PercentAutostartRadio;                             // 0x0240(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           DisabledVehicleList;                               // 0x0248(0x0010)(ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, float>                      ExteriorVolumeMultiplierMap;                       // 0x0258(0x0050)(Config, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, float>                      InteriorVolumeMultiplierMap;                       // 0x02A8(0x0050)(Config, Protected, NativeAccessSpecifierProtected)
	bool                                          bMinimalStateOnPlatform;                           // 0x02F8(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         DisabledStationList;                               // 0x0300(0x0010)(ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	bool                                          bAutostartOnEntry;                                 // 0x0310(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisabledForCurrentPlayerState;                    // 0x0311(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStreamingRadioSourceData              ReplicatedRadioSourceData;                         // 0x0318(0x0060)(Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(EStreamingRadioSourceState NewState)> OnReplicatedStateChangedDelegate;                  // 0x0378(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	class UMediaSoundComponent*                   SoundComponent;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStreamingRadioAudioShapeComponent*     AudioShape;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USrirachaRanchComponentTemplateWrapper* SoundCompTemplateSource;                           // 0x0398(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAthenaRadioStation                    LastSource;                                        // 0x03A0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FFortMediaInBandMetadata               LastMetadata;                                      // 0x03F0(0x0090)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<class URadioContentSourceItemDefinition*> Sources;                                           // 0x0480(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FAthenaRadioStation                    FallbackSource;                                    // 0x0490(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FSrirachaPerClassSpecialSeats> SpecialSeatList;                                   // 0x04E0(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	class UFortBaseStreamingVideo*                BasePlayerInstance;                                // 0x0530(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundSubmixBase*                       DefaultSoundSubmix;                                // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundSubmixBase*                       LicensedSoundSubmix;                               // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ERadioSource                                  CurrentMode;                                       // 0x0548(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_549[0x3];                                      // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaximumRetries;                                    // 0x054C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         FadeoutWhenUnpoweredInMS;                          // 0x0550(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         FadeoutWhenOwnerBeingDestroyedInMS;                // 0x0554(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxFadeoutTimeMS;                                  // 0x0558(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DefaultPlayingIndex;                               // 0x055C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundMix*                              SoundMixInside;                                    // 0x0560(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundMix*                              SoundMixOutside;                                   // 0x0568(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_570[0x4];                                      // 0x0570(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ActivationRadius;                                  // 0x0574(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ComponentToAttachTo;                               // 0x0578(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ComponentSocketAttachTo;                           // 0x0584(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortStreamMediaSource*                 MediaSource;                                       // 0x0590(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAthenaRadioStation>            RadioStationList;                                  // 0x0598(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UObject*                                DelegateContextObject;                             // 0x05A8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MediaStartTimeFromInit;                            // 0x05B0(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B4[0x24];                                     // 0x05B4(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFortBaseStreamingVideo* GetBaseStreamingVideo();
	struct FFortMediaInBandMetadata GetMediaMetadata();
	void HandleLicensedAudioTreatmentChanged(EUCPTypes UcpType);
	void MediaClose();
	void MediaClosed();
	void MediaEnded();
	void MediaOnSuccess();
	void MediaResumed();
	void MediaTerminalError(EBaseMediaTerminalErrorReason Reason);
	void MetadataChanged(const struct FFortMediaInBandMetadata& Metadata);
	void NativeOnPawnEnterSeat(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void NativeOnPawnEnterVehicle(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void NativeOnPawnExitSeat(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void NativeOnPawnExitVehicle(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void NativeOnVehicleOwnerChanged(const TScriptInterface<class IFortVehicleInterface>& Vehicle, const class AActor* NewOwner, const class AActor* PrevOwner);
	void OnOwnerDisabledChanged(bool bDisabled);
	void OnOwnerExploded();
	void OnOwnerOutOfFuel();
	void OnOwnerReFueledFromEmpty();
	void OnOwnerUnpowered();
	void OnOwningVehicleDied(class AFortAthenaVehicle* DeadVehicle, const struct FGameplayTagContainer& InTags, class AController* EventInstigator, class AActor* DamageCauser);
	void OnPawnEnterSeat(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void OnPawnEnterVehicle(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void OnPawnExitSeat(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void OnPawnExitVehicle(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void OnPiPPlayerBlockedChanged(bool bPiPPlayerBlocking);
	void OnRep_RadioSourceData();
	void PlayDefaultIndex();
	void PlayIndex(int32 Index_0);
	void PlayNextIndex();
	void PlayPrevIndex();
	void ServerPlayIndex(const int32 InIndex, const EStreamingRadioSourceState InState);
	void ServerSaveAutoStart(const bool bInAutoStart);
	void ServerSavedSource(const struct FAthenaRadioStation& InSource);
	void ServerSaveFadeOutTime(const float InFadeOutSeconds);
	void ServerSetDisabledForCurrentPlayerState(const bool bInDisableForCurrentPlayerState);
	void ServerStopRadio();
	void SetActivationRadius(float InRadius);
	void SetExteriorVolume(const TScriptInterface<class IFortVehicleInterface>& Vehicle);
	void SetInteriorVolume(const TScriptInterface<class IFortVehicleInterface>& Vehicle);
	void SoundMixUpdateTargetingState(bool bNewIsTargeting);
	void SoundMixUpdateWeaponState(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void StartRadio(int32 IdxToPlay, bool bFallbackOverride);
	void StopIfNoDriver(const TScriptInterface<class IFortVehicleInterface>& Vehicle);
	void StopRadio();
	void StopRadioWithFadeout(int32 Milliseconds);
	void ToggleRadioActive();

	struct FAthenaRadioStation GetOptionAt(int32 Idx) const;
	bool IsExternalSeat(int32 SeatIdx) const;
	bool IsPlayingLiveFeed() const;
	bool IsRadioOn() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StreamingRadioPlayerComponent">();
	}
	static class UStreamingRadioPlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStreamingRadioPlayerComponent>();
	}
};

// Class SrirachaRanch.RadioContentSourceItemDefinition
// 0x0018 (0x0520 - 0x0508)
class URadioContentSourceItemDefinition final : public UFortAccountItemDefinition
{
public:
	class FString                                 ResourceID;                                        // 0x0508(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortStreamMediaSource*                 MediaSource;                                       // 0x0518(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RadioContentSourceItemDefinition">();
	}
	static class URadioContentSourceItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadioContentSourceItemDefinition>();
	}
};

}

