#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StateTreeModule

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "StateTreeModule_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class StateTreeModule.StateTreeSchemaProvider
// 0x0000 (0x0030 - 0x0030)
class IStateTreeSchemaProvider final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeSchemaProvider">();
	}
	static class IStateTreeSchemaProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IStateTreeSchemaProvider>();
	}
};

// Class StateTreeModule.StateTreeSettings
// 0x0008 (0x0068 - 0x0060)
class UStateTreeSettings final : public UDeveloperSettings
{
public:
	bool                                          bAutoStartDebuggerTracesOnNonEditorTargets;        // 0x0060(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeSettings">();
	}
	static class UStateTreeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeSettings>();
	}
};

// Class StateTreeModule.StateTreeNodeBlueprintBase
// 0x0048 (0x0078 - 0x0030)
class UStateTreeNodeBlueprintBase : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CachedOwner;                                       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStateTree*                             CachedFrameStateTree;                              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Description;                                       // 0x0058(0x0010)(Edit, DisableEditOnInstance, EditorOnly, NativeAccessSpecifierPrivate)
	class FName                                   IconName;                                          // 0x0068(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FColor                                 IconColor;                                         // 0x0074(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void RequestTransition(const struct FStateTreeStateLink& TargetState, const EStateTreeTransitionPriority Priority);
	void SendEvent(const struct FStateTreeEvent& Event);

	class FText GetPropertyDescriptionByPropertyName(class FName PropertyName) const;
	void GetPropertyReference(const struct FStateTreeBlueprintPropertyRef& PropertyRef) const;
	bool IsPropertyRefValid(const struct FStateTreeBlueprintPropertyRef& PropertyRef) const;
	class FText ReceiveGetDescription(EStateTreeNodeFormatting Formatting) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeNodeBlueprintBase">();
	}
	static class UStateTreeNodeBlueprintBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeNodeBlueprintBase>();
	}
};

// Class StateTreeModule.StateTreeConditionBlueprintBase
// 0x0008 (0x0080 - 0x0078)
class UStateTreeConditionBlueprintBase final : public UStateTreeNodeBlueprintBase
{
public:
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool ReceiveTestCondition() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeConditionBlueprintBase">();
	}
	static class UStateTreeConditionBlueprintBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeConditionBlueprintBase>();
	}
};

// Class StateTreeModule.StateTreeConsiderationBlueprintBase
// 0x0008 (0x0080 - 0x0078)
class UStateTreeConsiderationBlueprintBase final : public UStateTreeNodeBlueprintBase
{
public:
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float ReceiveComputeRawScore() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeConsiderationBlueprintBase">();
	}
	static class UStateTreeConsiderationBlueprintBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeConsiderationBlueprintBase>();
	}
};

// Class StateTreeModule.StateTreeEvaluatorBlueprintBase
// 0x0008 (0x0080 - 0x0078)
class UStateTreeEvaluatorBlueprintBase final : public UStateTreeNodeBlueprintBase
{
public:
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceiveTick(const float DeltaTime);
	void ReceiveTreeStart();
	void ReceiveTreeStop();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeEvaluatorBlueprintBase">();
	}
	static class UStateTreeEvaluatorBlueprintBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeEvaluatorBlueprintBase>();
	}
};

// Class StateTreeModule.StateTreeTaskBlueprintBase
// 0x0008 (0x0080 - 0x0078)
class UStateTreeTaskBlueprintBase : public UStateTreeNodeBlueprintBase
{
public:
	uint8                                         Pad_78[0x1];                                       // 0x0078(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bShouldStateChangeOnReselect : 1;                  // 0x0079(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         BitPad_79_1 : 1;                                   // 0x0079(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bShouldCallTickOnlyOnEvents : 1;                   // 0x0079(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bShouldCopyBoundPropertiesOnTick : 1;              // 0x0079(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bShouldCopyBoundPropertiesOnExitState : 1;         // 0x0079(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FinishTask(const bool bSucceeded);
	EStateTreeRunStatus ReceiveEnterState(const struct FStateTreeTransitionResult& Transition);
	void ReceiveExitState(const struct FStateTreeTransitionResult& Transition);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);
	void ReceiveLatentTick(const float DeltaTime);
	void ReceiveStateCompleted(const EStateTreeRunStatus CompletionStatus, const struct FStateTreeActiveStates& CompletedActiveStates);
	EStateTreeRunStatus ReceiveTick(const float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeTaskBlueprintBase">();
	}
	static class UStateTreeTaskBlueprintBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeTaskBlueprintBase>();
	}
};

// Class StateTreeModule.StateTree
// 0x0210 (0x0248 - 0x0038)
class UStateTree final : public UDataAsset
{
public:
	class UObject*                                EditorData;                                        // 0x0038(0x0008)(ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        LastCompiledEditorDataHash;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStateTreeSchema*                       Schema;                                            // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FCompactStateTreeState>         States;                                            // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FCompactStateTransition>        Transitions;                                       // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FInstancedStructContainer              Nodes;                                             // 0x0080(0x0010)(NativeAccessSpecifierPrivate)
	struct FStateTreeInstanceData                 DefaultInstanceData;                               // 0x0090(0x0020)(NativeAccessSpecifierPrivate)
	struct FStateTreeInstanceData                 SharedInstanceData;                                // 0x00B0(0x0020)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x18];                                      // 0x00D0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStateTreeExternalDataDesc>     ContextDataDescs;                                  // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FStateTreePropertyBindings             PropertyBindings;                                  // 0x00F8(0x0098)(NativeAccessSpecifierPrivate)
	TArray<struct FStateTreeStateIdToHandle>      IDToStateMappings;                                 // 0x0190(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FStateTreeNodeIdToIndex>        IDToNodeMappings;                                  // 0x01A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FStateTreeTransitionIdToIndex>  IDToTransitionMappings;                            // 0x01B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FInstancedPropertyBag                  Parameters;                                        // 0x01C0(0x0010)(NativeAccessSpecifierPrivate)
	uint16                                        NumContextData;                                    // 0x01D0(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        NumGlobalInstanceData;                             // 0x01D2(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        EvaluatorsBegin;                                   // 0x01D4(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        EvaluatorsNum;                                     // 0x01D6(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        GlobalTasksBegin;                                  // 0x01D8(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        GlobalTasksNum;                                    // 0x01DA(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasGlobalTransitionTasks;                         // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStateTreeExternalDataDesc>     ExternalDataDescs;                                 // 0x01E0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1F0[0x58];                                     // 0x01F0(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTree">();
	}
	static class UStateTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTree>();
	}
};

// Class StateTreeModule.StateTreeSchema
// 0x0000 (0x0030 - 0x0030)
class UStateTreeSchema : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeSchema">();
	}
	static class UStateTreeSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeSchema>();
	}
};

}

