#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StateDrivenActorRuntime

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum StateDrivenActorRuntime.EStateDrivenStateID
// NumValues: 0x000E
enum class EStateDrivenStateID : uint8
{
	Invalid                                  = 0,
	Success                                  = 1,
	Failure                                  = 2,
	State_A                                  = 3,
	State_B                                  = 4,
	State_C                                  = 5,
	State_D                                  = 6,
	State_E                                  = 7,
	State_F                                  = 8,
	State_G                                  = 9,
	State_H                                  = 10,
	State_I                                  = 11,
	State_J                                  = 12,
	EStateDrivenStateID_MAX                  = 13,
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenStateTransitions
// 0x0020 (0x0020 - 0x0000)
struct FStateDrivenStateTransitions final
{
public:
	struct FGameplayTag                           TransitionTag;                                     // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInstancedStruct>               TransitionEvents;                                  // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenState
// 0x0040 (0x0040 - 0x0000)
struct FStateDrivenState final
{
public:
	class FString                                 DevNotes;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               SourceEnterStateReactions;                         // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               InstigatorEnterStateReactions;                     // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FStateDrivenStateTransitions>   Transitions;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.InstancedStateTreeId
// 0x0004 (0x0004 - 0x0000)
struct FInstancedStateTreeId final
{
public:
	uint32                                        Id;                                                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct StateDrivenActorRuntime.LatestObjectRecordedStateTreeTransitionResult
// 0x0028 (0x0028 - 0x0000)
struct FLatestObjectRecordedStateTreeTransitionResult final
{
public:
	TWeakObjectPtr<class AActor>                  Instigator;                                        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRecordedStateTreeTransitionResult> RecordedTransitions;                               // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UObjectInstancedStateTreeComponent> ObjectInstancedComponent;                          // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FInstancedStateTreeId                  ObjectInstancedComponentId;                        // 0x0020(0x0004)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenFloat
// 0x0018 (0x0018 - 0x0000)
struct FStateDrivenFloat final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       InstancedFloat;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent
// 0x0020 (0x0020 - 0x0000)
struct FStateDrivenEvent
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActorComponent_StateDriven*        StateDrivenOwner;                                  // 0x0018(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_QuestObjectiveActive
// 0x0020 (0x0040 - 0x0020)
struct FStateDrivenEvent_QuestObjectiveActive final : public FStateDrivenEvent
{
public:
	class UFortItemDefinition*                    QuestItemDefinition;                               // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ObjectiveBackendName;                              // 0x0028(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStateDrivenEventQuestObjectiveActiveHelper* StateDrivenEventQuestObjectiveActiveHelper;        // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenTagQuery
// 0x0018 (0x0018 - 0x0000)
struct FStateDrivenTagQuery final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       InstancedTagQuery;                                 // 0x0008(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_BeginOverlap
// 0x0020 (0x0040 - 0x0020)
struct FStateDrivenEvent_BeginOverlap : public FStateDrivenEvent
{
public:
	struct FStateDrivenTagQuery                   OverlappingActorTagQuery;                          // 0x0020(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         OverlapRadius;                                     // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenFloat_Base
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FStateDrivenFloat_Base
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenFloat_Simple
// 0x0008 (0x0010 - 0x0008)
struct FStateDrivenFloat_Simple final : public FStateDrivenFloat_Base
{
public:
	float                                         Value;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_InteractionBase
// 0x0030 (0x0050 - 0x0020)
struct FStateDrivenEvent_InteractionBase : public FStateDrivenEvent
{
public:
	struct FStateDrivenTagQuery                   PlayerTagQuery;                                    // 0x0020(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   InteractionStringOverride;                         // 0x0038(0x0010)(Edit, NativeAccessSpecifierPublic)
	float                                         InteractionTimeOverride;                           // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_Conversation
// 0x0018 (0x0068 - 0x0050)
struct FStateDrivenEvent_Conversation final : public FStateDrivenEvent_InteractionBase
{
public:
	struct FGameplayTag                           ConversationEntryTag;                              // 0x0050(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UFortNonPlayerConversationParticipantComponent> ConversationComponentPtr;                          // 0x005C(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_DamageInstance
// 0x0038 (0x0058 - 0x0020)
struct FStateDrivenEvent_DamageInstance final : public FStateDrivenEvent
{
public:
	struct FStateDrivenTagQuery                   InstigatorTagQuery;                                // 0x0020(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FStateDrivenTagQuery                   DamageInstanceTagQuery;                            // 0x0038(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         MinimumInstanceDamage;                             // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_DepositResource
// 0x0038 (0x0088 - 0x0050)
struct FStateDrivenEvent_DepositResource final : public FStateDrivenEvent_InteractionBase
{
public:
	TSoftObjectPtr<class UFortItemDefinition>     DepositItem;                                       // 0x0050(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DepositAmount;                                     // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_Destroy
// 0x0030 (0x0050 - 0x0020)
struct FStateDrivenEvent_Destroy final : public FStateDrivenEvent
{
public:
	struct FStateDrivenTagQuery                   InstigatorTagQuery;                                // 0x0020(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FStateDrivenTagQuery                   DamageInstanceTagQuery;                            // 0x0038(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_EndOverlap
// 0x0020 (0x0040 - 0x0020)
struct FStateDrivenEvent_EndOverlap final : public FStateDrivenEvent
{
public:
	struct FStateDrivenTagQuery                   OverlappingActorTagQuery;                          // 0x0020(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         OverlapRadius;                                     // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_InsertItem
// 0x0018 (0x0068 - 0x0050)
struct FStateDrivenEvent_InsertItem final : public FStateDrivenEvent_InteractionBase
{
public:
	struct FStateDrivenTagQuery                   EquippedItemTagQuery;                              // 0x0050(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_Interaction
// 0x0000 (0x0050 - 0x0050)
struct FStateDrivenEvent_Interaction final : public FStateDrivenEvent_InteractionBase
{
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_PickupItem
// 0x0000 (0x0040 - 0x0040)
struct FStateDrivenEvent_PickupItem final : public FStateDrivenEvent_BeginOverlap
{
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_QuestObjectiveCompleted
// 0x0020 (0x0040 - 0x0020)
struct FStateDrivenEvent_QuestObjectiveCompleted final : public FStateDrivenEvent
{
public:
	class UFortItemDefinition*                    QuestItemDefinition;                               // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ObjectiveBackendName;                              // 0x0028(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStateDrivenEventQuestObjectiveCompletedHelper* StateDrivenEventQuestObjectiveCompletedHelper;     // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_Timer
// 0x0020 (0x0040 - 0x0020)
struct FStateDrivenEvent_Timer final : public FStateDrivenEvent
{
public:
	struct FStateDrivenFloat                      Duration;                                          // 0x0020(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UStateDrivenEventTimerHelper*           StateDrivenEventTimerHelper;                       // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_Verb
// 0x0020 (0x0040 - 0x0020)
struct FStateDrivenEvent_Verb final : public FStateDrivenEvent
{
public:
	TArray<struct FInstancedStruct>               Verbs;                                             // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ValueThreshold;                                    // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStateDrivenEventVerbHelper*            StateDrivenEventVerbHelper;                        // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEvent_WithdrawItem
// 0x0018 (0x0068 - 0x0050)
struct FStateDrivenEvent_WithdrawItem final : public FStateDrivenEvent_InteractionBase
{
public:
	struct FVector                                SlottedItemPopOffset;                              // 0x0050(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenFloat_Variable
// 0x0008 (0x0010 - 0x0008)
struct FStateDrivenFloat_Variable final : public FStateDrivenFloat_Base
{
public:
	int32                                         VariableIndex;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenTagQuery_Base
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FStateDrivenTagQuery_Base
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenTagQuery_Simple
// 0x0048 (0x0050 - 0x0008)
struct FStateDrivenTagQuery_Simple final : public FStateDrivenTagQuery_Base
{
public:
	struct FGameplayTagQuery                      Query;                                             // 0x0008(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenTagQuery_Variable
// 0x0008 (0x0010 - 0x0008)
struct FStateDrivenTagQuery_Variable final : public FStateDrivenTagQuery_Base
{
public:
	int32                                         VariableIndex;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEventTransitionStateTreeTaskInstanceData
// 0x0058 (0x0058 - 0x0000)
struct FStateDrivenEventTransitionStateTreeTaskInstanceData final
{
public:
	struct FStateDrivenState                      StateData;                                         // 0x0000(0x0040)(Edit, NativeAccessSpecifierPublic)
	class AActor*                                 UserActor;                                         // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InstigatorActor;                                   // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateDrivenActorRuntime.StateDrivenEventTransitionStateTreeTask
// 0x0000 (0x0030 - 0x0030)
struct FStateDrivenEventTransitionStateTreeTask final : public FStateTreeTaskCommonBase
{
};

}

