#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StateTreeEditorModule

#include "Basic.hpp"

#include "StateTreeEditorModule_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UnrealEd_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "BlueprintGraph_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "StateTreeModule_structs.hpp"


namespace SDK
{

// Class StateTreeEditorModule.AssetDefinition_StateTree
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_StateTree final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_StateTree">();
	}
	static class UAssetDefinition_StateTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_StateTree>();
	}
};

// Class StateTreeEditorModule.K2Node_StateTreeBlueprintPropertyRef
// 0x0000 (0x00C0 - 0x00C0)
class UK2Node_StateTreeBlueprintPropertyRef final : public UK2Node
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_StateTreeBlueprintPropertyRef">();
	}
	static class UK2Node_StateTreeBlueprintPropertyRef* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_StateTreeBlueprintPropertyRef>();
	}
};

// Class StateTreeEditorModule.K2Node_StateTreeNodeGetPropertyDescription
// 0x0038 (0x00F8 - 0x00C0)
class UK2Node_StateTreeNodeGetPropertyDescription final : public UK2Node
{
public:
	struct FMemberReference                       Variable;                                          // 0x00C0(0x0038)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_StateTreeNodeGetPropertyDescription">();
	}
	static class UK2Node_StateTreeNodeGetPropertyDescription* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_StateTreeNodeGetPropertyDescription>();
	}
};

// Class StateTreeEditorModule.StateTreePropertyRefSchema
// 0x0000 (0x0040 - 0x0040)
class UStateTreePropertyRefSchema final : public UEdGraphSchema_K2
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreePropertyRefSchema">();
	}
	static class UStateTreePropertyRefSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreePropertyRefSchema>();
	}
};

// Class StateTreeEditorModule.StateTreeEditorSettings
// 0x0008 (0x0068 - 0x0060)
class UStateTreeEditorSettings final : public UDeveloperSettings
{
public:
	EStateTreeSaveOnCompile                       SaveOnCompile;                                     // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldDebuggerAutoRecordOnPIE;                    // 0x0061(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldDebuggerResetDataOnNewPIESession;           // 0x0062(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRetainNodePropertyValues;                         // 0x0063(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeEditorSettings">();
	}
	static class UStateTreeEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeEditorSettings>();
	}
};

// Class StateTreeEditorModule.StateTreeToolMenuContext
// 0x0010 (0x0040 - 0x0030)
class UStateTreeToolMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeToolMenuContext">();
	}
	static class UStateTreeToolMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeToolMenuContext>();
	}
};

// Class StateTreeEditorModule.StateTreeClipboardBindings
// 0x0010 (0x0040 - 0x0030)
class UStateTreeClipboardBindings final : public UObject
{
public:
	TArray<struct FStateTreePropertyPathBinding>  Bindings;                                          // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeClipboardBindings">();
	}
	static class UStateTreeClipboardBindings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeClipboardBindings>();
	}
};

// Class StateTreeEditorModule.StateTreeCompileAllCommandlet
// 0x0008 (0x0090 - 0x0088)
class UStateTreeCompileAllCommandlet final : public UCommandlet
{
public:
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeCompileAllCommandlet">();
	}
	static class UStateTreeCompileAllCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeCompileAllCommandlet>();
	}
};

// Class StateTreeEditorModule.StateTreeEditorData
// 0x0110 (0x0140 - 0x0030)
class UStateTreeEditorData final : public UObject
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UStateTreeSchema*                       Schema;                                            // 0x0058(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStateParameters              RootParameters;                                    // 0x0060(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FStateTreeEditorNode>           Evaluators;                                        // 0x0098(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FStateTreeEditorNode>           GlobalTasks;                                       // 0x00A8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FStateTreeEditorPropertyBindings       EditorBindings;                                    // 0x00B8(0x0018)(NativeAccessSpecifierPublic)
	TSet<struct FStateTreeEditorColor>            Colors;                                            // 0x00D0(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UStateTreeState*>                SubTrees;                                          // 0x0120(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FStateTreeEditorBreakpoint>     Breakpoints;                                       // 0x0130(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeEditorData">();
	}
	static class UStateTreeEditorData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeEditorData>();
	}
};

// Class StateTreeEditorModule.StateTreeEditorPropertyBindingsOwner
// 0x0000 (0x0030 - 0x0030)
class IStateTreeEditorPropertyBindingsOwner final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeEditorPropertyBindingsOwner">();
	}
	static class IStateTreeEditorPropertyBindingsOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IStateTreeEditorPropertyBindingsOwner>();
	}
};

// Class StateTreeEditorModule.StateTreeFactory
// 0x0008 (0x0090 - 0x0088)
class UStateTreeFactory final : public UFactory
{
public:
	TSubclassOf<class UObject>                    StateTreeSchemaClass;                              // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeFactory">();
	}
	static class UStateTreeFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeFactory>();
	}
};

// Class StateTreeEditorModule.StateTreeState
// 0x01A0 (0x01D0 - 0x0030)
class UStateTreeState final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name_0;                                            // 0x0038(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0044(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeEditorColorRef               ColorRef;                                          // 0x0050(0x0010)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeStateType                           Type;                                              // 0x0060(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeStateSelectionBehavior              SelectionBehavior;                                 // 0x0061(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeStateLink                    LinkedSubtree;                                     // 0x0064(0x0020)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStateTree*                             LinkedAsset;                                       // 0x0088(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStateParameters              Parameters;                                        // 0x0090(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bCheckPrerequisitesWhenActivatingChildDirectly;    // 0x00C8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasRequiredEventToEnter;                          // 0x00C9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeEventDesc                    RequiredEventToEnter;                              // 0x00D0(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FStateTreeEditorNode>           EnterConditions;                                   // 0x0120(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FStateTreeEditorNode>           Tasks;                                             // 0x0130(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FStateTreeEditorNode>           Considerations;                                    // 0x0140(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FStateTreeEditorNode                   SingleTask;                                        // 0x0150(0x0040)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FStateTreeTransition>           Transitions;                                       // 0x0190(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UStateTreeState*>                Children;                                          // 0x01A0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x01B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExpanded;                                         // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x01C1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStateTreeState*                        Parent;                                            // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeState">();
	}
	static class UStateTreeState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeState>();
	}
};

}

