#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StateTreeEditorModule

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum StateTreeEditorModule.EStateTreeNodeType
// NumValues: 0x0007
enum class EStateTreeNodeType : uint8
{
	EnterCondition                           = 0,
	Evaluator                                = 1,
	Task                                     = 2,
	TransitionCondition                      = 3,
	StateParameters                          = 4,
	PropertyFunction                         = 5,
	EStateTreeNodeType_MAX                   = 6,
};

// Enum StateTreeEditorModule.EStateTreeSaveOnCompile
// NumValues: 0x0004
enum class EStateTreeSaveOnCompile : uint8
{
	Never                                    = 0,
	SuccessOnly                              = 1,
	Always                                   = 2,
	EStateTreeSaveOnCompile_MAX              = 3,
};

// Enum StateTreeEditorModule.EStateTreeVisitor
// NumValues: 0x0003
enum class EStateTreeVisitor : uint8
{
	Continue                                 = 0,
	Break                                    = 1,
	EStateTreeVisitor_MAX                    = 2,
};

// ScriptStruct StateTreeEditorModule.StateTreeEditorNode
// 0x0040 (0x0040 - 0x0000)
struct FStateTreeEditorNode final
{
public:
	struct FInstancedStruct                       Node;                                              // 0x0000(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       Instance;                                          // 0x0010(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UObject*                                InstanceObject;                                    // 0x0020(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0028(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ExpressionIndent;                                  // 0x0038(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeExpressionOperand                   ExpressionOperand;                                 // 0x0039(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeEditorModule.StateTreeEditorColorRef
// 0x0010 (0x0010 - 0x0000)
struct FStateTreeEditorColorRef final
{
public:
	struct FGuid                                  ID;                                                // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeEditorModule.StateTreeEditorColor
// 0x0030 (0x0030 - 0x0000)
struct FStateTreeEditorColor final
{
public:
	struct FStateTreeEditorColorRef               ColorRef;                                          // 0x0000(0x0010)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DisplayName;                                       // 0x0010(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0020(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeEditorModule.StateTreeCompilerLogMessage
// 0x0060 (0x0060 - 0x0000)
struct FStateTreeCompilerLogMessage final
{
public:
	int32                                         Severity;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStateTreeState*                        State;                                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeBindableStructDesc           Item;                                              // 0x0010(0x0040)(NativeAccessSpecifierPublic)
	class FString                                 Message;                                           // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeEditorModule.StateTreeCompilerLog
// 0x0020 (0x0020 - 0x0000)
struct FStateTreeCompilerLog final
{
public:
	TArray<class UStateTreeState*>                StateStack;                                        // 0x0000(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FStateTreeCompilerLogMessage>   Messages;                                          // 0x0010(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};

// ScriptStruct StateTreeEditorModule.StateTreeEditorBreakpoint
// 0x0014 (0x0014 - 0x0000)
struct FStateTreeEditorBreakpoint final
{
public:
	struct FGuid                                  ID;                                                // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeBreakpointType                      BreakpointType;                                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeEditorModule.StateTreeEditorPropertyBindings
// 0x0018 (0x0018 - 0x0000)
struct FStateTreeEditorPropertyBindings final
{
public:
	TArray<struct FStateTreePropertyPathBinding>  PropertyBindings;                                  // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeEditorModule.StateTreeNodeClassData
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FStateTreeNodeClassData final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeEditorModule.StateTreePropertyBindingCompiler
// 0x0030 (0x0030 - 0x0000)
struct FStateTreePropertyBindingCompiler final
{
public:
	TArray<struct FStateTreeBindableStructDesc>   SourceStructs;                                     // 0x0000(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_10[0x20];                                      // 0x0010(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeEditorModule.StateTreeEventDesc
// 0x0050 (0x0050 - 0x0000)
struct FStateTreeEventDesc final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptStruct*                          PayloadStruct;                                     // 0x0010(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsumeEventOnSelect;                             // 0x0018(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeEvent                        TemporaryEvent;                                    // 0x0020(0x0030)(Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct StateTreeEditorModule.StateTreeTransition
// 0x00B8 (0x00B8 - 0x0000)
struct FStateTreeTransition final
{
public:
	EStateTreeTransitionTrigger                   Trigger;                                           // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeEventDesc                    RequiredEvent;                                     // 0x0008(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FStateTreeStateLink                    State;                                             // 0x0058(0x0020)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0078(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeTransitionPriority                  Priority;                                          // 0x0088(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDelayTransition;                                  // 0x0089(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayDuration;                                     // 0x008C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DelayRandomVariance;                               // 0x0090(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStateTreeEditorNode>           Conditions;                                        // 0x0098(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bTransitionEnabled;                                // 0x00A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           EventTag;                                          // 0x00AC(0x000C)(Deprecated, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeEditorModule.StateTreeStateParameters
// 0x0038 (0x0038 - 0x0000)
struct FStateTreeStateParameters final
{
public:
	struct FInstancedPropertyBag                  Parameters;                                        // 0x0000(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          PropertyOverrides;                                 // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bFixedLayout;                                      // 0x0020(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  ID;                                                // 0x0024(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

