#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StaticMeshEditor

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum StaticMeshEditor.EScriptCollisionShapeType
// NumValues: 0x0009
enum class EScriptCollisionShapeType : uint8
{
	Box                                      = 0,
	Sphere                                   = 1,
	Capsule                                  = 2,
	NDOP10_X                                 = 3,
	NDOP10_Y                                 = 4,
	NDOP10_Z                                 = 5,
	NDOP18                                   = 6,
	NDOP26                                   = 7,
	EScriptCollisionShapeType_MAX            = 8,
};

// ScriptStruct StaticMeshEditor.JoinStaticMeshActorsOptions
// 0x0020 (0x0020 - 0x0000)
struct FJoinStaticMeshActorsOptions
{
public:
	bool                                          bDestroySourceActors;                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NewActorLabel;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRenameComponentsFromSource;                       // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StaticMeshEditor.CreateProxyMeshActorOptions
// 0x0128 (0x0148 - 0x0020)
struct FCreateProxyMeshActorOptions final : public FJoinStaticMeshActorsOptions
{
public:
	bool                                          bSpawnMergedActor;                                 // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 BasePackageName;                                   // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMeshProxySettings                     MeshProxySettings;                                 // 0x0038(0x0110)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct StaticMeshEditor.StaticMeshReductionSettings
// 0x0008 (0x0008 - 0x0000)
struct FStaticMeshReductionSettings final
{
public:
	float                                         PercentTriangles;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScreenSize;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StaticMeshEditor.StaticMeshReductionOptions
// 0x0018 (0x0018 - 0x0000)
struct FStaticMeshReductionOptions final
{
public:
	bool                                          bAutoComputeLODScreenSize;                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStaticMeshReductionSettings>   ReductionSettings;                                 // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct StaticMeshEditor.MergeStaticMeshActorsOptions
// 0x0130 (0x0150 - 0x0020)
struct FMergeStaticMeshActorsOptions final : public FJoinStaticMeshActorsOptions
{
public:
	bool                                          bSpawnMergedActor;                                 // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 BasePackageName;                                   // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMeshMergingSettings                   MeshMergingSettings;                               // 0x0038(0x0118)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

}

