#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StateTreeTestSuite

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "StateTreeTestSuite_structs.hpp"
#include "StateTreeModule_classes.hpp"


namespace SDK
{

// Class StateTreeTestSuite.StateTreeTest_PropertyObjectInstanced
// 0x0028 (0x0058 - 0x0030)
class UStateTreeTest_PropertyObjectInstanced : public UObject
{
public:
	int32                                         A;                                                 // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       InstancedStruct;                                   // 0x0038(0x0010)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                   ArrayOfTags;                                       // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeTest_PropertyObjectInstanced">();
	}
	static class UStateTreeTest_PropertyObjectInstanced* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeTest_PropertyObjectInstanced>();
	}
};

// Class StateTreeTestSuite.StateTreeTest_PropertyObjectInstancedWithB
// 0x0008 (0x0060 - 0x0058)
class UStateTreeTest_PropertyObjectInstancedWithB final : public UStateTreeTest_PropertyObjectInstanced
{
public:
	int32                                         B;                                                 // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeTest_PropertyObjectInstancedWithB">();
	}
	static class UStateTreeTest_PropertyObjectInstancedWithB* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeTest_PropertyObjectInstancedWithB>();
	}
};

// Class StateTreeTestSuite.StateTreeTest_PropertyObject
// 0x0068 (0x0098 - 0x0030)
class UStateTreeTest_PropertyObject final : public UObject
{
public:
	class UStateTreeTest_PropertyObjectInstanced* InstancedObject;                                   // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UStateTreeTest_PropertyObjectInstanced*> ArrayOfInstancedObjects;                           // 0x0038(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<int32>                                 ArrayOfInts;                                       // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       InstancedStruct;                                   // 0x0058(0x0010)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               ArrayOfInstancedStructs;                           // 0x0068(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FStateTreeTest_PropertyStruct          Struct;                                            // 0x0078(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStateTreeTest_PropertyStruct>  ArrayOfStruct;                                     // 0x0088(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeTest_PropertyObject">();
	}
	static class UStateTreeTest_PropertyObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeTest_PropertyObject>();
	}
};

// Class StateTreeTestSuite.StateTreeTest_PropertyObject2
// 0x0000 (0x0030 - 0x0030)
class UStateTreeTest_PropertyObject2 final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeTest_PropertyObject2">();
	}
	static class UStateTreeTest_PropertyObject2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeTest_PropertyObject2>();
	}
};

// Class StateTreeTestSuite.StateTreeTestSchema
// 0x0000 (0x0030 - 0x0030)
class UStateTreeTestSchema final : public UStateTreeSchema
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeTestSchema">();
	}
	static class UStateTreeTestSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeTestSchema>();
	}
};

}

