#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StormShieldModifierRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "StormShieldModifierRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class StormShieldModifierRuntime.FortAthenaMutator_SplitStorm
// 0x0240 (0x0860 - 0x0620)
class AFortAthenaMutator_SplitStorm final : public AFortAthenaMutator_GameModeBase
{
public:
	TSubclassOf<class AActor>                     SafeZoneProxyClass;                                // 0x0620(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         ProxyUpdateFrequency;                              // 0x0628(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         SplitParallelTravelDistance;                       // 0x0660(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         JoinParallelTravelDistance;                        // 0x0698(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         SplitPerpendicularTravelDistance;                  // 0x06D0(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         JoinAngleFromParallelDegrees;                      // 0x0708(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         PhaseToSplitStorm;                                 // 0x0740(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FLinearColor                           ProxyMapCircleColor;                               // 0x0778(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ProxyMapCircleLineThickness;                       // 0x0788(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ProxyMapCircleLineSegments;                        // 0x078C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 SafeZoneProxy;                                     // 0x0790(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESplitStormProxyPhase                         CurrentProxyPhase;                                 // 0x0798(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_799[0x3];                                      // 0x0799(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MoveToHoldWaitDuration;                            // 0x079C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MoveToHoldDuration;                                // 0x07A0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MoveToEndWaitDuration;                             // 0x07A4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MoveToEndDuration;                                 // 0x07A8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MoveStartTime;                                     // 0x07AC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSplitStormProxyCircle                 ProxyStartCircle;                                  // 0x07B0(0x0020)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSplitStormProxyCircle                 ProxyEndCircle;                                    // 0x07D0(0x0020)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSplitStormProxyCircle                 ProxyHoldCircle;                                   // 0x07F0(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSplitStormProxyCircle                 CurrentProxyCircle;                                // 0x0810(0x0020)(BlueprintVisible, BlueprintReadOnly, Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_830[0x30];                                     // 0x0830(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_CurrentProxyCircle();
	void OnSafeZoneIndicatorSpawned(const struct FFortSafeZoneIndicatorUpdatedEvent& Event);
	void OnSafeZonePhaseChanged();
	void SetProxyCenter(const struct FVector& NewCenter);
	void SetProxyRadius(const float NewRadius);
	void SetSafeZoneProxyPhase(ESplitStormProxyPhase NewPhase);
	void StartProxyUpdateTimer();
	void UpdateProxyCenterAndRadius();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_SplitStorm">();
	}
	static class AFortAthenaMutator_SplitStorm* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_SplitStorm>();
	}
};

}

