#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StructUtilsTestSuite

#include "Basic.hpp"


namespace SDK
{

// Enum StructUtilsTestSuite.EPropertyBagTest1
// NumValues: 0x0003
enum class EPropertyBagTest1 : uint8
{
	Foo                                      = 0,
	Bar                                      = 1,
	EPropertyBagTest1_MAX                    = 2,
};

// Enum StructUtilsTestSuite.EPropertyBagTest2
// NumValues: 0x0003
enum class EPropertyBagTest2 : uint8
{
	Bingo                                    = 0,
	Bongo                                    = 1,
	EPropertyBagTest2_MAX                    = 2,
};

// ScriptStruct StructUtilsTestSuite.TestStructSimpleBase
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FTestStructSimpleBase
{
};
#pragma pack(pop)

// ScriptStruct StructUtilsTestSuite.TestStructSimple
// 0x0004 (0x0004 - 0x0000)
struct FTestStructSimple final : public FTestStructSimpleBase
{
public:
	float                                         Float;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StructUtilsTestSuite.TestStructSimpleNonZeroDefault
// 0x0008 (0x0008 - 0x0000)
struct FTestStructSimpleNonZeroDefault final : public FTestStructSimpleBase
{
public:
	float                                         Float;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StructUtilsTestSuite.TestStructComplex
// 0x0020 (0x0020 - 0x0000)
struct FTestStructComplex final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         StringArray;                                       // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct StructUtilsTestSuite.TestStructSimple1
// 0x0004 (0x0004 - 0x0000)
struct FTestStructSimple1 final : public FTestStructSimpleBase
{
public:
	float                                         Float;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StructUtilsTestSuite.TestStructSimple2
// 0x0004 (0x0004 - 0x0000)
struct FTestStructSimple2 final : public FTestStructSimpleBase
{
public:
	float                                         Float;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StructUtilsTestSuite.TestStructSimple3
// 0x0004 (0x0004 - 0x0000)
struct FTestStructSimple3 final : public FTestStructSimpleBase
{
public:
	float                                         Float;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StructUtilsTestSuite.TestStructSimple4
// 0x0004 (0x0004 - 0x0000)
struct FTestStructSimple4 final : public FTestStructSimpleBase
{
public:
	float                                         Float;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StructUtilsTestSuite.TestStructSimple5
// 0x0004 (0x0004 - 0x0000)
struct FTestStructSimple5 final : public FTestStructSimpleBase
{
public:
	float                                         Float;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StructUtilsTestSuite.TestStructSimple6
// 0x0004 (0x0004 - 0x0000)
struct FTestStructSimple6 final : public FTestStructSimpleBase
{
public:
	float                                         Float;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StructUtilsTestSuite.TestStructSimple7
// 0x0004 (0x0004 - 0x0000)
struct FTestStructSimple7 final : public FTestStructSimpleBase
{
public:
	float                                         Float;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

