#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StyleSheetsConverter

#include "Basic.hpp"

#include "StyleSheetsConverter_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class StyleSheetsConverter.StyleSheetsConversionRuleSet
// 0x0028 (0x0060 - 0x0038)
class UStyleSheetsConversionRuleSet final : public UDataAsset
{
public:
	TArray<struct FStyleSheetsConversionRule_TextBlock> TextBlockRules;                                    // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FStyleSheetsConversionRule_Class> PerClassRules;                                     // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	EStyleSheetsConverterTagApplicationPolicy     TagApplicationPolicy;                              // 0x0058(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowOverrideTags;                                // 0x0059(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowRecursiveChildUserWidgetProcessing;          // 0x005A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StyleSheetsConversionRuleSet">();
	}
	static class UStyleSheetsConversionRuleSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStyleSheetsConversionRuleSet>();
	}
};

// Class StyleSheetsConverter.StyleSheetsConverterLibrary
// 0x0000 (0x0030 - 0x0030)
class UStyleSheetsConverterLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ProcessWidgetBlueprints(const TArray<class UObject*>& Assets, const class UStyleSheetsConversionRuleSet* RuleSet, TArray<class UObject*>* OutModifiedWidgets);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StyleSheetsConverterLibrary">();
	}
	static class UStyleSheetsConverterLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStyleSheetsConverterLibrary>();
	}
};

}

