#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubobjectDataInterface

#include "Basic.hpp"

#include "SubobjectDataInterface_structs.hpp"


namespace SDK::Params
{

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.CanCopy
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_CanCopy final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.CanDelete
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_CanDelete final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.CanDuplicate
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_CanDuplicate final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.CanEdit
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_CanEdit final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.CanRename
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_CanRename final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.CanReparent
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_CanReparent final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.GetBlueprint
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_GetBlueprint final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UBlueprint*                             ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.GetData
// 0x0058 (0x0058 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_GetData final
{
public:
	struct FSubobjectDataHandle                   DataHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSubobjectData                         OutData;                                           // 0x0010(0x0048)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.GetDisplayName
// 0x0058 (0x0058 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_GetDisplayName final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0048(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.GetHandle
// 0x0058 (0x0058 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_GetHandle final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSubobjectDataHandle                   OutHandle;                                         // 0x0048(0x0010)(Parm, OutParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.GetObject
// 0x0058 (0x0058 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_GetObject final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bEvenIfPendingKill;                                // 0x0048(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UObject*                          ReturnValue;                                       // 0x0050(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.GetObjectForBlueprint
// 0x0058 (0x0058 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_GetObjectForBlueprint final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UBlueprint*                             Blueprint;                                         // 0x0048(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          ReturnValue;                                       // 0x0050(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.GetVariableName
// 0x0058 (0x0058 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_GetVariableName final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0048(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.IsActor
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_IsActor final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.IsAttachedTo
// 0x0060 (0x0060 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_IsAttachedTo final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSubobjectDataHandle                   InHandle;                                          // 0x0048(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.IsChildActor
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_IsChildActor final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.IsComponent
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_IsComponent final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.IsDefaultSceneRoot
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_IsDefaultSceneRoot final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.IsHandleValid
// 0x0018 (0x0018 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_IsHandleValid final
{
public:
	struct FSubobjectDataHandle                   DataHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.IsInheritedComponent
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_IsInheritedComponent final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.IsInstancedActor
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_IsInstancedActor final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.IsInstancedComponent
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_IsInstancedComponent final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.IsNativeComponent
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_IsNativeComponent final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.IsRootActor
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_IsRootActor final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.IsRootComponent
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_IsRootComponent final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.IsSceneComponent
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_IsSceneComponent final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataBlueprintFunctionLibrary.IsValid
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataBlueprintFunctionLibrary_IsValid final
{
public:
	struct FSubobjectData                         Data;                                              // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.CreateNewBPComponent
// 0x0030 (0x0030 - 0x0000)
struct SubobjectDataSubsystem_CreateNewBPComponent final
{
public:
	TSubclassOf<class UActorComponent>            ComponentClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewClassPath;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewClassName;                                      // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.CreateNewCPPComponent
// 0x0030 (0x0030 - 0x0000)
struct SubobjectDataSubsystem_CreateNewCPPComponent final
{
public:
	TSubclassOf<class UActorComponent>            ComponentClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewClassPath;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewClassName;                                      // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.RenameSubobjectMemberVariable
// 0x0028 (0x0028 - 0x0000)
struct SubobjectDataSubsystem_RenameSubobjectMemberVariable final
{
public:
	class UBlueprint*                             BPContext;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSubobjectDataHandle                   InHandle;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewName;                                           // 0x0018(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.AddNewSubobject
// 0x0050 (0x0050 - 0x0000)
struct SubobjectDataSubsystem_AddNewSubobject final
{
public:
	struct FAddNewSubobjectParams                 Params_0;                                          // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   FailReason;                                        // 0x0030(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FSubobjectDataHandle                   ReturnValue;                                       // 0x0040(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.AttachSubobject
// 0x0028 (0x0028 - 0x0000)
struct SubobjectDataSubsystem_AttachSubobject final
{
public:
	struct FSubobjectDataHandle                   OwnerHandle;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSubobjectDataHandle                   ChildToAddHandle;                                  // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.ChangeSubobjectClass
// 0x0020 (0x0020 - 0x0000)
struct SubobjectDataSubsystem_ChangeSubobjectClass final
{
public:
	struct FSubobjectDataHandle                   Handle;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UClass*                           NewClass;                                          // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.CopySubobjects
// 0x0018 (0x0018 - 0x0000)
struct SubobjectDataSubsystem_CopySubobjects final
{
public:
	TArray<struct FSubobjectDataHandle>           Handles;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UBlueprint*                             BpContext;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.DeleteSubobject
// 0x0030 (0x0030 - 0x0000)
struct SubobjectDataSubsystem_DeleteSubobject final
{
public:
	struct FSubobjectDataHandle                   ContextHandle;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSubobjectDataHandle                   SubobjectToDelete;                                 // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlueprint*                             BPContext;                                         // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.DeleteSubobjects
// 0x0030 (0x0030 - 0x0000)
struct SubobjectDataSubsystem_DeleteSubobjects final
{
public:
	struct FSubobjectDataHandle                   ContextHandle;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSubobjectDataHandle>           SubobjectsToDelete;                                // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UBlueprint*                             BPContext;                                         // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.DetachSubobject
// 0x0028 (0x0028 - 0x0000)
struct SubobjectDataSubsystem_DetachSubobject final
{
public:
	struct FSubobjectDataHandle                   OwnerHandle;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSubobjectDataHandle                   ChildToRemove;                                     // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.DuplicateSubobjects
// 0x0038 (0x0038 - 0x0000)
struct SubobjectDataSubsystem_DuplicateSubobjects final
{
public:
	struct FSubobjectDataHandle                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSubobjectDataHandle>           SubobjectsToDup;                                   // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UBlueprint*                             BpContext;                                         // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSubobjectDataHandle>           OutNewSubobjects;                                  // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.K2_DeleteSubobjectFromInstance
// 0x0028 (0x0028 - 0x0000)
struct SubobjectDataSubsystem_K2_DeleteSubobjectFromInstance final
{
public:
	struct FSubobjectDataHandle                   ContextHandle;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSubobjectDataHandle                   SubobjectToDelete;                                 // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.K2_DeleteSubobjectsFromInstance
// 0x0028 (0x0028 - 0x0000)
struct SubobjectDataSubsystem_K2_DeleteSubobjectsFromInstance final
{
public:
	struct FSubobjectDataHandle                   ContextHandle;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSubobjectDataHandle>           SubobjectsToDelete;                                // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.K2_GatherSubobjectDataForBlueprint
// 0x0018 (0x0018 - 0x0000)
struct SubobjectDataSubsystem_K2_GatherSubobjectDataForBlueprint final
{
public:
	class UBlueprint*                             Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSubobjectDataHandle>           OutArray;                                          // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.K2_GatherSubobjectDataForInstance
// 0x0018 (0x0018 - 0x0000)
struct SubobjectDataSubsystem_K2_GatherSubobjectDataForInstance final
{
public:
	class AActor*                                 Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSubobjectDataHandle>           OutArray;                                          // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.MakeNewSceneRoot
// 0x0030 (0x0030 - 0x0000)
struct SubobjectDataSubsystem_MakeNewSceneRoot final
{
public:
	struct FSubobjectDataHandle                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSubobjectDataHandle                   NewSceneRoot;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlueprint*                             BPContext;                                         // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.PasteSubobjects
// 0x0038 (0x0038 - 0x0000)
struct SubobjectDataSubsystem_PasteSubobjects final
{
public:
	struct FSubobjectDataHandle                   PasteToContext;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSubobjectDataHandle>           NewParentHandles;                                  // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UBlueprint*                             BpContext;                                         // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSubobjectDataHandle>           OutPastedHandles;                                  // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.RenameSubobject
// 0x0028 (0x0028 - 0x0000)
struct SubobjectDataSubsystem_RenameSubobject final
{
public:
	struct FSubobjectDataHandle                   Handle;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   InNewName;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.ReparentSubobject
// 0x0038 (0x0038 - 0x0000)
struct SubobjectDataSubsystem_ReparentSubobject final
{
public:
	struct FReparentSubobjectParams               Params_0;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSubobjectDataHandle                   ToReparentHandle;                                  // 0x0020(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.ReparentSubobjects
// 0x0038 (0x0038 - 0x0000)
struct SubobjectDataSubsystem_ReparentSubobjects final
{
public:
	struct FReparentSubobjectParams               Params_0;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FSubobjectDataHandle>           HandlesToMove;                                     // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.CanCopySubobjects
// 0x0018 (0x0018 - 0x0000)
struct SubobjectDataSubsystem_CanCopySubobjects final
{
public:
	TArray<struct FSubobjectDataHandle>           Handles;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.CanPasteSubobjects
// 0x0020 (0x0020 - 0x0000)
struct SubobjectDataSubsystem_CanPasteSubobjects final
{
public:
	struct FSubobjectDataHandle                   RootHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlueprint*                             BPContext;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.FindHandleForObject
// 0x0030 (0x0030 - 0x0000)
struct SubobjectDataSubsystem_FindHandleForObject final
{
public:
	struct FSubobjectDataHandle                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          ObjectToFind;                                      // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlueprint*                             BPContext;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSubobjectDataHandle                   ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.IsValidRename
// 0x0038 (0x0038 - 0x0000)
struct SubobjectDataSubsystem_IsValidRename final
{
public:
	struct FSubobjectDataHandle                   Handle;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   InNewText;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   OutErrorMessage;                                   // 0x0020(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SubobjectDataInterface.SubobjectDataSubsystem.K2_FindSubobjectDataFromHandle
// 0x0060 (0x0060 - 0x0000)
struct SubobjectDataSubsystem_K2_FindSubobjectDataFromHandle final
{
public:
	struct FSubobjectDataHandle                   Handle;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSubobjectData                         OutData;                                           // 0x0010(0x0048)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

