#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubobjectDataInterface

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct SubobjectDataInterface.SubobjectDataHandle
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FSubobjectDataHandle final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SubobjectDataInterface.SubobjectData
// 0x0048 (0x0048 - 0x0000)
struct FSubobjectData final
{
public:
	TWeakObjectPtr<class UObject>                 WeakObjectPtr;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSubobjectDataHandle                   Handle;                                            // 0x0008(0x0010)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSubobjectDataHandle                   ParentObjectHandle;                                // 0x0018(0x0010)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FSubobjectDataHandle>           ChildrenHandles;                                   // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SubobjectDataInterface.AddNewSubobjectParams
// 0x0030 (0x0030 - 0x0000)
struct FAddNewSubobjectParams final
{
public:
	struct FSubobjectDataHandle                   ParentHandle;                                      // 0x0000(0x0010)(BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    NewClass;                                          // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlueprint*                             BlueprintContext;                                  // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bSkipMarkBlueprintModified : 1;                    // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bConformTransformToParent : 1;                     // 0x0028(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SubobjectDataInterface.ReparentSubobjectParams
// 0x0020 (0x0020 - 0x0000)
struct FReparentSubobjectParams final
{
public:
	struct FSubobjectDataHandle                   NewParentHandle;                                   // 0x0000(0x0010)(BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlueprint*                             BlueprintContext;                                  // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ActorPreviewContext;                               // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

