#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SunRoseChainWhipGameplay

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "TargetingSystem_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class SunRoseChainWhipGameplay.Chains_SunRose_Sharp_Wep_AnimInstance
// 0x0050 (0x0820 - 0x07D0)
class UChains_SunRose_Sharp_Wep_AnimInstance final : public UCustomCharacterPartAnimInstance
{
public:
	float                                         AttackRange;                                       // 0x07D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ActiveTechniqueIndex;                              // 0x07D4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTechniqueActive;                                // 0x07D8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasIsTargetingTag;                                // 0x07D9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7DA[0x2];                                      // 0x07DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PawnVelocitySpeed;                                 // 0x07DC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PawnVelocitySpeedCutoff;                           // 0x07E0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAttack_01;                                      // 0x07E4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAttack_02;                                      // 0x07E5(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAttack_03;                                      // 0x07E6(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAllowPhysics;                                   // 0x07E7(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMantisDone;                                     // 0x07E8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUpperBodyAttack_01;                             // 0x07E9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUpperBodyAttack_02;                             // 0x07EA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7EB[0x1];                                      // 0x07EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         XMoveRight;                                        // 0x07EC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         XMoveLeft;                                         // 0x07F0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YMoveFwd;                                          // 0x07F4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIs700Distance;                                    // 0x07F8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIs1200Distance;                                   // 0x07F9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTurnOffPhysics;                                 // 0x07FA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7FB[0x1];                                      // 0x07FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AttackRange700;                                    // 0x07FC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AttackRange1200;                                   // 0x0800(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AttackRange1500;                                   // 0x0804(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           IsTargetingTag;                                    // 0x0808(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_814[0xC];                                      // 0x0814(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Chains_SunRose_Sharp_Wep_AnimInstance">();
	}
	static class UChains_SunRose_Sharp_Wep_AnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChains_SunRose_Sharp_Wep_AnimInstance>();
	}
};

// Class SunRoseChainWhipGameplay.Hades_Player_LayerAnimInstance
// 0x0030 (0x14D0 - 0x14A0)
class UHades_Player_LayerAnimInstance final : public UFortPlayerAnimInstanceProxy
{
public:
	bool                                          bIsMotorcycle;                                     // 0x1498(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHookshot;                                       // 0x1499(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTechniqueActive;                                // 0x149A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHadesAO;                                        // 0x149B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUpperBodyReplacement;                           // 0x149C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_149D[0x3];                                     // 0x149D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           MotorcycleTag;                                     // 0x14A0(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           HookshotTag;                                       // 0x14AC(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           DisableGrindRailUpperBodyCorrectTag;               // 0x14B8(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14C4[0xC];                                     // 0x14C4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Hades_Player_LayerAnimInstance">();
	}
	static class UHades_Player_LayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHades_Player_LayerAnimInstance>();
	}
};

// Class SunRoseChainWhipGameplay.FortCheatManager_SunRoseChainWhip
// 0x0060 (0x0090 - 0x0030)
class UFortCheatManager_SunRoseChainWhip final : public UChildCheatManager
{
public:
	TSoftClassPtr<class UClass>                   HookShotGameplayEffectClass;                       // 0x0030(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   HookShooterAISpawnerData;                          // 0x0060(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SunRoseApplyHookShot(const float Delay);
	void SunRoseRemoveHookShotShooter();
	void SunRoseSpawnHookShotShooter();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_SunRoseChainWhip">();
	}
	static class UFortCheatManager_SunRoseChainWhip* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_SunRoseChainWhip>();
	}
};

// Class SunRoseChainWhipGameplay.TargetingSelectionTask_SunRoseChainWhip
// 0x0000 (0x01E0 - 0x01E0)
class UTargetingSelectionTask_SunRoseChainWhip : public UTargetingSelectionTask_Trace
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingSelectionTask_SunRoseChainWhip">();
	}
	static class UTargetingSelectionTask_SunRoseChainWhip* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingSelectionTask_SunRoseChainWhip>();
	}
};

// Class SunRoseChainWhipGameplay.TargetingSelectionTask_SunRoseChainWhip_Melee
// 0x0020 (0x0200 - 0x01E0)
class UTargetingSelectionTask_SunRoseChainWhip_Melee final : public UTargetingSelectionTask_SunRoseChainWhip
{
public:
	float                                         YawOffsetDegrees;                                  // 0x01E0(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SourceLocationRelativeOffset;                      // 0x01E8(0x0018)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingSelectionTask_SunRoseChainWhip_Melee">();
	}
	static class UTargetingSelectionTask_SunRoseChainWhip_Melee* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingSelectionTask_SunRoseChainWhip_Melee>();
	}
};

}

