#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SunRoseFlyingRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FlyingCodeRuntime_structs.hpp"


namespace SDK
{

// Enum SunRoseFlyingRuntime.EWingedFlyingStatus
// NumValues: 0x0008
enum class EWingedFlyingStatus : uint8
{
	Default                                  = 0,
	Boosting                                 = 1,
	Ascending                                = 2,
	Crashing                                 = 4,
	DodgingLeft                              = 8,
	DodgingRight                             = 16,
	Charging                                 = 32,
	EWingedFlyingStatus_MAX                  = 33,
};

// ScriptStruct SunRoseFlyingRuntime.FlyingStatusConfig
// 0x00F8 (0x00F8 - 0x0000)
struct FFlyingStatusConfig final
{
public:
	EWingedFlyingStatus                           Status;                                            // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         InitialEnergyCost;                                 // 0x0008(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTag                           CooldownTag;                                       // 0x0040(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         CooldownDuration;                                  // 0x0050(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         OnGoingEnergyCost;                                 // 0x0088(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         EndOnEmptyEnergy;                                  // 0x00C0(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct SunRoseFlyingRuntime.FortMovementMode_WingedFlyingCreationData
// 0x0008 (0x0038 - 0x0030)
struct FFortMovementMode_WingedFlyingCreationData final : public FFortMovementMode_FlyingCreationData
{
public:
	float                                         FlyingEnergy;                                      // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsumeExtraLeapEnergy;                           // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

