#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SuperstormRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SuperstormRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "TargetingSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "FieldSystemEngine_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Class SuperstormRuntime.TempestLightningComponent
// 0x0488 (0x0560 - 0x00D8)
class UTempestLightningComponent final : public UGameFrameworkComponent
{
public:
	TSubclassOf<class AFortGameplayEffectDeliveryActor> LightningBoltClass;                                // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FTempestLightningBoltEffectContainer> LightningBoltTargetEffectContainers;               // 0x00E0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class UTargetingPreset*                       LightningBoltTargetingPreset;                      // 0x00F0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEnvQuery*                              FindTargetablePawnsQuery;                          // 0x00F8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEnvQuery*                              FindTargetableLocationQuery;                       // 0x0100(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   EnvironmentQueryParamName_LightningRadius;         // 0x0108(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   EnvironmentQueryParamName_MinLightningTargetDistance; // 0x0114(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningCloudHeight;                              // 0x0120(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningRadius;                                   // 0x0158(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinLightningTargetDistance;                        // 0x0190(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningFrequencyMin;                             // 0x01C8(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningFrequencyMax;                             // 0x0200(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningBoltsMin;                                 // 0x0238(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningBoltsMax;                                 // 0x0270(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningBoltIntervalMin;                          // 0x02A8(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningBoltIntervalMax;                          // 0x02E0(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningBoltSeparationDistance;                   // 0x0318(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningStruckPawnReselectionInterval;            // 0x0350(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningBoltTelegraphDuration;                    // 0x0388(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningBoltImpactIgnitionRadius;                 // 0x03C0(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningBoltGrassIgnitionRadius;                  // 0x03F8(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LightningBoltGrassFirePropagationFuel;             // 0x0430(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           LightningAreaTargetTelegraphCue;                   // 0x0468(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           LightningBoltTargetTelegraphCue;                   // 0x0474(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FTempestLightningBoltData>      LightningBoltData;                                 // 0x0480(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_490[0xD0];                                     // 0x0490(0x00D0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetCloudHeight() const;
	float GetLightningRadius() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TempestLightningComponent">();
	}
	static class UTempestLightningComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTempestLightningComponent>();
	}
};

// Class SuperstormRuntime.TempestTornadoForcesComponent
// 0x04E0 (0x05B8 - 0x00D8)
class UTempestTornadoForcesComponent final : public UGameFrameworkComponent
{
public:
	TMulticastInlineDelegate<void(class AActor* AffectedActor)> OnActorAddedToTornadoForces;                       // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* AffectedActor)> OnActorRemovedFromTornadoForces;                   // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    ConfigHandle;                                      // 0x00F8(0x0018)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FGameplayTag>                   PhysicsPresetTagsAngularDampingToOverride;         // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AngularDampingOverride;                            // 0x0120(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>            PawnInGE;                                          // 0x0158(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EFortPhysicsObjectType, struct FScalableFloat> ObjectTypeToMaxCapCount;                           // 0x0160(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TagsToIgnore;                                      // 0x01B0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>            RecentlyRemovedGE;                                 // 0x01D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTargetingPreset*                       TargetingPreset;                                   // 0x01D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           DamageSetByCallerTag;                              // 0x01E0(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            PeriodicDamageGE;                                  // 0x01F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>            BurstDamageGE;                                     // 0x01F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TornadoActiveCue;                                  // 0x0200(0x000C)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           PlayerNearCue;                                     // 0x020C(0x000C)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           PawnInCue;                                         // 0x0218(0x000C)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         PlayerNearRange;                                   // 0x0228(0x0038)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  BlockAbilitiesWithTag;                             // 0x0260(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FTornadoClientSimulationArray          ActorsToClientSimulate;                            // 0x0280(0x0120)(Net, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A0[0x118];                                    // 0x03A0(0x0118)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTargetingRequestHandle                AsyncTargetingHandle;                              // 0x04B8(0x0004)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class AFortPlayerPawn*>                  PreviouslyNearPlayers;                             // 0x04C0(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_510[0xA8];                                     // 0x0510(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnVehicleInTornadoPlayerExit(const class AFortPlayerControllerAthena* PlayerController, class AFortAthenaVehicle* Vehicle);

	bool IsActorInTornado(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TempestTornadoForcesComponent">();
	}
	static class UTempestTornadoForcesComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTempestTornadoForcesComponent>();
	}
};

// Class SuperstormRuntime.TornadoRadialForce
// 0x0038 (0x0460 - 0x0428)
class ATornadoRadialForce final : public AFieldSystemActor
{
public:
	float                                         Radius;                                            // 0x0428(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Strength;                                          // 0x042C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0430(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StopTime;                                          // 0x0434(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IncomingDuration;                                  // 0x0438(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutgoingDuration;                                  // 0x043C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_440[0x8];                                      // 0x0440(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class URadialVector*                          RadialVector;                                      // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URadialFalloff*                         RadialFalloff;                                     // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOperatorField*                         OperatorField;                                     // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TornadoRadialForce">();
	}
	static class ATornadoRadialForce* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATornadoRadialForce>();
	}
};

}

