#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SupplyDropRadioRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SupplyDropRadioRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class SupplyDropRadioRuntime.BuildingGameplayActorSupplyDropRadio
// 0x0208 (0x0F28 - 0x0D20)
class ABuildingGameplayActorSupplyDropRadio final : public ABuildingGameplayActor
{
public:
	float                                         MinimumMovingSpeedThresholdSq;                     // 0x0D20(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BalloonClosedGroundedFallSpeed;                    // 0x0D24(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoOpen;                                         // 0x0D28(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D29[0x7];                                      // 0x0D29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ForceOpenActorTags;                                // 0x0D30(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagQuery                      IgnoreMovingCollisionWithActorTagQuery;            // 0x0D50(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         InterpRateToBalloonOpenedFallSpeed;                // 0x0D98(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DistanceFromOriginalSpawnLocForBalloonOpen;        // 0x0D9C(0x0004)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESupplyDropRadioBalloonState                  BalloonState;                                      // 0x0DA0(0x0001)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DA1[0x7];                                      // 0x0DA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             WaterHitResult;                                    // 0x0DA8(0x0108)(BlueprintVisible, Transient, IsPlainOldData, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          bMoving;                                           // 0x0EB0(0x0001)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EB1[0x3];                                      // 0x0EB1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FallSpeed;                                         // 0x0EB4(0x0004)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BalloonOpenedFallSpeed;                            // 0x0EB8(0x0004)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GravityMultiplier;                                 // 0x0EBC(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                ServerLocation;                                    // 0x0EC0(0x0018)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ClientLocationCorrectionMaxDistSqWhenBalloonDisabled; // 0x0ED8(0x0004)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ClientLocationCorrectionMaxDistSqWhenBalloonEnabled; // 0x0EDC(0x0004)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                Velocity;                                          // 0x0EE0(0x0018)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                PreviousFrameVelocity;                             // 0x0EF8(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                OriginalServerSpawnLocation;                       // 0x0F10(0x0018)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleMoveIgnoredActorEndPlay(class AActor* EndPlayActor, EEndPlayReason Reason);
	void OnRep_BalloonState();
	void OnRep_DistanceFromOriginalSpawnLocForBalloonOpen();
	void OpenSupplyDrop();
	void SetBalloonState(const ESupplyDropRadioBalloonState InBalloonState);
	void SetGravityMultiplier(const float InGravityMultiplier);
	void UpdateGroundInfo(const bool bValidBlock, const struct FHitResult& MovementHitResult);

	ESupplyDropRadioBalloonState GetBalloonState() const;
	float GetGravityZ() const;
	class AActor* GetHighestAttachParent(const class AActor* InActor) const;
	class UBoxComponent* GetRootCollisionComponent() const;
	bool IsGrounded() const;
	bool IsMoving() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuildingGameplayActorSupplyDropRadio">();
	}
	static class ABuildingGameplayActorSupplyDropRadio* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABuildingGameplayActorSupplyDropRadio>();
	}
};

// Class SupplyDropRadioRuntime.FortSupplyDropRadioAttachActorComponent
// 0x0000 (0x00D8 - 0x00D8)
class UFortSupplyDropRadioAttachActorComponent final : public UActorComponent
{
public:
	void SetOwningActorNetCullDistance(const float DistanceSquared) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSupplyDropRadioAttachActorComponent">();
	}
	static class UFortSupplyDropRadioAttachActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSupplyDropRadioAttachActorComponent>();
	}
};

// Class SupplyDropRadioRuntime.FortSupplyDropRadioBlueprintLibrary
// 0x0000 (0x0030 - 0x0030)
class UFortSupplyDropRadioBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void SetMoveShouldAbortConversation(class AFortPlayerControllerGameplay* PlayerController, const bool bNewMoveAbortConversation);
	static void StopCurrentConversation(class AFortPlayerControllerGameplay* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSupplyDropRadioBlueprintLibrary">();
	}
	static class UFortSupplyDropRadioBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSupplyDropRadioBlueprintLibrary>();
	}
};

}

