#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: supply_drop_spawner_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass supply_drop_spawner_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class supply_drop_spawner_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass supply_drop_spawner_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class supply_drop_spawner_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<supply_drop_spawner_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass supply_drop_spawner_device.supply_drop_spawner_device
// 0x0040 (0x0100 - 0x00C0)
class Usupply_drop_spawner_device final : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0xC67AC554_BalloonPoppedEvent;             // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xF7F9147A_OpenedEvent;                    // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x8AD4F435_LandingEvent;                   // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xA1DD012D_SpawnFunction;                  // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x24879C7C_DestroyBalloonFunction;         // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x91F4AF8E_OpenFunction;                   // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x7BCCDCA3_LockFunction;                   // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xA6F04492_UnlockFunction;                 // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fsupply__drop__spawner__device_N_RDestroyBalloon(const struct supply_drop_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fsupply__drop__spawner__device_N_RLock(const struct supply_drop_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fsupply__drop__spawner__device_N_ROpen_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fsupply__drop__spawner__device_N_RSpawn(const struct supply_drop_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fsupply__drop__spawner__device_N_RSpawn_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fsupply__drop__spawner__device_N_RUnlock(const struct supply_drop_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"supply_drop_spawner_device">();
	}
	static class Usupply_drop_spawner_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Usupply_drop_spawner_device>();
	}
};

}

