#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TacticalSprintRuntime

#include "Basic.hpp"

#include "TacticalSprintRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "ModularGameplay_classes.hpp"


namespace SDK
{

// Class TacticalSprintRuntime.FortMovementMode_TacSprintRuntimeData
// 0x0038 (0x0080 - 0x0048)
class UFortMovementMode_TacSprintRuntimeData final : public UFortMovementMode_BaseExtRuntimeData
{
public:
	uint8                                         Pad_48[0x38];                                      // 0x0048(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_TacSprintRuntimeData">();
	}
	static class UFortMovementMode_TacSprintRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_TacSprintRuntimeData>();
	}
};

// Class TacticalSprintRuntime.FortMovementMode_ELTacSprint
// 0x03D0 (0x0518 - 0x0148)
class UFortMovementMode_ELTacSprint : public UFortMovementMode_BaseExtLogic
{
public:
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TacticalSprintFail;                                // 0x0150(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  TacticalSprintFailLowEnergy;                       // 0x0170(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MinEnergyToActivate;                               // 0x0190(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MinEnergyToActivateCreative;                       // 0x01C8(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTag                           GCEnergyDrain;                                     // 0x0200(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           GCSpeedLines;                                      // 0x020C(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           GCSprintEnd;                                       // 0x0218(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxSpeedMultiplier;                                // 0x0228(0x0038)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AccelerationMultiplier;                            // 0x0260(0x0038)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RampUpSpeed;                                       // 0x0298(0x0038)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RampDownSpeed;                                     // 0x02D0(0x0038)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         JumpHeightMultiplier;                              // 0x0308(0x0038)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_340[0x4];                                      // 0x0340(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           TutorialGameplayTag;                               // 0x0344(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TutorialAdditionalSourceTag;                       // 0x0350(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TutorialTargetTag;                                 // 0x0370(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class USoundBase*                             OnEnergyFullyDrainedSound;                         // 0x0390(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TacticalBehaviorTag;                               // 0x0398(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bIsCancelledBySliding : 1;                         // 0x03A4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bShouldHolsterWeapon : 1;                          // 0x03A4(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           TagPreventWeaponHolster;                           // 0x03A8(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinSpeedForHolster;                                // 0x03B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HolsterTimeAttemptDelay;                           // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         MaxTryHolsterAttempt;                              // 0x03BC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3BD[0x13];                                     // 0x03BD(0x0013)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortComponent_Energy>      EnergyComponentClass;                              // 0x03D0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HF_EnergyCostOnStart;                              // 0x03D8(0x0038)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HF_EnergyCostPerSecond;                            // 0x0410(0x0038)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HF_EnergyCostOnJump;                               // 0x0448(0x0038)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           IgnoreJumpCostTag;                                 // 0x0480(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TacticalSprintTag;                                 // 0x048C(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           EnergyUseIdentifier;                               // 0x0498(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundMix*                              SprintStartedSoundMix;                             // 0x04A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                             SprintStartedSound2D;                              // 0x04B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         HF_TacSprintEnabled;                               // 0x04C0(0x0038)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4F8[0x8];                                      // 0x04F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortCameraMode>            CameraMode;                                        // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           CameraModeTag;                                     // 0x0508(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleFailedToSprint();
	void HandleMovementModeChanged(class ACharacter* Character, EMovementMode PreviousMovementMode, uint8 PreviousCustomMode);
	void HandleOnEnergyDrained(class UFortComponent_Energy* EnergyComp);
	void HandleOnEnterAircraft();
	void HandleOnEnteredEditMode();
	void HandleOnPawnJump();
	void HandleOnPlayerWeaponChanged(class AFortPawn* InPawn, class AFortWeapon* InNewWeapon, class AFortWeapon* InPlayerWeapon);
	void HandleOnReloadCanceling();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ELTacSprint">();
	}
	static class UFortMovementMode_ELTacSprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ELTacSprint>();
	}
};

// Class TacticalSprintRuntime.FortPlayerControllerComponent_TacticalSprint
// 0x0198 (0x0270 - 0x00D8)
class UFortPlayerControllerComponent_TacticalSprint final : public UControllerComponent
{
public:
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFailedToSprint;                                  // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMovementMode_BaseExtLogic> MovementModeExtension;                             // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPlayerPawn*                        CurrentBoundPlayerPawn;                            // 0x0108(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bTacticalSprintEnabled : 1;                        // 0x0110(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bWantsToTacticalSprint : 1;                        // 0x0110(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bHandlingMoveForward : 1;                          // 0x0110(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bIsSprinting : 1;                                  // 0x0110(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bWasInBuildMode : 1;                               // 0x0110(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bFireAnalyticsEventOnEndPlay : 1;                  // 0x0110(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           TacticalSprintAbilityGameplayTag;                  // 0x0114(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           DisableTacticalSprintAbilityGameplayTag;           // 0x0120(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         TacticalSprintEnabled;                             // 0x0130(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TacticalSprintToggleGracePeriod;                   // 0x0168(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnTacticalSprintStarted;                           // 0x01A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnTacticalSprintEnded;                             // 0x01B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	bool                                          bUseMovementModeExtension;                         // 0x01C0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C1[0xF];                                      // 0x01C1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           AllowPrimaryFireTag;                               // 0x01D0(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           AllowSecondaryFireTag;                             // 0x01DC(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           StopWantingToSprintTimerReceipt;                   // 0x01E8(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1F0[0x60];                                     // 0x01F0(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        InputComponent;                                    // 0x0250(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_258[0x18];                                     // 0x0258(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddCustomSprintMMEClass(const TSubclassOf<class UFortMovementMode_ELTacSprint>& SprintMMEClassToAdd);
	void LogAndVisualLog(class UObject* LoggingSource, ESprintLoggingVerbosityLevel Verbosity, const class FString& LogString);
	void OnAutoRunChanged(bool bAutoRunIsOn);
	void OnMovementModeChanged(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void OnMutatorUpdated();
	void OnPawnChanged(class AFortPawn* InPawn);
	void OnPlayerStatePawnSet(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);
	void OnWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PreviousWeapon);
	void RegisterMutatorUpdatedDelegate();
	void RemoveCustomSprintMMEClass(const TSubclassOf<class UFortMovementMode_ELTacSprint>& SprintMMEClassToRemove);
	void SetIsSprinting(bool bNewIsSprinting);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerControllerComponent_TacticalSprint">();
	}
	static class UFortPlayerControllerComponent_TacticalSprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerControllerComponent_TacticalSprint>();
	}
};

}

