#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TakeRecorder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"
#include "TakeTrackRecorders_structs.hpp"


namespace SDK
{

// Enum TakeRecorder.ETakeRecorderState
// NumValues: 0x0007
enum class ETakeRecorderState : uint8
{
	CountingDown                             = 0,
	PreRecord                                = 1,
	TickingAfterPre                          = 2,
	Started                                  = 3,
	Stopped                                  = 4,
	Cancelled                                = 5,
	ETakeRecorderState_MAX                   = 6,
};

// Enum TakeRecorder.ETakeRecorderPanelMode
// NumValues: 0x0005
enum class ETakeRecorderPanelMode : uint8
{
	NewRecording                             = 0,
	RecordingInto                            = 1,
	EditingPreset                            = 2,
	ReviewingRecording                       = 3,
	ETakeRecorderPanelMode_MAX               = 4,
};

// Enum TakeRecorder.ETakeRecorderMode
// NumValues: 0x0003
enum class ETakeRecorderMode : uint8
{
	RecordNewSequence                        = 0,
	RecordIntoSequence                       = 1,
	ETakeRecorderMode_MAX                    = 2,
};

// ScriptStruct TakeRecorder.TakeRecorderUserParameters
// 0x0018 (0x0018 - 0x0000)
struct FTakeRecorderUserParameters final
{
public:
	bool                                          bMaximizeViewport;                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CountdownSeconds;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EngineTimeDilation;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetPlayhead;                                    // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopAtPlaybackEnd;                                // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveRedundantTracks;                            // 0x000E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReduceKeysTolerance;                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSaveRecordedAssets;                               // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoLock;                                         // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoSerialize;                                    // 0x0016(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TakeRecorder.TakeRecorderProjectParameters
// 0x0050 (0x0050 - 0x0000)
struct FTakeRecorderProjectParameters final
{
public:
	struct FDirectoryPath                         RootTakeSaveDir;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TakeSaveDir;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultSlate;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUpdateClockSource                            RecordingClockSource;                              // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartAtCurrentTimecode;                           // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecordTimecode;                                   // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecordSourcesIntoSubSequences;                    // 0x0033(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecordToPossessable;                              // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTakeRecorderTrackSettings>     DefaultTracks;                                     // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bShowNotifications;                                // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TakeRecorder.TakeRecorderParameters
// 0x0078 (0x0078 - 0x0000)
struct FTakeRecorderParameters final
{
public:
	struct FTakeRecorderUserParameters            User;                                              // 0x0000(0x0018)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FTakeRecorderProjectParameters         Project;                                           // 0x0018(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	ETakeRecorderMode                             TakeRecorderMode;                                  // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameNumber                           StartFrame;                                        // 0x006C(0x0004)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableRecordingAndSave;                          // 0x0070(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

