#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TakesCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TakesCore.TakeMetaData.GetFrameRate
// 0x0008 (0x0008 - 0x0000)
struct TakeMetaData_GetFrameRate final
{
public:
	struct FFrameRate                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.SetDescription
// 0x0010 (0x0010 - 0x0000)
struct TakeMetaData_SetDescription final
{
public:
	class FString                                 InDescription;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.SetDuration
// 0x0008 (0x0008 - 0x0000)
struct TakeMetaData_SetDuration final
{
public:
	struct FFrameTime                             InDuration;                                        // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.SetFrameRate
// 0x0008 (0x0008 - 0x0000)
struct TakeMetaData_SetFrameRate final
{
public:
	struct FFrameRate                             InFrameRate;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.SetFrameRateFromTimecode
// 0x0001 (0x0001 - 0x0000)
struct TakeMetaData_SetFrameRateFromTimecode final
{
public:
	bool                                          InFromTimecode;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.SetLevelOrigin
// 0x0008 (0x0008 - 0x0000)
struct TakeMetaData_SetLevelOrigin final
{
public:
	class ULevel*                                 InLevelOrigin;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.SetPresetOrigin
// 0x0008 (0x0008 - 0x0000)
struct TakeMetaData_SetPresetOrigin final
{
public:
	class UTakePreset*                            InPresetOrigin;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.SetSlate
// 0x0018 (0x0018 - 0x0000)
struct TakeMetaData_SetSlate final
{
public:
	class FString                                 InSlate;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEmitChanged;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function TakesCore.TakeMetaData.SetTakeNumber
// 0x0008 (0x0008 - 0x0000)
struct TakeMetaData_SetTakeNumber final
{
public:
	int32                                         InTakeNumber;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEmitChanged;                                      // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function TakesCore.TakeMetaData.SetTimecodeIn
// 0x0014 (0x0014 - 0x0000)
struct TakeMetaData_SetTimecodeIn final
{
public:
	struct FTimecode                              InTimecodeIn;                                      // 0x0000(0x0014)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.SetTimecodeOut
// 0x0014 (0x0014 - 0x0000)
struct TakeMetaData_SetTimecodeOut final
{
public:
	struct FTimecode                              InTimecodeOut;                                     // 0x0000(0x0014)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.SetTimestamp
// 0x0008 (0x0008 - 0x0000)
struct TakeMetaData_SetTimestamp final
{
public:
	struct FDateTime                              InTimestamp;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.GenerateAssetPath
// 0x0020 (0x0020 - 0x0000)
struct TakeMetaData_GenerateAssetPath final
{
public:
	class FString                                 PathFormatString;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.GetDescription
// 0x0010 (0x0010 - 0x0000)
struct TakeMetaData_GetDescription final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.GetDuration
// 0x0008 (0x0008 - 0x0000)
struct TakeMetaData_GetDuration final
{
public:
	struct FFrameTime                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.GetFrameRateFromTimecode
// 0x0001 (0x0001 - 0x0000)
struct TakeMetaData_GetFrameRateFromTimecode final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.GetLevelOrigin
// 0x0008 (0x0008 - 0x0000)
struct TakeMetaData_GetLevelOrigin final
{
public:
	class ULevel*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.GetLevelPath
// 0x0010 (0x0010 - 0x0000)
struct TakeMetaData_GetLevelPath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.GetPresetOrigin
// 0x0008 (0x0008 - 0x0000)
struct TakeMetaData_GetPresetOrigin final
{
public:
	class UTakePreset*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.GetSlate
// 0x0010 (0x0010 - 0x0000)
struct TakeMetaData_GetSlate final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.GetTakeNumber
// 0x0004 (0x0004 - 0x0000)
struct TakeMetaData_GetTakeNumber final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.GetTimecodeIn
// 0x0014 (0x0014 - 0x0000)
struct TakeMetaData_GetTimecodeIn final
{
public:
	struct FTimecode                              ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.GetTimecodeOut
// 0x0014 (0x0014 - 0x0000)
struct TakeMetaData_GetTimecodeOut final
{
public:
	struct FTimecode                              ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.GetTimestamp
// 0x0008 (0x0008 - 0x0000)
struct TakeMetaData_GetTimestamp final
{
public:
	struct FDateTime                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.IsLocked
// 0x0001 (0x0001 - 0x0000)
struct TakeMetaData_IsLocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeMetaData.Recorded
// 0x0001 (0x0001 - 0x0000)
struct TakeMetaData_Recorded final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeRecorderSources.AddSource
// 0x0010 (0x0010 - 0x0000)
struct TakeRecorderSources_AddSource final
{
public:
	TSubclassOf<class UTakeRecorderSource>        InSourceType;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTakeRecorderSource*                    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeRecorderSources.RemoveSource
// 0x0008 (0x0008 - 0x0000)
struct TakeRecorderSources_RemoveSource final
{
public:
	class UTakeRecorderSource*                    InSource;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeRecorderSources.StartRecordingSource
// 0x0020 (0x0020 - 0x0000)
struct TakeRecorderSources_StartRecordingSource final
{
public:
	TArray<class UTakeRecorderSource*>            InSources;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FQualifiedFrameTime                    CurrentFrameTime;                                  // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakeRecorderSources.GetSourcesCopy
// 0x0010 (0x0010 - 0x0000)
struct TakeRecorderSources_GetSourcesCopy final
{
public:
	TArray<class UTakeRecorderSource*>            ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakesCoreBlueprintLibrary.ComputeNextTakeNumber
// 0x0018 (0x0018 - 0x0000)
struct TakesCoreBlueprintLibrary_ComputeNextTakeNumber final
{
public:
	class FString                                 Slate;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function TakesCore.TakesCoreBlueprintLibrary.FindTakes
// 0x0028 (0x0028 - 0x0000)
struct TakesCoreBlueprintLibrary_FindTakes final
{
public:
	class FString                                 Slate;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TakeNumber;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAssetData>                     ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakesCoreBlueprintLibrary.SetOnTakeRecorderSlateChanged
// 0x0014 (0x0014 - 0x0000)
struct TakesCoreBlueprintLibrary_SetOnTakeRecorderSlateChanged final
{
public:
	TDelegate<void(const class FString& Slate)>   OnTakeRecorderSlateChanged;                        // 0x0000(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakesCore.TakesCoreBlueprintLibrary.SetOnTakeRecorderTakeNumberChanged
// 0x0014 (0x0014 - 0x0000)
struct TakesCoreBlueprintLibrary_SetOnTakeRecorderTakeNumberChanged final
{
public:
	TDelegate<void(int32 TakeNumber)>             OnTakeRecorderTakeNumberChanged;                   // 0x0000(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

