#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TakeRecorder

#include "Basic.hpp"

#include "TakeRecorder_structs.hpp"
#include "MovieScene_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TakeRecorder.TakeRecorder.GetCountdownSeconds
// 0x0004 (0x0004 - 0x0000)
struct TakeRecorder_GetCountdownSeconds final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorder.GetSequence
// 0x0008 (0x0008 - 0x0000)
struct TakeRecorder_GetSequence final
{
public:
	class ULevelSequence*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorder.GetState
// 0x0001 (0x0001 - 0x0000)
struct TakeRecorder_GetState final
{
public:
	ETakeRecorderState                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderBlueprintLibrary.GetActiveRecorder
// 0x0008 (0x0008 - 0x0000)
struct TakeRecorderBlueprintLibrary_GetActiveRecorder final
{
public:
	class UTakeRecorder*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderBlueprintLibrary.GetDefaultParameters
// 0x0078 (0x0078 - 0x0000)
struct TakeRecorderBlueprintLibrary_GetDefaultParameters final
{
public:
	struct FTakeRecorderParameters                ReturnValue;                                       // 0x0000(0x0078)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderBlueprintLibrary.GetTakeRecorderPanel
// 0x0008 (0x0008 - 0x0000)
struct TakeRecorderBlueprintLibrary_GetTakeRecorderPanel final
{
public:
	class UTakeRecorderPanel*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderBlueprintLibrary.IsRecording
// 0x0001 (0x0001 - 0x0000)
struct TakeRecorderBlueprintLibrary_IsRecording final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderBlueprintLibrary.IsTakeRecorderEnabled
// 0x0001 (0x0001 - 0x0000)
struct TakeRecorderBlueprintLibrary_IsTakeRecorderEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderBlueprintLibrary.OpenTakeRecorderPanel
// 0x0008 (0x0008 - 0x0000)
struct TakeRecorderBlueprintLibrary_OpenTakeRecorderPanel final
{
public:
	class UTakeRecorderPanel*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderBlueprintLibrary.SetDefaultParameters
// 0x0078 (0x0078 - 0x0000)
struct TakeRecorderBlueprintLibrary_SetDefaultParameters final
{
public:
	struct FTakeRecorderParameters                DefaultParameters;                                 // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderBlueprintLibrary.SetOnTakeRecorderCancelled
// 0x0014 (0x0014 - 0x0000)
struct TakeRecorderBlueprintLibrary_SetOnTakeRecorderCancelled final
{
public:
	TDelegate<void()>                             OnTakeRecorderCancelled;                           // 0x0000(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderBlueprintLibrary.SetOnTakeRecorderFinished
// 0x0014 (0x0014 - 0x0000)
struct TakeRecorderBlueprintLibrary_SetOnTakeRecorderFinished final
{
public:
	TDelegate<void(class ULevelSequence* SequenceAsset)> OnTakeRecorderFinished;                            // 0x0000(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderBlueprintLibrary.SetOnTakeRecorderMarkedFrameAdded
// 0x0014 (0x0014 - 0x0000)
struct TakeRecorderBlueprintLibrary_SetOnTakeRecorderMarkedFrameAdded final
{
public:
	TDelegate<void(struct FMovieSceneMarkedFrame& MarkedFrame)> OnTakeRecorderMarkedFrameAdded;                    // 0x0000(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderBlueprintLibrary.SetOnTakeRecorderPanelChanged
// 0x0014 (0x0014 - 0x0000)
struct TakeRecorderBlueprintLibrary_SetOnTakeRecorderPanelChanged final
{
public:
	TDelegate<void()>                             OnTakeRecorderPanelChanged;                        // 0x0000(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderBlueprintLibrary.SetOnTakeRecorderPreInitialize
// 0x0014 (0x0014 - 0x0000)
struct TakeRecorderBlueprintLibrary_SetOnTakeRecorderPreInitialize final
{
public:
	TDelegate<void()>                             OnTakeRecorderPreInitialize;                       // 0x0000(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderBlueprintLibrary.SetOnTakeRecorderStarted
// 0x0014 (0x0014 - 0x0000)
struct TakeRecorderBlueprintLibrary_SetOnTakeRecorderStarted final
{
public:
	TDelegate<void()>                             OnTakeRecorderStarted;                             // 0x0000(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderBlueprintLibrary.SetOnTakeRecorderStopped
// 0x0014 (0x0014 - 0x0000)
struct TakeRecorderBlueprintLibrary_SetOnTakeRecorderStopped final
{
public:
	TDelegate<void()>                             OnTakeRecorderStopped;                             // 0x0000(0x0014)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderBlueprintLibrary.StartRecording
// 0x0098 (0x0098 - 0x0000)
struct TakeRecorderBlueprintLibrary_StartRecording final
{
public:
	class ULevelSequence*                         LevelSequence;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTakeRecorderSources*                   Sources;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTakeMetaData*                          MetaData;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTakeRecorderParameters                Parameters;                                        // 0x0018(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UTakeRecorder*                          ReturnValue;                                       // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderPanel.SetFrameRate
// 0x0008 (0x0008 - 0x0000)
struct TakeRecorderPanel_SetFrameRate final
{
public:
	struct FFrameRate                             InFrameRate;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderPanel.SetFrameRateFromTimecode
// 0x0001 (0x0001 - 0x0000)
struct TakeRecorderPanel_SetFrameRateFromTimecode final
{
public:
	bool                                          bInFromTimecode;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderPanel.SetupForEditing
// 0x0008 (0x0008 - 0x0000)
struct TakeRecorderPanel_SetupForEditing final
{
public:
	class UTakePreset*                            TakePreset;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderPanel.SetupForRecording_LevelSequence
// 0x0008 (0x0008 - 0x0000)
struct TakeRecorderPanel_SetupForRecording_LevelSequence final
{
public:
	class ULevelSequence*                         LevelSequenceAsset;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderPanel.SetupForRecording_TakePreset
// 0x0008 (0x0008 - 0x0000)
struct TakeRecorderPanel_SetupForRecording_TakePreset final
{
public:
	class UTakePreset*                            TakePresetAsset;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderPanel.SetupForRecordingInto_LevelSequence
// 0x0008 (0x0008 - 0x0000)
struct TakeRecorderPanel_SetupForRecordingInto_LevelSequence final
{
public:
	class ULevelSequence*                         LevelSequenceAsset;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderPanel.SetupForViewing
// 0x0008 (0x0008 - 0x0000)
struct TakeRecorderPanel_SetupForViewing final
{
public:
	class ULevelSequence*                         LevelSequenceAsset;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderPanel.CanStartRecording
// 0x0018 (0x0018 - 0x0000)
struct TakeRecorderPanel_CanStartRecording final
{
public:
	class FText                                   OutErrorText;                                      // 0x0000(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function TakeRecorder.TakeRecorderPanel.GetFrameRate
// 0x0008 (0x0008 - 0x0000)
struct TakeRecorderPanel_GetFrameRate final
{
public:
	struct FFrameRate                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderPanel.GetLastRecordedLevelSequence
// 0x0008 (0x0008 - 0x0000)
struct TakeRecorderPanel_GetLastRecordedLevelSequence final
{
public:
	class ULevelSequence*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderPanel.GetLevelSequence
// 0x0008 (0x0008 - 0x0000)
struct TakeRecorderPanel_GetLevelSequence final
{
public:
	class ULevelSequence*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderPanel.GetMode
// 0x0001 (0x0001 - 0x0000)
struct TakeRecorderPanel_GetMode final
{
public:
	ETakeRecorderPanelMode                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderPanel.GetSources
// 0x0008 (0x0008 - 0x0000)
struct TakeRecorderPanel_GetSources final
{
public:
	class UTakeRecorderSources*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TakeRecorder.TakeRecorderPanel.GetTakeMetaData
// 0x0008 (0x0008 - 0x0000)
struct TakeRecorderPanel_GetTakeMetaData final
{
public:
	class UTakeMetaData*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

