#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TakeTrackRecorders

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct TakeTrackRecorders.TakeRecorderPropertyTrackSettings
// 0x0020 (0x0020 - 0x0000)
struct FTakeRecorderPropertyTrackSettings final
{
public:
	class FString                                 ComponentPath;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyPath;                                      // 0x0010(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TakeTrackRecorders.TakeRecorderTrackSettings
// 0x0048 (0x0048 - 0x0000)
struct FTakeRecorderTrackSettings final
{
public:
	struct FSoftClassPath                         MatchingActorClass;                                // 0x0000(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTakeRecorderPropertyTrackSettings> DefaultPropertyTracks;                             // 0x0028(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FTakeRecorderPropertyTrackSettings> ExcludePropertyTracks;                             // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
};

}

