#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: team_settings_and_inventory_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass team_settings_and_inventory_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class team_settings_and_inventory_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass team_settings_and_inventory_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class team_settings_and_inventory_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<team_settings_and_inventory_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass team_settings_and_inventory_device.team_settings_and_inventory_device
// 0x0030 (0x00F0 - 0x00C0)
class Uteam_settings_and_inventory_device final : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0xD9D9DA43_EnemyEliminatedEvent;           // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xF972B868_TeamMemberEliminatedEvent;      // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x88B26FF1_TeamMemberSpawnedEvent;         // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x284B84AB_TeamOutOfRespawnsEvent;         // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xBC317D08_EndRoundFunction;               // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0x42DC780F_IsOnTeamFunction;               // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fteam__settings__and__inventory__device_N_REndRound(const struct team_settings_and_inventory_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fteam__settings__and__inventory__device_N_RIsOnTeam_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"team_settings_and_inventory_device">();
	}
	static class Uteam_settings_and_inventory_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uteam_settings_and_inventory_device>();
	}
};

}

