#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TempestRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "TempestRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "ModularGameplay_classes.hpp"


namespace SDK
{

// Class TempestRuntime.FortAIControllerComponent_Tempest
// 0x0018 (0x00F8 - 0x00E0)
class UFortAIControllerComponent_Tempest final : public UFortControllerComponent
{
public:
	class UFortTimeOfDayWeatherComponent*         WeatherComponent;                                  // 0x00E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x10];                                      // 0x00E8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAIControllerComponent_Tempest">();
	}
	static class UFortAIControllerComponent_Tempest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAIControllerComponent_Tempest>();
	}
};

// Class TempestRuntime.FortCheatManager_Tempest
// 0x0000 (0x0030 - 0x0030)
class UFortCheatManager_Tempest final : public UChildCheatManager
{
public:
	void EndTempestStorm(const class FString& StormName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_Tempest">();
	}
	static class UFortCheatManager_Tempest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_Tempest>();
	}
};

// Class TempestRuntime.TempestMovementComponent
// 0x0148 (0x0220 - 0x00D8)
class UTempestMovementComponent final : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTempestReplicatedMovementData         MovementData;                                      // 0x00E0(0x0050)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnTempestMovementStuck;                            // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(bool bIsInSafeZone)> OnTempestSafeZoneStateChanged;                     // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	ETempestMovementMode                          MovementMode;                                      // 0x0150(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQuery*                              FindNextMovementLocationQuery;                     // 0x0158(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortAthenaPatrolPath*                  MovementPath;                                      // 0x0160(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MovementSpeed;                                     // 0x0168(0x0038)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         RotationSpeed;                                     // 0x01A0(0x0038)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         bShouldIgnoreZMovement : 1;                        // 0x01D8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bFloatOnWater : 1;                                 // 0x01D8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         WaterTraceZOffset;                                 // 0x01E0(0x0038)(Edit, AdvancedDisplay, NativeAccessSpecifierPrivate)
	uint8                                         Pad_218[0x8];                                      // 0x0218(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_MovementData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TempestMovementComponent">();
	}
	static class UTempestMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTempestMovementComponent>();
	}
};

// Class TempestRuntime.TempestStateMachineComponent
// 0x0108 (0x01E0 - 0x00D8)
class alignas(0x10) UTempestStateMachineComponent final : public UGameFrameworkComponent
{
public:
	bool                                          bDestroyOnCompletion;                              // 0x00D8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         FormationDuration;                                 // 0x00E0(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ActiveDuration;                                    // 0x0118(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DissipationDuration;                               // 0x0150(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FTempestStateInfo                      CurrentStateInfo;                                  // 0x0188(0x000C)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_194[0x24];                                     // 0x0194(0x0024)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(struct FTempestStateInfo& TempestStateInfo)> OnTempestStateChangedDelegate;                     // 0x01B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C8[0x18];                                     // 0x01C8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ForceDissipate(const class FString& InDissipationReason);
	void OnRep_CurrentStateInfo();

	ETempestState GetCurrentState() const;
	float GetCurrentStateCompletionPercentage() const;
	struct FTempestStateInfo GetCurrentStateInfo() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TempestStateMachineComponent">();
	}
	static class UTempestStateMachineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTempestStateMachineComponent>();
	}
};

}

