#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TextureUtilitiesCommon

#include "Basic.hpp"

#include "TextureUtilitiesCommon_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class TextureUtilitiesCommon.TextureImportSettings
// 0x0010 (0x0070 - 0x0060)
class UTextureImportSettings final : public UDeveloperSettings
{
public:
	int32                                         AutoVTSize;                                        // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AutoLimitDimension;                                // 0x0064(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableNormalizeNormals;                           // 0x0068(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFastMipFilter;                              // 0x0069(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureImportFloatingPointFormat             CompressedFormatForFloatTextures;                  // 0x006A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureImportPNGInfill                       PNGInfill;                                         // 0x006B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TextureImportSettings">();
	}
	static class UTextureImportSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextureImportSettings>();
	}
};

}

