#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: timer_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass timer_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class timer_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass timer_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class timer_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<timer_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass timer_device.timer_device
// 0x0100 (0x01C0 - 0x00C0)
class Utimer_device final : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0x55123475_SuccessEvent;                   // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x3E6E2FB4_FailureEvent;                   // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xB28C1D85_StartUrgencyModeEvent;          // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x34428A18_SavedEvent;                     // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xD1A14493_LoadedEvent;                    // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x14877526_ClearedEvent;                   // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x5BDC7A5C_EnableFunction;                 // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC9184E23_DisableFunction;                // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x4D1E6968_ResetFunction;                  // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x8BF41F0D_ResetForAllFunction;            // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x50C372C4_StartFunction;                  // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x4C106864_PauseFunction;                  // 0x0118(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC2DB72EC_ResumeFunction;                 // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x4C597D37_CompleteFunction;               // 0x0128(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xBA9D5C67_StartForAllFunction;            // 0x0130(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xFDC96A41_PauseForAllFunction;            // 0x0138(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x2632443F_ResumeForAllFunction;           // 0x0140(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x40190FF9_CompleteForAllFunction;         // 0x0148(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x252B490C_SaveFunction;                   // 0x0150(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xF37C340A_LoadFunction;                   // 0x0158(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x1BF90C5F_LoadForAllFunction;             // 0x0160(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x38F3EF66_SaveForAllFunction;             // 0x0168(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x0077D7C2_ClearPersistenceDataFunction;   // 0x0170(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x1F20724C_ClearPersistenceDataForAllFunction; // 0x0178(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type* __verse_0x35E67205_SetActiveDurationFunction;      // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0xD48A443C_GetActiveDurationFunction;      // 0x0188(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x62842463_SetLapTimeFunction;             // 0x0190(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x495C7D91_SetLapTimeForAllFunction;       // 0x0198(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_float*     __verse_0x0D0C35DC_SetMaxDurationFunction;         // 0x01A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_float*     __verse_0x7FB85224_GetMaxDurationFunction;         // 0x01A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_logic*     __verse_0x34C1EAD5_IsStatePerAgentFunction;        // 0x01B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RClearPersistenceData_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RClearPersistenceDataForAll(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RClearPersistenceDataForAll_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RComplete(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RComplete_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RCompleteForAll(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RCompleteForAll_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RDisable(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RDisable_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_REnable(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_REnable_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RGetActiveDuration(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RGetActiveDuration_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RGetMaxDuration(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RIsStatePerAgent(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RLoad_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RLoadForAll(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RPause(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RPause_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RPauseForAll(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RPauseForAll_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RReset(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RReset_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RResetForAll(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RResetForAll_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RResume(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RResume_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RResumeForAll(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RResumeForAll_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RSave_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RSaveForAll(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RSetActiveDuration_L_Nfloat_M_Nagent_R(const struct Ftuple_Lfloat_Magent_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RSetActiveDuration_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RSetLapTime_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RSetLapTimeForAll(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RSetLapTimeForAll_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RSetMaxDuration_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RStart(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RStart_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RStartForAll(const struct timer_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftimer__device_N_RStartForAll_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"timer_device">();
	}
	static class Utimer_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utimer_device>();
	}
};

}

