#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToolMenus

#include "Basic.hpp"

#include "ToolMenus_structs.hpp"
#include "Slate_structs.hpp"
#include "Slate_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Class ToolMenus.ToolMenu
// 0x0100 (0x0130 - 0x0030)
class UToolMenu final : public UToolMenuBase
{
public:
	class FName                                   MenuName;                                          // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MenuParent;                                        // 0x003C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StyleName;                                         // 0x0048(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TutorialHighlightName;                             // 0x0054(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMultiBoxType                                 MenuType;                                          // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldCleanupContextOnDestroy;                    // 0x0061(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldCloseWindowAfterMenuSelection;              // 0x0062(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCloseSelfOnly;                                    // 0x0063(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSearchable;                                       // 0x0064(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bToolBarIsFocusable;                               // 0x0065(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bToolBarForceSmallIcons;                           // 0x0066(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreventCustomization;                             // 0x0067(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FToolMenuOwner                         MenuOwner;                                         // 0x0068(0x0010)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FToolMenuContext                       Context;                                           // 0x0078(0x0068)(NativeAccessSpecifierPublic)
	TArray<struct FToolMenuSection>               Sections;                                          // 0x00E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UToolMenu*                              SubMenuParent;                                     // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SubMenuSourceEntryName;                            // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x2C];                                     // 0x0104(0x002C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddDynamicSectionScript(const class FName SectionName, class UToolMenuSectionDynamic* Object);
	void AddMenuEntry(const class FName SectionName, const struct FToolMenuEntry& Args);
	void AddMenuEntryObject(class UToolMenuEntryScript* InObject);
	void AddSectionScript(const class FName SectionName, const class FText& Label, const class FName InsertName, const EToolMenuInsertType InsertType);
	class UToolMenu* AddSubMenuScript(const class FName Owner, const class FName SectionName, const class FName Name_0, const class FText& Label, const class FText& ToolTip);
	void InitMenu(const struct FToolMenuOwner& Owner, class FName Name_0, class FName Parent, EMultiBoxType Type);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolMenu">();
	}
	static class UToolMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolMenu>();
	}
};

// Class ToolMenus.ToolMenuContextBase
// 0x0000 (0x0030 - 0x0030)
class UToolMenuContextBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolMenuContextBase">();
	}
	static class UToolMenuContextBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolMenuContextBase>();
	}
};

// Class ToolMenus.SlateTabManagerContext
// 0x0010 (0x0040 - 0x0030)
class USlateTabManagerContext final : public UToolMenuContextBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SlateTabManagerContext">();
	}
	static class USlateTabManagerContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlateTabManagerContext>();
	}
};

// Class ToolMenus.ToolMenuEntryScript
// 0x00A8 (0x00D8 - 0x0030)
class UToolMenuEntryScript : public UObject
{
public:
	struct FToolMenuEntryScriptData               Data;                                              // 0x0030(0x00A8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	void ConstructMenuEntry(class UToolMenu* Menu, const class FName SectionName, const struct FToolMenuContext& Context);
	void Execute(const struct FToolMenuContext& Context);
	void InitEntry(const class FName OwnerName, const class FName Menu, const class FName Section, const class FName Name_0, const class FText& Label, const class FText& ToolTip);
	void RegisterMenuEntry();

	bool CanExecute(const struct FToolMenuContext& Context) const;
	ECheckBoxState GetCheckState(const struct FToolMenuContext& Context) const;
	struct FScriptSlateIcon GetIcon(const struct FToolMenuContext& Context) const;
	class FText GetLabel(const struct FToolMenuContext& Context) const;
	class FText GetToolTip(const struct FToolMenuContext& Context) const;
	bool IsVisible(const struct FToolMenuContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolMenuEntryScript">();
	}
	static class UToolMenuEntryScript* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolMenuEntryScript>();
	}
};

// Class ToolMenus.ToolMenuProfileContext
// 0x0010 (0x0040 - 0x0030)
class UToolMenuProfileContext final : public UToolMenuContextBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolMenuProfileContext">();
	}
	static class UToolMenuProfileContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolMenuProfileContext>();
	}
};

// Class ToolMenus.ToolMenus
// 0x0328 (0x0358 - 0x0030)
class UToolMenus final : public UObject
{
public:
	uint8                                         Pad_30[0xB0];                                      // 0x0030(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCustomizedToolMenu>            CustomizedMenus;                                   // 0x00E0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<class FName, class FName>                MenuSubstitutionsDuringGenerate;                   // 0x00F0(0x0050)(Edit, NativeAccessSpecifierPrivate)
	TMap<class FName, class UToolMenu*>           Menus;                                             // 0x0140(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_190[0x110];                                    // 0x0190(0x0110)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FToolMenuProfileMap> MenuProfiles;                                      // 0x02A0(0x0050)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F0[0x68];                                     // 0x02F0(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool AddMenuEntryObject(class UToolMenuEntryScript* MenuEntryObject);
	static class UObject* FindContext(const struct FToolMenuContext& InContext, class UClass* InClass);
	static class UToolMenus* Get();

	class UToolMenu* ExtendMenu(const class FName Name_0);
	class UToolMenu* FindMenu(const class FName Name_0);
	void RefreshAllWidgets();
	bool RefreshMenuWidget(const class FName Name_0);
	class UToolMenu* RegisterMenu(class FName Name_0, const class FName Parent, EMultiBoxType Type, bool bWarnIfAlreadyRegistered);
	void RemoveEntry(const class FName MenuName, const class FName Section, const class FName Name_0);
	void RemoveMenu(const class FName MenuName);
	void RemoveSection(const class FName MenuName, const class FName Section);
	void SetSectionLabel(const class FName MenuName, const class FName SectionName, const class FText& Label);
	void SetSectionPosition(const class FName MenuName, const class FName SectionName, const class FName OtherSectionName, const EToolMenuInsertType PositionType);
	void UnregisterOwnerByName(class FName InOwnerName);

	bool IsMenuRegistered(const class FName Name_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolMenus">();
	}
	static class UToolMenus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolMenus>();
	}
};

// Class ToolMenus.ToolMenuContextExtensions
// 0x0000 (0x0030 - 0x0030)
class UToolMenuContextExtensions final : public UObject
{
public:
	static class UObject* FindByClass(const struct FToolMenuContext& Context, TSubclassOf<class UObject> InClass);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolMenuContextExtensions">();
	}
	static class UToolMenuContextExtensions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolMenuContextExtensions>();
	}
};

// Class ToolMenus.ToolMenuEntryExtensions
// 0x0000 (0x0030 - 0x0030)
class UToolMenuEntryExtensions final : public UObject
{
public:
	static void BreakScriptSlateIcon(const struct FScriptSlateIcon& InValue, class FName* StyleSetName, class FName* StyleName, class FName* SmallStyleName);
	static void BreakStringCommand(const struct FToolMenuStringCommand& InValue, EToolMenuStringCommandType* Type, class FName* CustomType, class FString* String);
	static void BreakToolMenuOwner(const struct FToolMenuOwner& InValue, class FName* Name_0);
	static class FText GetLabel(const struct FToolMenuEntry& Target);
	static class FText GetToolTip(const struct FToolMenuEntry& Target);
	static struct FToolMenuEntry InitMenuEntry(const class FName InOwner, const class FName InName, const class FText& InLabel, const class FText& InToolTip, const EToolMenuStringCommandType CommandType, const class FName CustomCommandType, const class FString& CommandString);
	static struct FScriptSlateIcon MakeScriptSlateIcon(const class FName StyleSetName, const class FName StyleName, const class FName SmallStyleName);
	static struct FToolMenuStringCommand MakeStringCommand(EToolMenuStringCommandType Type, class FName CustomType, const class FString& String);
	static struct FToolMenuOwner MakeToolMenuOwner(class FName Name_0);
	static void SetIcon(struct FToolMenuEntry& Target, const class FName StyleSetName, const class FName StyleName, const class FName SmallStyleName);
	static void SetLabel(struct FToolMenuEntry& Target, const class FText& Label);
	static void SetStringCommand(struct FToolMenuEntry& Target, const EToolMenuStringCommandType Type, const class FName CustomType, const class FString& String);
	static void SetToolTip(struct FToolMenuEntry& Target, const class FText& ToolTip);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolMenuEntryExtensions">();
	}
	static class UToolMenuEntryExtensions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolMenuEntryExtensions>();
	}
};

// Class ToolMenus.ToolMenuSectionExtensions
// 0x0000 (0x0030 - 0x0030)
class UToolMenuSectionExtensions final : public UObject
{
public:
	static void AddEntry(struct FToolMenuSection& Section, const struct FToolMenuEntry& Args);
	static void AddEntryObject(struct FToolMenuSection& Section, class UToolMenuEntryScript* InObject);
	static class FText GetLabel(const struct FToolMenuSection& Section);
	static void SetLabel(struct FToolMenuSection& Section, const class FText& Label);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolMenuSectionExtensions">();
	}
	static class UToolMenuSectionExtensions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolMenuSectionExtensions>();
	}
};

// Class ToolMenus.ToolMenuSectionDynamic
// 0x0000 (0x0030 - 0x0030)
class UToolMenuSectionDynamic : public UObject
{
public:
	void ConstructSections(class UToolMenu* Menu, const struct FToolMenuContext& Context);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolMenuSectionDynamic">();
	}
	static class UToolMenuSectionDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolMenuSectionDynamic>();
	}
};

// Class ToolMenus.ToolMenuWidgetCollectionContext
// 0x0010 (0x0040 - 0x0030)
class UToolMenuWidgetCollectionContext final : public UToolMenuContextBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolMenuWidgetCollectionContext">();
	}
	static class UToolMenuWidgetCollectionContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolMenuWidgetCollectionContext>();
	}
};

}

