#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToolMenusEditor

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "ToolMenusEditor_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// Class ToolMenusEditor.ToolMenuEditorDialogObject
// 0x0000 (0x0030 - 0x0030)
class UToolMenuEditorDialogObject : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolMenuEditorDialogObject">();
	}
	static class UToolMenuEditorDialogObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolMenuEditorDialogObject>();
	}
};

// Class ToolMenusEditor.ToolMenuEditorDialogMenu
// 0x0018 (0x0048 - 0x0030)
class UToolMenuEditorDialogMenu final : public UToolMenuEditorDialogObject
{
public:
	class FName                                   Name_0;                                            // 0x0030(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UToolMenu*                              Menu;                                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolMenuEditorDialogMenu">();
	}
	static class UToolMenuEditorDialogMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolMenuEditorDialogMenu>();
	}
};

// Class ToolMenusEditor.ToolMenuEditorDialogBlock
// 0x0020 (0x0050 - 0x0030)
class UToolMenuEditorDialogBlock : public UToolMenuEditorDialogObject
{
public:
	class FName                                   Name_0;                                            // 0x0030(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESelectedEditMenuEntryType                    Type;                                              // 0x003C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ECustomizedToolMenuVisibility                 Visibility;                                        // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UToolMenu*                              Menu;                                              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolMenuEditorDialogBlock">();
	}
	static class UToolMenuEditorDialogBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolMenuEditorDialogBlock>();
	}
};

// Class ToolMenusEditor.ToolMenuEditorDialogSection
// 0x0000 (0x0050 - 0x0050)
class UToolMenuEditorDialogSection final : public UToolMenuEditorDialogBlock
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolMenuEditorDialogSection">();
	}
	static class UToolMenuEditorDialogSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolMenuEditorDialogSection>();
	}
};

// Class ToolMenusEditor.ToolMenuEditorDialogEntry
// 0x0000 (0x0050 - 0x0050)
class UToolMenuEditorDialogEntry final : public UToolMenuEditorDialogBlock
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolMenuEditorDialogEntry">();
	}
	static class UToolMenuEditorDialogEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolMenuEditorDialogEntry>();
	}
};

}

