#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TowHookWeaponRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "TowHookWeaponRuntime_structs.hpp"


namespace SDK::Params
{

// Function TowHookWeaponRuntime.FortMovementMode_ExtLogicTethered.BP_OnExtensionEnded
// 0x000C (0x000C - 0x0000)
struct FortMovementMode_ExtLogicTethered_BP_OnExtensionEnded final
{
public:
	struct FMMERuntimeContext                     RuntimeContext;                                    // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function TowHookWeaponRuntime.FortMovementMode_ExtLogicTethered.EventCallback_OnJumpInput
// 0x0001 (0x0001 - 0x0000)
struct FortMovementMode_ExtLogicTethered_EventCallback_OnJumpInput final
{
public:
	bool                                          bPressed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TowHookWeaponRuntime.FortMovementMode_ExtLogicTethered.ShouldActivateInTetheredMovement
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicTethered_ShouldActivateInTetheredMovement final
{
public:
	class UFortMovementMode_TetheredRuntimeData*  TetheredRuntimeData;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function TowHookWeaponRuntime.FortMovementMode_ExtLogicTethered.ShouldReEnterTetheredMovement
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicTethered_ShouldReEnterTetheredMovement final
{
public:
	class UFortMovementMode_TetheredRuntimeData*  TetheredRuntimeData;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function TowHookWeaponRuntime.FortMovementMode_ExtLogicTethered.BP_GetRuntimeData
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicTethered_BP_GetRuntimeData final
{
public:
	class UFortMovementMode_TetheredRuntimeData*  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TowHookWeaponRuntime.FortMovementMode_ExtLogicTethered.IsAnotherTetheredMMEActive
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicTethered_IsAnotherTetheredMMEActive final
{
public:
	const class UFortMovementMode_TetheredRuntimeData* TetheredRuntimeData;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function TowHookWeaponRuntime.FortMovementMode_ExtLogicTethered.IsAtSlowSpeed
// 0x0028 (0x0028 - 0x0000)
struct FortMovementMode_ExtLogicTethered_IsAtSlowSpeed final
{
public:
	class UFortMovementMode_TetheredRuntimeData*  TetheredRuntimeData;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PawnVelocity;                                      // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function TowHookWeaponRuntime.FortPawnComponent_TetheredMovement.StartTetheredMovement
// 0x0040 (0x0040 - 0x0000)
struct FortPawnComponent_TetheredMovement_StartTetheredMovement final
{
public:
	struct FFortMovementMode_TetheredCreationData CreationData;                                      // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function TowHookWeaponRuntime.FortPawnComponent_TetheredMovement.BP_GetRuntimeData
// 0x0008 (0x0008 - 0x0000)
struct FortPawnComponent_TetheredMovement_BP_GetRuntimeData final
{
public:
	class UFortMovementMode_TetheredRuntimeData*  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TowHookWeaponRuntime.TowHookWeaponBlueprintLibrary.GetTowHookWeaponTargetInfo
// 0x01E0 (0x01E0 - 0x0000)
struct TowHookWeaponBlueprintLibrary_GetTowHookWeaponTargetInfo final
{
public:
	class AFortPlayerPawn*                        SourcePlayerPawn;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTowHookWeaponTargetingConfig          TargetingConfig;                                   // 0x0008(0x0198)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         DrawDebugDuration;                                 // 0x01A0(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTowHookWeaponTargetInfo               ReturnValue;                                       // 0x01A8(0x0038)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

}

