#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrainRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "TargetingSystem_structs.hpp"
#include "TrainRuntime_structs.hpp"


namespace SDK
{

// Class TrainRuntime.FortTrainCheatManager
// 0x0018 (0x0048 - 0x0030)
class UFortTrainCheatManager final : public UChildCheatManager
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTrainMoveInPositiveRailDirection(bool bMoveInPositiveRailDirection);
	void SetTrainStartLocationToCursor();
	void TeleportToTrain();
	void TeleportToTrainStartLocation();
	void TeleportTrainToCursor();
	void TeleportTrainToTrainStartLocation();

	void PrintTrainDebug() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTrainCheatManager">();
	}
	static class UFortTrainCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTrainCheatManager>();
	}
};

// Class TrainRuntime.FortTrainSpawner
// 0x00E0 (0x0500 - 0x0420)
class AFortTrainSpawner final : public AActor
{
public:
	class UTrainConfig*                           TrainConfig;                                       // 0x0420(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RandomizeSpawnLocation;                            // 0x0428(0x0038)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ReverseDirection;                                  // 0x0460(0x0038)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RandomizeDirection;                                // 0x0498(0x0038)(Edit, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class AFortTrainRail>          Rail;                                              // 0x04D0(0x0030)(Edit, DisableEditOnTemplate, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTrainSpawner">();
	}
	static class AFortTrainSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortTrainSpawner>();
	}
};

// Class TrainRuntime.TrainCar
// 0x01F8 (0x0640 - 0x0448)
class ATrainCar final : public AFortGameplayTagActor
{
public:
	uint8                                         Pad_448[0x14];                                     // 0x0448(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bCanBeMarked : 1;                                  // 0x045C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bBlockMarking : 1;                                 // 0x045C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_45D[0x3];                                      // 0x045D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarkedActorDisplayInfo                MarkerDisplay;                                     // 0x0460(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                MarkerPositionOffset;                              // 0x0530(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Length;                                            // 0x0548(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ConnectorLength;                                   // 0x054C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTargetingPreset*                       DestructionTargetingPreset;                        // 0x0550(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTargetingPreset*                       ImpulseTargetingPreset;                            // 0x0558(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DestroyBuildings;                                  // 0x0560(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DestroyOnlyTargetPlayerBuilds;                     // 0x0598(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  DestructionActorTags;                              // 0x05D0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  DestructionIgnoredActorTags;                       // 0x05F0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FTargetingRequestHandle                DestructionAsyncTargetingHandle;                   // 0x0610(0x0004)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FTargetingRequestHandle                ImpulseAsyncTargetingHandle;                       // 0x0614(0x0004)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_618[0x8];                                      // 0x0618(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSoundIndicatorComponent*           OnboardSoundIndicatorComponent;                    // 0x0620(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAudioShapeLineListComponent*           OnboardAudioShapeLineList;                         // 0x0628(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                             TrainMoveSoundCue;                                 // 0x0630(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundControlBus*                       PlayerOnboardControlBus;                           // 0x0638(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void EnableAudioProcessingForLocalPlayerOnboard(const float TimeIntervalToUpdate, class UFortSoundIndicatorComponent* SoundIndicatorComponent, class UAudioShapeLineListComponent* AudioShapeLineList, const float ControlBusFadeTime);
	void HandleMovementBaseChanged(class UPrimitiveComponent* NewBaseComponent, const class FName BoneName);
	void HandlePossessedPawnChanged(class APawn* OldPawn, class APawn* NewPawn);
	void OnActorTargetedForImpulse(class AActor* Actor);
	void OnPawnBasedOnTrainCar(class AFortPawn* Pawn);
	void OnPawnDebasedTrainCar(class AFortPawn* Pawn, class AActor* NewBase);

	int32 GetCarIndex() const;
	class UFortTrainManager* GetTrainManager() const;
	struct FTransform GetTransformAtServerTime(float ServerTime) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TrainCar">();
	}
	static class ATrainCar* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrainCar>();
	}
};

// Class TrainRuntime.TrainConfig
// 0x0088 (0x00D0 - 0x0048)
class UTrainConfig final : public UPrimaryDataAsset
{
public:
	TSubclassOf<class UFortTrainManager>          TrainManagerClass;                                 // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class ATrainCar>>          Cars;                                              // 0x0050(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MoveSpeed;                                         // 0x0060(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         DefaultConnectorLength;                            // 0x0098(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TrainConfig">();
	}
	static class UTrainConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrainConfig>();
	}
};

// Class TrainRuntime.FortTrainManager
// 0x0190 (0x02D0 - 0x0140)
class UFortTrainManager final : public UMovementComponent
{
public:
	uint8                                         Pad_140[0x10];                                     // 0x0140(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bProceduralCarOrder;                               // 0x0150(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CarTable;                                          // 0x0158(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FDataTableRowHandle>            CarOrder;                                          // 0x0160(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         DefaultConnectorLength;                            // 0x0170(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BaseMoveSpeed;                                     // 0x0174(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         TruckLocationTolerance;                            // 0x0178(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxIterations;                                     // 0x01B0(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxErrorOffset;                                    // 0x01E8(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ErrorCatchupSpeedModifier;                         // 0x0220(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class AFortTrainRail*                         Rail;                                              // 0x0258(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FTrainCarRuntimeData>           Cars;                                              // 0x0260(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_270[0x10];                                     // 0x0270(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTrainMovementData                     ReplicatedMovementData;                            // 0x0280(0x0010)(Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_290[0x20];                                     // 0x0290(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioShapeLineListComponent*           CachedAudioShapeLineList;                          // 0x02B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B8[0x18];                                     // 0x02B8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void MoveAlongRail(float DeltaDistance, bool bUpdateReplicatedMovementData);
	void MoveToPositionOnRail(float RailDistance, bool bUpdateReplicatedMovementData);
	void MoveToPositionOnRailAtCurrentServerTime(bool bUpdateReplicatedMovementData);
	void MoveToTimeAlongRail(float Time, bool bUpdateReplicatedMovementData);
	void OnRep_Rail();
	void OnRep_ReplicatedMovementData();
	void PlaceOnRails();

	struct FVector GetWorldLocationAtServerTime(float ServerTime) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTrainManager">();
	}
	static class UFortTrainManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTrainManager>();
	}
};

// Class TrainRuntime.FortTrainStationComponent
// 0x00F0 (0x0360 - 0x0270)
class UFortTrainStationComponent final : public USceneComponent
{
public:
	struct FGameplayTag                           IdentifierTag;                                     // 0x0270(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         EnterLength;                                       // 0x0280(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         CoastLength;                                       // 0x02B8(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         ExitLength;                                        // 0x02F0(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         SpeedMultiplier;                                   // 0x0328(0x0038)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTrainStationComponent">();
	}
	static class UFortTrainStationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTrainStationComponent>();
	}
};

// Class TrainRuntime.FortTrainRail
// 0x0068 (0x0488 - 0x0420)
class AFortTrainRail final : public AActor
{
public:
	TSoftObjectPtr<class ALandscapeSplineActor>   LandscapeSplineActor;                              // 0x0420(0x0030)(Edit, DisableEditOnTemplate, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bMinimizeSplineComponent;                          // 0x0450(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxTangentDifference;                              // 0x0454(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USplineComponent*                       SplineComponent;                                   // 0x0458(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_460[0x28];                                     // 0x0460(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GenerateSpline() const;
	float GetTimeFromNextTrainArrival(const struct FGameplayTag& StationIdentifierTag) const;
	void ValidateSpline() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTrainRail">();
	}
	static class AFortTrainRail* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortTrainRail>();
	}
};

// Class TrainRuntime.FortTrainMovingPlatformComponent
// 0x0048 (0x02B8 - 0x0270)
class UFortTrainMovingPlatformComponent final : public UFortMovingPlatformComponent
{
public:
	class UCurveVector*                           PickupPushCurve;                                   // 0x0270(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         PickupTeleportDistance;                            // 0x0278(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B0[0x8];                                      // 0x02B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFortTrainManager* FindOrGetTrainManager() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTrainMovingPlatformComponent">();
	}
	static class UFortTrainMovingPlatformComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTrainMovingPlatformComponent>();
	}
};

}

