#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TranslationEditor

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "TranslationEditor_structs.hpp"


namespace SDK
{

// Class TranslationEditor.TranslationPickerSettings
// 0x0008 (0x0038 - 0x0030)
class UTranslationPickerSettings final : public UObject
{
public:
	bool                                          bSubmitTranslationPickerChangesToLocalizationService; // 0x0030(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TranslationPickerSettings">();
	}
	static class UTranslationPickerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTranslationPickerSettings>();
	}
};

// Class TranslationEditor.TranslationUnit
// 0x00A0 (0x00D0 - 0x0030)
class UTranslationUnit final : public UObject
{
public:
	class FString                                 Namespace;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Source;                                            // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Translation;                                       // 0x0060(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTranslationContextInfo>        Contexts;                                          // 0x0070(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	bool                                          HasBeenReviewed;                                   // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TranslationBeforeImport;                           // 0x0088(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LocresPath;                                        // 0x0098(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x28];                                      // 0x00A8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TranslationUnit">();
	}
	static class UTranslationUnit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTranslationUnit>();
	}
};

}

