#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: trick_tile_device

#include "Basic.hpp"

#include "VerseDevices_structs.hpp"
#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"
#include "trick_tile_device_structs.hpp"
#include "VerseNative_0_classes.hpp"


namespace SDK
{

// VerseClass trick_tile_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class trick_tile_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass trick_tile_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class trick_tile_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<trick_tile_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass trick_tile_device.task_trick_tile_device$MoveTo_L_Ntransform_M_Nfloat_R
// 0x0188 (0x0250 - 0x00C8)
class Utask_trick_tile_device_MoveTo_L_Ntransform_M_Nfloat_R final : public UConcurrency_task
{
public:
	class Utrick_tile_device*                     _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_Ltransform_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0070)(Parm, NoDestructor, HasGetValueTypeHash)
	EDevices_move_to_result                       _RetVal;                                           // 0x0140(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_0;                                      // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_Ltransform_Mfloat_R _ExprResult_1;                                     // 0x0150(0x0070)(NoDestructor, HasGetValueTypeHash)
	int64                                         _AsyncResult_2;                                    // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_3;                                      // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_Ltransform_Mfloat_R _ExprResult_4;                                     // 0x01D0(0x0070)(NoDestructor, HasGetValueTypeHash)
	int64                                         _AsyncResult_5;                                    // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_trick_tile_device$MoveTo_L_Ntransform_M_Nfloat_R">();
	}
	static class Utask_trick_tile_device_MoveTo_L_Ntransform_M_Nfloat_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_trick_tile_device_MoveTo_L_Ntransform_M_Nfloat_R>();
	}
};

// VerseClass trick_tile_device.task_trick_tile_device$MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R
// 0x0128 (0x01F0 - 0x00C8)
class Utask_trick_tile_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R final : public UConcurrency_task
{
public:
	class Utrick_tile_device*                     _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_Lvector3_Mrotation_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0050)(Parm, NoDestructor, HasGetValueTypeHash)
	EDevices_move_to_result                       _RetVal;                                           // 0x0120(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_0;                                      // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_Lvector3_Mrotation_Mfloat_R _ExprResult_1;                                     // 0x0130(0x0050)(NoDestructor, HasGetValueTypeHash)
	int64                                         _AsyncResult_2;                                    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_3;                                      // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_Lvector3_Mrotation_Mfloat_R _ExprResult_4;                                     // 0x0190(0x0050)(NoDestructor, HasGetValueTypeHash)
	int64                                         _AsyncResult_5;                                    // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_trick_tile_device$MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R">();
	}
	static class Utask_trick_tile_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_trick_tile_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R>();
	}
};

// VerseClass trick_tile_device.trick_tile_device
// 0x0050 (0x0110 - 0x00C0)
class Utrick_tile_device final : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0xC313E746_ActivatedEvent;                 // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xA223B8A0_TriggeredEvent;                 // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x5BDC7A5C_EnableFunction;                 // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC9184E23_DisableFunction;                // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x4D1E6968_ResetFunction;                  // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x0F1E42FE_EnableAgentContactTriggerFunction; // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x08B6A78F_DisableAgentContactTriggerFunction; // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x63D8F1DF_ToggleEnabledFunction;          // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x116F8A50_ToggleAgentContactTriggerFunction; // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC873D696_TriggerFunction;                // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Nvector3_M_Nrotation_R(const struct trick_tile_device::Ftuple_Lvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_RDisable(const struct trick_tile_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_RDisableAgentContactTrigger(const struct trick_tile_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_REnable(const struct trick_tile_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_REnableAgentContactTrigger(const struct trick_tile_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_RReset(const struct trick_tile_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_RToggleAgentContactTrigger(const struct trick_tile_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_RToggleEnabled(const struct trick_tile_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_RTrigger(const struct trick_tile_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* MoveTo_L_Ntransform_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct trick_tile_device::Ftuple_Ltransform_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct trick_tile_device::Ftuple_Lvector3_Mrotation_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"trick_tile_device">();
	}
	static class Utrick_tile_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utrick_tile_device>();
	}
};

}

