#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: trick_tile_device

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK
{

// VerseStruct trick_tile_device.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct trick_tile_device::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct trick_tile_device.tuple_Ltransform_Mfloat_R
// 0x0070 (0x0070 - 0x0000)
struct trick_tile_device::Ftuple_Ltransform_Mfloat_R final
{
public:
	struct FSpatialMath_transform                 __verse_0x18E3F084_Elem0;                          // 0x0000(0x0060)(InstancedReference, NoDestructor)
	double                                        __verse_0x7D844C3C_Elem1;                          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct trick_tile_device.tuple_Lvector3_Mrotation_Mfloat_R
// 0x0050 (0x0050 - 0x0000)
struct trick_tile_device::Ftuple_Lvector3_Mrotation_Mfloat_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0x18E3F084_Elem0;                          // 0x0000(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         __verse_0x7D844C3C_Elem1;                          // 0x0020(0x0020)(InstancedReference, NoDestructor)
	double                                        __verse_0x932BF92E_Elem2;                          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct trick_tile_device.tuple_Lvector3_Mrotation_R
// 0x0040 (0x0040 - 0x0000)
struct trick_tile_device::Ftuple_Lvector3_Mrotation_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0x18E3F084_Elem0;                          // 0x0000(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         __verse_0x7D844C3C_Elem1;                          // 0x0020(0x0020)(InstancedReference, NoDestructor)
};

}

