#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: trick_tile_device

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "trick_tile_device_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"


namespace SDK::Params
{

// Function trick_tile_device.task_trick_tile_device$MoveTo_L_Ntransform_M_Nfloat_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_trick_tile_device_MoveTo_L_Ntransform_M_Nfloat_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function trick_tile_device.task_trick_tile_device$MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_trick_tile_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function trick_tile_device.trick_tile_device.$InitCDO
// 0x03C0 (0x03C0 - 0x0000)
struct trick_tile_device__InitCDO final
{
public:
	class UDevices_device_event_agent*            _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_2;                            // 0x0010(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0020(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_agent*            _ExprResult_4;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_6;                            // 0x0040(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_8;                                     // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_9;                                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_10;                           // 0x0070(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x0080(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_12;                                    // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_13;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_14;                           // 0x00A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x00B0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_16;                                    // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_17;                               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_18;                           // 0x00D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_19;                                    // 0x00E0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_20;                                    // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_21;                               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_22;                           // 0x0100(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_23;                                    // 0x0110(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_24;                                    // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_25;                               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_26;                           // 0x0130(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_27;                                    // 0x0140(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_28;                                    // 0x0150(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_29;                               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_30;                           // 0x0160(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_31;                                    // 0x0170(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_32;                                    // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_33;                               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_34;                           // 0x0190(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_35;                                    // 0x01A0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_36;                                    // 0x01B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_37;                               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_38;                           // 0x01C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_39;                                    // 0x01D0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_agent*            _ExprResult_40;                                    // 0x01E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_41;                               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_42;                           // 0x01F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_43;                                    // 0x0200(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_agent*            _ExprResult_44;                                    // 0x0210(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_45;                               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_46;                           // 0x0220(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_47;                                    // 0x0230(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_48;                                    // 0x0240(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_49;                               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_50;                           // 0x0250(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_51;                                    // 0x0260(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_52;                                    // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_53;                               // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_54;                           // 0x0280(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_55;                                    // 0x0290(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_56;                                    // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_57;                               // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_58;                           // 0x02B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_59;                                    // 0x02C0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_60;                                    // 0x02D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_61;                               // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_62;                           // 0x02E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_63;                                    // 0x02F0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_64;                                    // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_65;                               // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_66;                           // 0x0310(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_67;                                    // 0x0320(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_68;                                    // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_69;                               // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_70;                           // 0x0340(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_71;                                    // 0x0350(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_72;                                    // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_73;                               // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_74;                           // 0x0370(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_75;                                    // 0x0380(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_76;                                    // 0x0390(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_77;                               // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_78;                           // 0x03A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_79;                                    // 0x03B0(0x0010)(HasGetValueTypeHash)
};

// Function trick_tile_device.trick_tile_device._L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Ntransform_R
// 0x0070 (0x0070 - 0x0000)
struct trick_tile_device__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Ntransform_R final
{
public:
	struct FSpatialMath_transform                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0060)(Parm, NoDestructor)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0060(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_0;                                // 0x0062(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_1;                                // 0x0064(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function trick_tile_device.trick_tile_device._L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Nvector3_M_Nrotation_R
// 0x00E0 (0x00E0 - 0x0000)
struct trick_tile_device__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Nvector3_M_Nrotation_R final
{
public:
	struct trick_tile_device::Ftuple_Lvector3_Mrotation_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0040)(Parm, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0040(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_0;                                // 0x0042(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct trick_tile_device::Ftuple_Lvector3_Mrotation_R _ExprResult_1;                                     // 0x0050(0x0040)(NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_2;                                // 0x0090(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0xE];                                       // 0x0092(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct trick_tile_device::Ftuple_Lvector3_Mrotation_R _ExprResult_3;                                     // 0x00A0(0x0040)(NoDestructor, HasGetValueTypeHash)
};

// Function trick_tile_device.trick_tile_device._L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_RDisable
// 0x0068 (0x0068 - 0x0000)
struct trick_tile_device__L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_RDisable final
{
public:
	struct trick_tile_device::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_L_R          _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_L_R          _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function trick_tile_device.trick_tile_device._L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_RDisableAgentContactTrigger
// 0x0068 (0x0068 - 0x0000)
struct trick_tile_device__L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_RDisableAgentContactTrigger final
{
public:
	struct trick_tile_device::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_L_R          _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_L_R          _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function trick_tile_device.trick_tile_device._L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_REnable
// 0x0068 (0x0068 - 0x0000)
struct trick_tile_device__L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_REnable final
{
public:
	struct trick_tile_device::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_L_R          _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_L_R          _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function trick_tile_device.trick_tile_device._L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_REnableAgentContactTrigger
// 0x0068 (0x0068 - 0x0000)
struct trick_tile_device__L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_REnableAgentContactTrigger final
{
public:
	struct trick_tile_device::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_L_R          _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_L_R          _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function trick_tile_device.trick_tile_device._L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_RReset
// 0x0068 (0x0068 - 0x0000)
struct trick_tile_device__L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_RReset final
{
public:
	struct trick_tile_device::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_L_R          _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_L_R          _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function trick_tile_device.trick_tile_device._L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_RToggleAgentContactTrigger
// 0x0068 (0x0068 - 0x0000)
struct trick_tile_device__L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_RToggleAgentContactTrigger final
{
public:
	struct trick_tile_device::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_L_R          _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_L_R          _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function trick_tile_device.trick_tile_device._L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_RToggleEnabled
// 0x0068 (0x0068 - 0x0000)
struct trick_tile_device__L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_RToggleEnabled final
{
public:
	struct trick_tile_device::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_L_R          _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_L_R          _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function trick_tile_device.trick_tile_device._L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_RTrigger
// 0x0068 (0x0068 - 0x0000)
struct trick_tile_device__L_2fFortnite_2ecom_2fDevices_2ftrick__tile__device_N_RTrigger final
{
public:
	struct trick_tile_device::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_L_R          _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct trick_tile_device::Ftuple_L_R          _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function trick_tile_device.trick_tile_device.MoveTo_L_Ntransform_M_Nfloat_R
// 0x00A0 (0x00A0 - 0x0000)
struct trick_tile_device_MoveTo_L_Ntransform_M_Nfloat_R final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct trick_tile_device::Ftuple_Ltransform_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0020(0x0070)(Parm, NoDestructor, HasGetValueTypeHash)
	class UConcurrency_task*                      RetVal;                                            // 0x0090(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function trick_tile_device.trick_tile_device.MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R
// 0x0080 (0x0080 - 0x0000)
struct trick_tile_device_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct trick_tile_device::Ftuple_Lvector3_Mrotation_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0020(0x0050)(Parm, NoDestructor, HasGetValueTypeHash)
	class UConcurrency_task*                      RetVal;                                            // 0x0070(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

}

