#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: trigger_base_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass trigger_base_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class trigger_base_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass trigger_base_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class trigger_base_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<trigger_base_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass trigger_base_device.trigger_base_device
// 0x0050 (0x0110 - 0x00C0)
class Utrigger_base_device : public UDevices_creative_device_base
{
public:
	class UDevices_device_function*               __verse_0x5BDC7A5C_EnableFunction;                 // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC9184E23_DisableFunction;                // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x4D1E6968_ResetFunction;                  // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_int*       __verse_0x82355D28_SetMaxTriggerCountFunction;     // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_int*       __verse_0xE6384AD1_GetMaxTriggerCountFunction;     // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_int*       __verse_0x0C270D17_GetTriggerCountRemainingFunction; // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_float*     __verse_0x9ED87B15_SetResetDelayFunction;          // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_float*     __verse_0xD4426906_GetResetDelayFunction;          // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_float*     __verse_0x2C1EB985_SetTransmitDelayFunction;       // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_float*     __verse_0x0CC743D2_GetTransmitDelayFunction;       // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2ftrigger__base__device_N_RDisable(const struct trigger_base_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftrigger__base__device_N_REnable(const struct trigger_base_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fDevices_2ftrigger__base__device_N_RGetMaxTriggerCount(const struct trigger_base_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fDevices_2ftrigger__base__device_N_RGetResetDelay(const struct trigger_base_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fDevices_2ftrigger__base__device_N_RGetTransmitDelay(const struct trigger_base_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	int64 _L_2fFortnite_2ecom_2fDevices_2ftrigger__base__device_N_RGetTriggerCountRemaining(const struct trigger_base_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftrigger__base__device_N_RReset(const struct trigger_base_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftrigger__base__device_N_RSetMaxTriggerCount_L_Nint_R(int64 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftrigger__base__device_N_RSetResetDelay_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2ftrigger__base__device_N_RSetTransmitDelay_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"trigger_base_device">();
	}
	static class Utrigger_base_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utrigger_base_device>();
	}
};

}

