#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TypedElementsDataStorageAssetData

#include "Basic.hpp"

#include "TypedElementFramework_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct TypedElementsDataStorageAssetData.AssetTag
// 0x0000 (0x0001 - 0x0001)
struct FAssetTag final : public FTypedElementDataStorageTag
{
};

// ScriptStruct TypedElementsDataStorageAssetData.AssetPathColumn_Experimental
// 0x000C (0x000C - 0x0000)
struct FAssetPathColumn_Experimental final : public FTypedElementDataStorageColumn
{
public:
	class FName                                   Path;                                              // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementsDataStorageAssetData.ParentAssetPathColumn_Experimental
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FParentAssetPathColumn_Experimental final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementsDataStorageAssetData.ChildrenAssetPathColumn_Experimental
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FChildrenAssetPathColumn_Experimental final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementsDataStorageAssetData.AssetsInPathColumn_Experimental
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FAssetsInPathColumn_Experimental final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementsDataStorageAssetData.AssetDataColumn_Experimental
// 0x0098 (0x0098 - 0x0000)
struct FAssetDataColumn_Experimental final : public FTypedElementDataStorageColumn
{
public:
	struct FAssetData                             AssetData;                                         // 0x0000(0x0098)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementsDataStorageAssetData.UnresolvedParentAssetPathColumn_Experimental
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FUnresolvedParentAssetPathColumn_Experimental final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementsDataStorageAssetData.UnresolvedAssetsInPathColumn_Experimental
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FUnresolvedAssetsInPathColumn_Experimental final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TypedElementsDataStorageAssetData.PrivateAssetTag
// 0x0000 (0x0001 - 0x0001)
struct FPrivateAssetTag final : public FTypedElementDataStorageTag
{
};

// ScriptStruct TypedElementsDataStorageAssetData.PublicAssetTag
// 0x0000 (0x0001 - 0x0001)
struct FPublicAssetTag final : public FTypedElementDataStorageTag
{
};

// ScriptStruct TypedElementsDataStorageAssetData.DiskSizeColumn
// 0x0008 (0x0008 - 0x0000)
struct FDiskSizeColumn final : public FTypedElementDataStorageColumn
{
public:
	int64                                         DiskSize;                                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TypedElementsDataStorageAssetData.VersePathColumn
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FVersePathColumn final : public FTypedElementDataStorageColumn
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

