#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TypedElementsDataStorage

#include "Basic.hpp"

#include "TypedElementsDataStorage_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "TypedElementFramework_classes.hpp"
#include "MassEntity_structs.hpp"
#include "MassEntity_classes.hpp"
#include "EditorSubsystem_classes.hpp"


namespace SDK
{

// Class TypedElementsDataStorage.EditorDataStorageSettings
// 0x0058 (0x0088 - 0x0030)
class UEditorDataStorageSettings final : public UObject
{
public:
	EChunkMemorySize                              ChunkMemorySize;                                   // 0x0030(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, EChunkMemorySize>           TableSpecificChunkMemorySize;                      // 0x0038(0x0050)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorDataStorageSettings">();
	}
	static class UEditorDataStorageSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorDataStorageSettings>();
	}
};

// Class TypedElementsDataStorage.TEDSTypedElementActorHandleFactory
// 0x0018 (0x0048 - 0x0030)
class UTEDSTypedElementActorHandleFactory final : public UTypedElementDataStorageFactory
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TEDSTypedElementActorHandleFactory">();
	}
	static class UTEDSTypedElementActorHandleFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTEDSTypedElementActorHandleFactory>();
	}
};

// Class TypedElementsDataStorage.TEDSTypedElementBridge
// 0x0010 (0x0040 - 0x0030)
class UTEDSTypedElementBridge final : public UTypedElementDataStorageFactory
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TEDSTypedElementBridge">();
	}
	static class UTEDSTypedElementBridge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTEDSTypedElementBridge>();
	}
};

// Class TypedElementsDataStorage.TypedElementActorLabelFactory
// 0x0000 (0x0030 - 0x0030)
class UTypedElementActorLabelFactory final : public UTypedElementDataStorageFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementActorLabelFactory">();
	}
	static class UTypedElementActorLabelFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementActorLabelFactory>();
	}
};

// Class TypedElementsDataStorage.TypedElementActorParentFactory
// 0x0000 (0x0030 - 0x0030)
class UTypedElementActorParentFactory final : public UTypedElementDataStorageFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementActorParentFactory">();
	}
	static class UTypedElementActorParentFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementActorParentFactory>();
	}
};

// Class TypedElementsDataStorage.TypedElementActorTransformFactory
// 0x0000 (0x0030 - 0x0030)
class UTypedElementActorTransformFactory final : public UTypedElementDataStorageFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementActorTransformFactory">();
	}
	static class UTypedElementActorTransformFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementActorTransformFactory>();
	}
};

// Class TypedElementsDataStorage.TypedElementActorViewportFactory
// 0x0000 (0x0030 - 0x0030)
class UTypedElementActorViewportFactory final : public UTypedElementDataStorageFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementActorViewportFactory">();
	}
	static class UTypedElementActorViewportFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementActorViewportFactory>();
	}
};

// Class TypedElementsDataStorage.TypedElementAlertQueriesFactory
// 0x0010 (0x0040 - 0x0030)
class UTypedElementAlertQueriesFactory final : public UTypedElementDataStorageFactory
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementAlertQueriesFactory">();
	}
	static class UTypedElementAlertQueriesFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementAlertQueriesFactory>();
	}
};

// Class TypedElementsDataStorage.TypedElementDatabase
// 0x00E8 (0x0118 - 0x0030)
class UTypedElementDatabase final : public UObject
{
public:
	uint8                                         Pad_30[0xE8];                                      // 0x0030(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementDatabase">();
	}
	static class UTypedElementDatabase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementDatabase>();
	}
};

// Class TypedElementsDataStorage.TypedElementDatabaseCompatibility
// 0x02B8 (0x02E8 - 0x0030)
class UTypedElementDatabaseCompatibility final : public UObject
{
public:
	uint8                                         Pad_30[0x2B8];                                     // 0x0030(0x02B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementDatabaseCompatibility">();
	}
	static class UTypedElementDatabaseCompatibility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementDatabaseCompatibility>();
	}
};

// Class TypedElementsDataStorage.TypedElementDatabaseUi
// 0x0070 (0x00A0 - 0x0030)
class UTypedElementDatabaseUi final : public UObject
{
public:
	uint8                                         Pad_30[0x70];                                      // 0x0030(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementDatabaseUi">();
	}
	static class UTypedElementDatabaseUi* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementDatabaseUi>();
	}
};

// Class TypedElementsDataStorage.TypedElementHiearchyQueriesFactory
// 0x0000 (0x0030 - 0x0030)
class UTypedElementHiearchyQueriesFactory final : public UTypedElementDataStorageFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementHiearchyQueriesFactory">();
	}
	static class UTypedElementHiearchyQueriesFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementHiearchyQueriesFactory>();
	}
};

// Class TypedElementsDataStorage.TypedElementMementoTranslatorBase
// 0x0000 (0x0030 - 0x0030)
class UTypedElementMementoTranslatorBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementMementoTranslatorBase">();
	}
	static class UTypedElementMementoTranslatorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementMementoTranslatorBase>();
	}
};

// Class TypedElementsDataStorage.TypedElementDefaultMementoTranslator
// 0x0028 (0x0058 - 0x0030)
class UTypedElementDefaultMementoTranslator : public UTypedElementMementoTranslatorBase
{
public:
	class UScriptStruct*                          MementoType;                                       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x20];                                      // 0x0038(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementDefaultMementoTranslator">();
	}
	static class UTypedElementDefaultMementoTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementDefaultMementoTranslator>();
	}
};

// Class TypedElementsDataStorage.TypedElementSelectionColumnMementoTranslator
// 0x0000 (0x0058 - 0x0058)
class UTypedElementSelectionColumnMementoTranslator final : public UTypedElementDefaultMementoTranslator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementSelectionColumnMementoTranslator">();
	}
	static class UTypedElementSelectionColumnMementoTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementSelectionColumnMementoTranslator>();
	}
};

// Class TypedElementsDataStorage.TypedElementRemoveSyncToWorldTagFactory
// 0x0000 (0x0030 - 0x0030)
class UTypedElementRemoveSyncToWorldTagFactory final : public UTypedElementDataStorageFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementRemoveSyncToWorldTagFactory">();
	}
	static class UTypedElementRemoveSyncToWorldTagFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementRemoveSyncToWorldTagFactory>();
	}
};

// Class TypedElementsDataStorage.TypedElementObjectReinstancingManager
// 0x0080 (0x00B0 - 0x0030)
class UTypedElementObjectReinstancingManager final : public UObject
{
public:
	class UTypedElementDatabase*                  Database;                                          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTypedElementDatabaseCompatibility*     DataStorageCompatibility;                          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x70];                                      // 0x0040(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementObjectReinstancingManager">();
	}
	static class UTypedElementObjectReinstancingManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementObjectReinstancingManager>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryProcessorCallbackAdapterProcessorBase
// 0x0340 (0x0410 - 0x00D0)
class UTypedElementQueryProcessorCallbackAdapterProcessorBase : public UMassProcessor
{
public:
	struct FTypedElementQueryProcessorData        Data;                                              // 0x00D0(0x0340)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryProcessorCallbackAdapterProcessorBase">();
	}
	static class UTypedElementQueryProcessorCallbackAdapterProcessorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryProcessorCallbackAdapterProcessorBase>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryProcessorCallbackAdapterProcessor
// 0x0000 (0x0410 - 0x0410)
class UTypedElementQueryProcessorCallbackAdapterProcessor final : public UTypedElementQueryProcessorCallbackAdapterProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryProcessorCallbackAdapterProcessor">();
	}
	static class UTypedElementQueryProcessorCallbackAdapterProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryProcessorCallbackAdapterProcessor>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryProcessorCallbackAdapterProcessorWith1Subquery
// 0x0320 (0x0730 - 0x0410)
class UTypedElementQueryProcessorCallbackAdapterProcessorWith1Subquery final : public UTypedElementQueryProcessorCallbackAdapterProcessorBase
{
public:
	struct FMassEntityQuery                       NativeSubqueries;                                  // 0x0410(0x0320)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryProcessorCallbackAdapterProcessorWith1Subquery">();
	}
	static class UTypedElementQueryProcessorCallbackAdapterProcessorWith1Subquery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryProcessorCallbackAdapterProcessorWith1Subquery>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryProcessorCallbackAdapterProcessorWith2Subqueries
// 0x0640 (0x0A50 - 0x0410)
class UTypedElementQueryProcessorCallbackAdapterProcessorWith2Subqueries final : public UTypedElementQueryProcessorCallbackAdapterProcessorBase
{
public:
	struct FMassEntityQuery                       NativeSubqueries[0x2];                             // 0x0410(0x0320)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryProcessorCallbackAdapterProcessorWith2Subqueries">();
	}
	static class UTypedElementQueryProcessorCallbackAdapterProcessorWith2Subqueries* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryProcessorCallbackAdapterProcessorWith2Subqueries>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryProcessorCallbackAdapterProcessorWith3Subqueries
// 0x0960 (0x0D70 - 0x0410)
class UTypedElementQueryProcessorCallbackAdapterProcessorWith3Subqueries final : public UTypedElementQueryProcessorCallbackAdapterProcessorBase
{
public:
	struct FMassEntityQuery                       NativeSubqueries[0x3];                             // 0x0410(0x0320)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryProcessorCallbackAdapterProcessorWith3Subqueries">();
	}
	static class UTypedElementQueryProcessorCallbackAdapterProcessorWith3Subqueries* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryProcessorCallbackAdapterProcessorWith3Subqueries>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryProcessorCallbackAdapterProcessorWith4Subqueries
// 0x0C80 (0x1090 - 0x0410)
class UTypedElementQueryProcessorCallbackAdapterProcessorWith4Subqueries final : public UTypedElementQueryProcessorCallbackAdapterProcessorBase
{
public:
	struct FMassEntityQuery                       NativeSubqueries[0x4];                             // 0x0410(0x0320)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryProcessorCallbackAdapterProcessorWith4Subqueries">();
	}
	static class UTypedElementQueryProcessorCallbackAdapterProcessorWith4Subqueries* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryProcessorCallbackAdapterProcessorWith4Subqueries>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryProcessorCallbackAdapterProcessorWith5Subqueries
// 0x0FA0 (0x13B0 - 0x0410)
class UTypedElementQueryProcessorCallbackAdapterProcessorWith5Subqueries final : public UTypedElementQueryProcessorCallbackAdapterProcessorBase
{
public:
	struct FMassEntityQuery                       NativeSubqueries[0x5];                             // 0x0410(0x0320)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryProcessorCallbackAdapterProcessorWith5Subqueries">();
	}
	static class UTypedElementQueryProcessorCallbackAdapterProcessorWith5Subqueries* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryProcessorCallbackAdapterProcessorWith5Subqueries>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryProcessorCallbackAdapterProcessorWith6Subqueries
// 0x12C0 (0x16D0 - 0x0410)
class UTypedElementQueryProcessorCallbackAdapterProcessorWith6Subqueries final : public UTypedElementQueryProcessorCallbackAdapterProcessorBase
{
public:
	struct FMassEntityQuery                       NativeSubqueries[0x6];                             // 0x0410(0x0320)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryProcessorCallbackAdapterProcessorWith6Subqueries">();
	}
	static class UTypedElementQueryProcessorCallbackAdapterProcessorWith6Subqueries* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryProcessorCallbackAdapterProcessorWith6Subqueries>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryProcessorCallbackAdapterProcessorWith7Subqueries
// 0x15E0 (0x19F0 - 0x0410)
class UTypedElementQueryProcessorCallbackAdapterProcessorWith7Subqueries final : public UTypedElementQueryProcessorCallbackAdapterProcessorBase
{
public:
	struct FMassEntityQuery                       NativeSubqueries[0x7];                             // 0x0410(0x0320)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryProcessorCallbackAdapterProcessorWith7Subqueries">();
	}
	static class UTypedElementQueryProcessorCallbackAdapterProcessorWith7Subqueries* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryProcessorCallbackAdapterProcessorWith7Subqueries>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryProcessorCallbackAdapterProcessorWith8Subqueries
// 0x1900 (0x1D10 - 0x0410)
class UTypedElementQueryProcessorCallbackAdapterProcessorWith8Subqueries final : public UTypedElementQueryProcessorCallbackAdapterProcessorBase
{
public:
	struct FMassEntityQuery                       NativeSubqueries[0x8];                             // 0x0410(0x0320)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryProcessorCallbackAdapterProcessorWith8Subqueries">();
	}
	static class UTypedElementQueryProcessorCallbackAdapterProcessorWith8Subqueries* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryProcessorCallbackAdapterProcessorWith8Subqueries>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryObserverCallbackAdapterProcessorBase
// 0x0348 (0x0430 - 0x00E8)
class UTypedElementQueryObserverCallbackAdapterProcessorBase : public UMassObserverProcessor
{
public:
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTypedElementQueryProcessorData        Data;                                              // 0x00F0(0x0340)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryObserverCallbackAdapterProcessorBase">();
	}
	static class UTypedElementQueryObserverCallbackAdapterProcessorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryObserverCallbackAdapterProcessorBase>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryObserverCallbackAdapterProcessor
// 0x0000 (0x0430 - 0x0430)
class UTypedElementQueryObserverCallbackAdapterProcessor final : public UTypedElementQueryObserverCallbackAdapterProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryObserverCallbackAdapterProcessor">();
	}
	static class UTypedElementQueryObserverCallbackAdapterProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryObserverCallbackAdapterProcessor>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryObserverCallbackAdapterProcessorWith1Subquery
// 0x0320 (0x0750 - 0x0430)
class UTypedElementQueryObserverCallbackAdapterProcessorWith1Subquery final : public UTypedElementQueryObserverCallbackAdapterProcessorBase
{
public:
	struct FMassEntityQuery                       NativeSubqueries;                                  // 0x0430(0x0320)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryObserverCallbackAdapterProcessorWith1Subquery">();
	}
	static class UTypedElementQueryObserverCallbackAdapterProcessorWith1Subquery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryObserverCallbackAdapterProcessorWith1Subquery>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryObserverCallbackAdapterProcessorWith2Subqueries
// 0x0640 (0x0A70 - 0x0430)
class UTypedElementQueryObserverCallbackAdapterProcessorWith2Subqueries final : public UTypedElementQueryObserverCallbackAdapterProcessorBase
{
public:
	struct FMassEntityQuery                       NativeSubqueries[0x2];                             // 0x0430(0x0320)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryObserverCallbackAdapterProcessorWith2Subqueries">();
	}
	static class UTypedElementQueryObserverCallbackAdapterProcessorWith2Subqueries* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryObserverCallbackAdapterProcessorWith2Subqueries>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryObserverCallbackAdapterProcessorWith3Subqueries
// 0x0960 (0x0D90 - 0x0430)
class UTypedElementQueryObserverCallbackAdapterProcessorWith3Subqueries final : public UTypedElementQueryObserverCallbackAdapterProcessorBase
{
public:
	struct FMassEntityQuery                       NativeSubqueries[0x3];                             // 0x0430(0x0320)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryObserverCallbackAdapterProcessorWith3Subqueries">();
	}
	static class UTypedElementQueryObserverCallbackAdapterProcessorWith3Subqueries* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryObserverCallbackAdapterProcessorWith3Subqueries>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryObserverCallbackAdapterProcessorWith4Subqueries
// 0x0C80 (0x10B0 - 0x0430)
class UTypedElementQueryObserverCallbackAdapterProcessorWith4Subqueries final : public UTypedElementQueryObserverCallbackAdapterProcessorBase
{
public:
	struct FMassEntityQuery                       NativeSubqueries[0x4];                             // 0x0430(0x0320)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryObserverCallbackAdapterProcessorWith4Subqueries">();
	}
	static class UTypedElementQueryObserverCallbackAdapterProcessorWith4Subqueries* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryObserverCallbackAdapterProcessorWith4Subqueries>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryObserverCallbackAdapterProcessorWith5Subqueries
// 0x0FA0 (0x13D0 - 0x0430)
class UTypedElementQueryObserverCallbackAdapterProcessorWith5Subqueries final : public UTypedElementQueryObserverCallbackAdapterProcessorBase
{
public:
	struct FMassEntityQuery                       NativeSubqueries[0x5];                             // 0x0430(0x0320)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryObserverCallbackAdapterProcessorWith5Subqueries">();
	}
	static class UTypedElementQueryObserverCallbackAdapterProcessorWith5Subqueries* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryObserverCallbackAdapterProcessorWith5Subqueries>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryObserverCallbackAdapterProcessorWith6Subqueries
// 0x12C0 (0x16F0 - 0x0430)
class UTypedElementQueryObserverCallbackAdapterProcessorWith6Subqueries final : public UTypedElementQueryObserverCallbackAdapterProcessorBase
{
public:
	struct FMassEntityQuery                       NativeSubqueries[0x6];                             // 0x0430(0x0320)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryObserverCallbackAdapterProcessorWith6Subqueries">();
	}
	static class UTypedElementQueryObserverCallbackAdapterProcessorWith6Subqueries* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryObserverCallbackAdapterProcessorWith6Subqueries>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryObserverCallbackAdapterProcessorWith7Subqueries
// 0x15E0 (0x1A10 - 0x0430)
class UTypedElementQueryObserverCallbackAdapterProcessorWith7Subqueries final : public UTypedElementQueryObserverCallbackAdapterProcessorBase
{
public:
	struct FMassEntityQuery                       NativeSubqueries[0x7];                             // 0x0430(0x0320)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryObserverCallbackAdapterProcessorWith7Subqueries">();
	}
	static class UTypedElementQueryObserverCallbackAdapterProcessorWith7Subqueries* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryObserverCallbackAdapterProcessorWith7Subqueries>();
	}
};

// Class TypedElementsDataStorage.TypedElementQueryObserverCallbackAdapterProcessorWith8Subqueries
// 0x1900 (0x1D30 - 0x0430)
class UTypedElementQueryObserverCallbackAdapterProcessorWith8Subqueries final : public UTypedElementQueryObserverCallbackAdapterProcessorBase
{
public:
	struct FMassEntityQuery                       NativeSubqueries[0x8];                             // 0x0430(0x0320)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementQueryObserverCallbackAdapterProcessorWith8Subqueries">();
	}
	static class UTypedElementQueryObserverCallbackAdapterProcessorWith8Subqueries* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementQueryObserverCallbackAdapterProcessorWith8Subqueries>();
	}
};

// Class TypedElementsDataStorage.TypedElementSlateWidgetReferenceColumnUpdateFactory
// 0x0000 (0x0030 - 0x0030)
class UTypedElementSlateWidgetReferenceColumnUpdateFactory final : public UTypedElementDataStorageFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementSlateWidgetReferenceColumnUpdateFactory">();
	}
	static class UTypedElementSlateWidgetReferenceColumnUpdateFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementSlateWidgetReferenceColumnUpdateFactory>();
	}
};

// Class TypedElementsDataStorage.TypedElementDataStorageSubsystem
// 0x0008 (0x0040 - 0x0038)
class UTypedElementDataStorageSubsystem final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementDataStorageSubsystem">();
	}
	static class UTypedElementDataStorageSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementDataStorageSubsystem>();
	}
};

// Class TypedElementsDataStorage.TypedElementDataStorageUiSubsystem
// 0x0008 (0x0040 - 0x0038)
class UTypedElementDataStorageUiSubsystem final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementDataStorageUiSubsystem">();
	}
	static class UTypedElementDataStorageUiSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementDataStorageUiSubsystem>();
	}
};

// Class TypedElementsDataStorage.TypedElementDataStorageCompatibilitySubsystem
// 0x0008 (0x0040 - 0x0038)
class UTypedElementDataStorageCompatibilitySubsystem final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementDataStorageCompatibilitySubsystem">();
	}
	static class UTypedElementDataStorageCompatibilitySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementDataStorageCompatibilitySubsystem>();
	}
};

// Class TypedElementsDataStorage.TypedElementUObjectPackagePathFactory
// 0x0008 (0x0038 - 0x0030)
class UTypedElementUObjectPackagePathFactory final : public UTypedElementDataStorageFactory
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementUObjectPackagePathFactory">();
	}
	static class UTypedElementUObjectPackagePathFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementUObjectPackagePathFactory>();
	}
};

// Class TypedElementsDataStorage.TypedElementUObjectWorldFactory
// 0x0000 (0x0030 - 0x0030)
class UTypedElementUObjectWorldFactory final : public UTypedElementDataStorageFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TypedElementUObjectWorldFactory">();
	}
	static class UTypedElementUObjectWorldFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTypedElementUObjectWorldFactory>();
	}
};

}

