#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MovieRenderPipelineInfoTableRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_MovieRenderPipelineInfoTableRow.UI_MovieRenderPipelineInfoTableRow_C
// 0x0038 (0x0450 - 0x0418)
class UUI_MovieRenderPipelineInfoTableRow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             LeftTextBlock;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RightTextBlock;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   LeftColumnText;                                    // 0x0430(0x0010)(Edit, BlueprintVisible)
	class FText                                   RightColumnText;                                   // 0x0440(0x0010)(Edit, BlueprintVisible)

public:
	void Construct();
	void ExecuteUbergraph_UI_MovieRenderPipelineInfoTableRow(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetValueColor(const struct FSlateColor& Color);
	void SetValueText(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_MovieRenderPipelineInfoTableRow_C">();
	}
	static class UUI_MovieRenderPipelineInfoTableRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_MovieRenderPipelineInfoTableRow_C>();
	}
};

}

