#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MovieGraphPipelineScreenOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MovieRenderPipelineCore_structs.hpp"
#include "MovieRenderPipelineCore_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_MovieGraphPipelineScreenOverlay.UI_MovieGraphPipelineScreenOverlay_C
// 0x0090 (0x04A8 - 0x0418)
class UUI_MovieGraphPipelineScreenOverlay_C final : public UMovieGraphRenderPreviewWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUI_MovieRenderPipelineInfoTableRow_C*  CurrentSequenceRow;                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MovieRenderPipelineInfoTableRow_C*  ElapsedTimeRow;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MovieRenderPipelineInfoTableRow_C*  EstimatedTimeRemainingRow;                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MovieRenderPipelineInfoTableRow_C*  PipelineStateRow;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      PreviewImageGrid;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MovieRenderPipelineInfoTableRow_C*  ShotEngineWarmUpFramesRow;                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MovieRenderPipelineInfoTableRow_C*  ShotFrameCountRow;                                 // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MovieRenderPipelineInfoTableRow_C*  ShotHandleFramesRow;                               // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MovieRenderPipelineInfoTableRow_C*  ShotNameRow;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MovieRenderPipelineInfoTableRow_C*  ShotStateRow;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MovieRenderPipelineInfoTableRow_C*  ShotSubFrameRow;                                   // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MovieRenderPipelineInfoTableRow_C*  TotalFrameRow;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMovieGraphPipeline*                    Pipeline;                                          // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PreviewMaterialInst;                               // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UUI_MovieGraphImagePreview_C*>   CreatedGridWidgets;                                // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void CreateEnoughGridWidgets(TArray<struct FMovieGraphImagePreviewData>& CurData);
	void ExecuteUbergraph_UI_MovieGraphPipelineScreenOverlay(int32 EntryPoint);
	void GetNumRowAndColumnForGrid(int32 NumPreviews, int32* Rows, int32* Columns);
	ESlateVisibility GetShotEngineWarm_Visibility();
	ESlateVisibility GetShotSampleRow_Visibility();
	void OnInitializedForPipeline(class UMovieGraphPipeline* InPipeline);
	void SetCurrentLocalFrame();
	void SetCurrentShotName();
	void SetElapsedTime();
	void SetEstimatedTime();
	void SetPipelineState_Color();
	void SetPipelineState_Text();
	void SetSequenceName();
	void SetShotState_Color();
	void SetShotState_Text();
	void SetSubSample();
	void SetTotalFrames();
	void SetWarmUpFrames();
	void Should_Reinitialize_Widgets(TArray<struct FMovieGraphImagePreviewData>& CurData, bool* bReinitialize);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateRowWidgetVisibilities();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_MovieGraphPipelineScreenOverlay_C">();
	}
	static class UUI_MovieGraphPipelineScreenOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_MovieGraphPipelineScreenOverlay_C>();
	}
};

}

