#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMGEditor

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Enum UMGEditor.EThumbnailLabelType_BlueprintType
// NumValues: 0x0004
enum class EThumbnailLabelType_BlueprintType : uint8
{
	ClassName                                = 0,
	AssetName                                = 1,
	NoLabel                                  = 2,
	EThumbnailLabelType_MAX                  = 3,
};

// Enum UMGEditor.EThumbnailColorStripOrientation_BlueprintType
// NumValues: 0x0003
enum class EThumbnailColorStripOrientation_BlueprintType : uint8
{
	HorizontalBottomEdge                     = 0,
	VerticalRightEdge                        = 1,
	EThumbnailColorStripOrientation_MAX      = 2,
};

// Enum UMGEditor.ERootSelectionMode
// NumValues: 0x0004
enum class ERootSelectionMode : uint8
{
	Disabled                                 = 0,
	Enabled                                  = 1,
	Self                                     = 2,
	ERootSelectionMode_MAX                   = 3,
};

// Enum UMGEditor.EWidgetSupportsDynamicCreation
// NumValues: 0x0004
enum class EWidgetSupportsDynamicCreation : uint8
{
	Default                                  = 0,
	Yes                                      = 1,
	No                                       = 2,
	EWidgetSupportsDynamicCreation_MAX       = 3,
};

// Enum UMGEditor.EThumbnailPreviewSizeMode
// NumValues: 0x0005
enum class EThumbnailPreviewSizeMode : uint8
{
	MatchDesignerMode                        = 0,
	FillScreen                               = 1,
	Custom                                   = 2,
	Desired                                  = 3,
	EThumbnailPreviewSizeMode_MAX            = 4,
};

// Enum UMGEditor.EWidgetCompileTimeTickPrediction
// NumValues: 0x0004
enum class EWidgetCompileTimeTickPrediction : uint8
{
	WontTick                                 = 0,
	OnDemand                                 = 1,
	WillTick                                 = 2,
	EWidgetCompileTimeTickPrediction_MAX     = 3,
};

// Enum UMGEditor.EDisplayOnCompile
// NumValues: 0x0005
enum class EDisplayOnCompile : uint8
{
	DoC_ErrorsOrWarnings                     = 0,
	DoC_ErrorsOnly                           = 1,
	DoC_WarningsOnly                         = 2,
	DoC_Never                                = 3,
	DoC_MAX                                  = 4,
};

// Enum UMGEditor.EPropertyBindingPermissionLevel
// NumValues: 0x0005
enum class EPropertyBindingPermissionLevel : uint8
{
	Allow                                    = 0,
	Prevent                                  = 1,
	PreventAndWarn                           = 2,
	PreventAndError                          = 3,
	EPropertyBindingPermissionLevel_MAX      = 4,
};

// ScriptStruct UMGEditor.AssetThumbnailWidgetSettings
// 0x0058 (0x0058 - 0x0000)
struct FAssetThumbnailWidgetSettings final
{
public:
	bool                                          bForceGenericThumbnail;                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowHintText;                                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowRealTimeOnHovered;                           // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowAssetSpecificThumbnailOverlay;               // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EThumbnailLabelType_BlueprintType             ThumbnailLabel;                                    // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             HighlightedTextDelegate;                           // 0x0008(0x0014)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           HintColorAndOpacity;                               // 0x001C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideAssetTypeColor;                           // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           AssetTypeColorOverride;                            // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                Padding;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         GenericThumbnailSize;                              // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EThumbnailColorStripOrientation_BlueprintType ColorStripOrientation;                             // 0x0054(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct UMGEditor.NavigationSimulationArguments
// 0x0008 (0x0008 - 0x0000)
struct FNavigationSimulationArguments final
{
public:
	int32                                         UserIndex;                                         // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENavigationGenesis                            NavigationGenesis;                                 // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUINavigation                                 UINavigation;                                      // 0x0005(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideUINavigation;                             // 0x0006(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowPreview;                                      // 0x0007(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UMGEditor.EditorPropertyPathSegment
// 0x0028 (0x0028 - 0x0000)
struct FEditorPropertyPathSegment final
{
public:
	class UStruct*                                Struct;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   MemberName;                                        // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  MemberGuid;                                        // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          IsProperty;                                        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct UMGEditor.EditorPropertyPath
// 0x0010 (0x0010 - 0x0000)
struct FEditorPropertyPath final
{
public:
	TArray<struct FEditorPropertyPathSegment>     Segments;                                          // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct UMGEditor.DelegateEditorBinding
// 0x0060 (0x0060 - 0x0000)
struct FDelegateEditorBinding final
{
public:
	class FString                                 ObjectName;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FunctionName;                                      // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SourceProperty;                                    // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEditorPropertyPath                    SourcePath;                                        // 0x0038(0x0010)(NativeAccessSpecifierPublic)
	struct FGuid                                  MemberGuid;                                        // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBindingKind                                  Kind;                                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct UMGEditor.DebugResolution
// 0x0028 (0x0028 - 0x0000)
struct FDebugResolution final
{
public:
	int32                                         Width;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0018(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UMGEditor.WidgetCompilerOptions
// 0x0018 (0x0018 - 0x0000)
struct FWidgetCompilerOptions final
{
public:
	bool                                          bAllowBlueprintTick;                               // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowBlueprintPaint;                              // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPropertyBindingPermissionLevel               PropertyBindingRule;                               // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           Rules;                                             // 0x0008(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct UMGEditor.DirectoryWidgetCompilerOptions
// 0x0038 (0x0038 - 0x0000)
struct FDirectoryWidgetCompilerOptions final
{
public:
	struct FDirectoryPath                         Directory;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UWidgetBlueprint>> IgnoredWidgets;                                    // 0x0010(0x0010)(Edit, ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FWidgetCompilerOptions                 Options;                                           // 0x0020(0x0018)(Edit, NativeAccessSpecifierPublic)
};

}

