#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMGEditor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UnrealEd_classes.hpp"
#include "BlueprintGraph_classes.hpp"
#include "UMGEditor_structs.hpp"
#include "EditorFramework_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class UMGEditor.AssetDefinition_WidgetBlueprint
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_WidgetBlueprint final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_WidgetBlueprint">();
	}
	static class UAssetDefinition_WidgetBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_WidgetBlueprint>();
	}
};

// Class UMGEditor.AssetDefinition_WidgetBlueprintGeneratedClass
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_WidgetBlueprintGeneratedClass final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_WidgetBlueprintGeneratedClass">();
	}
	static class UAssetDefinition_WidgetBlueprintGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_WidgetBlueprintGeneratedClass>();
	}
};

// Class UMGEditor.K2Node_WidgetAnimationEvent
// 0x0058 (0x01B8 - 0x0160)
class UK2Node_WidgetAnimationEvent final : public UK2Node_Event
{
public:
	EWidgetAnimationEvent                         Action;                                            // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AnimationPropertyName;                             // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UserTag;                                           // 0x0170(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetBlueprint*                       SourceWidgetBlueprint;                             // 0x0180(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_188[0x30];                                     // 0x0188(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_WidgetAnimationEvent">();
	}
	static class UK2Node_WidgetAnimationEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_WidgetAnimationEvent>();
	}
};

// Class UMGEditor.AssetThumbnailWidget
// 0x0118 (0x0368 - 0x0250)
class UAssetThumbnailWidget final : public UWidget
{
public:
	struct FAssetData                             AssetToShow;                                       // 0x0250(0x0098)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FIntPoint                              Resolution;                                        // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAssetThumbnailWidgetSettings          ThumbnailSettings;                                 // 0x02F0(0x0058)(Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_348[0x20];                                     // 0x0348(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAsset(const struct FAssetData& AssetData);
	void SetAssetByObject(class UObject* Object);
	void SetResolution(const struct FIntPoint& InResolution);
	void SetThumbnailSettings(const struct FAssetThumbnailWidgetSettings& InThumbnailSettings);

	struct FIntPoint GetResolution() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetThumbnailWidget">();
	}
	static class UAssetThumbnailWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetThumbnailWidget>();
	}
};

// Class UMGEditor.K2Node_CreateDragDropOperation
// 0x0000 (0x00E8 - 0x00E8)
class UK2Node_CreateDragDropOperation final : public UK2Node_ConstructObjectFromClass
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_CreateDragDropOperation">();
	}
	static class UK2Node_CreateDragDropOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_CreateDragDropOperation>();
	}
};

// Class UMGEditor.K2Node_CreateWidget
// 0x0000 (0x00E8 - 0x00E8)
class UK2Node_CreateWidget final : public UK2Node_ConstructObjectFromClass
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_CreateWidget">();
	}
	static class UK2Node_CreateWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_CreateWidget>();
	}
};

// Class UMGEditor.K2Node_PlayAnimation
// 0x0000 (0x00F0 - 0x00F0)
class UK2Node_PlayAnimation final : public UK2Node_BaseAsyncTask
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_PlayAnimation">();
	}
	static class UK2Node_PlayAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_PlayAnimation>();
	}
};

// Class UMGEditor.K2Node_PlayAnimationTimeRange
// 0x0000 (0x00F0 - 0x00F0)
class UK2Node_PlayAnimationTimeRange final : public UK2Node_BaseAsyncTask
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"K2Node_PlayAnimationTimeRange">();
	}
	static class UK2Node_PlayAnimationTimeRange* GetDefaultObj()
	{
		return GetDefaultObjImpl<UK2Node_PlayAnimationTimeRange>();
	}
};

// Class UMGEditor.SlateVectorArtDataFactory
// 0x0000 (0x0088 - 0x0088)
class USlateVectorArtDataFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SlateVectorArtDataFactory">();
	}
	static class USlateVectorArtDataFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlateVectorArtDataFactory>();
	}
};

// Class UMGEditor.WidgetEditingProjectSettings
// 0x0238 (0x0298 - 0x0060)
class UWidgetEditingProjectSettings : public UDeveloperSettings
{
public:
	struct FWidgetCompilerOptions                 DefaultCompilerOptions;                            // 0x0060(0x0018)(Edit, Config, NativeAccessSpecifierPublic)
	TArray<struct FDirectoryWidgetCompilerOptions> DirectoryCompilerOptions;                          // 0x0078(0x0010)(Edit, ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	bool                                          bShowWidgetsFromEngineContent;                     // 0x0088(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowWidgetsFromDeveloperContent;                  // 0x0089(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CategoriesToHide;                                  // 0x0090(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<struct FSoftClassPath>                 WidgetClassesToHide;                               // 0x00A0(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bUseWidgetTemplateSelector;                        // 0x00B0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           CommonRootWidgetClasses;                           // 0x00B8(0x0010)(Edit, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)
	TSubclassOf<class UPanelWidget>               DefaultRootWidget;                                 // 0x00C8(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseEditorConfigPaletteFiltering;                  // 0x00D0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseUserWidgetParentClassViewerSelector;           // 0x00D1(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseUserWidgetParentDefaultClassViewerSelector;    // 0x00D2(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMakeVariable;                               // 0x00D3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableWidgetAnimationEditor;                      // 0x00D4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnablePaletteWindow;                              // 0x00D5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableLibraryWindow;                              // 0x00D6(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableHierarchyWindow;                            // 0x00D7(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableBindWidgetWindow;                           // 0x00D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableNavigationSimulationWindow;                 // 0x00D9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanCallInitializedWithoutPlayerContext;           // 0x00DA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           FavoriteWidgetParentClasses;                       // 0x00E0(0x0010)(Edit, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FDebugResolution>               DebugResolutions;                                  // 0x00F0(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	int32                                         Version;                                           // 0x0100(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_104[0x194];                                    // 0x0104(0x0194)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetEditingProjectSettings">();
	}
	static class UWidgetEditingProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetEditingProjectSettings>();
	}
};

// Class UMGEditor.UMGEditorProjectSettings
// 0x0000 (0x0298 - 0x0298)
class UUMGEditorProjectSettings final : public UWidgetEditingProjectSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UMGEditorProjectSettings">();
	}
	static class UUMGEditorProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMGEditorProjectSettings>();
	}
};

// Class UMGEditor.WidgetBlueprint
// 0x0068 (0x05D0 - 0x0568)
class UWidgetBlueprint : public UBaseWidgetBlueprint
{
public:
	TArray<struct FDelegateEditorBinding>         Bindings;                                          // 0x0568(0x0010)(ZeroConstructor, EditorOnly, NativeAccessSpecifierPublic)
	TArray<class UWidgetAnimation*>               Animations;                                        // 0x0578(0x0010)(ZeroConstructor, EditorOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	class FString                                 PaletteCategory;                                   // 0x0588(0x0010)(ZeroConstructor, EditorOnly, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanCallInitializedWithoutPlayerContext;           // 0x0598(0x0001)(Edit, ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetTickFrequency                          TickFrequency;                                     // 0x0599(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EWidgetCompileTimeTickPrediction              TickPrediction;                                    // 0x059A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_59B[0x5];                                      // 0x059B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TickPredictionReason;                              // 0x05A0(0x0010)(ZeroConstructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         PropertyBindings;                                  // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EThumbnailPreviewSizeMode                     ThumbnailSizeMode;                                 // 0x05B4(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B5[0x3];                                      // 0x05B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ThumbnailCustomSize;                               // 0x05B8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             ThumbnailImage;                                    // 0x05C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetBlueprint">();
	}
	static class UWidgetBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetBlueprint>();
	}
};

// Class UMGEditor.WidgetBlueprintExtension
// 0x0000 (0x0030 - 0x0030)
class UWidgetBlueprintExtension : public UBlueprintExtension
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetBlueprintExtension">();
	}
	static class UWidgetBlueprintExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetBlueprintExtension>();
	}
};

// Class UMGEditor.WidgetBlueprintFactory
// 0x0018 (0x00A0 - 0x0088)
class UWidgetBlueprintFactory final : public UFactory
{
public:
	EBlueprintType                                BlueprintType;                                     // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidget>                ParentClass;                                       // 0x0090(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    RootWidgetClass;                                   // 0x0098(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetBlueprintFactory">();
	}
	static class UWidgetBlueprintFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetBlueprintFactory>();
	}
};

// Class UMGEditor.WidgetBlueprintThumbnailRenderer
// 0x0008 (0x0040 - 0x0038)
class UWidgetBlueprintThumbnailRenderer final : public UDefaultSizedThumbnailRenderer
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetBlueprintThumbnailRenderer">();
	}
	static class UWidgetBlueprintThumbnailRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetBlueprintThumbnailRenderer>();
	}
};

// Class UMGEditor.WidgetBlueprintToolMenuContext
// 0x0010 (0x0040 - 0x0030)
class UWidgetBlueprintToolMenuContext final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetBlueprintToolMenuContext">();
	}
	static class UWidgetBlueprintToolMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetBlueprintToolMenuContext>();
	}
};

// Class UMGEditor.WidgetCompilerRule
// 0x0000 (0x0030 - 0x0030)
class UWidgetCompilerRule : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetCompilerRule">();
	}
	static class UWidgetCompilerRule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetCompilerRule>();
	}
};

// Class UMGEditor.WidgetDesignerSettings
// 0x0028 (0x0088 - 0x0060)
class UWidgetDesignerSettings final : public UDeveloperSettings
{
public:
	uint8                                         GridSnapEnabled : 1;                               // 0x0060(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GridSnapSize;                                      // 0x0064(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLockToPanelOnDragByDefault;                       // 0x0068(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUintVector2                           DefaultPreviewResolution;                          // 0x006C(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowOutlines;                                     // 0x0074(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExecutePreConstructEvent;                         // 0x0075(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRespectLocks;                                     // 0x0076(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDisplayOnCompile                             CreateOnCompile;                                   // 0x0077(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDisplayOnCompile                             DismissOnCompile;                                  // 0x0078(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetPaletteFavorites*                Favorites;                                         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetDesignerSettings">();
	}
	static class UWidgetDesignerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetDesignerSettings>();
	}
};

// Class UMGEditor.WidgetEditorModeUISubsystem
// 0x0000 (0x0038 - 0x0038)
class UWidgetEditorModeUISubsystem final : public UAssetEditorUISubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetEditorModeUISubsystem">();
	}
	static class UWidgetEditorModeUISubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetEditorModeUISubsystem>();
	}
};

// Class UMGEditor.WidgetGraphSchema
// 0x0000 (0x0040 - 0x0040)
class UWidgetGraphSchema final : public UEdGraphSchema_K2
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetGraphSchema">();
	}
	static class UWidgetGraphSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetGraphSchema>();
	}
};

// Class UMGEditor.WidgetPaletteFavorites
// 0x0028 (0x0058 - 0x0030)
class UWidgetPaletteFavorites final : public UObject
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Favorites;                                         // 0x0048(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetPaletteFavorites">();
	}
	static class UWidgetPaletteFavorites* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetPaletteFavorites>();
	}
};

// Class UMGEditor.WidgetSlotPair
// 0x0030 (0x0060 - 0x0030)
class UWidgetSlotPair final : public UObject
{
public:
	class FName                                   WidgetName;                                        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SlotPropertyNames;                                 // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class FString>                         SlotPropertyValues;                                // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetSlotPair">();
	}
	static class UWidgetSlotPair* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetSlotPair>();
	}
};

}

