#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMGWidgetPreview

#include "Basic.hpp"

#include "UnrealEd_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class UMGWidgetPreview.AssetDefinition_WidgetPreview
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_WidgetPreview final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_WidgetPreview">();
	}
	static class UAssetDefinition_WidgetPreview* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_WidgetPreview>();
	}
};

// Class UMGWidgetPreview.WidgetPreview
// 0x00E0 (0x0110 - 0x0030)
class UWidgetPreview final : public UObject
{
public:
	TSoftClassPtr<class UClass>                   WidgetType;                                        // 0x0030(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   LayoutWidgetType;                                  // 0x0060(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, TSoftClassPtr<class UClass>> SlotWidgets;                                       // 0x0090(0x0050)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UUserWidget*                            WidgetInstance;                                    // 0x00E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FName>                           SlotNameCache;                                     // 0x00E8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x18];                                      // 0x00F8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class FName> GetAvailableLayoutSlotNames();
	const TArray<class FName> GetLayoutSlotNames();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetPreview">();
	}
	static class UWidgetPreview* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetPreview>();
	}
};

// Class UMGWidgetPreview.WidgetPreviewEditor
// 0x0008 (0x0048 - 0x0040)
class UWidgetPreviewEditor final : public UAssetEditor
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetPreviewEditor">();
	}
	static class UWidgetPreviewEditor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetPreviewEditor>();
	}
};

// Class UMGWidgetPreview.WidgetPreviewFactory
// 0x0000 (0x0088 - 0x0088)
class UWidgetPreviewFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetPreviewFactory">();
	}
	static class UWidgetPreviewFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetPreviewFactory>();
	}
};

}

