#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnrealEd

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Enum UnrealEd.ELevelViewportType
// NumValues: 0x000A
enum class ELevelViewportType : uint8
{
	LVT_OrthoXY                              = 0,
	LVT_OrthoXZ                              = 1,
	LVT_OrthoYZ                              = 2,
	LVT_Perspective                          = 3,
	LVT_OrthoFreelook                        = 4,
	LVT_OrthoNegativeXY                      = 5,
	LVT_OrthoNegativeXZ                      = 6,
	LVT_OrthoNegativeYZ                      = 7,
	LVT_MAX                                  = 8,
	LVT_None                                 = 255,
};

// Enum UnrealEd.EClassViewerDeveloperType
// NumValues: 0x0005
enum class EClassViewerDeveloperType : uint8
{
	CVDT_None                                = 0,
	CVDT_CurrentUser                         = 1,
	CVDT_All                                 = 2,
	CVDT_Max                                 = 3,
	CVDT_MAX                                 = 4,
};

// Enum UnrealEd.ECookMode
// NumValues: 0x0006
enum class ECookMode : uint8
{
	CookOnTheFly                             = 0,
	CookOnTheFlyFromTheEditor                = 1,
	CookByTheBookFromTheEditor               = 2,
	CookByTheBook                            = 3,
	CookWorker                               = 4,
	ECookMode_MAX                            = 5,
};

// Enum UnrealEd.ECookTickFlags
// NumValues: 0x0004
enum class ECookTickFlags : uint8
{
	None                                     = 0,
	MarkupInUsePackages                      = 1,
	HideProgressDisplay                      = 2,
	ECookTickFlags_MAX                       = 3,
};

// Enum UnrealEd.ECSVImportType
// NumValues: 0x0006
enum class ECSVImportType : uint8
{
	ECSV_DataTable                           = 0,
	ECSV_CurveTable                          = 1,
	ECSV_CurveFloat                          = 2,
	ECSV_CurveVector                         = 3,
	ECSV_CurveLinearColor                    = 4,
	ECSV_MAX                                 = 5,
};

// Enum UnrealEd.EProcessRootMotionMode
// NumValues: 0x0004
enum class EProcessRootMotionMode : uint8
{
	Ignore                                   = 0,
	Loop                                     = 1,
	LoopAndReset                             = 2,
	EProcessRootMotionMode_MAX               = 3,
};

// Enum UnrealEd.ESkeletonDrawMode
// NumValues: 0x0004
enum class ESkeletonDrawMode : uint8
{
	Default                                  = 0,
	Hidden                                   = 1,
	GreyedOut                                = 2,
	ESkeletonDrawMode_MAX                    = 3,
};

// Enum UnrealEd.ECommentBoxMode
// NumValues: 0x0003
enum class ECommentBoxMode : uint8
{
	GroupMovement                            = 0,
	NoGroupMovement                          = 1,
	ECommentBoxMode_MAX                      = 2,
};

// Enum UnrealEd.EMapSetBrushFlags
// NumValues: 0x0005
enum class EMapSetBrushFlags : uint8
{
	MSB_BrushColor                           = 1,
	MSB_Group                                = 2,
	MSB_PolyFlags                            = 4,
	MSB_BrushType                            = 8,
	MSB_MAX                                  = 9,
};

// Enum UnrealEd.EPasteTo
// NumValues: 0x0004
enum class EPasteTo : uint8
{
	PT_OriginalLocation                      = 0,
	PT_Here                                  = 1,
	PT_WorldOrigin                           = 2,
	PT_MAX                                   = 3,
};

// Enum UnrealEd.ELevelVisibilityDirtyMode
// NumValues: 0x0003
enum class ELevelVisibilityDirtyMode : uint8
{
	ModifyOnChange                           = 0,
	DontModify                               = 1,
	ELevelVisibilityDirtyMode_MAX            = 2,
};

// Enum UnrealEd.ELoadLevelAtStartup
// NumValues: 0x0004
enum class ELoadLevelAtStartup : uint8
{
	None                                     = 0,
	ProjectDefault                           = 1,
	LastOpened                               = 2,
	ELoadLevelAtStartup_MAX                  = 3,
};

// Enum UnrealEd.EAutoSaveMethod
// NumValues: 0x0003
enum class EAutoSaveMethod : uint8
{
	BackupAndRestore                         = 0,
	BackupAndOverwrite                       = 1,
	EAutoSaveMethod_MAX                      = 2,
};

// Enum UnrealEd.ERestoreOpenAssetTabsMethod
// NumValues: 0x0004
enum class ERestoreOpenAssetTabsMethod : uint8
{
	AlwaysPrompt                             = 0,
	AlwaysRestore                            = 1,
	NeverRestore                             = 2,
	ERestoreOpenAssetTabsMethod_MAX          = 3,
};

// Enum UnrealEd.EEditorUserScreenPercentageModeOverride
// NumValues: 0x0005
enum class EEditorUserScreenPercentageModeOverride : uint32
{
	ProjectDefault                           = 0,
	Manual                                   = 1,
	BasedOnDisplayResolution                 = 2,
	BasedOnDPIScale                          = 3,
	EEditorUserScreenPercentageModeOverride_MAX = 4,
};

// Enum UnrealEd.EUnitDisplay
// NumValues: 0x0005
enum class EUnitDisplay : uint8
{
	None                                     = 0,
	Metric                                   = 1,
	Imperial                                 = 2,
	Invalid                                  = 3,
	EUnitDisplay_MAX                         = 4,
};

// Enum UnrealEd.EDefaultLocationUnit
// NumValues: 0x000B
enum class EDefaultLocationUnit : uint8
{
	Micrometers                              = 0,
	Millimeters                              = 1,
	Centimeters                              = 2,
	Meters                                   = 3,
	Kilometers                               = 4,
	Inches                                   = 5,
	Feet                                     = 6,
	Yards                                    = 7,
	Miles                                    = 8,
	Invalid                                  = 9,
	EDefaultLocationUnit_MAX                 = 10,
};

// Enum UnrealEd.EReferenceViewerSettingMode
// NumValues: 0x0004
enum class EReferenceViewerSettingMode : uint8
{
	NoPreference                             = 0,
	ShowByDefault                            = 1,
	HideByDefault                            = 2,
	EReferenceViewerSettingMode_MAX          = 3,
};

// Enum UnrealEd.ELevelEditor2DAxis
// NumValues: 0x0004
enum class ELevelEditor2DAxis : uint8
{
	X                                        = 0,
	Y                                        = 1,
	Z                                        = 2,
	ELevelEditor2DAxis_MAX                   = 3,
};

// Enum UnrealEd.EAssetEditorOpenLocation
// NumValues: 0x0008
enum class EAssetEditorOpenLocation : uint8
{
	Default                                  = 0,
	NewWindow                                = 1,
	MainWindow                               = 2,
	ContentBrowser                           = 3,
	LastDockedWindowOrNewWindow              = 4,
	LastDockedWindowOrMainWindow             = 5,
	LastDockedWindowOrContentBrowser         = 6,
	EAssetEditorOpenLocation_MAX             = 7,
};

// Enum UnrealEd.EFBXAnimationLengthImportType
// NumValues: 0x0004
enum class EFBXAnimationLengthImportType : uint8
{
	FBXALIT_ExportedTime                     = 0,
	FBXALIT_AnimatedKey                      = 1,
	FBXALIT_SetRange                         = 2,
	FBXALIT_MAX                              = 3,
};

// Enum UnrealEd.EFBXExpectedResultPreset
// NumValues: 0x001E
enum class EFBXExpectedResultPreset : uint8
{
	Error_Number                             = 0,
	Warning_Number                           = 1,
	Created_Staticmesh_Number                = 2,
	Created_Skeletalmesh_Number              = 3,
	Materials_Created_Number                 = 4,
	Material_Slot_Imported_Name              = 5,
	Vertex_Number                            = 6,
	Lod_Number                               = 7,
	Vertex_Number_Lod                        = 8,
	Mesh_Materials_Number                    = 9,
	Mesh_LOD_Section_Number                  = 10,
	Mesh_LOD_Section_Vertex_Number           = 11,
	Mesh_LOD_Section_Triangle_Number         = 12,
	Mesh_LOD_Section_Material_Name           = 13,
	Mesh_LOD_Section_Material_Index          = 14,
	Mesh_LOD_Section_Material_Imported_Name  = 15,
	Mesh_LOD_Vertex_Position                 = 16,
	Mesh_LOD_Vertex_Normal                   = 17,
	LOD_UV_Channel_Number                    = 18,
	Bone_Number                              = 19,
	Bone_Position                            = 20,
	Animation_Frame_Number                   = 21,
	Animation_Length                         = 22,
	Animation_CustomCurve_KeyValue           = 23,
	Animation_CustomCurve_KeyArriveTangent   = 24,
	Animation_CustomCurve_KeyLeaveTangent    = 25,
	Skin_By_Bone_Vertex_Number               = 26,
	Animation_CustomCurve_KeyArriveTangentWeight = 27,
	Animation_CustomCurve_KeyLeaveTangentWeight = 28,
	EFBXExpectedResultPreset_MAX             = 29,
};

// Enum UnrealEd.EFBXTestPlanActionType
// NumValues: 0x0007
enum class EFBXTestPlanActionType : uint8
{
	Import                                   = 0,
	Reimport                                 = 1,
	AddLOD                                   = 2,
	ReimportLOD                              = 3,
	ImportReload                             = 4,
	AddAlternateSkinnig                      = 5,
	EFBXTestPlanActionType_MAX               = 6,
};

// Enum UnrealEd.EFbxExportCompatibility
// NumValues: 0x0009
enum class EFbxExportCompatibility : uint8
{
	FBX_2011                                 = 0,
	FBX_2012                                 = 1,
	FBX_2013                                 = 2,
	FBX_2014                                 = 3,
	FBX_2016                                 = 4,
	FBX_2018                                 = 5,
	FBX_2019                                 = 6,
	FBX_2020                                 = 7,
	FBX_MAX                                  = 8,
};

// Enum UnrealEd.EMovieSceneBakeType
// NumValues: 0x0005
enum class EMovieSceneBakeType : uint8
{
	None                                     = 0,
	BakeChannels                             = 1,
	BakeTransforms                           = 2,
	BakeAll                                  = 3,
	EMovieSceneBakeType_MAX                  = 4,
};

// Enum UnrealEd.EFbxMaterialBakeMode
// NumValues: 0x0004
enum class EFbxMaterialBakeMode : uint8
{
	Disabled                                 = 0,
	Simple                                   = 1,
	UseMeshData                              = 2,
	EFbxMaterialBakeMode_MAX                 = 3,
};

// Enum UnrealEd.EFBXImportType
// NumValues: 0x0004
enum class EFBXImportType : uint8
{
	FBXIT_StaticMesh                         = 0,
	FBXIT_SkeletalMesh                       = 1,
	FBXIT_Animation                          = 2,
	FBXIT_MAX                                = 3,
};

// Enum UnrealEd.EFBXNormalImportMethod
// NumValues: 0x0004
enum class EFBXNormalImportMethod : uint8
{
	FBXNIM_ComputeNormals                    = 0,
	FBXNIM_ImportNormals                     = 1,
	FBXNIM_ImportNormalsAndTangents          = 2,
	FBXNIM_MAX                               = 3,
};

// Enum UnrealEd.EFBXNormalGenerationMethod
// NumValues: 0x0003
enum class EFBXNormalGenerationMethod : uint8
{
	BuiltIn                                  = 0,
	MikkTSpace                               = 1,
	EFBXNormalGenerationMethod_MAX           = 2,
};

// Enum UnrealEd.EVertexColorImportOption
// NumValues: 0x0004
enum class EVertexColorImportOption : uint8
{
	Replace                                  = 0,
	Ignore                                   = 1,
	Override                                 = 2,
	EVertexColorImportOption_MAX             = 3,
};

// Enum UnrealEd.EFbxSceneReimportStatusFlags
// NumValues: 0x0007
enum class EFbxSceneReimportStatusFlags : uint8
{
	None                                     = 0,
	Added                                    = 1,
	Removed                                  = 2,
	Same                                     = 4,
	FoundContentBrowserAsset                 = 8,
	ReimportAsset                            = 16,
	EFbxSceneReimportStatusFlags_MAX         = 17,
};

// Enum UnrealEd.EFBXSceneOptionsCreateHierarchyType
// NumValues: 0x0004
enum class EFBXSceneOptionsCreateHierarchyType : uint8
{
	FBXSOCHT_CreateLevelActors               = 0,
	FBXSOCHT_CreateActorComponents           = 1,
	FBXSOCHT_CreateBlueprint                 = 2,
	FBXSOCHT_MAX                             = 3,
};

// Enum UnrealEd.EFbxSceneVertexColorImportOption
// NumValues: 0x0004
enum class EFbxSceneVertexColorImportOption : uint8
{
	Replace                                  = 0,
	Ignore                                   = 1,
	Override                                 = 2,
	EFbxSceneVertexColorImportOption_MAX     = 3,
};

// Enum UnrealEd.EFBXSceneNormalImportMethod
// NumValues: 0x0004
enum class EFBXSceneNormalImportMethod : uint8
{
	FBXSceneNIM_ComputeNormals               = 0,
	FBXSceneNIM_ImportNormals                = 1,
	FBXSceneNIM_ImportNormalsAndTangents     = 2,
	FBXSceneNIM_MAX                          = 3,
};

// Enum UnrealEd.EFBXSceneNormalGenerationMethod
// NumValues: 0x0003
enum class EFBXSceneNormalGenerationMethod : uint8
{
	BuiltIn                                  = 0,
	MikkTSpace                               = 1,
	EFBXSceneNormalGenerationMethod_MAX      = 2,
};

// Enum UnrealEd.EFBXImportContentType
// NumValues: 0x0004
enum class EFBXImportContentType : uint8
{
	FBXICT_All                               = 0,
	FBXICT_Geometry                          = 1,
	FBXICT_SkinningWeights                   = 2,
	FBXICT_MAX                               = 3,
};

// Enum UnrealEd.EPropertyAccessBatchType
// NumValues: 0x0003
enum class EPropertyAccessBatchType : uint8
{
	Unbatched                                = 0,
	Batched                                  = 1,
	EPropertyAccessBatchType_MAX             = 2,
};

// Enum UnrealEd.EBlueprintBreakpointReloadMethod
// NumValues: 0x0004
enum class EBlueprintBreakpointReloadMethod : uint32
{
	RestoreAll                               = 0,
	RestoreAllAndDisable                     = 1,
	DiscardAll                               = 2,
	EBlueprintBreakpointReloadMethod_MAX     = 3,
};

// Enum UnrealEd.NetworkEmulationTarget
// NumValues: 0x0004
enum class ENetworkEmulationTarget : uint32
{
	Server                                   = 0,
	Client                                   = 1,
	Any                                      = 2,
	NetworkEmulationTarget_MAX               = 3,
};

// Enum UnrealEd.ELabelAnchorMode
// NumValues: 0x000A
enum class ELabelAnchorMode : uint8
{
	LabelAnchorMode_TopLeft                  = 0,
	LabelAnchorMode_TopCenter                = 1,
	LabelAnchorMode_TopRight                 = 2,
	LabelAnchorMode_CenterLeft               = 3,
	LabelAnchorMode_Centered                 = 4,
	LabelAnchorMode_CenterRight              = 5,
	LabelAnchorMode_BottomLeft               = 6,
	LabelAnchorMode_BottomCenter             = 7,
	LabelAnchorMode_BottomRight              = 8,
	LabelAnchorMode_MAX                      = 9,
};

// Enum UnrealEd.ELaunchModeType
// NumValues: 0x0002
enum class ELaunchModeType : uint8
{
	LaunchMode_OnDevice                      = 0,
	LaunchMode_MAX                           = 1,
};

// Enum UnrealEd.EPlayModeLocations
// NumValues: 0x0003
enum class EPlayModeLocations : uint8
{
	PlayLocation_CurrentCameraLocation       = 0,
	PlayLocation_DefaultPlayerStart          = 1,
	PlayLocation_MAX                         = 2,
};

// Enum UnrealEd.EPlayModeType
// NumValues: 0x000B
enum class EPlayModeType : uint8
{
	PlayMode_InViewPort                      = 0,
	PlayMode_InEditorFloating                = 1,
	PlayMode_InMobilePreview                 = 2,
	PlayMode_InTargetedMobilePreview         = 3,
	PlayMode_InVulkanPreview                 = 4,
	PlayMode_InNewProcess                    = 5,
	PlayMode_InVR                            = 6,
	PlayMode_Simulate                        = 7,
	PlayMode_QuickLaunch                     = 8,
	PlayMode_Count                           = 9,
	PlayMode_MAX                             = 10,
};

// Enum UnrealEd.EPlayNetMode
// NumValues: 0x0004
enum class EPlayNetMode : uint8
{
	PIE_Standalone                           = 0,
	PIE_ListenServer                         = 1,
	PIE_Client                               = 2,
	PIE_MAX                                  = 3,
};

// Enum UnrealEd.EPlayOnBuildMode
// NumValues: 0x0005
enum class EPlayOnBuildMode : uint8
{
	PlayOnBuild_Always                       = 0,
	PlayOnBuild_Never                        = 1,
	PlayOnBuild_Default                      = 2,
	PlayOnBuild_IfEditorBuiltLocally         = 3,
	PlayOnBuild_MAX                          = 4,
};

// Enum UnrealEd.EPlayOnLaunchConfiguration
// NumValues: 0x0006
enum class EPlayOnLaunchConfiguration : uint8
{
	LaunchConfig_Default                     = 0,
	LaunchConfig_Debug                       = 1,
	LaunchConfig_Development                 = 2,
	LaunchConfig_Test                        = 3,
	LaunchConfig_Shipping                    = 4,
	LaunchConfig_MAX                         = 5,
};

// Enum UnrealEd.EPlayOnPakFileMode
// NumValues: 0x0004
enum class EPlayOnPakFileMode : uint8
{
	NoPak                                    = 0,
	PakNoCompress                            = 1,
	PakCompress                              = 2,
	EPlayOnPakFileMode_MAX                   = 3,
};

// Enum UnrealEd.ERotationGridMode
// NumValues: 0x0003
enum class ERotationGridMode : uint8
{
	GridMode_DivisionsOf360                  = 0,
	GridMode_Common                          = 1,
	GridMode_MAX                             = 2,
};

// Enum UnrealEd.EWASDType
// NumValues: 0x0004
enum class EWASDType : uint8
{
	WASD_Always                              = 0,
	WASD_RMBOnly                             = 1,
	WASD_Never                               = 2,
	WASD_MAX                                 = 3,
};

// Enum UnrealEd.ELandscapeFoliageEditorControlType
// NumValues: 0x0004
enum class ELandscapeFoliageEditorControlType : uint8
{
	IgnoreCtrl                               = 0,
	RequireCtrl                              = 1,
	RequireNoCtrl                            = 2,
	ELandscapeFoliageEditorControlType_MAX   = 3,
};

// Enum UnrealEd.EMeasuringToolUnits
// NumValues: 0x0004
enum class EMeasuringToolUnits : uint8
{
	MeasureUnits_Centimeters                 = 0,
	MeasureUnits_Meters                      = 1,
	MeasureUnits_Kilometers                  = 2,
	MeasureUnits_MAX                         = 3,
};

// Enum UnrealEd.EScrollGestureDirection
// NumValues: 0x0004
enum class EScrollGestureDirection : uint8
{
	UseSystemSetting                         = 0,
	Standard                                 = 1,
	Natural                                  = 2,
	EScrollGestureDirection_MAX              = 3,
};

// Enum UnrealEd.EMaterialKind
// NumValues: 0x0006
enum class EMaterialKind : uint8
{
	Unknown                                  = 0,
	Base                                     = 1,
	Normal                                   = 2,
	Specular                                 = 3,
	Emissive                                 = 4,
	EMaterialKind_MAX                        = 5,
};

// Enum UnrealEd.EMaterialSearchLocation
// NumValues: 0x0006
enum class EMaterialSearchLocation : uint8
{
	Local                                    = 0,
	UnderParent                              = 1,
	UnderRoot                                = 2,
	AllAssets                                = 3,
	DoNotSearch                              = 4,
	EMaterialSearchLocation_MAX              = 5,
};

// Enum UnrealEd.EMaterialStatsDerivedMIOption
// NumValues: 0x0005
enum class EMaterialStatsDerivedMIOption : uint8
{
	Ignore                                   = 0,
	CompileOnly                              = 1,
	ShowStats                                = 2,
	InvalidOrMax                             = 3,
	EMaterialStatsDerivedMIOption_MAX        = 4,
};

// Enum UnrealEd.EReloadPackagesInteractionMode
// NumValues: 0x0004
enum class EReloadPackagesInteractionMode : uint8
{
	Interactive                              = 0,
	AssumePositive                           = 1,
	AssumeNegative                           = 2,
	EReloadPackagesInteractionMode_MAX       = 3,
};

// Enum UnrealEd.EAnimationViewportCameraFollowMode
// NumValues: 0x0005
enum class EAnimationViewportCameraFollowMode : uint8
{
	None                                     = 0,
	Bounds                                   = 1,
	Bone                                     = 2,
	Root                                     = 3,
	EAnimationViewportCameraFollowMode_MAX   = 4,
};

// Enum UnrealEd.EPhysicsAssetEditorCollisionViewMode
// NumValues: 0x0005
enum class EPhysicsAssetEditorCollisionViewMode : uint8
{
	Solid                                    = 0,
	Wireframe                                = 1,
	SolidWireframe                           = 2,
	None                                     = 3,
	EPhysicsAssetEditorCollisionViewMode_MAX = 4,
};

// Enum UnrealEd.EPhysicsAssetEditorCenterOfMassViewMode
// NumValues: 0x0004
enum class EPhysicsAssetEditorCenterOfMassViewMode : uint8
{
	All                                      = 0,
	Selected                                 = 1,
	None                                     = 2,
	EPhysicsAssetEditorCenterOfMassViewMode_MAX = 3,
};

// Enum UnrealEd.EPhysicsAssetEditorMeshViewMode
// NumValues: 0x0004
enum class EPhysicsAssetEditorMeshViewMode : uint8
{
	Solid                                    = 0,
	Wireframe                                = 1,
	None                                     = 2,
	EPhysicsAssetEditorMeshViewMode_MAX      = 3,
};

// Enum UnrealEd.EPhysicsAssetEditorConstraintViewMode
// NumValues: 0x0004
enum class EPhysicsAssetEditorConstraintViewMode : uint8
{
	None                                     = 0,
	AllPositions                             = 1,
	AllLimits                                = 2,
	EPhysicsAssetEditorConstraintViewMode_MAX = 3,
};

// Enum UnrealEd.EPropertyEditorTestEnum
// NumValues: 0x0007
enum class EPropertyEditorTestEnum : uint8
{
	PropertyEditorTest_Enum1                 = 0,
	PropertyEditorTest_Enum2                 = 1,
	PropertyEditorTest_Enum3                 = 2,
	PropertyEditorTest_Enum4                 = 3,
	PropertyEditorTest_Enum5                 = 4,
	PropertyEditorTest_Enum6                 = 5,
	PropertyEditorTest_MAX                   = 6,
};

// Enum UnrealEd.EPropertyEditorTestBitflags
// NumValues: 0x0005
enum class EPropertyEditorTestBitflags : uint8
{
	First                                    = 0,
	Second                                   = 1,
	Third                                    = 2,
	Hidden                                   = 3,
	EPropertyEditorTestBitflags_MAX          = 4,
};

// Enum UnrealEd.ArrayLabelEnum
// NumValues: 0x0008
enum class EArrayLabelEnum : uint8
{
	ArrayIndex0                              = 0,
	ArrayIndex1                              = 1,
	ArrayIndex2                              = 2,
	ArrayIndex3                              = 3,
	ArrayIndex4                              = 4,
	ArrayIndex5                              = 5,
	ArrayIndex_MAX                           = 6,
	ArrayLabelEnum_MAX                       = 7,
};

// Enum UnrealEd.EPropertyEditorTestEditColor
// NumValues: 0x000B
enum class EPropertyEditorTestEditColor : uint8
{
	Red                                      = 0,
	Orange                                   = 1,
	Yellow                                   = 2,
	Green                                    = 3,
	Blue                                     = 4,
	Indigo                                   = 5,
	Violet                                   = 6,
	Pink                                     = 7,
	Magenta                                  = 8,
	Cyan                                     = 9,
	EPropertyEditorTestEditColor_MAX         = 10,
};

// Enum UnrealEd.EPropertyEditorTestUnderscores
// NumValues: 0x0005
enum class EPropertyEditorTestUnderscores : uint8
{
	_One                                     = 0,
	_Two                                     = 1,
	_Three                                   = 2,
	NotUnderscore                            = 3,
	EPropertyEditorTestUnderscores_MAX       = 4,
};

// Enum UnrealEd.ETestEnumFlags
// NumValues: 0x0005
enum class ETestEnumFlags : uint8
{
	None                                     = 0,
	One                                      = 1,
	Two                                      = 2,
	Four                                     = 4,
	ETestEnumFlags_MAX                       = 5,
};

// Enum UnrealEd.EDeletedActorReferenceTypes
// NumValues: 0x0009
enum class EDeletedActorReferenceTypes : uint8
{
	None                                     = 0,
	ActorOrAsset                             = 1,
	Group                                    = 2,
	LevelBlueprint                           = 4,
	All                                      = 7,
	LevelAndActorOrAsset                     = 5,
	GroupAndActorOrAsset                     = 3,
	LevelAndGroup                            = 6,
	EDeletedActorReferenceTypes_MAX          = 8,
};

// Enum UnrealEd.ESheetAxis
// NumValues: 0x0004
enum class ESheetAxis : uint8
{
	AX_Horizontal                            = 0,
	AX_XAxis                                 = 1,
	AX_YAxis                                 = 2,
	AX_MAX                                   = 3,
};

// Enum UnrealEd.EStructViewerDeveloperType
// NumValues: 0x0005
enum class EStructViewerDeveloperType : uint8
{
	SVDT_None                                = 0,
	SVDT_CurrentUser                         = 1,
	SVDT_All                                 = 2,
	SVDT_Max                                 = 3,
	SVDT_MAX                                 = 4,
};

// Enum UnrealEd.ETexAlign
// NumValues: 0x0009
enum class ETexAlign : uint8
{
	TEXALIGN_None                            = 0,
	TEXALIGN_Default                         = 1,
	TEXALIGN_Box                             = 2,
	TEXALIGN_Planar                          = 3,
	TEXALIGN_Fit                             = 4,
	TEXALIGN_PlanarAuto                      = 5,
	TEXALIGN_PlanarWall                      = 6,
	TEXALIGN_PlanarFloor                     = 7,
	TEXALIGN_MAX                             = 8,
};

// Enum UnrealEd.ETextAssetCommandletMode
// NumValues: 0x0008
enum class ETextAssetCommandletMode : uint8
{
	ResaveText                               = 0,
	ResaveBinary                             = 1,
	RoundTrip                                = 2,
	LoadBinary                               = 3,
	LoadText                                 = 4,
	FindMismatchedSerializers                = 5,
	GenerateSchema                           = 6,
	ETextAssetCommandletMode_MAX             = 7,
};

// Enum UnrealEd.ETextureSourceColorSpace
// NumValues: 0x0004
enum class ETextureSourceColorSpace : uint32
{
	Auto                                     = 0,
	Linear                                   = 1,
	SRGB                                     = 2,
	ETextureSourceColorSpace_MAX             = 3,
};

// Enum UnrealEd.EThumbnailPrimType
// NumValues: 0x0006
enum class EThumbnailPrimType : uint8
{
	TPT_None                                 = 0,
	TPT_Sphere                               = 1,
	TPT_Cube                                 = 2,
	TPT_Plane                                = 3,
	TPT_Cylinder                             = 4,
	TPT_MAX                                  = 5,
};

// Enum UnrealEd.EPackageNotifyState
// NumValues: 0x0006
enum class EPackageNotifyState : uint8
{
	NS_Updating                              = 0,
	NS_BalloonPrompted                       = 1,
	NS_DialogPrompted                        = 2,
	NS_PendingPrompt                         = 3,
	NS_PendingWarning                        = 4,
	NS_MAX                                   = 5,
};

// Enum UnrealEd.EDestructiveAssetActions
// NumValues: 0x0005
enum class EDestructiveAssetActions : uint8
{
	AssetDelete                              = 0,
	AssetRename                              = 1,
	AssetMove                                = 2,
	AssetPrivatize                           = 4,
	EDestructiveAssetActions_MAX             = 5,
};

// Enum UnrealEd.EOrthoThumbnailDirection
// NumValues: 0x0007
enum class EOrthoThumbnailDirection : uint8
{
	Top                                      = 0,
	Bottom                                   = 1,
	Left                                     = 2,
	Right                                    = 3,
	Front                                    = 4,
	Back                                     = 5,
	EOrthoThumbnailDirection_MAX             = 6,
};

// ScriptStruct UnrealEd.SelectedSocketInfo
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FSelectedSocketInfo final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct UnrealEd.EditorParameterValue
// 0x0028 (0x0028 - 0x0000)
struct FEditorParameterValue
{
public:
	uint8                                         bOverride : 1;                                     // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMaterialParameterInfo                 ParameterInfo;                                     // 0x0004(0x0014)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ExpressionId;                                      // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UnrealEd.EditorStaticSwitchParameterValue
// 0x0004 (0x002C - 0x0028)
struct FEditorStaticSwitchParameterValue final : public FEditorParameterValue
{
public:
	uint8                                         ParameterValue : 1;                                // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct UnrealEd.BlueprintWatchedPin
// 0x0068 (0x0068 - 0x0000)
struct FBlueprintWatchedPin final
{
public:
	TSoftObjectPtr<class UEdGraphNode>            OwningNode;                                        // 0x0000(0x0030)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  PinId;                                             // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FName>                           PathToProperty;                                    // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct UnrealEd.IniStringValue
// 0x0050 (0x0050 - 0x0000)
struct FIniStringValue final
{
public:
	class FString                                 Section;                                           // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0020(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Branch;                                            // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UnrealEd.DialogueScriptEntry
// 0x00A8 (0x00A8 - 0x0000)
struct FDialogueScriptEntry final
{
public:
	class FString                                 SpeakingVoice;                                     // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         TargetVoices;                                      // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 SpokenDialogue;                                    // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VoiceActorDirection;                               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AudioFileName;                                     // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DialogueAsset;                                     // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsRecorded;                                        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         LocalizationKeys;                                  // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 SpeakingVoiceGUID;                                 // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         TargetVoiceGUIDs;                                  // 0x0088(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 DialogueAssetGUID;                                 // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UnrealEd.BlueprintBreakpoint
// 0x0040 (0x0040 - 0x0000)
struct FBlueprintBreakpoint final
{
public:
	uint8                                         bEnabled : 1;                                      // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UEdGraphNode>            Node;                                              // 0x0008(0x0030)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bStepOnce : 1;                                     // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bStepOnce_WasPreviouslyDisabled : 1;               // 0x0038(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bStepOnce_RemoveAfterHit : 1;                      // 0x0038(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct UnrealEd.ChunkDependency
// 0x0008 (0x0008 - 0x0000)
struct FChunkDependency final
{
public:
	int32                                         ChunkID;                                           // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParentChunkID;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UnrealEd.PropertyNameAndIndex
// 0x0010 (0x0010 - 0x0000)
struct FPropertyNameAndIndex final
{
public:
	class FName                                   Name;                                              // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index;                                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UnrealEd.ComponentPropertyPath
// 0x0020 (0x0020 - 0x0000)
struct FComponentPropertyPath final
{
public:
	TWeakObjectPtr<class AActor>                  ParentOwningActor;                                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UActorComponent>         LastResortComponentPtr;                            // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FPropertyNameAndIndex>          PropertyChain;                                     // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct UnrealEd.CSVImportSettings
// 0x0020 (0x0020 - 0x0000)
struct FCSVImportSettings final
{
public:
	class UScriptStruct*                          ImportRowStruct;                                   // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECSVImportType                                ImportType;                                        // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichCurveInterpMode                          ImportCurveInterpMode;                             // 0x0009(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x16];                                       // 0x000A(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct UnrealEd.DFontParameters
// 0x0010 (0x0010 - 0x0000)
struct FDFontParameters final
{
public:
	class UFont*                                  FontValue;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FontPage;                                          // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct UnrealEd.ScalarParameterAtlasData
// 0x0068 (0x0068 - 0x0000)
struct FScalarParameterAtlasData final
{
public:
	bool                                          bIsUsedAsAtlasPosition;                            // 0x0000(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCurveLinearColor>       Curve;                                             // 0x0008(0x0030)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCurveLinearColorAtlas>  Atlas;                                             // 0x0038(0x0030)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UnrealEd.DComponentMaskParameter
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FDComponentMaskParameter final
{
public:
	uint8                                         R : 1;                                             // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         G : 1;                                             // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         B : 1;                                             // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         A : 1;                                             // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct UnrealEd.CopySelectedInfo
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FCopySelectedInfo final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct UnrealEd.SelectionStateOfLevel
// 0x0020 (0x0020 - 0x0000)
struct FSelectionStateOfLevel final
{
public:
	TArray<class FString>                         SelectedActors;                                    // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         SelectedComponents;                                // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct UnrealEd.AutoReimportWildcard
// 0x0018 (0x0018 - 0x0000)
struct FAutoReimportWildcard final
{
public:
	class FString                                 Wildcard;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInclude;                                          // 0x0010(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct UnrealEd.AutoReimportDirectoryConfig
// 0x0030 (0x0030 - 0x0000)
struct FAutoReimportDirectoryConfig final
{
public:
	class FString                                 SourceDirectory;                                   // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MountPoint;                                        // 0x0010(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAutoReimportWildcard>          Wildcards;                                         // 0x0020(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
};

// ScriptStruct UnrealEd.Mode2DLayer
// 0x0018 (0x0018 - 0x0000)
struct FMode2DLayer final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Depth;                                             // 0x0010(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct UnrealEd.RecentProjectFile
// 0x0018 (0x0018 - 0x0000)
struct FRecentProjectFile final
{
public:
	class FString                                 ProjectName;                                       // 0x0000(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              LastOpenTime;                                      // 0x0010(0x0008)(ZeroConstructor, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UnrealEd.EditorWorldExtensionActorData
// 0x0010 (0x0010 - 0x0000)
struct FEditorWorldExtensionActorData final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValidForPIE;                                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct UnrealEd.ZenCookOnTheFlyRegisterServiceMessage
// 0x0018 (0x0018 - 0x0000)
struct FZenCookOnTheFlyRegisterServiceMessage final
{
public:
	class FString                                 ServiceId;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Port;                                              // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct UnrealEd.FbxTestPlanExpectedResult
// 0x0048 (0x0048 - 0x0000)
struct FFbxTestPlanExpectedResult final
{
public:
	EFBXExpectedResultPreset                      ExpectedPresetsType;                               // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ExpectedPresetsDataInteger;                        // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ExpectedPresetsDataFloat;                          // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<double>                                ExpectedPresetsDataDouble;                         // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         ExpectedPresetsDataString;                         // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct UnrealEd.FbxMaterialBakeSize
// 0x000C (0x000C - 0x0000)
struct FFbxMaterialBakeSize final
{
public:
	struct FIntPoint                              Size;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoDetect;                                       // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct UnrealEd.ImportMeshLodSectionsData
// 0x0010 (0x0010 - 0x0000)
struct FImportMeshLodSectionsData final
{
public:
	TArray<class FName>                           SectionOriginalMaterialName;                       // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct UnrealEd.NetworkEmulationPacketSettings
// 0x000C (0x000C - 0x0000)
struct FNetworkEmulationPacketSettings final
{
public:
	int32                                         MinLatency;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxLatency;                                        // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PacketLossPercentage;                              // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct UnrealEd.LevelEditorPlayNetworkEmulationSettings
// 0x0030 (0x0030 - 0x0000)
struct FLevelEditorPlayNetworkEmulationSettings final
{
public:
	bool                                          bIsNetworkEmulationEnabled;                        // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ENetworkEmulationTarget                       EmulationTarget;                                   // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrentProfile;                                    // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNetworkEmulationPacketSettings        OutPackets;                                        // 0x0018(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FNetworkEmulationPacketSettings        InPackets;                                         // 0x0024(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct UnrealEd.PlayScreenResolution
// 0x0050 (0x0050 - 0x0000)
struct FPlayScreenResolution final
{
public:
	class FString                                 Description;                                       // 0x0000(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Width;                                             // 0x0010(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0014(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AspectRatio;                                       // 0x0018(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanSwapAspectRatio;                               // 0x0028(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ProfileName;                                       // 0x0030(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleFactor;                                       // 0x0040(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LogicalHeight;                                     // 0x0044(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LogicalWidth;                                      // 0x0048(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct UnrealEd.LevelEditorViewportInstanceSettings
// 0x00B8 (0x00B8 - 0x0000)
struct FLevelEditorViewportInstanceSettings final
{
public:
	ELevelViewportType                            ViewportType;                                      // 0x0000(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EViewModeIndex                                PerspViewModeIndex;                                // 0x0001(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EViewModeIndex                                OrthoViewModeIndex;                                // 0x0002(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EditorShowFlagsString;                             // 0x0008(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameShowFlagsString;                               // 0x0018(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BufferVisualizationMode;                           // 0x0028(0x000C)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NaniteVisualizationMode;                           // 0x0034(0x000C)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LumenVisualizationMode;                            // 0x0040(0x000C)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SubstrateVisualizationMode;                        // 0x004C(0x000C)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GroomVisualizationMode;                            // 0x0058(0x000C)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VirtualShadowMapVisualizationMode;                 // 0x0064(0x000C)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RayTracingDebugVisualizationMode;                  // 0x0070(0x000C)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GPUSkinCacheVisualizationMode;                     // 0x007C(0x000C)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FExposureSettings                      ExposureSettings;                                  // 0x0088(0x0008)(Config, NoDestructor, NativeAccessSpecifierPublic)
	float                                         FOVAngle;                                          // 0x0090(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FarViewPlane;                                      // 0x0094(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRealtime;                                       // 0x0098(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowFPS;                                          // 0x0099(0x0001)(ZeroConstructor, Config, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowOnScreenStats;                                // 0x009A(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         EnabledStats;                                      // 0x00A0(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bShowFullToolbar;                                  // 0x00B0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowCinematicControl;                            // 0x00B1(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct UnrealEd.LevelEditorViewportInstanceSettingsKeyValuePair
// 0x00C8 (0x00C8 - 0x0000)
struct FLevelEditorViewportInstanceSettingsKeyValuePair final
{
public:
	class FString                                 ConfigName;                                        // 0x0000(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLevelEditorViewportInstanceSettings   ConfigSettings;                                    // 0x0010(0x00B8)(Config, NativeAccessSpecifierPublic)
};

// ScriptStruct UnrealEd.SnapToSurfaceSettings
// 0x000C (0x000C - 0x0000)
struct FSnapToSurfaceSettings final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SnapOffsetExtent;                                  // 0x0004(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
