#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnrealEd

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UnrealEd_structs.hpp"
#include "AssetDefinition_classes.hpp"
#include "EditorSubsystem_classes.hpp"
#include "PhysicsUtilities_structs.hpp"
#include "AssetTools_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ToolMenus_classes.hpp"
#include "TimeManagement_structs.hpp"


namespace SDK
{

// Class UnrealEd.ActorFactory
// 0x0060 (0x0090 - 0x0030)
class UActorFactory : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0038(0x0010)(NativeAccessSpecifierPublic)
	int32                                         MenuPriority;                                      // 0x0048(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NewActorClassName;                                 // 0x0050(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldAutoRegister;                               // 0x0060(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     NewActorClass;                                     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bShowInEditorQuickMenu : 1;                        // 0x0070(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseSurfaceOrientation : 1;                        // 0x0070(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUsePlacementExtent : 1;                           // 0x0070(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpawnPositionOffset;                               // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorFactory">();
	}
	static class UActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorFactory>();
	}
};

// Class UnrealEd.EditorBrushBuilder
// 0x0000 (0x0088 - 0x0088)
class UEditorBrushBuilder : public UBrushBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorBrushBuilder">();
	}
	static class UEditorBrushBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorBrushBuilder>();
	}
};

// Class UnrealEd.ConeBuilder
// 0x0028 (0x00B0 - 0x0088)
class UConeBuilder final : public UEditorBrushBuilder
{
public:
	float                                         Z;                                                 // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CapZ;                                              // 0x008C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OuterRadius;                                       // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InnerRadius;                                       // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Sides;                                             // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GroupName;                                         // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         AlignToSide : 1;                                   // 0x00A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Hollow : 1;                                        // 0x00A8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConeBuilder">();
	}
	static class UConeBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConeBuilder>();
	}
};

// Class UnrealEd.ActorFactoryEmptyActor
// 0x0008 (0x0098 - 0x0090)
class UActorFactoryEmptyActor : public UActorFactory
{
public:
	bool                                          bVisualizeActor;                                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorFactoryEmptyActor">();
	}
	static class UActorFactoryEmptyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorFactoryEmptyActor>();
	}
};

// Class UnrealEd.ActorFactoryPawn
// 0x0000 (0x0098 - 0x0098)
class UActorFactoryPawn final : public UActorFactoryEmptyActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorFactoryPawn">();
	}
	static class UActorFactoryPawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorFactoryPawn>();
	}
};

// Class UnrealEd.Factory
// 0x0058 (0x0088 - 0x0030)
class UFactory : public UObject
{
public:
	uint8                                         bCreateNew : 1;                                    // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    SupportedClass;                                    // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    ContextClass;                                      // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Formats;                                           // 0x0048(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         bEditAfterNew : 1;                                 // 0x0058(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEditorImport : 1;                                 // 0x0058(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bText : 1;                                         // 0x0058(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ImportPriority;                                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAutomatedAssetImportData*              AutomatedImportData;                               // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAssetImportTask*                       AssetImportTask;                                   // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OverwriteYesOrNoToAllState;                        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_74[0x14];                                      // 0x0074(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool ScriptFactoryCanImport(const class FString& Filename);
	bool ScriptFactoryCreateFile(class UAssetImportTask* InTask);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Factory">();
	}
	static class UFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFactory>();
	}
};

// Class UnrealEd.EditorWorldExtension
// 0x0020 (0x0050 - 0x0030)
class UEditorWorldExtension : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEditorWorldExtensionActorData> ExtensionActors;                                   // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorWorldExtension">();
	}
	static class UEditorWorldExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorWorldExtension>();
	}
};

// Class UnrealEd.ReplaceAssetsCommandlet
// 0x0000 (0x0088 - 0x0088)
class UReplaceAssetsCommandlet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReplaceAssetsCommandlet">();
	}
	static class UReplaceAssetsCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplaceAssetsCommandlet>();
	}
};

// Class UnrealEd.ThumbnailRenderer
// 0x0000 (0x0030 - 0x0030)
class UThumbnailRenderer : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ThumbnailRenderer">();
	}
	static class UThumbnailRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UThumbnailRenderer>();
	}
};

// Class UnrealEd.EditorPerProjectUserSettings
// 0x00D8 (0x0108 - 0x0030)
class UEditorPerProjectUserSettings final : public UObject
{
public:
	uint8                                         bDisplayUIExtensionPoints : 1;                     // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisplayDocumentationLink : 1;                     // 0x0030(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisplayActionListItemRefIds : 1;                  // 0x0030(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAlwaysGatherBehaviorTreeDebuggerData : 1;         // 0x0030(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisplayBlackboardKeysInAlphabeticalOrder : 1;     // 0x0030(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDisplayEngineVersionInBadge;                      // 0x0034(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSimplygonSwarm;                                // 0x0035(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SimplygonServerIP;                                 // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableSwarmDebugging;                             // 0x0048(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        SimplygonSwarmDelay;                               // 0x004C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        SwarmNumOfConcurrentJobs;                          // 0x0050(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        SwarmMaxUploadChunkSizeInMB;                       // 0x0054(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SwarmIntermediateFolder;                           // 0x0058(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAutomaticallyHotReloadNewClasses : 1;             // 0x0068(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowCompilerLogOnCompileError : 1;                // 0x0068(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bKeepFbxNamespace : 1;                             // 0x0068(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowImportDialogAtReimport : 1;                   // 0x0068(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDirectoryPath                         DataSourceFolder;                                  // 0x0070(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bKeepAttachHierarchy : 1;                          // 0x0080(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAnimationReimportWarnings : 1;                    // 0x0080(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bConfirmEditorClose : 1;                           // 0x0080(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseCurvesForDistributions : 1;                    // 0x0080(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PropertyMatrix_NumberOfPasteOperationsBeforeWarning; // 0x0084(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSCSEditorShowGrid;                                // 0x0088(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSCSEditorShowFloor;                               // 0x0089(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGetAttentionOnUATCompletion;                      // 0x008A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlwaysBuildUAT;                                   // 0x008B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SCSViewportCameraSpeed;                            // 0x008C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAutoloadCheckedOutPackages : 1;                   // 0x0090(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSuppressFullyLoadPrompt : 1;                      // 0x0090(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowSelectTranslucent : 1;                       // 0x0090(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowSelectionSubcomponents : 1;                   // 0x0090(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlueprintPaletteFavorites*             BlueprintFavorites;                                // 0x0098(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetViewerProfileIndex;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AssetViewerProfileName;                            // 0x00A8(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PreviewFeatureLevel;                               // 0x00B8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PreviewPlatformName;                               // 0x00BC(0x000C)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PreviewShaderFormatName;                           // 0x00C8(0x000C)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PreviewShaderPlatformName;                         // 0x00D4(0x000C)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreviewFeatureLevelActive;                        // 0x00E0(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreviewFeatureLevelWasDefault;                    // 0x00E1(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PreviewDeviceProfileName;                          // 0x00E4(0x000C)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x18];                                      // 0x00F0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorPerProjectUserSettings">();
	}
	static class UEditorPerProjectUserSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorPerProjectUserSettings>();
	}
};

// Class UnrealEd.BlendSpaceFactory1D
// 0x0020 (0x00A8 - 0x0088)
class UBlendSpaceFactory1D : public UFactory
{
public:
	class USkeleton*                              TargetSkeleton;                                    // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          PreviewSkeletalMesh;                               // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x10];                                      // 0x0098(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlendSpaceFactory1D">();
	}
	static class UBlendSpaceFactory1D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendSpaceFactory1D>();
	}
};

// Class UnrealEd.AimOffsetBlendSpaceFactory1D
// 0x0000 (0x00A8 - 0x00A8)
class UAimOffsetBlendSpaceFactory1D final : public UBlendSpaceFactory1D
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AimOffsetBlendSpaceFactory1D">();
	}
	static class UAimOffsetBlendSpaceFactory1D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAimOffsetBlendSpaceFactory1D>();
	}
};

// Class UnrealEd.PropertyEditorRowGeneratorTest
// 0x0030 (0x0060 - 0x0030)
class UPropertyEditorRowGeneratorTest final : public UObject
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropertyEditorRowGeneratorTest">();
	}
	static class UPropertyEditorRowGeneratorTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyEditorRowGeneratorTest>();
	}
};

// Class UnrealEd.HierarchicalLODSettings
// 0x0088 (0x00E8 - 0x0060)
class UHierarchicalLODSettings final : public UDeveloperSettings
{
public:
	bool                                          bForceSettingsInAllMaps;                           // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSaveLODActorsToHLODPackages;                      // 0x0061(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   DefaultSetup;                                      // 0x0068(0x0030)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDirectoryPath>                 DirectoriesForHLODCommandlet;                      // 0x0098(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<struct FFilePath>                      MapsToBuild;                                       // 0x00A8(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      BaseMaterial;                                      // 0x00B8(0x0030)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HierarchicalLODSettings">();
	}
	static class UHierarchicalLODSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHierarchicalLODSettings>();
	}
};

// Class UnrealEd.TextureThumbnailRenderer
// 0x0000 (0x0030 - 0x0030)
class UTextureThumbnailRenderer : public UThumbnailRenderer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TextureThumbnailRenderer">();
	}
	static class UTextureThumbnailRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextureThumbnailRenderer>();
	}
};

// Class UnrealEd.FontFactory
// 0x0000 (0x0088 - 0x0088)
class UFontFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FontFactory">();
	}
	static class UFontFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFontFactory>();
	}
};

// Class UnrealEd.ActorFactoryVectorFieldVolume
// 0x0000 (0x0090 - 0x0090)
class UActorFactoryVectorFieldVolume final : public UActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorFactoryVectorFieldVolume">();
	}
	static class UActorFactoryVectorFieldVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorFactoryVectorFieldVolume>();
	}
};

// Class UnrealEd.WorldPartitionBuilderCommandlet
// 0x0068 (0x00F0 - 0x0088)
class UWorldPartitionBuilderCommandlet final : public UCommandlet
{
public:
	uint8                                         Pad_88[0x68];                                      // 0x0088(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldPartitionBuilderCommandlet">();
	}
	static class UWorldPartitionBuilderCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldPartitionBuilderCommandlet>();
	}
};

// Class UnrealEd.BlueprintPropertyTestObject
// 0x0018 (0x0048 - 0x0030)
class UBlueprintPropertyTestObject final : public UObject
{
public:
	int32                                         ShouldBeHidden;                                    // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ShouldBeVisible;                                   // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             ObjectA;                                           // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             ObjectB;                                           // 0x0040(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintPropertyTestObject">();
	}
	static class UBlueprintPropertyTestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintPropertyTestObject>();
	}
};

// Class UnrealEd.DefaultSizedThumbnailRenderer
// 0x0008 (0x0038 - 0x0030)
class UDefaultSizedThumbnailRenderer : public UThumbnailRenderer
{
public:
	int32                                         DefaultSizeX;                                      // 0x0030(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DefaultSizeY;                                      // 0x0034(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DefaultSizedThumbnailRenderer">();
	}
	static class UDefaultSizedThumbnailRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultSizedThumbnailRenderer>();
	}
};

// Class UnrealEd.SheetBuilder
// 0x0020 (0x00A8 - 0x0088)
class USheetBuilder final : public UEditorBrushBuilder
{
public:
	int32                                         X;                                                 // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Y;                                                 // 0x008C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         XSegments;                                         // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         YSegments;                                         // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESheetAxis                                    Axis;                                              // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   GroupName;                                         // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SheetBuilder">();
	}
	static class USheetBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<USheetBuilder>();
	}
};

// Class UnrealEd.ParticleSystemAuditCommandlet
// 0x03F8 (0x0480 - 0x0088)
class UParticleSystemAuditCommandlet final : public UCommandlet
{
public:
	uint8                                         Pad_88[0x3C0];                                     // 0x0088(0x03C0)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HighSpawnRateOrBurstThreshold;                     // 0x0448(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FarLODDistanceTheshold;                            // 0x044C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_450[0x30];                                     // 0x0450(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ParticleSystemAuditCommandlet">();
	}
	static class UParticleSystemAuditCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParticleSystemAuditCommandlet>();
	}
};

// Class UnrealEd.BaseWidgetBlueprint
// 0x0008 (0x0568 - 0x0560)
class UBaseWidgetBlueprint : public UUserWidgetBlueprint
{
public:
	class UWidgetTree*                            WidgetTree;                                        // 0x0560(0x0008)(ZeroConstructor, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseWidgetBlueprint">();
	}
	static class UBaseWidgetBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseWidgetBlueprint>();
	}
};

// Class UnrealEd.EditorInstancedPlacementSettings
// 0x0000 (0x0288 - 0x0288)
class UEditorInstancedPlacementSettings final : public UInstancedPlacemenClientSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorInstancedPlacementSettings">();
	}
	static class UEditorInstancedPlacementSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorInstancedPlacementSettings>();
	}
};

// Class UnrealEd.ActorFactorySpotLight
// 0x0000 (0x0090 - 0x0090)
class UActorFactorySpotLight final : public UActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorFactorySpotLight">();
	}
	static class UActorFactorySpotLight* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorFactorySpotLight>();
	}
};

// Class UnrealEd.VectorFieldStaticFactory
// 0x0000 (0x0088 - 0x0088)
class UVectorFieldStaticFactory : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VectorFieldStaticFactory">();
	}
	static class UVectorFieldStaticFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVectorFieldStaticFactory>();
	}
};

// Class UnrealEd.ImportAssetsCommandlet
// 0x0038 (0x00C0 - 0x0088)
class UImportAssetsCommandlet final : public UCommandlet
{
public:
	uint8                                         Pad_88[0x18];                                      // 0x0088(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAutomatedAssetImportData*              GlobalImportData;                                  // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UAutomatedAssetImportData*>      ImportDataList;                                    // 0x00A8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImportAssetsCommandlet">();
	}
	static class UImportAssetsCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImportAssetsCommandlet>();
	}
};

// Class UnrealEd.AssetDefinitionDefault
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinitionDefault : public UAssetDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinitionDefault">();
	}
	static class UAssetDefinitionDefault* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinitionDefault>();
	}
};

// Class UnrealEd.DEditorParameterValue
// 0x0050 (0x0080 - 0x0030)
class UDEditorParameterValue : public UObject
{
public:
	uint8                                         bOverride : 1;                                     // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMaterialParameterInfo                 ParameterInfo;                                     // 0x0034(0x0014)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ExpressionId;                                      // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetPath;                                         // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SortPriority;                                      // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DEditorParameterValue">();
	}
	static class UDEditorParameterValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDEditorParameterValue>();
	}
};

// Class UnrealEd.DEditorFontParameterValue
// 0x0010 (0x0090 - 0x0080)
class UDEditorFontParameterValue final : public UDEditorParameterValue
{
public:
	struct FDFontParameters                       ParameterValue;                                    // 0x0080(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DEditorFontParameterValue">();
	}
	static class UDEditorFontParameterValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDEditorFontParameterValue>();
	}
};

// Class UnrealEd.ActorFactoryVolume
// 0x0000 (0x0090 - 0x0090)
class UActorFactoryVolume : public UActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorFactoryVolume">();
	}
	static class UActorFactoryVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorFactoryVolume>();
	}
};

// Class UnrealEd.EditorWorldExtensionManager
// 0x0010 (0x0040 - 0x0030)
class UEditorWorldExtensionManager final : public UObject
{
public:
	TArray<class UEditorWorldExtensionCollection*> EditorWorldExtensionCollection;                    // 0x0030(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorWorldExtensionManager">();
	}
	static class UEditorWorldExtensionManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorWorldExtensionManager>();
	}
};

// Class UnrealEd.ActorFactoryBoxVolume
// 0x0000 (0x0090 - 0x0090)
class UActorFactoryBoxVolume : public UActorFactoryVolume
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorFactoryBoxVolume">();
	}
	static class UActorFactoryBoxVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorFactoryBoxVolume>();
	}
};

// Class UnrealEd.DumpLightFunctionMaterialInfoCommandlet
// 0x0000 (0x0088 - 0x0088)
class UDumpLightFunctionMaterialInfoCommandlet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DumpLightFunctionMaterialInfoCommandlet">();
	}
	static class UDumpLightFunctionMaterialInfoCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDumpLightFunctionMaterialInfoCommandlet>();
	}
};

// Class UnrealEd.ActorFactoryCharacter
// 0x0000 (0x0090 - 0x0090)
class UActorFactoryCharacter final : public UActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorFactoryCharacter">();
	}
	static class UActorFactoryCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorFactoryCharacter>();
	}
};

// Class UnrealEd.BlueprintThumbnailRenderer
// 0x0050 (0x0088 - 0x0038)
class UBlueprintThumbnailRenderer : public UDefaultSizedThumbnailRenderer
{
public:
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintThumbnailRenderer">();
	}
	static class UBlueprintThumbnailRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintThumbnailRenderer>();
	}
};

// Class UnrealEd.MergeShaderPipelineCachesCommandlet
// 0x0000 (0x0088 - 0x0088)
class UMergeShaderPipelineCachesCommandlet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MergeShaderPipelineCachesCommandlet">();
	}
	static class UMergeShaderPipelineCachesCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMergeShaderPipelineCachesCommandlet>();
	}
};

// Class UnrealEd.ActorFactorySkeletalMesh
// 0x0008 (0x0098 - 0x0090)
class UActorFactorySkeletalMesh : public UActorFactory
{
public:
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorFactorySkeletalMesh">();
	}
	static class UActorFactorySkeletalMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorFactorySkeletalMesh>();
	}
};

// Class UnrealEd.DebugSkelMeshComponent
// 0x01F0 (0x12C0 - 0x10D0)
class UDebugSkelMeshComponent : public USkeletalMeshComponent
{
public:
	ESkeletonDrawMode                             SkeletonDrawMode;                                  // 0x10D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10D1[0x3];                                     // 0x10D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bDrawMesh : 1;                                     // 0x10D4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowBoneNames : 1;                                // 0x10D4(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDrawBoneInfluences : 1;                           // 0x10D4(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDrawMorphTargetVerts : 1;                         // 0x10D4(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDrawNormals : 1;                                  // 0x10D4(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDrawTangents : 1;                                 // 0x10D4(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDrawBinormals : 1;                                // 0x10D4(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDrawSockets : 1;                                  // 0x10D4(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDrawAttributes : 1;                               // 0x10D5(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSkeletonSocketsVisible : 1;                       // 0x10D5(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMeshSocketsVisible : 1;                           // 0x10D5(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisplayRawAnimation : 1;                          // 0x10D5(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisplayNonRetargetedPose : 1;                     // 0x10D5(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisplayAdditiveBasePose : 1;                      // 0x10D5(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisplayBakedAnimation : 1;                        // 0x10D5(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisplaySourceAnimation : 1;                       // 0x10D5(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowNotificationVisualizations : 1;               // 0x10D6(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowRootMotionVisualizations : 1;                 // 0x10D6(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowAssetUserDataVisualizations : 1;              // 0x10D6(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_10D7[0x1];                                     // 0x10D7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDisplayBound;                                     // 0x10D8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisplayVertexColors;                              // 0x10D9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10DA[0x2];                                     // 0x10DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           WireframeMeshOverlayColor;                         // 0x10DC(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bPreviewRootMotion : 1;                            // 0x10EC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_10ED[0x3];                                     // 0x10ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EProcessRootMotionMode                        RequestedProcessRootMotionMode;                    // 0x10F0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProcessRootMotionMode                        ProcessRootMotionMode;                             // 0x10F1(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10F2[0x2];                                     // 0x10F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ConsumeRootMotionPreviousPlaybackTime;             // 0x10F4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bShowClothData : 1;                                // 0x10F8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_10F9[0x3];                                     // 0x10F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinClothPropertyView;                              // 0x10FC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxClothPropertyView;                              // 0x1100(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClothMeshOpacity;                                  // 0x1104(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClothFlipNormal;                                  // 0x1108(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClothCullBackface;                                // 0x1109(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_110A[0x2];                                     // 0x110A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bRequiredBonesUpToDateDuringTick : 1;              // 0x110C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_110D[0xF3];                                    // 0x110D(0x00F3)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 BonesOfInterest;                                   // 0x1200(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class UMorphTarget*>                   MorphTargetOfInterests;                            // 0x1210(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             SkelMaterials;                                     // 0x1220(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	class UAnimPreviewInstance*                   PreviewInstance;                                   // 0x1230(0x0008)(ZeroConstructor, Transient, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimInstance*                          SavedAnimScriptInstance;                           // 0x1238(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUsingInGameBounds;                              // 0x1240(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUsingPreSkinnedBounds;                          // 0x1241(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPerformSingleClothingTick;                        // 0x1242(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPauseClothingSimulationWithAnim;                  // 0x1243(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTrackAttachedInstanceLOD;                         // 0x1244(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1245[0x7B];                                    // 0x1245(0x007B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DebugSkelMeshComponent">();
	}
	static class UDebugSkelMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDebugSkelMeshComponent>();
	}
};

// Class UnrealEd.ActorEditorContextSubsystem
// 0x0040 (0x0078 - 0x0038)
class UActorEditorContextSubsystem final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0x40];                                      // 0x0038(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorEditorContextSubsystem">();
	}
	static class UActorEditorContextSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorEditorContextSubsystem>();
	}
};

// Class UnrealEd.CookGlobalShadersDeviceHelperBase
// 0x0000 (0x0030 - 0x0030)
class UCookGlobalShadersDeviceHelperBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CookGlobalShadersDeviceHelperBase">();
	}
	static class UCookGlobalShadersDeviceHelperBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCookGlobalShadersDeviceHelperBase>();
	}
};

// Class UnrealEd.CookGlobalShadersDeviceHelperStaged
// 0x0010 (0x0040 - 0x0030)
class UCookGlobalShadersDeviceHelperStaged final : public UCookGlobalShadersDeviceHelperBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CookGlobalShadersDeviceHelperStaged">();
	}
	static class UCookGlobalShadersDeviceHelperStaged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCookGlobalShadersDeviceHelperStaged>();
	}
};

// Class UnrealEd.ActorElementDetailsInterface
// 0x0008 (0x0038 - 0x0030)
class UActorElementDetailsInterface final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorElementDetailsInterface">();
	}
	static class UActorElementDetailsInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorElementDetailsInterface>();
	}
};

// Class UnrealEd.FbxExportOption
// 0x0018 (0x0048 - 0x0030)
class UFbxExportOption final : public UObject
{
public:
	EFbxExportCompatibility                       FbxExportCompatibility;                            // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bASCII : 1;                                        // 0x0034(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, Config, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bForceFrontXAxis : 1;                              // 0x0034(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, Config, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         VertexColor : 1;                                   // 0x0034(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         LevelOfDetail : 1;                                 // 0x0034(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Collision : 1;                                     // 0x0034(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bExportSourceMesh : 1;                             // 0x0034(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bExportMorphTargets : 1;                           // 0x0034(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bExportPreviewMesh : 1;                            // 0x0034(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         MapSkeletalMotionToRoot : 1;                       // 0x0035(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bExportLocalTime : 1;                              // 0x0035(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	EMovieSceneBakeType                           BakeCameraAndLightAnimation;                       // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
