#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: USDClasses

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "USDClasses_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class USDClasses.UsdAssetCache
// 0x01C0 (0x01F0 - 0x0030)
class UUsdAssetCache final : public UObject
{
public:
	TMap<class FString, class UObject*>           TransientStorage;                                  // 0x0030(0x0050)(Edit, Transient, EditConst, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class FString, class UObject*>           PersistentStorage;                                 // 0x0080(0x0050)(Edit, EditConst, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPrivate)
	bool                                          bAllowPersistentStorage;                           // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<TWeakObjectPtr<class UObject>>           OwnedAssets;                                       // 0x00D8(0x0050)(NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class FString, TWeakObjectPtr<class UObject>> PrimPathToAssets;                                  // 0x0128(0x0050)(NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_178[0x78];                                     // 0x0178(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdAssetCache">();
	}
	static class UUsdAssetCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdAssetCache>();
	}
};

// Class USDClasses.UsdAssetCache2
// 0x0178 (0x01A8 - 0x0030)
class UUsdAssetCache2 final : public UObject
{
public:
	double                                        UnreferencedAssetStorageSizeMB;                    // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        PersistentAssetStorageSizeMB;                      // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class UObject*>           AssetStorage;                                      // 0x0040(0x0050)(Edit, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x118];                                     // 0x0090(0x0118)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AddAssetReference(const class UObject* Asset, const class UObject* Referencer);
	void CacheAsset(const class FString& Hash, class UObject* Asset, const class UObject* Referencer);
	bool CanRemoveAsset(const class FString& Hash);
	class UObject* GetCachedAsset(const class FString& Hash);
	void RefreshStorage();
	bool RemoveAllAssetReferences(const class UObject* Referencer);
	class UObject* RemoveAsset(const class FString& Hash);
	bool RemoveAssetReference(const class UObject* Asset, const class UObject* Referencer);
	void Reset();
	bool TouchAsset(const class UObject* Asset, const class UObject* Referencer);

	TArray<class FString> GetAllAssetHashes() const;
	TArray<class FString> GetAllCachedAssetPaths() const;
	TArray<class UObject*> GetAllLoadedAssets() const;
	class FString GetHashForAsset(const class UObject* Asset) const;
	int32 GetNumAssets() const;
	bool IsAssetOwnedByCache(const class FString& AssetPath) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdAssetCache2">();
	}
	static class UUsdAssetCache2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdAssetCache2>();
	}
};

// Class USDClasses.UsdAssetCache3
// 0x0268 (0x0298 - 0x0030)
class UUsdAssetCache3 final : public UObject
{
public:
	struct FDirectoryPath                         AssetDirectory;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyHandleAssetsWithinAssetDirectory;             // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FSoftObjectPath>   HashToAssetPaths;                                  // 0x0048(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bCleanUpUnreferencedAssets;                        // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FSoftObjectPath, class FString>   AssetPathToHashes;                                 // 0x00A0(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FString, class UObject*>           TransientObjectStorage;                            // 0x00F0(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_140[0x158];                                    // 0x0140(0x0158)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AddAssetReferencer(const class UObject* Asset, const class UObject* Referencer);
	void CacheAsset(const class FString& Hash, const struct FSoftObjectPath& AssetPath, const class UObject* Referencer);
	void DeleteUnreferencedAssets(const bool bShowConfirmation);
	void DeleteUnreferencedAssetsWithConfirmation();
	class UObject* GetOrCreateCachedAsset(const class FString& Hash, class UClass* Class_0, const class FString& DesiredName, int32 DesiredFlags, bool* bOutCreatedAsset, const class UObject* Referencer);
	bool RemoveAllAssetReferencers();
	bool RemoveAllReferencerAssets(const class UObject* Referencer);
	bool RemoveAllReferencersForAsset(const class UObject* Asset);
	bool RemoveAssetReferencer(const class UObject* Asset, const class UObject* Referencer);
	void RescanAssetDirectory();
	void SetAssetDeletable(const class UObject* Asset, bool bIsDeletable);
	struct FSoftObjectPath StopTrackingAsset(const class FString& Hash);

	TMap<class FString, struct FSoftObjectPath> GetAllTrackedAssets() const;
	class UObject* GetCachedAsset(const class FString& Hash) const;
	struct FSoftObjectPath GetCachedAssetPath(const class FString& Hash) const;
	class FString GetHashForAsset(const struct FSoftObjectPath& AssetPath) const;
	int32 GetNumAssets() const;
	bool IsAssetDeletable(const class UObject* Asset) const;
	bool IsAssetTrackedByCache(const struct FSoftObjectPath& AssetPath) const;
	TMap<class FString, class UObject*> LoadAndGetAllTrackedAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdAssetCache3">();
	}
	static class UUsdAssetCache3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdAssetCache3>();
	}
};

// Class USDClasses.UsdAssetImportData
// 0x0018 (0x0078 - 0x0060)
class UUsdAssetImportData : public UAssetImportData
{
public:
	class FString                                 PrimPath;                                          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ImportOptions;                                     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdAssetImportData">();
	}
	static class UUsdAssetImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdAssetImportData>();
	}
};

// Class USDClasses.UsdAnimSequenceAssetImportData
// 0x0008 (0x0080 - 0x0078)
class UUsdAnimSequenceAssetImportData final : public UUsdAssetImportData
{
public:
	float                                         LayerStartOffsetSeconds;                           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdAnimSequenceAssetImportData">();
	}
	static class UUsdAnimSequenceAssetImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdAnimSequenceAssetImportData>();
	}
};

// Class USDClasses.UsdMeshAssetImportData
// 0x0050 (0x00C8 - 0x0078)
class UUsdMeshAssetImportData final : public UUsdAssetImportData
{
public:
	TMap<int32, struct FUsdPrimPathList>          MaterialSlotToPrimPaths;                           // 0x0078(0x0050)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdMeshAssetImportData">();
	}
	static class UUsdMeshAssetImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdMeshAssetImportData>();
	}
};

// Class USDClasses.UsdAssetUserData
// 0x0070 (0x00A0 - 0x0030)
class UUsdAssetUserData : public UAssetUserData
{
public:
	TArray<class FString>                         PrimPaths;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, struct FUsdCombinedPrimMetadata> StageIdentifierToMetadata;                         // 0x0040(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 OriginalHash;                                      // 0x0090(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdAssetUserData">();
	}
	static class UUsdAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdAssetUserData>();
	}
};

// Class USDClasses.UsdAnimSequenceAssetUserData
// 0x0008 (0x00A8 - 0x00A0)
class UUsdAnimSequenceAssetUserData final : public UUsdAssetUserData
{
public:
	float                                         LayerStartOffsetSeconds;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdAnimSequenceAssetUserData">();
	}
	static class UUsdAnimSequenceAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdAnimSequenceAssetUserData>();
	}
};

// Class USDClasses.UsdMaterialAssetUserData
// 0x00A0 (0x0140 - 0x00A0)
class UUsdMaterialAssetUserData final : public UUsdAssetUserData
{
public:
	TMap<class FString, class FString>            ParameterToPrimvar;                                // 0x00A0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    PrimvarToUVIndex;                                  // 0x00F0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdMaterialAssetUserData">();
	}
	static class UUsdMaterialAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdMaterialAssetUserData>();
	}
};

// Class USDClasses.UsdMeshAssetUserData
// 0x00A0 (0x0140 - 0x00A0)
class UUsdMeshAssetUserData : public UUsdAssetUserData
{
public:
	TMap<int32, struct FUsdPrimPathList>          MaterialSlotToPrimPaths;                           // 0x00A0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    PrimvarToUVIndex;                                  // 0x00F0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdMeshAssetUserData">();
	}
	static class UUsdMeshAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdMeshAssetUserData>();
	}
};

// Class USDClasses.UsdGeometryCacheAssetUserData
// 0x0008 (0x0148 - 0x0140)
class UUsdGeometryCacheAssetUserData final : public UUsdMeshAssetUserData
{
public:
	float                                         LayerStartOffsetSeconds;                           // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdGeometryCacheAssetUserData">();
	}
	static class UUsdGeometryCacheAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdGeometryCacheAssetUserData>();
	}
};

// Class USDClasses.UsdLevelSequenceAssetUserData
// 0x0060 (0x0090 - 0x0030)
class UUsdLevelSequenceAssetUserData final : public UAssetUserData
{
public:
	struct FGuid                                  LastCheckedSignature;                              // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<struct FGuid>                            HandledBindingGuids;                               // 0x0040(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdLevelSequenceAssetUserData">();
	}
	static class UUsdLevelSequenceAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdLevelSequenceAssetUserData>();
	}
};

// Class USDClasses.UsdSparseVolumeTextureAssetUserData
// 0x0040 (0x00E0 - 0x00A0)
class UUsdSparseVolumeTextureAssetUserData final : public UUsdAssetUserData
{
public:
	TArray<class FString>                         SourceOpenVDBAssetPrimPaths;                       // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<double>                                TimeSamplePathTimeCodes;                           // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 TimeSamplePathIndices;                             // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         TimeSamplePaths;                                   // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdSparseVolumeTextureAssetUserData">();
	}
	static class UUsdSparseVolumeTextureAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdSparseVolumeTextureAssetUserData>();
	}
};

// Class USDClasses.UsdDrawModeComponent
// 0x0090 (0x0600 - 0x0570)
class UUsdDrawModeComponent final : public UPrimitiveComponent
{
public:
	struct FVector                                BoundsMin;                                         // 0x0570(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BoundsMax;                                         // 0x0588(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUsdDrawMode                                  DrawMode;                                          // 0x05A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           BoundsColor;                                       // 0x05A4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUsdModelCardGeometry                         CardGeometry;                                      // 0x05B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             CardTextureXPos;                                   // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             CardTextureYPos;                                   // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             CardTextureZPos;                                   // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             CardTextureXNeg;                                   // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             CardTextureYNeg;                                   // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             CardTextureZNeg;                                   // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInstance*>              MaterialInstances;                                 // 0x05E8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	int32                                         AuthoredFaces;                                     // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5FC[0x4];                                      // 0x05FC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBoundsColor(const struct FLinearColor& NewColor);
	void SetBoundsMax(const struct FVector& NewMax);
	void SetBoundsMin(const struct FVector& NewMin);
	void SetCardGeometry(EUsdModelCardGeometry NewGeometry);
	void SetCardTextureXNeg(class UTexture2D* NewTexture);
	void SetCardTextureXPos(class UTexture2D* NewTexture);
	void SetCardTextureYNeg(class UTexture2D* NewTexture);
	void SetCardTextureYPos(class UTexture2D* NewTexture);
	void SetCardTextureZNeg(class UTexture2D* NewTexture);
	void SetCardTextureZPos(class UTexture2D* NewTexture);
	void SetDrawMode(EUsdDrawMode NewDrawMode);
	void SetTextureForFace(EUsdModelCardFace Face, class UTexture2D* Texture);

	class UTexture2D* GetTextureForFace(EUsdModelCardFace Face) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdDrawModeComponent">();
	}
	static class UUsdDrawModeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdDrawModeComponent>();
	}
};

// Class USDClasses.UsdProjectSettings
// 0x02C0 (0x0320 - 0x0060)
class UUsdProjectSettings final : public UDeveloperSettings
{
public:
	TArray<struct FDirectoryPath>                 AdditionalPluginDirectories;                       // 0x0060(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FDirectoryPath>                 DefaultResolverSearchPath;                         // 0x0070(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FName>                           AdditionalMaterialPurposes;                        // 0x0080(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DefaultAssetCache;                                 // 0x0090(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowCreateDefaultAssetCacheDialog;                // 0x00B8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowConfirmationWhenClearingLayers;               // 0x00B9(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowConfirmationWhenMutingDirtyLayers;            // 0x00BA(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowOverriddenOpinionsWarning;                    // 0x00BB(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUsdEditInInstanceBehavior                    EditInInstanceableBehavior;                        // 0x00BC(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowWarningOnIncompleteDuplication;               // 0x00BD(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowTransformOnCameraComponentWarning;            // 0x00BE(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowTransformTrackOnCameraComponentWarning;       // 0x00BF(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUsdSaveDialogBehavior                        ShowSaveLayersDialogWhenSaving;                    // 0x00C0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUsdSaveDialogBehavior                        ShowSaveLayersDialogWhenClosing;                   // 0x00C1(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        DefaultSoundAttenuation;                           // 0x00C8(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReferenceDefaultSVTMaterial;                       // 0x00F0(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReferenceModelCardTextureMaterial;                 // 0x0118(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReferencePreviewSurfaceMaterial;                   // 0x0140(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReferencePreviewSurfaceTranslucentMaterial;        // 0x0168(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReferencePreviewSurfaceTwoSidedMaterial;           // 0x0190(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReferencePreviewSurfaceTranslucentTwoSidedMaterial; // 0x01B8(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReferencePreviewSurfaceVTMaterial;                 // 0x01E0(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReferencePreviewSurfaceTranslucentVTMaterial;      // 0x0208(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReferencePreviewSurfaceTwoSidedVTMaterial;         // 0x0230(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReferencePreviewSurfaceTranslucentTwoSidedVTMaterial; // 0x0258(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReferenceDisplayColorMaterial;                     // 0x0280(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReferenceDisplayColorAndOpacityMaterial;           // 0x02A8(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReferenceDisplayColorTwoSidedMaterial;             // 0x02D0(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReferenceDisplayColorAndOpacityTwoSidedMaterial;   // 0x02F8(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdProjectSettings">();
	}
	static class UUsdProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdProjectSettings>();
	}
};

// Class USDClasses.UsdReferenceOptions
// 0x0038 (0x0068 - 0x0030)
class UUsdReferenceOptions final : public UObject
{
public:
	bool                                          bInternalReference;                                // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFilePath                              TargetFile;                                        // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDefaultPrim;                                   // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TargetPrimPath;                                    // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeCodeOffset;                                    // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeCodeScale;                                     // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdReferenceOptions">();
	}
	static class UUsdReferenceOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdReferenceOptions>();
	}
};

}

