#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: USDStageImporter

#include "Basic.hpp"


namespace SDK
{

// Enum USDStageImporter.EReplaceActorPolicy
// NumValues: 0x0005
enum class EReplaceActorPolicy : uint8
{
	Append                                   = 0,
	Replace                                  = 1,
	UpdateTransform                          = 2,
	Ignore                                   = 3,
	EReplaceActorPolicy_MAX                  = 4,
};

// Enum USDStageImporter.EReplaceAssetPolicy
// NumValues: 0x0004
enum class EReplaceAssetPolicy : uint8
{
	Append                                   = 0,
	Replace                                  = 1,
	Ignore                                   = 2,
	EReplaceAssetPolicy_MAX                  = 3,
};

// ScriptStruct USDStageImporter.UsdStageImportContext
// 0x0180 (0x0180 - 0x0000)
struct alignas(0x10) FUsdStageImportContext final
{
public:
	uint8                                         Pad_0[0x78];                                       // 0x0000(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SceneActor;                                        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ObjectName;                                        // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PackagePath;                                       // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FilePath;                                          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUsdStageImportOptions*                 ImportOptions;                                     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ImportedAsset;                                     // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x10];                                      // 0x00C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UUsdAssetCache3*                        UsdAssetCache;                                     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUsdAssetCache2*                        AssetCache;                                        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0xA0];                                      // 0x00E0(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

