#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: USDStage

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "USDStage_structs.hpp"
#include "UnrealUSDWrapper_structs.hpp"
#include "USDClasses_structs.hpp"


namespace SDK
{

// Class USDStage.UsdDynamicBindingResolverLibrary
// 0x0000 (0x0030 - 0x0030)
class UUsdDynamicBindingResolverLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FMovieSceneDynamicBindingResolveResult ResolveWithStageActor(class UObject* WorldContextObject, const struct FMovieSceneDynamicBindingResolveParams& Params_0, const class FString& StageActorIDNameFilter, const class FString& RootLayerFilter, const class FString& PrimPath);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdDynamicBindingResolverLibrary">();
	}
	static class UUsdDynamicBindingResolverLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdDynamicBindingResolverLibrary>();
	}
};

// Class USDStage.UsdPrimTwin
// 0x0088 (0x00B8 - 0x0030)
class UUsdPrimTwin final : public UObject
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PrimPath;                                          // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class USceneComponent>         SceneComponent;                                    // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class UUsdPrimTwin*>      Children;                                          // 0x0060(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UUsdPrimTwin>            Parent;                                            // 0x00B0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdPrimTwin">();
	}
	static class UUsdPrimTwin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdPrimTwin>();
	}
};

// Class USDStage.UsdStageActor
// 0x0310 (0x0730 - 0x0420)
class AUsdStageActor final : public AActor
{
public:
	struct FFilePath                              RootLayer;                                         // 0x0420(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUsdStageState                                StageState;                                        // 0x0430(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUsdAssetCache3*                        AssetCache;                                        // 0x0438(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUsdAssetCache2*                        UsdAssetCache;                                     // 0x0440(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUsdInitialLoadSet                            InitialLoadSet;                                    // 0x0448(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUsdInterpolationType                         InterpolationType;                                 // 0x0449(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44A[0x2];                                      // 0x044A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         KindsToCollapse;                                   // 0x044C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMergeIdenticalMaterialSlots;                      // 0x0450(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShareAssetsForIdenticalPrims;                     // 0x0451(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReuseIdenticalAssets;                             // 0x0452(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCollapseTopLevelPointInstancers;                  // 0x0453(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PurposesToLoad;                                    // 0x0454(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NaniteTriangleThreshold;                           // 0x0458(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RenderContext;                                     // 0x045C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MaterialPurpose;                                   // 0x0468(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUsdRootMotionHandling                        RootMotionHandling;                                // 0x0474(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_475[0x3];                                      // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubdivisionLevel;                                  // 0x0478(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUsdMetadataImportOptions              MetadataOptions;                                   // 0x0480(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A0[0xA8];                                     // 0x04A0(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        SceneComponent;                                    // 0x0548(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Time;                                              // 0x0550(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         LevelSequence;                                     // 0x0558(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUsdPrimTwin*                           RootUsdTwin;                                       // 0x0560(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSet<class FString>                           PrimsToAnimate;                                    // 0x0568(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<class UObject*, class FString>           ObjectsToWatch;                                    // 0x05B8(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	class UUsdTransactor*                         Transactor;                                        // 0x0608(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_610[0x120];                                    // 0x0610(0x0120)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class UObject*> GetGeneratedAssets(const class FString& PrimPath);
	class USceneComponent* GetGeneratedComponent(const class FString& PrimPath);
	class ULevelSequence* GetLevelSequence();
	class FString GetSourcePrimPath(class UObject* Object);
	void NewStage();
	void SetAssetCache(class UUsdAssetCache2* NewCache);
	void SetBlockedPrefixFilters(const TArray<class FString>& NewFilters);
	void SetCollapseTopLevelPointInstancers(bool bCollapse);
	void SetCollectFromEntireSubtrees(bool bNewCollectValue);
	void SetCollectMetadata(bool bNewCollectValue);
	void SetCollectOnComponents(bool bNewCollectValue);
	void SetInitialLoadSet(EUsdInitialLoadSet NewLoadSet);
	void SetInterpolationType(EUsdInterpolationType NewType);
	void SetInvertFilters(bool bNewInvertValue);
	void SetIsolatedRootLayer(const class FString& IsolatedStageRootLayer);
	void SetKindsToCollapse(int32 NewKindsToCollapse);
	void SetMaterialPurpose(const class FName& NewMaterialPurpose);
	void SetMergeIdenticalMaterialSlots(bool bMerge);
	void SetNaniteTriangleThreshold(int32 NewNaniteTriangleThreshold);
	void SetPurposesToLoad(int32 NewPurposesToLoad);
	void SetRenderContext(const class FName& NewRenderContext);
	void SetReuseIdenticalAssets(bool bReuse);
	void SetRootLayer(const class FString& RootFilePath);
	void SetRootMotionHandling(EUsdRootMotionHandling NewHandlingStrategy);
	void SetShareAssetsForIdenticalPrims(bool bShare);
	void SetStageState(EUsdStageState NewStageState);
	void SetSubdivisionLevel(int32 NewLevel);
	void SetTime(float InTime);
	void SetUsdAssetCache(class UUsdAssetCache3* NewCache);

	class FString GetIsolatedRootLayer() const;
	float GetTime() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdStageActor">();
	}
	static class AUsdStageActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUsdStageActor>();
	}
};

// Class USDStage.UsdTransactor
// 0x0010 (0x0040 - 0x0030)
class UUsdTransactor final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UsdTransactor">();
	}
	static class UUsdTransactor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdTransactor>();
	}
};

}

