#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: USDTests

#include "Basic.hpp"


namespace SDK::Params
{

// Function USDTests.SDTestsBlueprintLibrary.DirtyStageActorBlueprint
// 0x0008 (0x0008 - 0x0000)
struct SDTestsBlueprintLibrary_DirtyStageActorBlueprint final
{
public:
	class AUsdStageActor*                         BlueprintDerivedStageActor;                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function USDTests.SDTestsBlueprintLibrary.GetSubtreeMaterialSlotCount
// 0x0020 (0x0020 - 0x0000)
struct SDTestsBlueprintLibrary_GetSubtreeMaterialSlotCount final
{
public:
	class AUsdStageActor*                         StageActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PrimPath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function USDTests.SDTestsBlueprintLibrary.GetSubtreeVertexCount
// 0x0020 (0x0020 - 0x0000)
struct SDTestsBlueprintLibrary_GetSubtreeVertexCount final
{
public:
	class AUsdStageActor*                         StageActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PrimPath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function USDTests.SDTestsBlueprintLibrary.RecompileBlueprintStageActor
// 0x0010 (0x0010 - 0x0000)
struct SDTestsBlueprintLibrary_RecompileBlueprintStageActor final
{
public:
	class AUsdStageActor*                         BlueprintDerivedStageActor;                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function USDTests.SDTestsBlueprintLibrary.SetUsdStageCpp
// 0x0018 (0x0018 - 0x0000)
struct SDTestsBlueprintLibrary_SetUsdStageCpp final
{
public:
	class AUsdStageActor*                         StageActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewStageRootLayer;                                 // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

