#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UVEditor

#include "Basic.hpp"

#include "EditorSubsystem_classes.hpp"
#include "UVEditorTools_classes.hpp"
#include "EditorFramework_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UnrealEd_classes.hpp"
#include "InteractiveToolsFramework_classes.hpp"
#include "UVEditor_structs.hpp"
#include "ModelingComponents_classes.hpp"


namespace SDK
{

// Class UVEditor.UVEditorInitializationContext
// 0x0008 (0x0038 - 0x0030)
class UUVEditorInitializationContext final : public UUVToolContextObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorInitializationContext">();
	}
	static class UUVEditorInitializationContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorInitializationContext>();
	}
};

// Class UVEditor.UVEditor
// 0x0020 (0x0060 - 0x0040)
class UUVEditor final : public UAssetEditor
{
public:
	TArray<class UObject*>                        OriginalObjectsToEdit;                             // 0x0040(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FTransform3d>                   ObjectWorldspaceOffsets;                           // 0x0050(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditor">();
	}
	static class UUVEditor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditor>();
	}
};

// Class UVEditor.UVEditorBackgroundPreviewProperties
// 0x0030 (0x00E0 - 0x00B0)
class UUVEditorBackgroundPreviewProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bVisible;                                          // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EUVEditorBackgroundSourceType                 SourceType;                                        // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             SourceTexture;                                     // 0x00B8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                              SourceMaterial;                                    // 0x00C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 UDIMBlocks;                                        // 0x00C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bUDIMsEnabled;                                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorBackgroundPreviewProperties">();
	}
	static class UUVEditorBackgroundPreviewProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorBackgroundPreviewProperties>();
	}
};

// Class UVEditor.UVEditorBackgroundPreview
// 0x0038 (0x0160 - 0x0128)
class UUVEditorBackgroundPreview final : public UPreviewGeometry
{
public:
	class UUVEditorBackgroundPreviewProperties*   Settings;                                          // 0x0128(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTriangleSetComponent*                  BackgroundComponent;                               // 0x0130(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               BackgroundMaterial;                                // 0x0138(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_140[0x20];                                     // 0x0140(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorBackgroundPreview">();
	}
	static class UUVEditorBackgroundPreview* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorBackgroundPreview>();
	}
};

// Class UVEditor.UVEditorDistortionVisualizationProperties
// 0x0060 (0x0110 - 0x00B0)
class UUVEditorDistortionVisualizationProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bVisible;                                          // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDistortionMetric                             Metric;                                            // 0x00B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCompareToAverageDensity;                          // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRespectUDIMTextureResolutions;                    // 0x00B3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MapSize;                                           // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetTexelDensity;                                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, int32>                            PerUDIMTextureResolution;                          // 0x00C0(0x0050)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorDistortionVisualizationProperties">();
	}
	static class UUVEditorDistortionVisualizationProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorDistortionVisualizationProperties>();
	}
};

// Class UVEditor.UVEditorDistortionVisualization
// 0x0038 (0x0068 - 0x0030)
class UUVEditorDistortionVisualization final : public UObject
{
public:
	class UUVEditorDistortionVisualizationProperties* Settings;                                          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UUVEditorToolMeshInput*>         Targets;                                           // 0x0038(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x20];                                      // 0x0048(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorDistortionVisualization">();
	}
	static class UUVEditorDistortionVisualization* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorDistortionVisualization>();
	}
};

// Class UVEditor.UVEditorGridProperties
// 0x0008 (0x00B8 - 0x00B0)
class UUVEditorGridProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bDrawGrid;                                         // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawRulers;                                       // 0x00B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorGridProperties">();
	}
	static class UUVEditorGridProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorGridProperties>();
	}
};

// Class UVEditor.UVEditorUDIMProperties
// 0x0040 (0x00F0 - 0x00B0)
class UUVEditorUDIMProperties final : public UInteractiveToolPropertySet
{
public:
	class FString                                 UDIMSourceAsset;                                   // 0x00B0(0x0010)(Edit, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             UDIMSourceTexture;                                 // 0x00C0(0x0008)(Edit, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FUDIMSpecifier>                 ActiveUDIMs;                                       // 0x00C8(0x0010)(Edit, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const TArray<class FString> GetAssetNames();
	void SetUDIMsFromAsset();
	void SetUDIMsFromTexture();

	int32 AssetByIndex() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorUDIMProperties">();
	}
	static class UUVEditorUDIMProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorUDIMProperties>();
	}
};

// Class UVEditor.UVEditorMode
// 0x01A0 (0x02D0 - 0x0130)
class UUVEditorMode final : public UEdMode
{
public:
	class UUVEditorBackgroundPreview*             BackgroundVisualization;                           // 0x0130(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUVEditorDistortionVisualization*       DistortionVisualization;                           // 0x0138(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUVEditorGridProperties*                UVEditorGridProperties;                            // 0x0140(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUVEditorUDIMProperties*                UVEditorUDIMProperties;                            // 0x0148(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UUVToolAction*>                  RegisteredActions;                                 // 0x0150(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_160[0x8];                                      // 0x0160(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        OriginalObjectsToEdit;                             // 0x0168(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UToolTarget*>                    ToolTargets;                                       // 0x0178(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_188[0x30];                                     // 0x0188(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUVEditorToolMeshInput*>         ToolInputObjects;                                  // 0x01B8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C8[0x80];                                     // 0x01C8(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 LivePreviewWorld;                                  // 0x0248(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_250[0x8];                                      // 0x0250(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UUVToolSelectionAPI*                    SelectionAPI;                                      // 0x0258(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UInteractiveToolPropertySet*>    PropertyObjectsToTick;                             // 0x0260(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_270[0x60];                                     // 0x0270(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorMode">();
	}
	static class UUVEditorMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorMode>();
	}
};

// Class UVEditor.UVEditorUVChannelProperties
// 0x0050 (0x0100 - 0x00B0)
class UUVEditorUVChannelProperties final : public UInteractiveToolPropertySet
{
public:
	class FString                                 Asset;                                             // 0x00B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UVChannel;                                         // 0x00C0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x30];                                      // 0x00D0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const TArray<class FString> GetAssetNames();
	const TArray<class FString> GetUVChannelNames();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorUVChannelProperties">();
	}
	static class UUVEditorUVChannelProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorUVChannelProperties>();
	}
};

// Class UVEditor.UVEditorUISubsystem
// 0x0000 (0x0038 - 0x0038)
class UUVEditorUISubsystem final : public UAssetEditorUISubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorUISubsystem">();
	}
	static class UUVEditorUISubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorUISubsystem>();
	}
};

// Class UVEditor.UVEditorSubsystem
// 0x0058 (0x0090 - 0x0038)
class UUVEditorSubsystem final : public UEditorSubsystem
{
public:
	class UToolTargetManager*                     ToolTargetManager;                                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x50];                                      // 0x0040(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorSubsystem">();
	}
	static class UUVEditorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorSubsystem>();
	}
};

}

