#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UVEditorTools

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "InteractiveToolsFramework_classes.hpp"
#include "UVEditorTools_structs.hpp"


namespace SDK
{

// Class UVEditorTools.BasicLineSetComponentBase
// 0x0050 (0x05F0 - 0x05A0)
class UBasicLineSetComponentBase : public UMeshComponent
{
public:
	class UMaterialInterface*                     LineMaterial;                                      // 0x05A0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBoxSphereBounds                       Bounds;                                            // 0x05A8(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bBoundsDirty;                                      // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E1[0x3];                                      // 0x05E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 Color;                                             // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Size;                                              // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DepthBias;                                         // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BasicLineSetComponentBase">();
	}
	static class UBasicLineSetComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasicLineSetComponentBase>();
	}
};

// Class UVEditorTools.Basic2DLineSetComponent
// 0x0020 (0x0610 - 0x05F0)
class UBasic2DLineSetComponent final : public UBasicLineSetComponentBase
{
public:
	uint8                                         Pad_5F0[0x20];                                     // 0x05F0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Basic2DLineSetComponent">();
	}
	static class UBasic2DLineSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasic2DLineSetComponent>();
	}
};

// Class UVEditorTools.Basic3DLineSetComponent
// 0x0020 (0x0610 - 0x05F0)
class UBasic3DLineSetComponent final : public UBasicLineSetComponentBase
{
public:
	uint8                                         Pad_5F0[0x20];                                     // 0x05F0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Basic3DLineSetComponent">();
	}
	static class UBasic3DLineSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasic3DLineSetComponent>();
	}
};

// Class UVEditorTools.BasicPointSetComponentBase
// 0x0050 (0x05F0 - 0x05A0)
class UBasicPointSetComponentBase : public UMeshComponent
{
public:
	class UMaterialInterface*                     PointMaterial;                                     // 0x05A0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBoxSphereBounds                       Bounds;                                            // 0x05A8(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bBoundsDirty;                                      // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E1[0x3];                                      // 0x05E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 Color;                                             // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Size;                                              // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DepthBias;                                         // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BasicPointSetComponentBase">();
	}
	static class UBasicPointSetComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasicPointSetComponentBase>();
	}
};

// Class UVEditorTools.Basic2DPointSetComponent
// 0x0020 (0x0610 - 0x05F0)
class UBasic2DPointSetComponent final : public UBasicPointSetComponentBase
{
public:
	uint8                                         Pad_5F0[0x20];                                     // 0x05F0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Basic2DPointSetComponent">();
	}
	static class UBasic2DPointSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasic2DPointSetComponent>();
	}
};

// Class UVEditorTools.Basic3DPointSetComponent
// 0x0020 (0x0610 - 0x05F0)
class UBasic3DPointSetComponent final : public UBasicPointSetComponentBase
{
public:
	uint8                                         Pad_5F0[0x20];                                     // 0x05F0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Basic3DPointSetComponent">();
	}
	static class UBasic3DPointSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasic3DPointSetComponent>();
	}
};

// Class UVEditorTools.BasicTriangleSetComponentBase
// 0x0060 (0x0600 - 0x05A0)
class UBasicTriangleSetComponentBase : public UMeshComponent
{
public:
	class UMaterialInterface*                     TriangleMaterial;                                  // 0x05A0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBoxSphereBounds                       Bounds;                                            // 0x05A8(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bBoundsDirty;                                      // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E1[0x3];                                      // 0x05E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 Color;                                             // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector3f                              Normal;                                            // 0x05E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F4[0xC];                                      // 0x05F4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BasicTriangleSetComponentBase">();
	}
	static class UBasicTriangleSetComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasicTriangleSetComponentBase>();
	}
};

// Class UVEditorTools.Basic2DTriangleSetComponent
// 0x0010 (0x0610 - 0x0600)
class UBasic2DTriangleSetComponent final : public UBasicTriangleSetComponentBase
{
public:
	uint8                                         Pad_600[0x10];                                     // 0x0600(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Basic2DTriangleSetComponent">();
	}
	static class UBasic2DTriangleSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasic2DTriangleSetComponent>();
	}
};

// Class UVEditorTools.Basic3DTriangleSetComponent
// 0x0010 (0x0610 - 0x0600)
class UBasic3DTriangleSetComponent final : public UBasicTriangleSetComponentBase
{
public:
	uint8                                         Pad_600[0x10];                                     // 0x0600(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Basic3DTriangleSetComponent">();
	}
	static class UBasic3DTriangleSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasic3DTriangleSetComponent>();
	}
};

// Class UVEditorTools.UVEditorMechanicAdapterTool
// 0x0008 (0x00A8 - 0x00A0)
class UUVEditorMechanicAdapterTool final : public UInteractiveTool
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorMechanicAdapterTool">();
	}
	static class UUVEditorMechanicAdapterTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorMechanicAdapterTool>();
	}
};

// Class UVEditorTools.UVToolContextObject
// 0x0000 (0x0030 - 0x0030)
class UUVToolContextObject : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVToolContextObject">();
	}
	static class UUVToolContextObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVToolContextObject>();
	}
};

// Class UVEditorTools.UVToolAssetInputsContext
// 0x0020 (0x0050 - 0x0030)
class UUVToolAssetInputsContext final : public UUVToolContextObject
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVToolAssetInputsContext">();
	}
	static class UUVToolAssetInputsContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVToolAssetInputsContext>();
	}
};

// Class UVEditorTools.UVToolViewportButtonsAPI
// 0x0068 (0x0098 - 0x0030)
class UUVToolViewportButtonsAPI final : public UUVToolContextObject
{
public:
	uint8                                         Pad_30[0x68];                                      // 0x0030(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVToolViewportButtonsAPI">();
	}
	static class UUVToolViewportButtonsAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVToolViewportButtonsAPI>();
	}
};

// Class UVEditorTools.UVUnwrapDynamicMesh
// 0x0000 (0x0030 - 0x0030)
class IUVUnwrapDynamicMesh final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVUnwrapDynamicMesh">();
	}
	static class IUVUnwrapDynamicMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<IUVUnwrapDynamicMesh>();
	}
};

// Class UVEditorTools.UVToolAction
// 0x0018 (0x0048 - 0x0030)
class UUVToolAction : public UObject
{
public:
	class UUVToolSelectionAPI*                    SelectionAPI;                                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUVToolEmitChangeAPI*                   EmitChangeAPI;                                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVToolAction">();
	}
	static class UUVToolAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVToolAction>();
	}
};

// Class UVEditorTools.UVSeamSewAction
// 0x0000 (0x0048 - 0x0048)
class UUVSeamSewAction final : public UUVToolAction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVSeamSewAction">();
	}
	static class UUVSeamSewAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVSeamSewAction>();
	}
};

// Class UVEditorTools.UVSplitAction
// 0x0000 (0x0048 - 0x0048)
class UUVSplitAction final : public UUVToolAction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVSplitAction">();
	}
	static class UUVSplitAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVSplitAction>();
	}
};

// Class UVEditorTools.UVToolEmitChangeAPI
// 0x0008 (0x0038 - 0x0030)
class UUVToolEmitChangeAPI final : public UUVToolContextObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVToolEmitChangeAPI">();
	}
	static class UUVToolEmitChangeAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVToolEmitChangeAPI>();
	}
};

// Class UVEditorTools.UVToolLivePreviewAPI
// 0x0100 (0x0130 - 0x0030)
class UUVToolLivePreviewAPI final : public UUVToolContextObject
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UWorld>                  World;                                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UInputRouter>            InputRouter;                                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_70[0xC0];                                      // 0x0070(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVToolLivePreviewAPI">();
	}
	static class UUVToolLivePreviewAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVToolLivePreviewAPI>();
	}
};

// Class UVEditorTools.UVTool2DViewportAPI
// 0x0060 (0x0090 - 0x0030)
class UUVTool2DViewportAPI final : public UUVToolContextObject
{
public:
	uint8                                         Pad_30[0x48];                                      // 0x0030(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FUDIMBlock>                     UDIMBlocks;                                        // 0x0078(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	bool                                          bDrawGrid;                                         // 0x0088(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDrawRulers;                                       // 0x0089(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVTool2DViewportAPI">();
	}
	static class UUVTool2DViewportAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVTool2DViewportAPI>();
	}
};

// Class UVEditorTools.UVToolAssetAndChannelAPI
// 0x00C0 (0x00F0 - 0x0030)
class UUVToolAssetAndChannelAPI final : public UUVToolContextObject
{
public:
	uint8                                         Pad_30[0xC0];                                      // 0x0030(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVToolAssetAndChannelAPI">();
	}
	static class UUVToolAssetAndChannelAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVToolAssetAndChannelAPI>();
	}
};

// Class UVEditorTools.UVToolAABBTreeStorage
// 0x0050 (0x0080 - 0x0030)
class UUVToolAABBTreeStorage final : public UUVToolContextObject
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVToolAABBTreeStorage">();
	}
	static class UUVToolAABBTreeStorage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVToolAABBTreeStorage>();
	}
};

// Class UVEditorTools.UVEditorToolPropertiesAPI
// 0x0008 (0x0038 - 0x0030)
class UUVEditorToolPropertiesAPI final : public UUVToolContextObject
{
public:
	class UObject*                                ToolDisplayProperties;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorToolPropertiesAPI">();
	}
	static class UUVEditorToolPropertiesAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorToolPropertiesAPI>();
	}
};

// Class UVEditorTools.UVEditorTexelDensitySettings
// 0x0018 (0x00C8 - 0x00B0)
class UUVEditorTexelDensitySettings : public UInteractiveToolPropertySet
{
public:
	ETexelDensityToolMode                         TexelDensityMode;                                  // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetWorldUnits;                                  // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetPixelCount;                                  // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TextureResolution;                                 // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableUDIMLayout;                                 // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool InSamplingMode() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorTexelDensitySettings">();
	}
	static class UUVEditorTexelDensitySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorTexelDensitySettings>();
	}
};

// Class UVEditorTools.UVTexelDensityOperatorFactory
// 0x0180 (0x01B0 - 0x0030)
class alignas(0x10) UUVTexelDensityOperatorFactory final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UUVEditorTexelDensitySettings*          Settings;                                          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x170];                                     // 0x0040(0x0170)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVTexelDensityOperatorFactory">();
	}
	static class UUVTexelDensityOperatorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVTexelDensityOperatorFactory>();
	}
};

// Class UVEditorTools.UVEditorUVTransformPropertiesBase
// 0x0000 (0x00B0 - 0x00B0)
class UUVEditorUVTransformPropertiesBase : public UInteractiveToolPropertySet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorUVTransformPropertiesBase">();
	}
	static class UUVEditorUVTransformPropertiesBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorUVTransformPropertiesBase>();
	}
};

// Class UVEditorTools.UVEditorUVTransformProperties
// 0x0060 (0x0110 - 0x00B0)
class UUVEditorUVTransformProperties : public UUVEditorUVTransformPropertiesBase
{
public:
	struct FVector2D                              Scale;                                             // 0x00B0(0x0010)(Edit, ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rotation;                                          // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Translation;                                       // 0x00C8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUVEditorTranslationMode                      TranslationMode;                                   // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUVEditorPivotType                            PivotMode;                                         // 0x00DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ManualPivot;                                       // 0x00E0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         QuickTranslateOffset;                              // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         QuickRotationOffset;                               // 0x00F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              QuickTranslation;                                  // 0x00F8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         QuickRotation;                                     // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorUVTransformProperties">();
	}
	static class UUVEditorUVTransformProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorUVTransformProperties>();
	}
};

// Class UVEditorTools.UVEditorUVQuickTransformProperties
// 0x0000 (0x0110 - 0x0110)
class UUVEditorUVQuickTransformProperties final : public UUVEditorUVTransformProperties
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorUVQuickTransformProperties">();
	}
	static class UUVEditorUVQuickTransformProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorUVQuickTransformProperties>();
	}
};

// Class UVEditorTools.UVEditorUVAlignProperties
// 0x0020 (0x00D0 - 0x00B0)
class UUVEditorUVAlignProperties final : public UUVEditorUVTransformPropertiesBase
{
public:
	EUVEditorAlignAnchor                          AlignAnchor;                                       // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ManualAnchor;                                      // 0x00B8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUVEditorAlignDirection                       AlignDirection;                                    // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUVEditorAlignDistributeGroupingMode          Grouping;                                          // 0x00CC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorUVAlignProperties">();
	}
	static class UUVEditorUVAlignProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorUVAlignProperties>();
	}
};

// Class UVEditorTools.UVEditorUVDistributeProperties
// 0x0010 (0x00C0 - 0x00B0)
class UUVEditorUVDistributeProperties final : public UUVEditorUVTransformPropertiesBase
{
public:
	EUVEditorDistributeMode                       DistributeMode;                                    // 0x00B0(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUVEditorAlignDistributeGroupingMode          Grouping;                                          // 0x00B2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableManualDistances;                            // 0x00B3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ManualExtent;                                      // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ManualSpacing;                                     // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorUVDistributeProperties">();
	}
	static class UUVEditorUVDistributeProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorUVDistributeProperties>();
	}
};

// Class UVEditorTools.UVEditorUVTransformOperatorFactory
// 0x0180 (0x01B0 - 0x0030)
class alignas(0x10) UUVEditorUVTransformOperatorFactory final : public UObject
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UUVEditorUVTransformPropertiesBase*     Settings;                                          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x168];                                     // 0x0048(0x0168)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorUVTransformOperatorFactory">();
	}
	static class UUVEditorUVTransformOperatorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorUVTransformOperatorFactory>();
	}
};

// Class UVEditorTools.UVEditorMeshSelectionMechanic
// 0x01A8 (0x01E0 - 0x0038)
class alignas(0x10) UUVEditorMeshSelectionMechanic final : public UInteractionMechanic
{
public:
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UUVToolSelectionAPI*                    SelectionAPI;                                      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUVToolViewportButtonsAPI*              ViewportButtonsAPI;                                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUVToolEmitChangeAPI*                   EmitChangeAPI;                                     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUVToolLivePreviewAPI*                  LivePreviewAPI;                                    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULocalSingleClickInputBehavior*         UnwrapClickTargetRouter;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULocalSingleClickInputBehavior*         LivePreviewClickTargetRouter;                      // 0x0078(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULocalMouseHoverBehavior*               UnwrapHoverBehaviorTargetRouter;                   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULocalMouseHoverBehavior*               LivePreviewHoverBehaviorTargetRouter;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URectangleMarqueeMechanic*              MarqueeMechanic;                                   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URectangleMarqueeMechanic*              LivePreviewMarqueeMechanic;                        // 0x0098(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               HoverTriangleSetMaterial;                          // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APreviewGeometryActor*                  HoverGeometryActor;                                // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x18];                                      // 0x00B0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputBehaviorSet*                      LivePreviewBehaviorSet;                            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULocalInputBehaviorSource*              LivePreviewBehaviorSource;                         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class APreviewGeometryActor*                  LivePreviewHoverGeometryActor;                     // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0xF8];                                      // 0x00E8(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorMeshSelectionMechanic">();
	}
	static class UUVEditorMeshSelectionMechanic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorMeshSelectionMechanic>();
	}
};

// Class UVEditorTools.UVToolSelectionAPI
// 0x00D8 (0x0108 - 0x0030)
class UUVToolSelectionAPI final : public UUVToolContextObject
{
public:
	uint8                                         Pad_30[0x68];                                      // 0x0030(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUVEditorToolMeshInput*>         Targets;                                           // 0x0098(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UUVEditorMechanicAdapterTool*           MechanicAdapter;                                   // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUVToolSelectionHighlightMechanic*      HighlightMechanic;                                 // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUVEditorMeshSelectionMechanic*         SelectionMechanic;                                 // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUVToolEmitChangeAPI*                   EmitChangeAPI;                                     // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D0[0x38];                                      // 0x00D0(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVToolSelectionAPI">();
	}
	static class UUVToolSelectionAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVToolSelectionAPI>();
	}
};

// Class UVEditorTools.UVToolSupportsSelection
// 0x0000 (0x0030 - 0x0030)
class IUVToolSupportsSelection final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVToolSupportsSelection">();
	}
	static class IUVToolSupportsSelection* GetDefaultObj()
	{
		return GetDefaultObjImpl<IUVToolSupportsSelection>();
	}
};

// Class UVEditorTools.UVToolSelectionHighlightMechanic
// 0x0080 (0x00B8 - 0x0038)
class UUVToolSelectionHighlightMechanic final : public UInteractionMechanic
{
public:
	class APreviewGeometryActor*                  UnwrapGeometryActor;                               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               TriangleSetMaterial;                               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x30];                                      // 0x0048(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class APreviewGeometryActor*                  UnwrapStationaryGeometryActor;                     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_80[0x18];                                      // 0x0080(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class APreviewGeometryActor*                  LivePreviewGeometryActor;                          // 0x0098(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVToolSelectionHighlightMechanic">();
	}
	static class UUVToolSelectionHighlightMechanic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVToolSelectionHighlightMechanic>();
	}
};

// Class UVEditorTools.UVEditorToolMeshInput
// 0x00F0 (0x0120 - 0x0030)
class alignas(0x10) UUVEditorToolMeshInput final : public UToolTarget
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshOpPreviewWithBackgroundCompute*    UnwrapPreview;                                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshOpPreviewWithBackgroundCompute*    AppliedPreview;                                    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshElementsVisualizer*                WireframeDisplay;                                  // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableTriangleVertexColors;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0xB7];                                      // 0x0069(0x00B7)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorToolMeshInput">();
	}
	static class UUVEditorToolMeshInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorToolMeshInput>();
	}
};

// Class UVEditorTools.UVEditorChannelEditToolBuilder
// 0x0008 (0x0038 - 0x0030)
class UUVEditorChannelEditToolBuilder final : public UInteractiveToolBuilder
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorChannelEditToolBuilder">();
	}
	static class UUVEditorChannelEditToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorChannelEditToolBuilder>();
	}
};

// Class UVEditorTools.UVEditorChannelEditSettings
// 0x0008 (0x00B8 - 0x00B0)
class UUVEditorChannelEditSettings final : public UInteractiveToolPropertySet
{
public:
	EChannelEditToolAction                        Action;                                            // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorChannelEditSettings">();
	}
	static class UUVEditorChannelEditSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorChannelEditSettings>();
	}
};

// Class UVEditorTools.UVEditorChannelEditTargetProperties
// 0x0068 (0x0118 - 0x00B0)
class UUVEditorChannelEditTargetProperties final : public UInteractiveToolPropertySet
{
public:
	class FString                                 Asset;                                             // 0x00B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetChannel;                                     // 0x00C0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReferenceChannel;                                  // 0x00D0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0x30];                                      // 0x00E0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bActionNeedsAsset;                                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActionNeedsReference;                             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActionNeedsTarget;                                // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const TArray<class FString> GetAssetNames();
	const TArray<class FString> GetUVChannelNames();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorChannelEditTargetProperties">();
	}
	static class UUVEditorChannelEditTargetProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorChannelEditTargetProperties>();
	}
};

// Class UVEditorTools.UVEditorChannelEditAddProperties
// 0x0000 (0x00B0 - 0x00B0)
class UUVEditorChannelEditAddProperties final : public UInteractiveToolPropertySet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorChannelEditAddProperties">();
	}
	static class UUVEditorChannelEditAddProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorChannelEditAddProperties>();
	}
};

// Class UVEditorTools.UVEditorChannelEditCopyProperties
// 0x0000 (0x00B0 - 0x00B0)
class UUVEditorChannelEditCopyProperties final : public UInteractiveToolPropertySet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorChannelEditCopyProperties">();
	}
	static class UUVEditorChannelEditCopyProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorChannelEditCopyProperties>();
	}
};

// Class UVEditorTools.UVEditorChannelEditDeleteProperties
// 0x0000 (0x00B0 - 0x00B0)
class UUVEditorChannelEditDeleteProperties final : public UInteractiveToolPropertySet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorChannelEditDeleteProperties">();
	}
	static class UUVEditorChannelEditDeleteProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorChannelEditDeleteProperties>();
	}
};

// Class UVEditorTools.UVEditorChannelEditToolActionPropertySet
// 0x0008 (0x00B8 - 0x00B0)
class UUVEditorChannelEditToolActionPropertySet final : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Apply();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorChannelEditToolActionPropertySet">();
	}
	static class UUVEditorChannelEditToolActionPropertySet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorChannelEditToolActionPropertySet>();
	}
};

// Class UVEditorTools.UVEditorChannelEditTool
// 0x00E8 (0x0188 - 0x00A0)
class UUVEditorChannelEditTool final : public UInteractiveTool
{
public:
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUVEditorToolMeshInput*>         Targets;                                           // 0x00B0(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UUVEditorChannelEditToolActionPropertySet* ToolActions;                                       // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUVEditorChannelEditSettings*           ActionSelectionProperties;                         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUVEditorChannelEditTargetProperties*   SourceChannelProperties;                           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUVEditorChannelEditAddProperties*      AddActionProperties;                               // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUVEditorChannelEditCopyProperties*     CopyActionProperties;                              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUVEditorChannelEditDeleteProperties*   DeleteActionProperties;                            // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUVToolEmitChangeAPI*                   EmitChangeAPI;                                     // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F8[0x90];                                      // 0x00F8(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorChannelEditTool">();
	}
	static class UUVEditorChannelEditTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorChannelEditTool>();
	}
};

// Class UVEditorTools.UVEditorLayoutToolBuilder
// 0x0008 (0x0038 - 0x0030)
class UUVEditorLayoutToolBuilder final : public UInteractiveToolBuilder
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorLayoutToolBuilder">();
	}
	static class UUVEditorLayoutToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorLayoutToolBuilder>();
	}
};

// Class UVEditorTools.UVEditorLayoutTool
// 0x00C0 (0x0160 - 0x00A0)
class UUVEditorLayoutTool final : public UInteractiveTool
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUVEditorToolMeshInput*>         Targets;                                           // 0x00A8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UUVLayoutProperties*                    Settings;                                          // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UUVLayoutOperatorFactory*>       Factories;                                         // 0x00C0(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UUVToolSelectionAPI*                    UVToolSelectionAPI;                                // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUVTool2DViewportAPI*                   UVTool2DViewportAPI;                               // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x80];                                      // 0x00E0(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorLayoutTool">();
	}
	static class UUVEditorLayoutTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorLayoutTool>();
	}
};

// Class UVEditorTools.UVEditorRecomputeUVsToolBuilder
// 0x0008 (0x0038 - 0x0030)
class UUVEditorRecomputeUVsToolBuilder final : public UInteractiveToolBuilder
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorRecomputeUVsToolBuilder">();
	}
	static class UUVEditorRecomputeUVsToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorRecomputeUVsToolBuilder>();
	}
};

// Class UVEditorTools.UVEditorRecomputeUVsTool
// 0x00D0 (0x0170 - 0x00A0)
class UUVEditorRecomputeUVsTool final : public UInteractiveTool
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUVEditorToolMeshInput*>         Targets;                                           // 0x00A8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class URecomputeUVsToolProperties*            Settings;                                          // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPolygroupLayersProperties*             PolygroupLayerProperties;                          // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class URecomputeUVsOpFactory*>         Factories;                                         // 0x00C8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UUVToolSelectionAPI*                    UVToolSelectionAPI;                                // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x90];                                      // 0x00E0(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorRecomputeUVsTool">();
	}
	static class UUVEditorRecomputeUVsTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorRecomputeUVsTool>();
	}
};

// Class UVEditorTools.UVEditorSeamToolProperties
// 0x0008 (0x00B8 - 0x00B0)
class UUVEditorSeamToolProperties final : public UInteractiveToolPropertySet
{
public:
	EUVEditorSeamMode                             Mode;                                              // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorSeamToolProperties">();
	}
	static class UUVEditorSeamToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorSeamToolProperties>();
	}
};

// Class UVEditorTools.UVEditorSeamToolBuilder
// 0x0008 (0x0038 - 0x0030)
class UUVEditorSeamToolBuilder final : public UInteractiveToolBuilder
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorSeamToolBuilder">();
	}
	static class UUVEditorSeamToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorSeamToolBuilder>();
	}
};

// Class UVEditorTools.UVEditorSeamTool
// 0x01C0 (0x0260 - 0x00A0)
class alignas(0x10) UUVEditorSeamTool final : public UInteractiveTool
{
public:
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUVEditorToolMeshInput*>         Targets;                                           // 0x00B8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UUVEditorSeamToolProperties*            Settings;                                          // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUVToolLivePreviewAPI*                  LivePreviewAPI;                                    // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUVToolEmitChangeAPI*                   EmitChangeAPI;                                     // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputBehaviorSet*                      LivePreviewBehaviorSet;                            // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULocalInputBehaviorSource*              LivePreviewBehaviorSource;                         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewGeometry*                       UnwrapGeometry;                                    // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewGeometry*                       LivePreviewGeometry;                               // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_100[0x160];                                    // 0x0100(0x0160)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorSeamTool">();
	}
	static class UUVEditorSeamTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorSeamTool>();
	}
};

// Class UVEditorTools.UVEditorTexelDensityToolBuilder
// 0x0008 (0x0038 - 0x0030)
class UUVEditorTexelDensityToolBuilder final : public UInteractiveToolBuilder
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorTexelDensityToolBuilder">();
	}
	static class UUVEditorTexelDensityToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorTexelDensityToolBuilder>();
	}
};

// Class UVEditorTools.UVEditorTexelDensityActionSettings
// 0x0008 (0x00B8 - 0x00B0)
class UUVEditorTexelDensityActionSettings final : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SampleTexelDensity();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorTexelDensityActionSettings">();
	}
	static class UUVEditorTexelDensityActionSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorTexelDensityActionSettings>();
	}
};

// Class UVEditorTools.UVEditorTexelDensityToolSettings
// 0x0008 (0x00D0 - 0x00C8)
class UUVEditorTexelDensityToolSettings final : public UUVEditorTexelDensitySettings
{
public:
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorTexelDensityToolSettings">();
	}
	static class UUVEditorTexelDensityToolSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorTexelDensityToolSettings>();
	}
};

// Class UVEditorTools.UVEditorTexelDensityTool
// 0x01C0 (0x0260 - 0x00A0)
class alignas(0x10) UUVEditorTexelDensityTool final : public UInteractiveTool
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUVEditorToolMeshInput*>         Targets;                                           // 0x00A8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UUVEditorTexelDensitySettings*          Settings;                                          // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUVEditorTexelDensityActionSettings*    ActionSettings;                                    // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UUVToolSelectionAPI*                    UVToolSelectionAPI;                                // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUVToolLivePreviewAPI*                  LivePreviewAPI;                                    // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUVTool2DViewportAPI*                   UVTool2DViewportAPI;                               // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUVToolEmitChangeAPI*                   EmitChangeAPI;                                     // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UUVTexelDensityOperatorFactory*> Factories;                                         // 0x00F0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputBehaviorSet*                      LivePreviewBehaviorSet;                            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
