#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UVEditorToolsEditorOnly

#include "Basic.hpp"

#include "InteractiveToolsFramework_classes.hpp"


namespace SDK
{

// Class UVEditorToolsEditorOnly.UVEditorParameterizeMeshToolBuilder
// 0x0008 (0x0038 - 0x0030)
class UUVEditorParameterizeMeshToolBuilder final : public UInteractiveToolBuilder
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorParameterizeMeshToolBuilder">();
	}
	static class UUVEditorParameterizeMeshToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorParameterizeMeshToolBuilder>();
	}
};

// Class UVEditorToolsEditorOnly.UVEditorParameterizeMeshTool
// 0x00C8 (0x0168 - 0x00A0)
class UUVEditorParameterizeMeshTool final : public UInteractiveTool
{
public:
	TArray<class UUVEditorToolMeshInput*>         Targets;                                           // 0x00A0(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UParameterizeMeshToolProperties*        Settings;                                          // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParameterizeMeshToolUVAtlasProperties* UVAtlasProperties;                                 // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParameterizeMeshToolXAtlasProperties*  XAtlasProperties;                                  // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParameterizeMeshToolPatchBuilderProperties* PatchBuilderProperties;                            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPolygroupLayersProperties*             PolygroupLayerProperties;                          // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UParameterizeMeshOperatorFactory*> Factories;                                         // 0x00D8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x80];                                      // 0x00E8(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UVEditorParameterizeMeshTool">();
	}
	static class UUVEditorParameterizeMeshTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVEditorParameterizeMeshTool>();
	}
};

}

