#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValkyrieEditor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UnrealEd_classes.hpp"
#include "EditorSubsystem_classes.hpp"
#include "ValkyrieEditor_structs.hpp"
#include "GameFeatures_classes.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DataValidation_classes.hpp"
#include "EditorConfig_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "VkEngineTypes_structs.hpp"
#include "Localization_structs.hpp"
#include "EpicCMSUIFramework_classes.hpp"


namespace SDK
{

// Class ValkyrieEditor.ValkyrieAssetAdapterActorFactory
// 0x0018 (0x00A8 - 0x0090)
class UValkyrieAssetAdapterActorFactory final : public UActorFactory
{
public:
	uint8                                         Pad_90[0x18];                                      // 0x0090(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieAssetAdapterActorFactory">();
	}
	static class UValkyrieAssetAdapterActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieAssetAdapterActorFactory>();
	}
};

// Class ValkyrieEditor.ValkyrieGameFeatureAction_AddAssetAdapter
// 0x0020 (0x0050 - 0x0030)
class UValkyrieGameFeatureAction_AddAssetAdapter final : public UGameFeatureAction
{
public:
	TArray<struct FAssetAdapterInfo>              AdapterInfos;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieGameFeatureAction_AddAssetAdapter">();
	}
	static class UValkyrieGameFeatureAction_AddAssetAdapter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieGameFeatureAction_AddAssetAdapter>();
	}
};

// Class ValkyrieEditor.ValkyrieAssetImportDefaultsForClass
// 0x0000 (0x0030 - 0x0030)
class UValkyrieAssetImportDefaultsForClass : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieAssetImportDefaultsForClass">();
	}
	static class UValkyrieAssetImportDefaultsForClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieAssetImportDefaultsForClass>();
	}
};

// Class ValkyrieEditor.ValkyrieAssetImportDefaults
// 0x0010 (0x0048 - 0x0038)
class UValkyrieAssetImportDefaults final : public UDataAsset
{
public:
	TArray<class UValkyrieAssetImportDefaultsForClass*> AssetImportDefaults;                               // 0x0038(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieAssetImportDefaults">();
	}
	static class UValkyrieAssetImportDefaults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieAssetImportDefaults>();
	}
};

// Class ValkyrieEditor.ValkyrieExperimentalContent
// 0x0010 (0x0040 - 0x0030)
class UValkyrieExperimentalContent final : public UObject
{
public:
	class FName                                   ExperimentalGameplayTagDef;                        // 0x0030(0x000C)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieExperimentalContent">();
	}
	static class UValkyrieExperimentalContent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieExperimentalContent>();
	}
};

// Class ValkyrieEditor.ValkyrieGameFeatureSetStyleSubsystem
// 0x0050 (0x0088 - 0x0038)
class UValkyrieGameFeatureSetStyleSubsystem final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieGameFeatureSetStyleSubsystem">();
	}
	static class UValkyrieGameFeatureSetStyleSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieGameFeatureSetStyleSubsystem>();
	}
};

// Class ValkyrieEditor.ValkyrieImageLoader
// 0x0050 (0x0080 - 0x0030)
class UValkyrieImageLoader final : public UObject
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieImageLoader">();
	}
	static class UValkyrieImageLoader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieImageLoader>();
	}
};

// Class ValkyrieEditor.ValkyrieProjectSize
// 0x01E8 (0x0220 - 0x0038)
class UValkyrieProjectSize final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0x1E8];                                     // 0x0038(0x01E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieProjectSize">();
	}
	static class UValkyrieProjectSize* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieProjectSize>();
	}
};

// Class ValkyrieEditor.ValkyrieReferencedContentAliases
// 0x0000 (0x0038 - 0x0038)
class UValkyrieReferencedContentAliases final : public UEditorSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieReferencedContentAliases">();
	}
	static class UValkyrieReferencedContentAliases* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieReferencedContentAliases>();
	}
};

// Class ValkyrieEditor.DuplicatePluginCommandlet
// 0x0000 (0x0088 - 0x0088)
class UDuplicatePluginCommandlet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DuplicatePluginCommandlet">();
	}
	static class UDuplicatePluginCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDuplicatePluginCommandlet>();
	}
};

// Class ValkyrieEditor.ProjectPickerWrapper
// 0x0010 (0x0428 - 0x0418)
class UProjectPickerWrapper final : public UUserWidget
{
public:
	uint8                                         Pad_418[0x10];                                     // 0x0418(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CloseProjectBrowser() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProjectPickerWrapper">();
	}
	static class UProjectPickerWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProjectPickerWrapper>();
	}
};

// Class ValkyrieEditor.ValkyrieValidator
// 0x0010 (0x0040 - 0x0030)
class UValkyrieValidator final : public UObject
{
public:
	TArray<class FString>                         UnavailableAssetClassesInPlugin;                   // 0x0030(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieValidator">();
	}
	static class UValkyrieValidator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieValidator>();
	}
};

// Class ValkyrieEditor.ValkyrieValidator_MaterialCompilation
// 0x0000 (0x0078 - 0x0078)
class UValkyrieValidator_MaterialCompilation final : public UEditorValidatorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieValidator_MaterialCompilation">();
	}
	static class UValkyrieValidator_MaterialCompilation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieValidator_MaterialCompilation>();
	}
};

// Class ValkyrieEditor.ValkyrieValidator_Properties
// 0x0000 (0x0078 - 0x0078)
class UValkyrieValidator_Properties final : public UEditorValidatorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieValidator_Properties">();
	}
	static class UValkyrieValidator_Properties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieValidator_Properties>();
	}
};

// Class ValkyrieEditor.ValkyrieValidator_Textures
// 0x0000 (0x0078 - 0x0078)
class UValkyrieValidator_Textures final : public UEditorValidatorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieValidator_Textures">();
	}
	static class UValkyrieValidator_Textures* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieValidator_Textures>();
	}
};

// Class ValkyrieEditor.ValkyrieClassRulesManager
// 0x00A8 (0x00E0 - 0x0038)
class UValkyrieClassRulesManager final : public UEditorSubsystem
{
public:
	TMap<struct FTopLevelAssetPath, struct FValkyrieStructRules> RulesByStructPath;                                 // 0x0038(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_88[0x58];                                      // 0x0088(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieClassRulesManager">();
	}
	static class UValkyrieClassRulesManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieClassRulesManager>();
	}
};

// Class ValkyrieEditor.ValkyrieEditorConfig
// 0x0278 (0x02D8 - 0x0060)
class UValkyrieEditorConfig final : public UDeveloperSettings
{
public:
	bool                                          bIsDevBuild;                                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bValkyrieMode;                                     // 0x0061(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bValkyrieRestrictiveMode;                          // 0x0062(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSaveValkyrieRestrictiveMode;                      // 0x0063(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCreateAssetsAsExternallyReferenceable;            // 0x0064(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bVerseComponentMode;                               // 0x0065(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DefaultProjectName;                                // 0x0068(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DefaultProjectVersionSuffix;                       // 0x0078(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseUnrealSourceControlForNewProjects;             // 0x0088(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAutoUndoOnFailedCheckout;                         // 0x0089(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAutomaticallyCheckoutOnAssetModificationValkyrieOverride; // 0x008A(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowOnlyLocalProjects;                            // 0x008B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDirectoryPath>                 ProjectSearchPaths;                                // 0x0090(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TArray<struct FDirectoryPath>                 UserDefinedProjectTemplateSearchPaths;             // 0x00A0(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	bool                                          bAssignProjectVersePathAutomatically;              // 0x00B0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bModalProjectBrowser;                              // 0x00B1(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReferencedContentCacheSizeGB;                      // 0x00B4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bStartupWithLastProject;                           // 0x00B8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bOnlyShowUnseenNewsOnStartup;                      // 0x00B9(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLoginOnStartup;                                   // 0x00BA(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EOnlineRegionSelection                        PreferredRegionSelection;                          // 0x00BB(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnableIterativeValidation;                        // 0x00BC(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLoadAssetsForValidation;                          // 0x00BD(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLiveEditEnabled;                                  // 0x00BE(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BF[0x1];                                       // 0x00BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              ClientResolution;                                  // 0x00C0(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EWindowMode                                   ClientWindowMode;                                  // 0x00C8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bTestOnLocalMachine;                               // 0x00C9(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAutomaticallyLaunchClientWhenTesting;             // 0x00CA(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseTestConfigurationClient;                       // 0x00CB(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AdditionalCommandLineArguments;                    // 0x00D0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLaunchClientAndServerWhenTesting;                 // 0x00E0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LocalClientBinaryLocation;                         // 0x00E8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 AdditionalClientArgs;                              // 0x00F8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 LocalServerBinaryLocation;                         // 0x0108(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 AdditionalServerArgs;                              // 0x0118(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLaunchSecondServer;                               // 0x0128(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SecondServerAdditionalServerArgs;                  // 0x0130(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 LastNewsTimestamp;                                 // 0x0140(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDateTime                              LastEulaCheckTimestamp;                            // 0x0150(0x0008)(ZeroConstructor, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 LastLoginSuccessUserId;                            // 0x0158(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSet<class FString>                           AdditionalProjectPaths;                            // 0x0168(0x0050)(Config, NativeAccessSpecifierPrivate)
	TSet<class FString>                           TrustedProjectIds;                                 // 0x01B8(0x0050)(Config, NativeAccessSpecifierPrivate)
	class FString                                 LastProjectFileName;                               // 0x0208(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 LastCreatedProjectLocation;                        // 0x0218(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 LastSelectedTeamId;                                // 0x0228(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 EditorServerProjectsLocation;                      // 0x0238(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAutoStartGameOnLaunch;                            // 0x0248(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_249[0x17];                                     // 0x0249(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FString>                           EnabledPermissions;                                // 0x0260(0x0050)(Edit, Config, NativeAccessSpecifierPrivate)
	class FString                                 EffectivePermissions;                              // 0x02B0(0x0010)(Edit, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 EntitledPermissions;                               // 0x02C0(0x0010)(Edit, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDevBuildGivesAllEntitlements;                     // 0x02D0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowPermissions;                                  // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class FString> GetEnabledPermissionOptions() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieEditorConfig">();
	}
	static class UValkyrieEditorConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieEditorConfig>();
	}
};

// Class ValkyrieEditor.ValkyrieEditorPermissionSettings
// 0x05E0 (0x0610 - 0x0030)
class UValkyrieEditorPermissionSettings : public UEditorConfigBase
{
public:
	struct FValkyrieEditorPermissionSettings_Project ValkyrieProjectSettings;                           // 0x0030(0x0020)(NativeAccessSpecifierPublic)
	struct FValkyrieEditorPermissionSettings_Blueprints ValkyrieBlueprintsSettings;                        // 0x0050(0x0048)(NativeAccessSpecifierPublic)
	struct FValkyrieEditorPermissionSettings_Animation ValkyrieAnimationSettings;                         // 0x0098(0x0028)(NativeAccessSpecifierPublic)
	struct FValkyrieEditorPermissionSettings_Audio ValkyrieAudioSettings;                             // 0x00C0(0x0018)(NativeAccessSpecifierPublic)
	struct FValkyrieEditorPermissionSettings_UMG  ValkyrieUMGSettings;                               // 0x00D8(0x0050)(NativeAccessSpecifierPublic)
	struct FValkyrieEditorPermissionSettings_EditorUtility ValkyrieEditorUtilitySettings;                     // 0x0128(0x00C0)(NativeAccessSpecifierPublic)
	struct FValkyrieEditorPermissionSettings_Editor ValkyrieEditorSettings;                            // 0x01E8(0x02A8)(NativeAccessSpecifierPublic)
	struct FValkyrieEditorPermissionSettings_Analytics ValkyrieAnalyticsSettings;                         // 0x0490(0x0010)(NativeAccessSpecifierPublic)
	bool                                          bAllowAccessToExperimentalContent;                 // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FValkyrieEditorPermissionSettings_WorldPartition ValkyrieWorldPartitionSettings;                    // 0x04A1(0x0001)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A2[0x6];                                      // 0x04A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FValkyrieClassPropertyPermissionList> PropertyEditorClassPermissionList;                 // 0x04A8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FValkyrieStructPropertyPermissionList> PropertyEditorStructPermissionList;                // 0x04B8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FValkyrieClassPropertyPermissionList> PropertySaveClassPermissionList;                   // 0x04C8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FValkyrieStructPropertyPermissionList> PropertySaveStructPermissionList;                  // 0x04D8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FValkyrieClassPropertyPermissionList> HiddenPropertyClassPermissionList;                 // 0x04E8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FValkyrieStructPropertyPermissionList> HiddenPropertyStructPermissionList;                // 0x04F8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_508[0x108];                                    // 0x0508(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieEditorPermissionSettings">();
	}
	static class UValkyrieEditorPermissionSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieEditorPermissionSettings>();
	}
};

// Class ValkyrieEditor.ValkyrieEditorSettings
// 0x0258 (0x02B8 - 0x0060)
class UValkyrieEditorSettings : public UDeveloperSettings
{
public:
	class FString                                 EditorPermissionsFile;                             // 0x0060(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 BaseEditorPermission;                              // 0x0070(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FValkyrieEditorPermission>      EditorPermissions;                                 // 0x0080(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TMap<class FString, class FString>            EntitlementTagIdMap;                               // 0x0090(0x0050)(Edit, Config, NativeAccessSpecifierPrivate)
	class FString                                 AppShortName;                                      // 0x00E0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FString>                         ProjectFileExtensions;                             // 0x00F0(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	class FString                                 CMSSuffix;                                         // 0x0100(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 BaseDocsUrlId;                                     // 0x0110(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 VoidProjectVersePathRoot;                          // 0x0120(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FValkyrieEditorEnvironmentUrl          ContentReportingDomain;                            // 0x0130(0x0040)(Edit, Config, NativeAccessSpecifierPrivate)
	class FString                                 ContentReportingPath;                              // 0x0170(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 ContentReportingQuery;                             // 0x0180(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 ContentReportProductId;                            // 0x0190(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 ContentReportProjectType;                          // 0x01A0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 CreatorGuidelinesUrl;                              // 0x01B0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UValkyrieUIData>         UIData;                                            // 0x01C0(0x0030)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UValkyrieUIData*                        UIDataInstance;                                    // 0x01F0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UValkyrieAssetImportDefaults> AssetImportDefaults;                               // 0x01F8(0x0030)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   GameFeatureDataClass;                              // 0x0228(0x0030)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UDataTable>              TemplateProjectLocalizationData;                   // 0x0258(0x0030)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   RuntimeHashClass;                                  // 0x0288(0x0030)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieEditorSettings">();
	}
	static class UValkyrieEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieEditorSettings>();
	}
};

// Class ValkyrieEditor.ValkyrieUIData
// 0x0008 (0x0040 - 0x0038)
class UValkyrieUIData final : public UDataAsset
{
public:
	class UProjectPickerWrapper*                  ValkyrieProjectBrowser;                            // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieUIData">();
	}
	static class UValkyrieUIData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieUIData>();
	}
};

// Class ValkyrieEditor.ValkyriePerProjectUserConfig
// 0x00F0 (0x0120 - 0x0030)
class UValkyriePerProjectUserConfig final : public UObject
{
public:
	class FString                                 ProjectId;                                         // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LastMap;                                           // 0x0040(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LastBuildCommitMessage;                            // 0x0050(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SourceControlProviderName;                         // 0x0060(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            SourceControlProviderParameters;                   // 0x0070(0x0050)(Config, NativeAccessSpecifierPublic)
	struct FDateTime                              LastOpenedTime;                                    // 0x00C0(0x0008)(ZeroConstructor, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FString>                           LastReferencedContentSourceProjectIds;             // 0x00C8(0x0050)(Config, NativeAccessSpecifierPublic)
	uint32                                        DimissedVerseVersion;                              // 0x0118(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsArchived;                                       // 0x011C(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyriePerProjectUserConfig">();
	}
	static class UValkyriePerProjectUserConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyriePerProjectUserConfig>();
	}
};

// Class ValkyrieEditor.ValkyrieProject
// 0x0588 (0x05B8 - 0x0030)
class UValkyrieProject final : public UObject
{
public:
	class FString                                 ProjectFileName;                                   // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 ProjectName;                                       // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 ProjectDirectory;                                  // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FValkyrieProjectDescriptor             ProjectDescriptor;                                 // 0x0060(0x0250)(NativeAccessSpecifierPrivate)
	bool                                          bIsOpened;                                         // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValkyriePerProjectUserConfig*          UserConfig;                                        // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C0[0x2F8];                                    // 0x02C0(0x02F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString GetProjectFileName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieProject">();
	}
	static class UValkyrieProject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieProject>();
	}
};

// Class ValkyrieEditor.ValkyrieProjectManager
// 0x0678 (0x06B0 - 0x0038)
class UValkyrieProjectManager final : public UEditorSubsystem
{
public:
	TMap<class FString, class UValkyrieProject*>  ProjectsByFilePath;                                // 0x0038(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class FString, class UValkyrieProject*>  ProjectsById;                                      // 0x0088(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UValkyrieProject*>               OpenedProjects;                                    // 0x00D8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UValkyrieProject*                       CurrentProject;                                    // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F0[0x5C0];                                     // 0x00F0(0x05C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieProjectManager">();
	}
	static class UValkyrieProjectManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieProjectManager>();
	}
};

// Class ValkyrieEditor.ValkyrieProjectSettingsEditorViewModel
// 0x0098 (0x00C8 - 0x0030)
class UValkyrieProjectSettingsEditorViewModel final : public UObject
{
public:
	class FString                                 Title;                                             // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 Description;                                       // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DocsUrl;                                           // 0x0050(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EValkyrieProjectKind                          Kind;                                              // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsProjectOffline;                                 // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bProjectHasVersePath;                              // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsProjectLive;                                    // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 VersePath;                                         // 0x0068(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowVerseVersion;                                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 VerseVersion;                                      // 0x0080(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUserGeneratedContentLocalizationDescriptor UGCLocDescriptor;                                  // 0x0090(0x0028)(Edit, NativeAccessSpecifierPrivate)
	bool                                          bIsUsingSceneGraphSystem;                          // 0x00B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsUsingExperimentalContent;                       // 0x00B9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BA[0xE];                                       // 0x00BA(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class FString> GetVerseVersionOptions();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieProjectSettingsEditorViewModel">();
	}
	static class UValkyrieProjectSettingsEditorViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieProjectSettingsEditorViewModel>();
	}
};

// Class ValkyrieEditor.CMSNewsLayoutWidget
// 0x00C8 (0x04E0 - 0x0418)
class UCMSNewsLayoutWidget final : public UUserWidget
{
public:
	uint8                                         Pad_418[0x98];                                     // 0x0418(0x0098)(Fixing Size After Last Property [ Dumper-7 ])
	class UCMSWelcomeMessage*                     NewsMessagePanel;                                  // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCMSWelcomeTileLayout*                  NewsTileLayout;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C0[0x20];                                     // 0x04C0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool GetOnlyShowUnseenNewsOnStartup();
	static void SetOnlyShowUnseenNewsOnStartup(bool bOnlyShowUnseenNewsOnStartup);

	void DataFound();
	void NoData();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CMSNewsLayoutWidget">();
	}
	static class UCMSNewsLayoutWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCMSNewsLayoutWidget>();
	}
};

// Class ValkyrieEditor.CMSWelcomeMessage
// 0x0000 (0x0458 - 0x0458)
class UCMSWelcomeMessage final : public UEpicCMSSimpleMessage
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CMSWelcomeMessage">();
	}
	static class UCMSWelcomeMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCMSWelcomeMessage>();
	}
};

// Class ValkyrieEditor.CMSWelcomeTile
// 0x0030 (0x1990 - 0x1960)
class UCMSWelcomeTile final : public UEpicCMSTileBase
{
public:
	TSoftObjectPtr<class UMaterialInterface>      TileMaterial;                                      // 0x1958(0x0030)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1988[0x8];                                     // 0x1988(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CMSWelcomeTile">();
	}
	static class UCMSWelcomeTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCMSWelcomeTile>();
	}
};

// Class ValkyrieEditor.CMSWelcomeTileLayout
// 0x0030 (0x04B0 - 0x0480)
class UCMSWelcomeTileLayout final : public UEpicCMSLayoutBase
{
public:
	TSoftClassPtr<class UClass>                   TileType;                                          // 0x0480(0x0030)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CMSWelcomeTileLayout">();
	}
	static class UCMSWelcomeTileLayout* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCMSWelcomeTileLayout>();
	}
};

}

