#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValkyrieCommon

#include "Basic.hpp"

#include "UnrealEngineExperimental_structs.hpp"
#include "VerseInterface_structs.hpp"
#include "VerseGameplayDebug_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "LinkId_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "VkEngineTypes_structs.hpp"
#include "ValkyrieCommon_structs.hpp"
#include "ConcertSyncCore_structs.hpp"


namespace SDK::Params
{

// Function ValkyrieCommon.ValkyrieBeaconClient.AddPrewarmCompatibilityVersion
// 0x0010 (0x0010 - 0x0000)
struct ValkyrieBeaconClient_AddPrewarmCompatibilityVersion final
{
public:
	class FString                                 ClientVersion;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ClientDisallowedLiveEditTransactionEncountered
// 0x0001 (0x0001 - 0x0000)
struct ValkyrieBeaconClient_ClientDisallowedLiveEditTransactionEncountered final
{
public:
	bool                                          bSuppressLiveEdit;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ClientHandleCookFailure
// 0x0010 (0x0010 - 0x0000)
struct ValkyrieBeaconClient_ClientHandleCookFailure final
{
public:
	class FString                                 CookJobId;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ClientHandleError
// 0x0010 (0x0010 - 0x0000)
struct ValkyrieBeaconClient_ClientHandleError final
{
public:
	class FText                                   ErrorMessage;                                      // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ClientHandleTransactionFinalizedEvent
// 0x00B8 (0x00B8 - 0x0000)
struct ValkyrieBeaconClient_ClientHandleTransactionFinalizedEvent final
{
public:
	struct FConcertTransactionFinalizedEvent      Event;                                             // 0x0000(0x00B8)(Parm, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ClientHandleVerseDiagnostics
// 0x0018 (0x0018 - 0x0000)
struct ValkyrieBeaconClient_ClientHandleVerseDiagnostics final
{
public:
	struct FVerseUploadDiagnostics                Diagnostics;                                       // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bOpenMessageLog;                                   // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ClientLogSummaryMessage
// 0x0010 (0x0010 - 0x0000)
struct ValkyrieBeaconClient_ClientLogSummaryMessage final
{
public:
	class FString                                 LogMessage;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ClientNotifyOfServerScriptDiagnosticMessage
// 0x0050 (0x0050 - 0x0000)
struct ValkyrieBeaconClient_ClientNotifyOfServerScriptDiagnosticMessage final
{
public:
	struct FScriptDiagnosticMessage               Message;                                           // 0x0000(0x0050)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ClientNotifyOfServerUnrecoverableErrorMessage
// 0x0028 (0x0028 - 0x0000)
struct ValkyrieBeaconClient_ClientNotifyOfServerUnrecoverableErrorMessage final
{
public:
	struct FOnUnrecoverableErrorMessage           Message;                                           // 0x0000(0x0028)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ClientNotifyOfServerVerseRuntimeErrorMessage
// 0x0010 (0x0010 - 0x0000)
struct ValkyrieBeaconClient_ClientNotifyOfServerVerseRuntimeErrorMessage final
{
public:
	class FText                                   ErrorMessage;                                      // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ClientProcessDebugMessage
// 0x0018 (0x0018 - 0x0000)
struct ValkyrieBeaconClient_ClientProcessDebugMessage final
{
public:
	struct FSolarisDebugMessage                   Message;                                           // 0x0000(0x0018)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ClientUpdateContentUpdateState
// 0x0001 (0x0001 - 0x0000)
struct ValkyrieBeaconClient_ClientUpdateContentUpdateState final
{
public:
	EContentUpdateState                           NewContentUpdateState;                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ClientVerseUploadComplete
// 0x0028 (0x0028 - 0x0000)
struct ValkyrieBeaconClient_ClientVerseUploadComplete final
{
public:
	class FString                                 InSnapshotId;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerseUploadState                             Result;                                            // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseUploadDiagnostics                Diagnostics;                                       // 0x0018(0x0010)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.HandleVkCheatConsoleCommand
// 0x0010 (0x0010 - 0x0000)
struct ValkyrieBeaconClient_HandleVkCheatConsoleCommand final
{
public:
	TArray<class FString>                         Args;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ServerContentUpdated
// 0x0030 (0x0030 - 0x0000)
struct ValkyrieBeaconClient_ServerContentUpdated final
{
public:
	class FString                                 ProjectId;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Snapshot;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVkModuleVersion>               Modules_Legacy;                                    // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ServerOnContentBeaconHostError
// 0x0108 (0x0108 - 0x0000)
struct ValkyrieBeaconClient_ServerOnContentBeaconHostError final
{
public:
	struct FContentBeaconError                    ContentBeaconError;                                // 0x0000(0x0108)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ServerProcessDebugMessage
// 0x0018 (0x0018 - 0x0000)
struct ValkyrieBeaconClient_ServerProcessDebugMessage final
{
public:
	struct FSolarisDebugMessage                   Message;                                           // 0x0000(0x0018)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ServerSendGameFlowMessage
// 0x0018 (0x0018 - 0x0000)
struct ValkyrieBeaconClient_ServerSendGameFlowMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVkEditStatus                                 VkEditStatus;                                      // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ServerSetExperimentalContentFilter
// 0x0001 (0x0001 - 0x0000)
struct ValkyrieBeaconClient_ServerSetExperimentalContentFilter final
{
public:
	bool                                          bFilter;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ServerSetPersistenceBehaviorOverride
// 0x0001 (0x0001 - 0x0000)
struct ValkyrieBeaconClient_ServerSetPersistenceBehaviorOverride final
{
public:
	EMinigameDevelopmentPersistenceBehavior       InPersistenceBehaviorOverride;                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ServerSetPublishingMemoryLimit
// 0x0004 (0x0004 - 0x0000)
struct ValkyrieBeaconClient_ServerSetPublishingMemoryLimit final
{
public:
	int32                                         PublishingMemoryLimit;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ServerSetUseLiveEditProxyActors
// 0x0001 (0x0001 - 0x0000)
struct ValkyrieBeaconClient_ServerSetUseLiveEditProxyActors final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ServerStartMemorySampling
// 0x0018 (0x0018 - 0x0000)
struct ValkyrieBeaconClient_ServerStartMemorySampling final
{
public:
	struct FOnlineLinkId                          LinkCode;                                          // 0x0000(0x0018)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ServerSubmitConnectedClientLogs
// 0x0010 (0x0010 - 0x0000)
struct ValkyrieBeaconClient_ServerSubmitConnectedClientLogs final
{
public:
	struct FGuid                                  ParentReportId;                                    // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ServerTeleportPlayer
// 0x0038 (0x0038 - 0x0000)
struct ValkyrieBeaconClient_ServerTeleportPlayer final
{
public:
	uint32                                        i;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function ValkyrieCommon.ValkyrieBeaconClient.ServerVkCheatMessage
// 0x0020 (0x0020 - 0x0000)
struct ValkyrieBeaconClient_ServerVkCheatMessage final
{
public:
	struct FVerseGameplayStringDebugMessage       Message;                                           // 0x0000(0x0020)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

}

