#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValkyrieFortniteEditor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum ValkyrieFortniteEditor.EModerationAssetFlags
// NumValues: 0x0009
enum class EModerationAssetFlags : uint8
{
	GeneratedMeshPreview                     = 1,
	GeneratedFStrings                        = 2,
	GeneratedLocalization                    = 4,
	GeneratedTexture                         = 8,
	GeneratedMeshExport                      = 16,
	GeneratedPointCloud                      = 32,
	GeneratedMeshMetaData                    = 64,
	None                                     = 0,
	EModerationAssetFlags_MAX                = 65,
};

// Enum ValkyrieFortniteEditor.EValkyrieFortniteProjectDataAuthority
// NumValues: 0x0004
enum class EValkyrieFortniteProjectDataAuthority : uint8
{
	Island                                   = 0,
	UEFN                                     = 1,
	None                                     = 2,
	EValkyrieFortniteProjectDataAuthority_MAX = 3,
};

// Enum ValkyrieFortniteEditor.EValkyrieAssetVisibility
// NumValues: 0x0009
enum class EValkyrieAssetVisibility : uint8
{
	Hidden                                   = 0,
	Legacy                                   = 1,
	Unreleased                               = 2,
	Untested                                 = 3,
	EarlyAccess                              = 4,
	Experimental                             = 5,
	Visible                                  = 6,
	Count                                    = 7,
	EValkyrieAssetVisibility_MAX             = 8,
};

// Enum ValkyrieFortniteEditor.EValkyrieSyncProjectState
// NumValues: 0x0008
enum class EValkyrieSyncProjectState : uint8
{
	Untracked                                = 0,
	Tracked                                  = 1,
	Staging                                  = 2,
	Uploading                                = 3,
	CreatingModuleVersions                   = 4,
	Failed                                   = 5,
	UpToDate                                 = 6,
	EValkyrieSyncProjectState_MAX            = 7,
};

// Enum ValkyrieFortniteEditor.EValkyrieSyncProjectOptions
// NumValues: 0x0008
enum class EValkyrieSyncProjectOptions : uint8
{
	None                                     = 0,
	AllowValidationFixup                     = 1,
	AllowUpload                              = 2,
	AllowClientUpdate                        = 4,
	ForceFullValidation                      = 8,
	PassedLocalValidation                    = 16,
	Default                                  = 7,
	EValkyrieSyncProjectOptions_MAX          = 17,
};

// ScriptStruct ValkyrieFortniteEditor.ModerationArtifact
// 0x0030 (0x0030 - 0x0000)
struct FModerationArtifact final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Hash;                                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Tags;                                              // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct ValkyrieFortniteEditor.ModerationAsset
// 0x0060 (0x0060 - 0x0000)
struct FModerationAsset final
{
public:
	class FString                                 FullPath;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClassName;                                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FModerationArtifact>            Artifacts;                                         // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint32>                                StringArtifactIndexes;                             // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 InputHash;                                         // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Tags;                                              // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct ValkyrieFortniteEditor.ModerationPackage
// 0x0040 (0x0040 - 0x0000)
struct FModerationPackage final
{
public:
	class FString                                 PackagePath;                                       // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PackageHash;                                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastModuleVersionWithChanges;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              LastModerationTime;                                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FModerationAsset>               Assets;                                            // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct ValkyrieFortniteEditor.ModerationManifest
// 0x0038 (0x0038 - 0x0000)
struct FModerationManifest final
{
public:
	TArray<class FString>                         Files;                                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FModerationPackage>             Packages;                                          // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ManifestVersion;                                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ModuleVersion;                                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ModerationTime;                                    // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ValkyrieFortniteEditor.ModerationStringManifest
// 0x0010 (0x0010 - 0x0000)
struct FModerationStringManifest final
{
public:
	TArray<class FString>                         Strings;                                           // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct ValkyrieFortniteEditor.FileInfo
// 0x0040 (0x0040 - 0x0000)
struct FFileInfo final
{
public:
	class FString                                 File;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PackagePath;                                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Hash;                                              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HashWithDependencies;                              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ValkyrieFortniteEditor.ModerationMeshExportTaskEntry
// 0x0020 (0x0020 - 0x0000)
struct FModerationMeshExportTaskEntry final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkinnedAsset*                          SkinnedMesh;                                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ValkyrieFortniteEditor.ModerationMeshPreviewEntry
// 0x0090 (0x0090 - 0x0000)
struct alignas(0x10) FModerationMeshPreviewEntry final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkinnedAsset*                          SkinnedMesh;                                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshComponent*                         MeshComponent;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     OverlayMaterial;                                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             Materials;                                         // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x60];                                      // 0x0030(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ValkyrieFortniteEditor.ModerationMeshActorPreviewEntry
// 0x0008 (0x0008 - 0x0000)
struct FModerationMeshActorPreviewEntry final
{
public:
	class AActor*                                 TemplateActor;                                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ValkyrieFortniteEditor.ModerationMeshTaskEntry
// 0x0028 (0x0028 - 0x0000)
struct FModerationMeshTaskEntry final
{
public:
	TArray<struct FModerationMeshPreviewEntry>    MeshPreviewEntries;                                // 0x0000(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FModerationMeshActorPreviewEntry       MeshActorPreviewEntry;                             // 0x0010(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x10];                                      // 0x0018(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ValkyrieFortniteEditor.ValkyrieTestProject
// 0x0028 (0x0028 - 0x0000)
struct FValkyrieTestProject final
{
public:
	class FString                                 FriendlyName;                                      // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Path;                                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldRunInCIS;                                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ValkyrieFortniteEditor.ValkyrieScratchManifestDescriptor
// 0x0010 (0x0010 - 0x0000)
struct FValkyrieScratchManifestDescriptor final
{
public:
	TArray<class FString>                         Files;                                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

}

