#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValkyrieEditor

#include "Basic.hpp"


namespace SDK::Params
{

// Function ValkyrieEditor.ValkyrieEditorConfig.GetEnabledPermissionOptions
// 0x0010 (0x0010 - 0x0000)
struct ValkyrieEditorConfig_GetEnabledPermissionOptions final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ValkyrieEditor.ValkyrieProject.GetProjectFileName
// 0x0010 (0x0010 - 0x0000)
struct ValkyrieProject_GetProjectFileName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ValkyrieEditor.ValkyrieProjectSettingsEditorViewModel.GetVerseVersionOptions
// 0x0010 (0x0010 - 0x0000)
struct ValkyrieProjectSettingsEditorViewModel_GetVerseVersionOptions final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function ValkyrieEditor.CMSNewsLayoutWidget.GetOnlyShowUnseenNewsOnStartup
// 0x0001 (0x0001 - 0x0000)
struct CMSNewsLayoutWidget_GetOnlyShowUnseenNewsOnStartup final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ValkyrieEditor.CMSNewsLayoutWidget.SetOnlyShowUnseenNewsOnStartup
// 0x0001 (0x0001 - 0x0000)
struct CMSNewsLayoutWidget_SetOnlyShowUnseenNewsOnStartup final
{
public:
	bool                                          bOnlyShowUnseenNewsOnStartup;                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

