#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VariantManager

#include "Basic.hpp"

#include "VariantManagerContent_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function VariantManager.VariantManagerBlueprintLibrary.AddActorBinding
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_AddActorBinding final
{
public:
	class UVariant*                               Variant;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.AddDependency
// 0x0078 (0x0078 - 0x0000)
struct VariantManagerBlueprintLibrary_AddDependency final
{
public:
	class UVariant*                               Variant;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVariantDependency                     Dependency;                                        // 0x0008(0x0068)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0070(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VariantManager.VariantManagerBlueprintLibrary.AddVariant
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_AddVariant final
{
public:
	class UVariantSet*                            VariantSet;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVariant*                               Variant;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.AddVariantSet
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_AddVariantSet final
{
public:
	class ULevelVariantSets*                      LevelVariantSets;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVariantSet*                            VariantSet;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.Apply
// 0x0008 (0x0008 - 0x0000)
struct VariantManagerBlueprintLibrary_Apply final
{
public:
	class UPropertyValue*                         PropVal;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.CaptureProperty
// 0x0028 (0x0028 - 0x0000)
struct VariantManagerBlueprintLibrary_CaptureProperty final
{
public:
	class UVariant*                               Variant;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyPath;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPropertyValue*                         ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.CreateLevelVariantSetsActor
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_CreateLevelVariantSetsActor final
{
public:
	class ULevelVariantSets*                      LevelVariantSetsAsset;                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ALevelVariantSetsActor*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.CreateLevelVariantSetsAsset
// 0x0028 (0x0028 - 0x0000)
struct VariantManagerBlueprintLibrary_CreateLevelVariantSetsAsset final
{
public:
	class FString                                 AssetName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetPath;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevelVariantSets*                      ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.DeleteDependency
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_DeleteDependency final
{
public:
	class UVariant*                               Variant;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VariantManager.VariantManagerBlueprintLibrary.GetCapturableProperties
// 0x0018 (0x0018 - 0x0000)
struct VariantManagerBlueprintLibrary_GetCapturableProperties final
{
public:
	class UObject*                                ActorOrClass;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.GetCapturedProperties
// 0x0020 (0x0020 - 0x0000)
struct VariantManagerBlueprintLibrary_GetCapturedProperties final
{
public:
	class UVariant*                               Variant;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPropertyValue*>                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.GetPropertyTypeString
// 0x0018 (0x0018 - 0x0000)
struct VariantManagerBlueprintLibrary_GetPropertyTypeString final
{
public:
	class UPropertyValue*                         PropVal;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.GetValueBool
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_GetValueBool final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VariantManager.VariantManagerBlueprintLibrary.GetValueColor
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_GetValueColor final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VariantManager.VariantManagerBlueprintLibrary.GetValueFloat
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_GetValueFloat final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VariantManager.VariantManagerBlueprintLibrary.GetValueInt
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_GetValueInt final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VariantManager.VariantManagerBlueprintLibrary.GetValueIntPoint
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_GetValueIntPoint final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.GetValueLinearColor
// 0x0018 (0x0018 - 0x0000)
struct VariantManagerBlueprintLibrary_GetValueLinearColor final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.GetValueObject
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_GetValueObject final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.GetValueQuat
// 0x0030 (0x0030 - 0x0000)
struct VariantManagerBlueprintLibrary_GetValueQuat final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.GetValueRotator
// 0x0020 (0x0020 - 0x0000)
struct VariantManagerBlueprintLibrary_GetValueRotator final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.GetValueString
// 0x0018 (0x0018 - 0x0000)
struct VariantManagerBlueprintLibrary_GetValueString final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.GetValueVector
// 0x0020 (0x0020 - 0x0000)
struct VariantManagerBlueprintLibrary_GetValueVector final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.GetValueVector2D
// 0x0018 (0x0018 - 0x0000)
struct VariantManagerBlueprintLibrary_GetValueVector2D final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.GetValueVector4
// 0x0030 (0x0030 - 0x0000)
struct VariantManagerBlueprintLibrary_GetValueVector4 final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.Record
// 0x0008 (0x0008 - 0x0000)
struct VariantManagerBlueprintLibrary_Record final
{
public:
	class UPropertyValue*                         PropVal;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.RemoveActorBinding
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_RemoveActorBinding final
{
public:
	class UVariant*                               Variant;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.RemoveActorBindingByName
// 0x0018 (0x0018 - 0x0000)
struct VariantManagerBlueprintLibrary_RemoveActorBindingByName final
{
public:
	class UVariant*                               Variant;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActorName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.RemoveCapturedProperty
// 0x0018 (0x0018 - 0x0000)
struct VariantManagerBlueprintLibrary_RemoveCapturedProperty final
{
public:
	class UVariant*                               Variant;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPropertyValue*                         Property;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.RemoveCapturedPropertyByName
// 0x0020 (0x0020 - 0x0000)
struct VariantManagerBlueprintLibrary_RemoveCapturedPropertyByName final
{
public:
	class UVariant*                               Variant;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyPath;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.RemoveVariant
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_RemoveVariant final
{
public:
	class UVariantSet*                            VariantSet;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVariant*                               Variant;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.RemoveVariantByName
// 0x0018 (0x0018 - 0x0000)
struct VariantManagerBlueprintLibrary_RemoveVariantByName final
{
public:
	class UVariantSet*                            VariantSet;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VariantName;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.RemoveVariantSet
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_RemoveVariantSet final
{
public:
	class ULevelVariantSets*                      LevelVariantSets;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVariantSet*                            VariantSet;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.RemoveVariantSetByName
// 0x0018 (0x0018 - 0x0000)
struct VariantManagerBlueprintLibrary_RemoveVariantSetByName final
{
public:
	class ULevelVariantSets*                      LevelVariantSets;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VariantSetName;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.SetDependency
// 0x0078 (0x0078 - 0x0000)
struct VariantManagerBlueprintLibrary_SetDependency final
{
public:
	class UVariant*                               Variant;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVariantDependency                     Dependency;                                        // 0x0010(0x0068)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.SetValueBool
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_SetValueBool final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InValue;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VariantManager.VariantManagerBlueprintLibrary.SetValueColor
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_SetValueColor final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 InValue;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VariantManager.VariantManagerBlueprintLibrary.SetValueFloat
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_SetValueFloat final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InValue;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VariantManager.VariantManagerBlueprintLibrary.SetValueInt
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_SetValueInt final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InValue;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VariantManager.VariantManagerBlueprintLibrary.SetValueIntPoint
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_SetValueIntPoint final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              InValue;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.SetValueLinearColor
// 0x0018 (0x0018 - 0x0000)
struct VariantManagerBlueprintLibrary_SetValueLinearColor final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           InValue;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.SetValueObject
// 0x0010 (0x0010 - 0x0000)
struct VariantManagerBlueprintLibrary_SetValueObject final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InValue;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.SetValueQuat
// 0x0030 (0x0030 - 0x0000)
struct VariantManagerBlueprintLibrary_SetValueQuat final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  InValue;                                           // 0x0010(0x0020)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.SetValueRotator
// 0x0020 (0x0020 - 0x0000)
struct VariantManagerBlueprintLibrary_SetValueRotator final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InValue;                                           // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.SetValueString
// 0x0018 (0x0018 - 0x0000)
struct VariantManagerBlueprintLibrary_SetValueString final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InValue;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.SetValueVector
// 0x0020 (0x0020 - 0x0000)
struct VariantManagerBlueprintLibrary_SetValueVector final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InValue;                                           // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.SetValueVector2D
// 0x0018 (0x0018 - 0x0000)
struct VariantManagerBlueprintLibrary_SetValueVector2D final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InValue;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VariantManager.VariantManagerBlueprintLibrary.SetValueVector4
// 0x0030 (0x0030 - 0x0000)
struct VariantManagerBlueprintLibrary_SetValueVector4 final
{
public:
	class UPropertyValue*                         Property;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               InValue;                                           // 0x0010(0x0020)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

