#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VaultingCodeRuntime

#include "Basic.hpp"

#include "VaultingCodeRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ContextualTraversalRuntime_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteAI_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VaultingCodeRuntime.FortMovementMode_HurdleRuntimeData
// 0x0000 (0x0130 - 0x0130)
class UFortMovementMode_HurdleRuntimeData final : public UFortMovementMode_TraversalBaseRuntimeData
{
public:
	EHurdleType                                   Type;                                              // 0x0128(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_HurdleRuntimeData">();
	}
	static class UFortMovementMode_HurdleRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_HurdleRuntimeData>();
	}
};

// Class VaultingCodeRuntime.FortMovementMode_ExtLogicHurdle
// 0x0058 (0x0218 - 0x01C0)
class UFortMovementMode_ExtLogicHurdle final : public UFortMovementMode_ExtLogicTraversalBase
{
public:
	struct FGameplayTagContainer                  HurdleTag;                                         // 0x01C0(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           HurdleStartedTag;                                  // 0x01E0(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  HurdleFinishedTag;                                 // 0x01F0(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	float                                         DestroyPropsSweepDistance;                         // 0x0210(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DestroyPropsWindowSillOffsetDistance;              // 0x0214(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_DestroyProp(class ABuildingProp* BuildPropToDestroy);
	void BP_GetAnimationMontageInformation(const struct FSynchedActionInfo& SynchedActionInfo, EHurdleType Type, bool bIsNarrowOpening, bool bIsCrouched, class UAnimMontage** AnimMontage, class FName* StartSectionName, class FName* MontageMiddleSectionName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ExtLogicHurdle">();
	}
	static class UFortMovementMode_ExtLogicHurdle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ExtLogicHurdle>();
	}
};

// Class VaultingCodeRuntime.HurdleNavLinkProcessor
// 0x0000 (0x0030 - 0x0030)
class UHurdleNavLinkProcessor final : public UFortCustomNavLinkProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HurdleNavLinkProcessor">();
	}
	static class UHurdleNavLinkProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHurdleNavLinkProcessor>();
	}
};

// Class VaultingCodeRuntime.HurdleCameraMode
// 0x0210 (0x2050 - 0x1E40)
class UHurdleCameraMode final : public UFortCameraMode_ThirdPerson
{
public:
	struct FVector                                StartCameraOriginInterpSpeed;                      // 0x1E40(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                ApexCameraOriginInterpSpeed;                       // 0x1E58(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                EndCameraOriginInterpSpeed;                        // 0x1E70(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ConstantSpeedCameraTrackInterpolationExponent;     // 0x1E88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CameraOriginVerticalThreshold;                     // 0x1E8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FallingVerticalInterpSpeed;                        // 0x1E90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FallSpeedThreshold;                                // 0x1E94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NonSprintFOV;                                      // 0x1E98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideSpectatorCamera;                          // 0x1E9C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E9D[0x3];                                     // 0x1E9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHurdleTargetingData                   HurdleTargetingData;                               // 0x1EA0(0x0138)(Transient, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1FD8[0x78];                                    // 0x1FD8(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HurdleCameraMode">();
	}
	static class UHurdleCameraMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHurdleCameraMode>();
	}
};

// Class VaultingCodeRuntime.HurdleComponent
// 0x0DB8 (0x0E98 - 0x00E0)
class UHurdleComponent final : public UFortPawnComponent
{
public:
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHurdleInputConfig                     HurdleInputConfig;                                 // 0x00E8(0x0908)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FHurdleInputConfigCache                HurdleInputConfigCache;                            // 0x09F0(0x00B0)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMovementMode_BaseExtLogic> MovementModeExtension;                             // 0x0AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AA8[0x8];                                      // 0x0AA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         HurdleEnabled;                                     // 0x0AB0(0x0038)(Edit, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AutoHurdleEnabled;                                 // 0x0AE8(0x0038)(Edit, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B20[0x140];                                    // 0x0B20(0x0140)(Fixing Size After Last Property [ Dumper-7 ])
	struct FReplicatedHurdleTargetingData         ReplayHurdleTargetingData;                         // 0x0C60(0x0070)(Net, NoDestructor, NativeAccessSpecifierPrivate)
	struct FHurdleTargetingData                   ParallelTargetingData;                             // 0x0CD0(0x0138)(Transient, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E08[0x38];                                     // 0x0E08(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HighlightPositionOffset;                           // 0x0E40(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                HighlightNormalMultiplier;                         // 0x0E58(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                HighlightScale;                                    // 0x0E70(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           CanStartHurdleTag;                                 // 0x0E88(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E94[0x3];                                      // 0x0E94(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bShouldShowHurdleIndicator;                        // 0x0E97(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BP_CleanupHurdleIndicator();
	void BP_CreateHurdleHighlight(const struct FHurdleTargetingData& TargetingData);
	void BP_ShowHurdleInputPrompt(bool bVisible);
	void BP_UpdateHurdleHighlight();
	void HandleNavLinkMoveStarted(const struct FVector& LinkEndPoint);
	void HandleOwnerJumpInput(bool bPressed);
	void OnMutatorUpdated();
	void OnPlayerStatePawnSet(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);
	void RegisterMutatorUpdatedDelegate(class APawn* AffectedPawn);
	void UnregisterMutatorUpdatedDelegate();

	void BP_CanStartHurdle(bool* OutCanStartHurdle) const;
	bool BP_IsTacticalSprinting() const;
	bool BP_UseAutoHurdle() const;
	struct FTransform GetHurdleHighlightTransform() const;
	bool IsUsingGamepad() const;
	bool ShouldShowHurdleIndicator() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HurdleComponent">();
	}
	static class UHurdleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHurdleComponent>();
	}
};

// Class VaultingCodeRuntime.HurdleLibrary
// 0x0000 (0x0030 - 0x0030)
class UHurdleLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool PerformHurdleTargeting(const class ACharacter* Character, struct FHurdleInputConfigCache* HurdleInputConfig, struct FHurdleTargetingData* OutTargetingData, bool bIsAutoHurdle, const struct FVector& OverrideAimDirection);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HurdleLibrary">();
	}
	static class UHurdleLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHurdleLibrary>();
	}
};

}

