#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: vehicle_spawner_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass vehicle_spawner_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class vehicle_spawner_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass vehicle_spawner_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class vehicle_spawner_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<vehicle_spawner_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass vehicle_spawner_device.vehicle_spawner_device
// 0x00D0 (0x0190 - 0x00C0)
class Uvehicle_spawner_device : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0xF6707756_AgentEntersVehicleEvent;        // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xCD56DB50_AgentExitsVehicleEvent;         // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x8478CED1_SpawnedEvent;                   // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x42481D15_VehicleSpawnedEvent;            // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xCAB27063_VehicleDestroyedEvent;          // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xB279E5FF_DestroyedEvent;                 // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x5BDC7A5C_EnableFunction;                 // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC9184E23_DisableFunction;                // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x67E2071E_AssignDriverFunction;           // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xA5D91F27_DestroyVehicleFunction;         // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x6EB77812_RespawnVehicleFunction;         // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x22BDEC28_ApplyOffRoadTiresFunction;      // 0x0118(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x4F07FB9E_RemoveTireModFunction;          // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xE41437C1_PopAllTiresFunction;            // 0x0128(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x8B7FDBA5_RepairAllTiresFunction;         // 0x0130(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x23A5BC9C_FullRepairVehicleFunction;      // 0x0138(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_float*     __verse_0xD26E4E18_SetVehicleHealthFunction;       // 0x0140(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_float*     __verse_0xF2B7B44F_GetVehicleHealthFunction;       // 0x0148(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_float*     __verse_0x2DA51126_SetFuelValueFunction;           // 0x0150(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_float*     __verse_0x6842874F_GetFuelValueFunction;           // 0x0158(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_float*     __verse_0xAE1B29FA_GetFuelCapacityFunction;        // 0x0160(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_logic*     __verse_0xF5CA6EA5_HasVehicleFunction;             // 0x0168(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0xC3B8E78C_IsDriverFunction;               // 0x0170(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* __verse_0x355D80FF_IsPassengerFunction;            // 0x0178(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_float*     __verse_0x99790EB1_SetMaxHealthFunction;           // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_get_agent*     __verse_0x4D8AE327_GetDriverFunction;              // 0x0188(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RApplyOffRoadTires(const struct vehicle_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RAssignDriver_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RDestroyVehicle(const struct vehicle_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RDisable(const struct vehicle_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_REnable(const struct vehicle_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class USimulation_agent*, true> _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RGetDriver(const struct vehicle_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RGetFuelRemaining(const struct vehicle_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RGetVehicleHealth(const struct vehicle_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RGetVehicleMaxHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RHasVehicle(const struct vehicle_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RIsDriver_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RIsPassenger_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RPopAllTires(const struct vehicle_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RRemoveTireMods(const struct vehicle_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RRepairAllTires(const struct vehicle_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RRepairVehicle(const struct vehicle_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RRespawnVehicle(const struct vehicle_spawner_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RSetFuelRemaining_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RSetVehicleHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RSetVehicleMaxHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"vehicle_spawner_device">();
	}
	static class Uvehicle_spawner_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uvehicle_spawner_device>();
	}
};

}

