#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: vehicle_spawner_device

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "vehicle_spawner_device_structs.hpp"


namespace SDK::Params
{

// Function vehicle_spawner_device.vehicle_spawner_device.$InitCDO
// 0x0AC0 (0x0AC0 - 0x0000)
struct vehicle_spawner_device__InitCDO final
{
public:
	class UDevices_device_event_agent*            _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_2;                            // 0x0010(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0020(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_agent*            _ExprResult_4;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_6;                            // 0x0040(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_vehicle*          _ExprResult_8;                                     // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_9;                                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_10;                           // 0x0070(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x0080(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_void*             _ExprResult_12;                                    // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_13;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_14;                           // 0x00A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x00B0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_void*             _ExprResult_16;                                    // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_17;                               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_18;                           // 0x00D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_19;                                    // 0x00E0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_void*             _ExprResult_20;                                    // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_21;                               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_22;                           // 0x0100(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_23;                                    // 0x0110(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_24;                                    // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_25;                               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_26;                           // 0x0130(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_27;                                    // 0x0140(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_28;                                    // 0x0150(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_29;                               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_30;                           // 0x0160(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_31;                                    // 0x0170(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_32;                                    // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_33;                               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_34;                           // 0x0190(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_35;                                    // 0x01A0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_36;                                    // 0x01B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_37;                               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_38;                           // 0x01C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_39;                                    // 0x01D0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_40;                                    // 0x01E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_41;                               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_42;                           // 0x01F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_43;                                    // 0x0200(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_44;                                    // 0x0210(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_45;                               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_46;                           // 0x0220(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_47;                                    // 0x0230(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_48;                                    // 0x0240(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_49;                               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_50;                           // 0x0250(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_51;                                    // 0x0260(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_52;                                    // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_53;                               // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_54;                           // 0x0280(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_55;                                    // 0x0290(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_56;                                    // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_57;                               // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_58;                           // 0x02B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_59;                                    // 0x02C0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_60;                                    // 0x02D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_61;                               // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_62;                           // 0x02E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_63;                                    // 0x02F0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_float*     _ExprResult_64;                                    // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_65;                               // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_66;                           // 0x0310(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_67;                                    // 0x0320(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_float*     _ExprResult_68;                                    // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_69;                               // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_70;                           // 0x0340(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_71;                                    // 0x0350(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_float*     _ExprResult_72;                                    // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_73;                               // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_74;                           // 0x0370(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_75;                                    // 0x0380(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_float*     _ExprResult_76;                                    // 0x0390(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_77;                               // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_78;                           // 0x03A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_79;                                    // 0x03B0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_float*     _ExprResult_80;                                    // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_81;                               // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_82;                           // 0x03D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_83;                                    // 0x03E0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_logic*     _ExprResult_84;                                    // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_85;                               // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_86;                           // 0x0400(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_87;                                    // 0x0410(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* _ExprResult_88;                                    // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_89;                               // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_90;                           // 0x0430(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_91;                                    // 0x0440(0x0010)(HasGetValueTypeHash)
	TOptional<class UClass*>                      _ArchetypeFieldValue_92;                           // 0x0450(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UClass*>                      _ExprResult_93;                                    // 0x0460(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UClass*>                         _ArchetypeFieldValue_94;                           // 0x0470(0x0010)(ContainsInstancedReference)
	TArray<class UClass*>                         _ExprResult_95;                                    // 0x0480(0x0010)(ContainsInstancedReference)
	class UDevices_device_function_set_params_by_type_const* _ExprResult_96;                                    // 0x0490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_97;                               // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_98;                           // 0x04A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_99;                                    // 0x04B0(0x0010)(HasGetValueTypeHash)
	TOptional<class UClass*>                      _ArchetypeFieldValue_100;                          // 0x04C0(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UClass*>                      _ExprResult_101;                                   // 0x04D0(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UClass*>                         _ArchetypeFieldValue_102;                          // 0x04E0(0x0010)(ContainsInstancedReference)
	TArray<class UClass*>                         _ExprResult_103;                                   // 0x04F0(0x0010)(ContainsInstancedReference)
	class UDevices_device_function_set_float*     _ExprResult_104;                                   // 0x0500(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_105;                              // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_106;                          // 0x0510(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_107;                                   // 0x0520(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_agent*     _ExprResult_108;                                   // 0x0530(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_109;                              // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_110;                          // 0x0540(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_111;                                   // 0x0550(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_agent*            _ExprResult_112;                                   // 0x0560(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_113;                              // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_114;                          // 0x0570(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_115;                                   // 0x0580(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_agent*            _ExprResult_116;                                   // 0x0590(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_117;                              // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_118;                          // 0x05A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_119;                                   // 0x05B0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_vehicle*          _ExprResult_120;                                   // 0x05C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_121;                              // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_122;                          // 0x05D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_123;                                   // 0x05E0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_void*             _ExprResult_124;                                   // 0x05F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_125;                              // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_126;                          // 0x0600(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_127;                                   // 0x0610(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_void*             _ExprResult_128;                                   // 0x0620(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_129;                              // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_130;                          // 0x0630(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_131;                                   // 0x0640(0x0010)(HasGetValueTypeHash)
	class UDevices_device_event_void*             _ExprResult_132;                                   // 0x0650(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_133;                              // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_134;                          // 0x0660(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_135;                                   // 0x0670(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_136;                                   // 0x0680(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_137;                              // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_138;                          // 0x0690(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_139;                                   // 0x06A0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_140;                                   // 0x06B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_141;                              // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_142;                          // 0x06C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_143;                                   // 0x06D0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_144;                                   // 0x06E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_145;                              // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_146;                          // 0x06F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_147;                                   // 0x0700(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_148;                                   // 0x0710(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_149;                              // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_150;                          // 0x0720(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_151;                                   // 0x0730(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_152;                                   // 0x0740(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_153;                              // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_154;                          // 0x0750(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_155;                                   // 0x0760(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_156;                                   // 0x0770(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_157;                              // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_158;                          // 0x0780(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_159;                                   // 0x0790(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_160;                                   // 0x07A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_161;                              // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_162;                          // 0x07B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_163;                                   // 0x07C0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_164;                                   // 0x07D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_165;                              // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_166;                          // 0x07E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_167;                                   // 0x07F0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_168;                                   // 0x0800(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_169;                              // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_170;                          // 0x0810(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_171;                                   // 0x0820(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function*               _ExprResult_172;                                   // 0x0830(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_173;                              // 0x0838(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_174;                          // 0x0840(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_175;                                   // 0x0850(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_float*     _ExprResult_176;                                   // 0x0860(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_177;                              // 0x0868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_178;                          // 0x0870(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_179;                                   // 0x0880(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_float*     _ExprResult_180;                                   // 0x0890(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_181;                              // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_182;                          // 0x08A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_183;                                   // 0x08B0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_float*     _ExprResult_184;                                   // 0x08C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_185;                              // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_186;                          // 0x08D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_187;                                   // 0x08E0(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_float*     _ExprResult_188;                                   // 0x08F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_189;                              // 0x08F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_190;                          // 0x0900(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_191;                                   // 0x0910(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_float*     _ExprResult_192;                                   // 0x0920(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_193;                              // 0x0928(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_194;                          // 0x0930(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_195;                                   // 0x0940(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_logic*     _ExprResult_196;                                   // 0x0950(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_197;                              // 0x0958(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_198;                          // 0x0960(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_199;                                   // 0x0970(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_set_params_by_type_const* _ExprResult_200;                                   // 0x0980(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_201;                              // 0x0988(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_202;                          // 0x0990(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_203;                                   // 0x09A0(0x0010)(HasGetValueTypeHash)
	TOptional<class UClass*>                      _ArchetypeFieldValue_204;                          // 0x09B0(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UClass*>                      _ExprResult_205;                                   // 0x09C0(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UClass*>                         _ArchetypeFieldValue_206;                          // 0x09D0(0x0010)(ContainsInstancedReference)
	TArray<class UClass*>                         _ExprResult_207;                                   // 0x09E0(0x0010)(ContainsInstancedReference)
	class UDevices_device_function_set_params_by_type_const* _ExprResult_208;                                   // 0x09F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_209;                              // 0x09F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_210;                          // 0x0A00(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_211;                                   // 0x0A10(0x0010)(HasGetValueTypeHash)
	TOptional<class UClass*>                      _ArchetypeFieldValue_212;                          // 0x0A20(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UClass*>                      _ExprResult_213;                                   // 0x0A30(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UClass*>                         _ArchetypeFieldValue_214;                          // 0x0A40(0x0010)(ContainsInstancedReference)
	TArray<class UClass*>                         _ExprResult_215;                                   // 0x0A50(0x0010)(ContainsInstancedReference)
	class UDevices_device_function_set_float*     _ExprResult_216;                                   // 0x0A60(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_217;                              // 0x0A68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_218;                          // 0x0A70(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_219;                                   // 0x0A80(0x0010)(HasGetValueTypeHash)
	class UDevices_device_function_get_agent*     _ExprResult_220;                                   // 0x0A90(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_221;                              // 0x0A98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ArchetypeFieldValue_222;                          // 0x0AA0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_223;                                   // 0x0AB0(0x0010)(HasGetValueTypeHash)
};

// Function vehicle_spawner_device.vehicle_spawner_device._L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RApplyOffRoadTires
// 0x0068 (0x0068 - 0x0000)
struct vehicle_spawner_device__L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RApplyOffRoadTires final
{
public:
	struct vehicle_spawner_device::Ftuple_L_R     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct vehicle_spawner_device::Ftuple_L_R     _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct vehicle_spawner_device::Ftuple_L_R     _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function vehicle_spawner_device.vehicle_spawner_device._L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RAssignDriver_L_Nagent_R
// 0x0058 (0x0058 - 0x0000)
struct vehicle_spawner_device__L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RAssignDriver_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
};

// Function vehicle_spawner_device.vehicle_spawner_device._L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RDestroyVehicle
// 0x0068 (0x0068 - 0x0000)
struct vehicle_spawner_device__L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RDestroyVehicle final
{
public:
	struct vehicle_spawner_device::Ftuple_L_R     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct vehicle_spawner_device::Ftuple_L_R     _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct vehicle_spawner_device::Ftuple_L_R     _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function vehicle_spawner_device.vehicle_spawner_device._L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RDisable
// 0x0068 (0x0068 - 0x0000)
struct vehicle_spawner_device__L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RDisable final
{
public:
	struct vehicle_spawner_device::Ftuple_L_R     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct vehicle_spawner_device::Ftuple_L_R     _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct vehicle_spawner_device::Ftuple_L_R     _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function vehicle_spawner_device.vehicle_spawner_device._L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_REnable
// 0x0068 (0x0068 - 0x0000)
struct vehicle_spawner_device__L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_REnable final
{
public:
	struct vehicle_spawner_device::Ftuple_L_R     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct vehicle_spawner_device::Ftuple_L_R     _ExprResult_2;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function*               __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct vehicle_spawner_device::Ftuple_L_R     _ExprResult_5;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function vehicle_spawner_device.vehicle_spawner_device._L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RGetDriver
// 0x0080 (0x0080 - 0x0000)
struct vehicle_spawner_device__L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RGetDriver final
{
public:
	struct vehicle_spawner_device::Ftuple_L_R     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class USimulation_agent*, true>     RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResultStack_0;                                // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResult_1;                                     // 0x0018(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UDevices_device_function_get_agent*     __verse_0x00000000__1;                             // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0028(0x0018)(HasGetValueTypeHash)
	struct vehicle_spawner_device::Ftuple_L_R     _ExprResult_3;                                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class USimulation_agent*, true>     _ExprResultStack_4;                                // 0x0048(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResult_5;                                     // 0x0050(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UDevices_device_function_get_agent*     __verse_0x00000000__2;                             // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0060(0x0018)(HasGetValueTypeHash)
	struct vehicle_spawner_device::Ftuple_L_R     _ExprResult_7;                                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function vehicle_spawner_device.vehicle_spawner_device._L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RGetFuelRemaining
// 0x0060 (0x0060 - 0x0000)
struct vehicle_spawner_device__L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RGetFuelRemaining final
{
public:
	struct vehicle_spawner_device::Ftuple_L_R     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_function_get_float*     __verse_0x00000000__1;                             // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct vehicle_spawner_device::Ftuple_L_R     _ExprResult_1;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function_get_float*     __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
	struct vehicle_spawner_device::Ftuple_L_R     _ExprResult_3;                                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function vehicle_spawner_device.vehicle_spawner_device._L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RGetVehicleHealth
// 0x0060 (0x0060 - 0x0000)
struct vehicle_spawner_device__L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RGetVehicleHealth final
{
public:
	struct vehicle_spawner_device::Ftuple_L_R     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_function_get_float*     __verse_0x00000000__1;                             // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct vehicle_spawner_device::Ftuple_L_R     _ExprResult_1;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDevices_device_function_get_float*     __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
	struct vehicle_spawner_device::Ftuple_L_R     _ExprResult_3;                                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function vehicle_spawner_device.vehicle_spawner_device._L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RGetVehicleMaxHealth_L_Nfloat_R
// 0x0058 (0x0058 - 0x0000)
struct vehicle_spawner_device__L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RGetVehicleMaxHealth_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_device_function_set_float*     __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	class UDevices_device_function_set_float*     __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
};

// Function vehicle_spawner_device.vehicle_spawner_device._L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RHasVehicle
// 0x0108 (0x0108 - 0x0000)
struct vehicle_spawner_device__L_2fFortnite_2ecom_2fDevices_2fvehicle__spawner__device_N_RHasVehicle final
{
public:
