#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehicleCosmeticsAudioRuntime

#include "Basic.hpp"

#include "VehicleCosmeticsRuntime_structs.hpp"


namespace SDK::Params
{

// Function VehicleCosmeticsAudioRuntime.VehicleCosmeticsAudioController.BP_OnCosmeticsDataUpdated
// 0x0008 (0x0008 - 0x0000)
struct VehicleCosmeticsAudioController_BP_OnCosmeticsDataUpdated final
{
public:
	const class UVehicleAudioCosmeticData*        CosmeticData;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsAudioRuntime.VehicleCosmeticsAudioController.BP_OnCosmeticsFailed
// 0x0001 (0x0001 - 0x0000)
struct VehicleCosmeticsAudioController_BP_OnCosmeticsFailed final
{
public:
	struct FVehicleCosmeticsFailureInfo           ReasonInfo;                                        // 0x0000(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsAudioRuntime.VehicleCosmeticsAudioController.BP_OnEngineAudioDataLoaded
// 0x0008 (0x0008 - 0x0000)
struct VehicleCosmeticsAudioController_BP_OnEngineAudioDataLoaded final
{
public:
	const class USoundBase*                       Sound;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsAudioRuntime.VehicleCosmeticsAudioController.HandleEngineAudioCosmeticsFailed
// 0x0001 (0x0001 - 0x0000)
struct VehicleCosmeticsAudioController_HandleEngineAudioCosmeticsFailed final
{
public:
	struct FVehicleCosmeticsFailureInfo           ReasonInfo;                                        // 0x0000(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsAudioRuntime.VehicleCosmeticsAudioController.HandleEngineAudioItemUpdated
// 0x0030 (0x0030 - 0x0000)
struct VehicleCosmeticsAudioController_HandleEngineAudioItemUpdated final
{
public:
	TSoftObjectPtr<class UVehicleCosmeticsItemDefinition_EngineAudio> EngineAudioItem;                                   // 0x0000(0x0030)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsAudioRuntime.VehicleCosmeticsAudioController.UpdateAudioData
// 0x0008 (0x0008 - 0x0000)
struct VehicleCosmeticsAudioController_UpdateAudioData final
{
public:
	const class UVehicleAudioCosmeticData*        CosmeticData;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

