#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehicleCosmeticsRuntime

#include "Basic.hpp"

#include "ModularGameplay_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VehicleBouncyChassisRuntime_classes.hpp"
#include "AssembledMeshSystem_classes.hpp"
#include "CosmeticsFrameworkLoadouts_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "VehicleCosmeticsRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class VehicleCosmeticsRuntime.DealershipAssetProfiler
// 0x0050 (0x0470 - 0x0420)
class alignas(0x10) ADealershipAssetProfiler final : public AActor
{
public:
	TArray<class UDealershipProfilerCommand*>     ProfilerCommands;                                  // 0x0420(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDealershipProfilerCommand> CurrentCommand;                                    // 0x0430(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FTransform>                     ProfilerSpawnLocators;                             // 0x0438(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_448[0x28];                                     // 0x0448(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void KickOffProfiling();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DealershipAssetProfiler">();
	}
	static class ADealershipAssetProfiler* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADealershipAssetProfiler>();
	}
};

// Class VehicleCosmeticsRuntime.DealershipProfilerCommand
// 0x0030 (0x0060 - 0x0030)
class UDealershipProfilerCommand : public UObject
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DeinitCommand();
	void InitCommand(const class UObject* WorldContext, const TArray<struct FTransform>& SpawnLocators);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DealershipProfilerCommand">();
	}
	static class UDealershipProfilerCommand* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDealershipProfilerCommand>();
	}
};

// Class VehicleCosmeticsRuntime.DealershipProfilerCommand_Body
// 0x0060 (0x00C0 - 0x0060)
class UDealershipProfilerCommand_Body final : public UDealershipProfilerCommand
{
public:
	float                                         StartDelay;                                        // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CaptureTime;                                       // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortSkeletalMeshActor*>         ProfilingActors;                                   // 0x0070(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<TSoftObjectPtr<class UVehicleCosmeticsItemDefinition>> VehicleCosmeticsItemDefinitions;                   // 0x0080(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	int32                                         CurrentItemIndex;                                  // 0x0090(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVehicleCosmeticsItemDefinition_Body*   CurrentBody;                                       // 0x0098(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCustomizableObjectInstance*            COI;                                               // 0x00A0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginReport();
	void OnCustomizableObjectLoaded();
	void OnItemDefinitionLoaded();
	void TryProfileNextBody();
	void UpdateSkeletalMeshesAndProfileNextBody(const struct FUpdateContext& Result);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DealershipProfilerCommand_Body">();
	}
	static class UDealershipProfilerCommand_Body* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDealershipProfilerCommand_Body>();
	}
};

// Class VehicleCosmeticsRuntime.DealershipProfilerCommand_Booster
// 0x0000 (0x0060 - 0x0060)
class UDealershipProfilerCommand_Booster final : public UDealershipProfilerCommand
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DealershipProfilerCommand_Booster">();
	}
	static class UDealershipProfilerCommand_Booster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDealershipProfilerCommand_Booster>();
	}
};

// Class VehicleCosmeticsRuntime.DealershipProfilerCommand_VehiclePreview
// 0x0000 (0x0060 - 0x0060)
class UDealershipProfilerCommand_VehiclePreview final : public UDealershipProfilerCommand
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DealershipProfilerCommand_VehiclePreview">();
	}
	static class UDealershipProfilerCommand_VehiclePreview* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDealershipProfilerCommand_VehiclePreview>();
	}
};

// Class VehicleCosmeticsRuntime.FortItemVehiclePreviewActor
// 0x00A0 (0x07F0 - 0x0750)
class AFortItemVehiclePreviewActor final : public AFortItemPreviewMultiAngleActor
{
public:
	uint8                                         Pad_750[0x8];                                      // 0x0750(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       ZoomedOutVehicleCameraComponent;                   // 0x0758(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                       ZoomedInVehicleCameraComponent;                    // 0x0760(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                       ZoomedOutWheelCameraComponent;                     // 0x0768(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                       ZoomedInWheelCameraComponent;                      // 0x0770(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                       ZoomedOutBoostCameraComponent;                     // 0x0778(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                       ZoomedInBoostCameraComponent;                      // 0x0780(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                       ZoomedOutDriftTrailCameraComponent;                // 0x0788(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                       ZoomedInDriftTrailCameraComponent;                 // 0x0790(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseSingleConfiguredCamera;                        // 0x0798(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_799[0x3];                                      // 0x0799(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FrameSettingHeightOffset;                          // 0x079C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FrameSettingExpansionOffset;                       // 0x07A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortUICameraFrameTargetBoundingBehavior      FrameSettingBoundingBehavior;                      // 0x07A4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7A5[0x3];                                      // 0x07A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FrameSettingZoomInBoundsScale;                     // 0x07A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideTargetBounds;                             // 0x07AC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7AD[0x3];                                      // 0x07AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortUICameraFrameTargetBounds         OverrideTargetBounds;                              // 0x07B0(0x0020)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UChildActorComponent*                   PreviewVehicleActorComponent;                      // 0x07D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AVehicleCosmeticsPreviewVehicle*        PreviewVehicleActor;                               // 0x07D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7E0[0x10];                                     // 0x07E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleBoostFinished();
	void HandleBoostStarted();
	void HandleDriftTrailStarted();
	void HandleVehicleCosmeticsReady();
	void OnVehicleDriftStarted(const bool bEnableVFX);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemVehiclePreviewActor">();
	}
	static class AFortItemVehiclePreviewActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortItemVehiclePreviewActor>();
	}
};

// Class VehicleCosmeticsRuntime.FortVehicleCosmeticsLevelPreviewActor
// 0x01A8 (0x05C8 - 0x0420)
class AFortVehicleCosmeticsLevelPreviewActor final : public AActor
{
public:
	uint8                                         Pad_420[0x48];                                     // 0x0420(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortVehicleCosmeticsItemDefinition_Body* BodyAsset;                                         // 0x0468(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortVehicleCosmeticsItemDefinition_Booster* BoosterAsset;                                      // 0x0470(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortVehicleCosmeticsItemDefinition_DriftTrail* DriftTrailAsset;                                   // 0x0478(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortVehicleCosmeticsItemDefinition_Skin* SkinAsset;                                         // 0x0480(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortVehicleCosmeticsItemDefinition_Wheel* WheelAsset;                                        // 0x0488(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortItemVehiclePreviewActor*           CosmeticsPreviewActor;                             // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVehicleCosmeticsItemDefinition_Body*   BodyItemDef;                                       // 0x0498(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVehicleCosmeticsItemDefinition_Booster* BoosterItemDef;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVehicleCosmeticsItemDefinition_DriftTrail* DriftTrailItemDef;                                 // 0x04A8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVehicleCosmeticsItemDefinition_Skin*   SkinItemDef;                                       // 0x04B0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVehicleCosmeticsItemDefinition_Wheel*  WheelItemDef;                                      // 0x04B8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bEnableBoost : 1;                                  // 0x04C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEnableDriftTrail : 1;                             // 0x04C0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bEnableAsynchronousLoading : 1;                    // 0x04C0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           BodyAssetTierTag;                                  // 0x04C4(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           BoosterAssetTierTag;                               // 0x04D0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           DriftTrailAssetTierTag;                            // 0x04DC(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           SkinAssetTierTag;                                  // 0x04E8(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           WheelAssetTierTag;                                 // 0x04F4(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           BodyColor;                                         // 0x0500(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           GlowColor;                                         // 0x0510(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 BodyPaintName;                                     // 0x0520(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           SkinColor;                                         // 0x0530(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 SkinName;                                          // 0x0540(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 SkinPaintName;                                     // 0x0550(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 WheelPaintName;                                    // 0x0560(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bCreateBodyPaintedVariants : 1;                    // 0x0570(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bCreateSkinPaintedVariants : 1;                    // 0x0570(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bCreateWheelPaintedVariants : 1;                   // 0x0570(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortVehicleCosmeticsLevelPreviewPaintedVariantCollection> PaintedVariantCollections;                         // 0x0578(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_588[0x40];                                     // 0x0588(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBodyAsset(class UFortVehicleCosmeticsItemDefinition_Body* NewBodyAsset);
	void SetBodyPaintName(const class FString& NewBodyPaintName);
	void SetBodyTierTag(const struct FGameplayTag& NewTierTag);
	void SetBoosterAsset(class UFortVehicleCosmeticsItemDefinition_Booster* NewBoosterAsset);
	void SetBoosterEnabled(bool bEnabled);
	void SetBoosterTierTag(const struct FGameplayTag& NewTierTag);
	void SetDriftTrailAsset(class UFortVehicleCosmeticsItemDefinition_DriftTrail* NewDriftTrailAsset);
	void SetDriftTrailEnabled(bool bEnabled);
	void SetDriftTrailTierTag(const struct FGameplayTag& NewTierTag);
	void SetSkinAsset(class UFortVehicleCosmeticsItemDefinition_Skin* NewSkinAsset);
	void SetSkinPaintName(const class FString& NewSkinPaintName);
	void SetSkinTierTag(const struct FGameplayTag& NewTierTag);
	void SetWheelAsset(class UFortVehicleCosmeticsItemDefinition_Wheel* NewWheelAsset);
	void SetWheelPaintName(const class FString& NewWheelPaintName);
	void SetWheelTierTag(const struct FGameplayTag& NewTierTag);
	void TryRebuildCosmetics();

	TArray<class FString> GetPossiblePaintNames() const;
	TArray<class FString> GetPossibleSkinNames() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleCosmeticsLevelPreviewActor">();
	}
	static class AFortVehicleCosmeticsLevelPreviewActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortVehicleCosmeticsLevelPreviewActor>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsAIControllerInterface
// 0x0000 (0x0030 - 0x0030)
class IVehicleCosmeticsAIControllerInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsAIControllerInterface">();
	}
	static class IVehicleCosmeticsAIControllerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IVehicleCosmeticsAIControllerInterface>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsEditorPreviewSettings
// 0x0118 (0x0148 - 0x0030)
class UVehicleCosmeticsEditorPreviewSettings final : public UObject
{
public:
	TArray<struct FVehicleCosmeticsEditorPreviewSlotInfo> PreviewSlotInfos;                                  // 0x0030(0x0010)(ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   FortItemVehiclePreviewClass;                       // 0x0040(0x0030)(Config, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   FortVehicleCosmeticsLevelPreviewClass;             // 0x0070(0x0030)(Config, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   VehicleCosmeticsPreviewClass;                      // 0x00A0(0x0030)(Config, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UDataTable>              PaintTable;                                        // 0x00D0(0x0030)(Config, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           BodySchemaTag;                                     // 0x0100(0x000C)(Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           WheelSchemaTag;                                    // 0x010C(0x000C)(Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           PaintedVariantChannelTag;                          // 0x0118(0x000C)(Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           PaintedVariantNameTag;                             // 0x0124(0x000C)(Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TierVariantChannelTag;                             // 0x0130(0x000C)(Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TierVariantPropertyTag;                            // 0x013C(0x000C)(Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsEditorPreviewSettings">();
	}
	static class UVehicleCosmeticsEditorPreviewSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsEditorPreviewSettings>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsPreviewConfigs
// 0x0110 (0x0158 - 0x0048)
class UVehicleCosmeticsPreviewConfigs final : public UPrimaryDataAsset
{
public:
	TSoftClassPtr<class UClass>                   VehiclePreviewActorClass;                          // 0x0048(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   DefaultBoostPreviewActorClass;                     // 0x0078(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   DefaultTrailPreviewActorClass;                     // 0x00A8(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   VehiclePreviewPrefabAssetClass;                    // 0x00D8(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, TSoftObjectPtr<class UFortVehicleCosmeticsItemDefinition>> VehiclePreviewDefaultPreviewBody;                  // 0x0108(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsPreviewConfigs">();
	}
	static class UVehicleCosmeticsPreviewConfigs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsPreviewConfigs>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsPreviewVehicle
// 0x00C0 (0x2440 - 0x2380)
class AVehicleCosmeticsPreviewVehicle final : public AFortAthenaSKVehicle
{
public:
	uint8                                         Pad_2380[0xC0];                                    // 0x2380(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOnBoostApplied();
	void HandleOnDriftTrailApplied();
	void HandleOnVehicleCosmeticsFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsPreviewVehicle">();
	}
	static class AVehicleCosmeticsPreviewVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVehicleCosmeticsPreviewVehicle>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsBlueprintLibrary
// 0x0000 (0x0030 - 0x0030)
class UVehicleCosmeticsBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetMaxSignificanceLOD_BoostFX();
	static int32 GetMaxSignificanceLOD_FrontWheelDriftFX();
	static int32 GetMaxSignificanceLOD_Generic();
	static int32 GetMaxSignificanceLOD_RearWheelDriftFX();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsBlueprintLibrary">();
	}
	static class UVehicleCosmeticsBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsBlueprintLibrary>();
	}
};

// Class VehicleCosmeticsRuntime.FortVehicleCosmeticsItemDefinition
// 0x00D8 (0x09F8 - 0x0920)
class UFortVehicleCosmeticsItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	uint8                                         Pad_920[0x8];                                      // 0x0920(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVehicleCosmeticsItemDefinition> VehicleCosmeticsItemDef;                           // 0x0928(0x0030)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UVehicleCosmeticsItemDefinition>> VehicleCosmeticsItemDefForTiers;                   // 0x0958(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ItemTypeTag;                                       // 0x0968(0x000C)(Edit, DisableEditOnInstance, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_974[0x4];                                      // 0x0974(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVehicleCosmeticsPreviewConfigs> PreviewConfig;                                     // 0x0978(0x0030)(Config, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FVehicleCosmeticsRestrictionDefinition> RestrictionDefinitions;                            // 0x09A8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortVehicleCosmeticsItemDefinition> ItemPreviewVehicleBody;                            // 0x09B8(0x0030)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FCosmeticCustomizationInfo>     ItemPreviewBodyVariantOverrides;                   // 0x09E8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleCosmeticsItemDefinition">();
	}
	static class UFortVehicleCosmeticsItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleCosmeticsItemDefinition>();
	}
};

// Class VehicleCosmeticsRuntime.FortVehicleCosmeticsItemDefinition_Body
// 0x0000 (0x09F8 - 0x09F8)
class UFortVehicleCosmeticsItemDefinition_Body final : public UFortVehicleCosmeticsItemDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleCosmeticsItemDefinition_Body">();
	}
	static class UFortVehicleCosmeticsItemDefinition_Body* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleCosmeticsItemDefinition_Body>();
	}
};

// Class VehicleCosmeticsRuntime.FortVehicleCosmeticsItemDefinition_Booster
// 0x0000 (0x09F8 - 0x09F8)
class UFortVehicleCosmeticsItemDefinition_Booster final : public UFortVehicleCosmeticsItemDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleCosmeticsItemDefinition_Booster">();
	}
	static class UFortVehicleCosmeticsItemDefinition_Booster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleCosmeticsItemDefinition_Booster>();
	}
};

// Class VehicleCosmeticsRuntime.FortVehicleCosmeticsItemDefinition_DriftTrail
// 0x0000 (0x09F8 - 0x09F8)
class UFortVehicleCosmeticsItemDefinition_DriftTrail final : public UFortVehicleCosmeticsItemDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleCosmeticsItemDefinition_DriftTrail">();
	}
	static class UFortVehicleCosmeticsItemDefinition_DriftTrail* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleCosmeticsItemDefinition_DriftTrail>();
	}
};

// Class VehicleCosmeticsRuntime.FortVehicleCosmeticsItemDefinition_EngineAudio
// 0x0000 (0x09F8 - 0x09F8)
class UFortVehicleCosmeticsItemDefinition_EngineAudio final : public UFortVehicleCosmeticsItemDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleCosmeticsItemDefinition_EngineAudio">();
	}
	static class UFortVehicleCosmeticsItemDefinition_EngineAudio* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleCosmeticsItemDefinition_EngineAudio>();
	}
};

// Class VehicleCosmeticsRuntime.FortVehicleCosmeticsItemDefinition_Skin
// 0x0000 (0x09F8 - 0x09F8)
class UFortVehicleCosmeticsItemDefinition_Skin final : public UFortVehicleCosmeticsItemDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleCosmeticsItemDefinition_Skin">();
	}
	static class UFortVehicleCosmeticsItemDefinition_Skin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleCosmeticsItemDefinition_Skin>();
	}
};

// Class VehicleCosmeticsRuntime.FortVehicleCosmeticsItemDefinition_Wheel
// 0x0000 (0x09F8 - 0x09F8)
class UFortVehicleCosmeticsItemDefinition_Wheel final : public UFortVehicleCosmeticsItemDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleCosmeticsItemDefinition_Wheel">();
	}
	static class UFortVehicleCosmeticsItemDefinition_Wheel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleCosmeticsItemDefinition_Wheel>();
	}
};

// Class VehicleCosmeticsRuntime.FortVehicleCosmeticsVariantTokenType
// 0x0000 (0x0560 - 0x0560)
class UFortVehicleCosmeticsVariantTokenType final : public UFortVariantTokenType
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleCosmeticsVariantTokenType">();
	}
	static class UFortVehicleCosmeticsVariantTokenType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleCosmeticsVariantTokenType>();
	}
};

// Class VehicleCosmeticsRuntime.PlayerCustomizableObjectCacheComponent
// 0x0050 (0x0128 - 0x00D8)
class UPlayerCustomizableObjectCacheComponent final : public UPlayerStateComponent
{
public:
	TMap<TSubclassOf<class AFortAthenaVehicle>, class UCustomizableObjectInstance*> CachedInstanceMap;                                 // 0x00D8(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void OnPlayerDisconnected(class AFortPlayerStateAthena* PlayerState, bool bIsDisconnected);
	void OnSeamlessTravelStart(class UWorld* CurrentWorld, const class FString& LevelName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerCustomizableObjectCacheComponent">();
	}
	static class UPlayerCustomizableObjectCacheComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerCustomizableObjectCacheComponent>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsActorSpawnLogic
// 0x0000 (0x0030 - 0x0030)
class UVehicleCosmeticsActorSpawnLogic : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsActorSpawnLogic">();
	}
	static class UVehicleCosmeticsActorSpawnLogic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsActorSpawnLogic>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsActorSpawnLogic_AttachTo
// 0x0010 (0x0040 - 0x0030)
class UVehicleCosmeticsActorSpawnLogic_AttachTo final : public UVehicleCosmeticsActorSpawnLogic
{
public:
	class FName                                   AttachSocket;                                      // 0x0030(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsActorSpawnLogic_AttachTo">();
	}
	static class UVehicleCosmeticsActorSpawnLogic_AttachTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsActorSpawnLogic_AttachTo>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsActorSpawnLogic_AttachToEach
// 0x0010 (0x0040 - 0x0030)
class UVehicleCosmeticsActorSpawnLogic_AttachToEach final : public UVehicleCosmeticsActorSpawnLogic
{
public:
	TArray<class FName>                           AttachSockets;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsActorSpawnLogic_AttachToEach">();
	}
	static class UVehicleCosmeticsActorSpawnLogic_AttachToEach* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsActorSpawnLogic_AttachToEach>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsActorSpawnLogic_Booster
// 0x0000 (0x0030 - 0x0030)
class UVehicleCosmeticsActorSpawnLogic_Booster final : public UVehicleCosmeticsActorSpawnLogic
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsActorSpawnLogic_Booster">();
	}
	static class UVehicleCosmeticsActorSpawnLogic_Booster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsActorSpawnLogic_Booster>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsActor
// 0x0060 (0x0480 - 0x0420)
class AVehicleCosmeticsActor final : public AActor
{
public:
	class UVehicleCosmeticsActorSpawnLogic*       SpawnLogic;                                        // 0x0420(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class AVehicleCosmeticsActor>> CosmeticDependencies;                              // 0x0428(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TScriptInterface<class IFortVehicleInterface> VehicleInterface;                                  // 0x0438(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TScriptInterface<class IVehicleCosmeticsInterface> VehicleCosmeticsInterface;                         // 0x0448(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UActorComponent*                        VehicleCosmeticComponent;                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   SocketAttachedTo;                                  // 0x0460(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         BoosterPortsNum;                                   // 0x046C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAudioGameplayBehavior>     BoostAGBClass;                                     // 0x0470(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAudioGameplayBehavior*                 BoostAGBComponent;                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ApplyCosmetic();
	void BoostFinished();
	void BoostStarted();
	void BP_OnBonusSpeedActivated();
	void BP_OnBonusSpeedDeactivated();
	void BP_OnBoostFinished();
	void BP_OnBoostStarted();
	void BP_OnColorReady(class FName Color, const struct FVehicleCosmeticsAdditionalParameterInfos& AdditionalInfo);
	void BP_OnCosmeticApplied();
	void BP_OnDeactivated();
	void BP_OnDriftFinished();
	void BP_OnDriftStarted();
	void BP_OnVehicleLanded(float LandingForced, bool bLandedKickflip);
	void BP_OnVehicleWheelsLeftGround();
	void ColorReady(const class FName InColor, const struct FVehicleCosmeticsAdditionalParameterInfos& InInfo);
	void DriftFinished();
	void DriftStarted();

	class USkeletalMeshComponent* GetBodyMeshComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsActor">();
	}
	static class AVehicleCosmeticsActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVehicleCosmeticsActor>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsAnimInstance
// 0x00D0 (0x09C0 - 0x08F0)
#pragma pack(push, 0x1)
class alignas(0x10) UVehicleCosmeticsAnimInstance : public UVehicleBouncyChassisAnimInstance
{
public:
	bool                                          bDriftBoostActive;                                 // 0x08F0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUnderthrustActive;                                // 0x08F1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDriftActive;                                      // 0x08F2(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKickflipActive;                                   // 0x08F3(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bJumpActive;                                       // 0x08F4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTurboActive;                                      // 0x08F5(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartlineBoostActive;                             // 0x08F6(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDraftingActive;                                   // 0x08F7(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWorldBonusSpeedApplied;                           // 0x08F8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasTireMod;                                       // 0x08F9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBoosting;                                       // 0x08FA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldWheelSpinForPreview;                        // 0x08FB(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8FC[0x4];                                      // 0x08FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVehicleCosmeticsAnimPreviewSettings   PreviewSettings;                                   // 0x0900(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         PreviewWheelSpin;                                  // 0x0958(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEnterTransition_IdleToBoostStart;              // 0x095C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEnterTransition_BoostStartToBoostLoop;         // 0x095D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEnterTransition_BoostLoopToBoostEnd;           // 0x095E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEnterTransition_BoostEndToIdle;                // 0x095F(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCachedAnimRelevancyData               BoostStartToBoostLoopRelevancyData;                // 0x0960(0x0024)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FCachedAnimRelevancyData               BoostEndToIdleRelevancyData;                       // 0x0984(0x0024)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	float                                         BoostStartToBoostLoopRemainingTimeThreshold;       // 0x09A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostEndToIdleRemainingTimeThreshold;              // 0x09AC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVehicleCosmeticsAssembledMeshUserComponent* CachedCosmeticsComponent;                          // 0x09B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsAnimInstance">();
	}
	static class UVehicleCosmeticsAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsAnimInstance>();
	}
};
#pragma pack(pop)

// Class VehicleCosmeticsRuntime.VehicleCosmeticsAssembledMeshUserComponent
// 0x0830 (0x0970 - 0x0140)
class UVehicleCosmeticsAssembledMeshUserComponent final : public UAssembledMeshUserComponent
{
public:
	uint8                                         Pad_140[0x28];                                     // 0x0140(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizableObjectInstance*            TempCustomizableObjectInstance;                    // 0x0168(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_170[0x30];                                     // 0x0170(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FReplicatedCosmeticLoadoutData         OwningCosmeticLoadoutData;                         // 0x01A0(0x0020)(Net, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C0[0x10];                                     // 0x01C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVehicleCosmeticsDefaultLoadoutInfo> DefaultLoadoutInfos;                               // 0x01D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1E0[0x1];                                      // 0x01E0(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bVehicleCosmeticsEnabled;                          // 0x01E1(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AVehicleCosmeticsActor*>         SpawnedCosmeticActors_Body;                        // 0x01E8(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class AVehicleCosmeticsActor*>         SpawnedCosmeticActors_Wheel;                       // 0x01F8(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class AVehicleCosmeticsActor*>         SpawnedCosmeticActors_Booster;                     // 0x0208(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_218[0x10];                                     // 0x0218(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AVehicleCosmeticsActor*>         SpawnedCosmeticActors_DriftTrail;                  // 0x0228(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_238[0x10];                                     // 0x0238(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AVehicleCosmeticsActor*>         SpawnedCosmeticActors_Skin;                        // 0x0248(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class FName, bool>                       HasBeenCustomizedMap;                              // 0x0258(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<int32, class UAssembledMeshSchema*>      MeshPartDataMap;                                   // 0x02A8(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F8[0x4E8];                                    // 0x02F8(0x04E8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTirePopReplacementInfo>        TirePopReplacementInfos;                           // 0x07E0(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      LoadoutSlotTagQuery;                               // 0x07F0(0x0048)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_838[0x8];                                      // 0x0838(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AVehicleCosmeticsActor* CosmeticActor)> OnCosmeticActorSpawned;                            // 0x0840(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CustomizationEnabled;                              // 0x0850(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CosmeticsLoadoutFXLoopTime;                        // 0x0888(0x0038)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(TSoftObjectPtr<class UVehicleCosmeticsItemDefinition_EngineAudio> Item)> OnEngineAudioUpdated;                              // 0x08C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FVehicleCosmeticsFailureInfo& ReasonInfo)> OnVehicleCosmeticsFailed;                          // 0x08D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_8E0[0x90];                                     // 0x08E0(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientOnCosmeticsFailed(const struct FVehicleCosmeticsFailureInfo& ReasonInfo);
	void HandleBeginVehicleCosmetics();
	void HandleBodyPhysicsChanges();
	void HandleBoostFinished();
	void HandleBoostStarted();
	void HandleDriftFinished();
	void HandleDriftStarted(const bool bEnableVFX);
	void HandleForceApplyVehicleCosmetics(const struct FSpawnerInfoForcedCosmetics& ForcedCosmetics);
	void HandleModApplied(const class AFortAthenaVehicle* Vehicle, const struct FGameplayTag& ModTag);
	void HandleOnExplode(const class AController* LastDamageInstigator, class AFortAthenaVehicle* Vehicle);
	void HandleTirePopped(const int32 TireIndex);
	void HandleTireRepaired(const int32 TireIndex);
	void OnRep_OwningCosmeticsLoadoutData();
	void SetVehicleCosmeticsEnabled(const bool bEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsAssembledMeshUserComponent">();
	}
	static class UVehicleCosmeticsAssembledMeshUserComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsAssembledMeshUserComponent>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager
// 0x0000 (0x0030 - 0x0030)
class UVehicleCosmeticsCheatManager final : public UChildCheatManager
{
public:
	void ClearVehicleCosmeticsLoadout();
	void CustomizeAllVehicles(const class FString& BodyName, const class FString& WheelName, const class FString& SkinName, const class FString& BoosterName, const class FString& DriftTrailName, const class FString& BodyPainted, const class FString& WheelPainted, const class FString& BodyColor, const class FString& SkinColor, const class FString& GlowColor, const class FString& SkinPainted, const class FString& BoosterPainted, const class FString& DriftTrailPainted);
	void CustomizeVehicle(const class FString& BodyName, const class FString& WheelName, const class FString& SkinName, const class FString& BoosterName, const class FString& DriftTrailName, const class FString& BodyPainted, const class FString& WheelPainted, const class FString& BodyColor, const class FString& SkinColor, const class FString& GlowColor, const class FString& SkinPainted, const class FString& BoosterPainted, const class FString& DriftTrailPainted);
	void DumpVehicleCosmeticsComponents();
	void DumpVehicleCosmeticsLoadedAssetCheatNames();
	void DumpVehicleCosmeticsLoadedAssetSkeletalMeshes();
	void DumpVehicleCosmeticsLoadedAssetTemplateIds();
	void DumpVehicleCosmeticsLoadedAssetVariantTokenTypes();
	void DumpVehicleCosmeticsPhysicsShapeCollision();
	void GrantVehicleCosmeticsLoadedAssets(const class FString& CheatName);
	void SetVehicleActiveArchetype(const class FName VehicleArchetypeTagName);
	void SetVehicleCosmetics_BoosterPainted(const class FString& PaintName);
	void SetVehicleCosmetics_DriftTrailPainted(const class FString& PaintName);
	void SetVehicleCosmeticsLoadout(const class FString& BodyName, const class FString& WheelName, const class FString& SkinName, const class FString& BoosterName, const class FString& DriftTrailName, const class FString& BodyPainted, const class FString& WheelPainted, const class FString& BodyColor, const class FString& SkinColor, const class FString& GlowColor, const class FString& SkinPainted, const class FString& BoosterPainted, const class FString& DriftTrailPainted);
	void SetVehicleCosmeticsLoadout_Body(const class FString& BodyName);
	void SetVehicleCosmeticsLoadout_BodyColor(const class FString& BodyColor, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_BodyPainted(const class FString& PaintName, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_Booster(const class FString& BoosterName, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_BoosterPainted(const class FString& PaintName, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_DriftTrail(const class FString& DriftSmokeName, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_DriftTrailPainted(const class FString& PaintName, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_GlowColor(const class FString& GlowColor, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_Skin(const class FString& SkinName, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_SkinColor(const class FString& SkinColor, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_SkinPainted(const class FString& PaintName, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_Wheel(const class FString& WheelName, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_WheelPainted(const class FString& PaintName, class FName VehicleArchetypeTagName);
	void VehicleCosmeticsDriftEnabled(const bool bNewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsCheatManager">();
	}
	static class UVehicleCosmeticsCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsCheatManager>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsInterface
// 0x0000 (0x0030 - 0x0030)
class IVehicleCosmeticsInterface : public IInterface
{
public:
	void ApplyFXParams();

	class FName GetBodyItemName() const;
	float GetDraftingAppliedBonusSpeed() const;
	class FName GetDriftTrailItemName() const;
	class FName GetTurboItemName() const;
	class FName GetWheelItemName() const;
	TArray<class USkeletalMeshComponent*> GetWheelSkeletalMeshComponents() const;
	bool IsDriftBoostActive() const;
	bool IsDrifting() const;
	bool IsJumpAbilityActive() const;
	bool IsKickflipActive() const;
	bool IsStartlineBoostActive() const;
	bool IsTurboActive() const;
	bool IsUnderthrustActive() const;
	bool ShouldWheelSpinForPreview() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsInterface">();
	}
	static class IVehicleCosmeticsInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IVehicleCosmeticsInterface>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsItemDefinition
// 0x0030 (0x02A0 - 0x0270)
class UVehicleCosmeticsItemDefinition : public UAssembledMeshSchema
{
public:
	TArray<TSoftClassPtr<class UClass>>           CosmeticAttachments;                               // 0x0270(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FVehicleCosmeticsCosmeticAttachmentQueryInfo> CosmeticAttachmentQueryInfos;                      // 0x0280(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class FString>                         CheatNames;                                        // 0x0290(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsItemDefinition">();
	}
	static class UVehicleCosmeticsItemDefinition* GetDefaultObj()
	{
