#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehicleCosmeticsRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CosmeticsFrameworkLoadouts_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum VehicleCosmeticsRuntime.EVehicleCosmeticsFailureReason
// NumValues: 0x000B
enum class EVehicleCosmeticsFailureReason : uint8
{
	BodyTypeMismatch                         = 0,
	NoBodyEquipped                           = 1,
	ActiveArchetypeNoBodyEquipped            = 2,
	NoOwningVehicle                          = 3,
	NoLoadoutComponent                       = 4,
	CustomizationDisabled                    = 5,
	LoadoutIsTheSame                         = 6,
	UsingDefaultItem                         = 7,
	NumAllowedIsZero                         = 8,
	Unknown                                  = 9,
	EVehicleCosmeticsFailureReason_MAX       = 10,
};

// ScriptStruct VehicleCosmeticsRuntime.VehicleCosmeticsCustomizableObjectIntInfo
// 0x0018 (0x0018 - 0x0000)
struct FVehicleCosmeticsCustomizableObjectIntInfo final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParameterValue;                                    // 0x000C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.VehicleCosmeticsFailureInfo
// 0x0001 (0x0001 - 0x0000)
struct FVehicleCosmeticsFailureInfo final
{
public:
	EVehicleCosmeticsFailureReason                Reason;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.TirePopInfo
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FTirePopInfo
{
};
#pragma pack(pop)

// ScriptStruct VehicleCosmeticsRuntime.TirePopUsingMaterialParameterInfo
// 0x0020 (0x0020 - 0x0000)
struct FTirePopUsingMaterialParameterInfo final : public FTirePopInfo
{
public:
	TArray<class FName>                           WheelMaterialSlotNames;                            // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FName                                   WheelMaterialParameterName;                        // 0x0010(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VehicleCosmeticsRuntime.TirePopReplacementInfo
// 0x0008 (0x0008 - 0x0000)
struct FTirePopReplacementInfo final
{
public:
	TWeakObjectPtr<class UStaticMeshComponent>    ReplacementWheelMesh;                              // 0x0000(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.VehicleCosmeticsRestrictionDefinition
// 0x0068 (0x0068 - 0x0000)
struct FVehicleCosmeticsRestrictionDefinition final
{
public:
	struct FGameplayTagQuery                      RequiredTagQuery;                                  // 0x0000(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                   ItemLockerRestrictedText;                          // 0x0048(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VehicleCosmeticsRuntime.TirePopUsingBoneInfo
// 0x00D0 (0x00D0 - 0x0000)
struct FTirePopUsingBoneInfo final : public FTirePopInfo
{
public:
	TSoftObjectPtr<class USkeleton>               WheelSkeletonReference;                            // 0x0000(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneSocketTarget                      WheelBone;                                         // 0x0030(0x00A0)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.VehicleCosmeticsDefaultLoadoutInfo
// 0x0058 (0x0058 - 0x0000)
struct FVehicleCosmeticsDefaultLoadoutInfo final
{
public:
	struct FGameplayTagQuery                      VehicleTagQuery;                                   // 0x0000(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FCosmeticLoadout                       DefaultLoadout;                                    // 0x0048(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.ReplicatedCosmeticLoadoutData
// 0x0020 (0x0020 - 0x0000)
struct FReplicatedCosmeticLoadoutData final
{
public:
	struct FCosmeticLoadout                       CosmeticLoadout;                                   // 0x0000(0x0010)(NativeAccessSpecifierPublic)
	struct FGameplayTag                           PrimaryArchetype;                                  // 0x0010(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VehicleCosmeticsRuntime.VehicleCosmeticsEditorPreviewSlotInfo
// 0x0060 (0x0060 - 0x0000)
struct FVehicleCosmeticsEditorPreviewSlotInfo final
{
public:
	class FName                                   VehicleType;                                       // 0x0000(0x000C)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SlotTag;                                           // 0x000C(0x000C)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCosmeticLoadoutSlotTemplate> SlotTemplate;                                      // 0x0018(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   SchemaTagName;                                     // 0x0048(0x000C)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_54[0xC];                                       // 0x0054(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VehicleCosmeticsRuntime.FortVehicleCosmeticsLevelPreviewPaintedVariant
// 0x0018 (0x0018 - 0x0000)
struct FFortVehicleCosmeticsLevelPreviewPaintedVariant final
{
public:
	class FString                                 PaintName;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortVehicleCosmeticsLevelPreviewActor* PreviewActor;                                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.FortVehicleCosmeticsLevelPreviewPaintedVariantCollection
// 0x0020 (0x0020 - 0x0000)
struct FFortVehicleCosmeticsLevelPreviewPaintedVariantCollection final
{
public:
	TArray<struct FFortVehicleCosmeticsLevelPreviewPaintedVariant> PaintedVariants;                                   // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           PreviewSlotTag;                                    // 0x0010(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VehicleCosmeticsRuntime.WheelAttachInfo
// 0x00B0 (0x00B0 - 0x0000)
struct FWheelAttachInfo final
{
public:
	EVehicleWheelLocations                        WheelLocation;                                     // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneSocketTarget                      WheelSocket;                                       // 0x0010(0x00A0)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.WheelTransformInfo
// 0x0048 (0x0048 - 0x0000)
struct FWheelTransformInfo final
{
public:
	struct FVector                                WheelOffset;                                       // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               WheelRotation;                                     // 0x0018(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                WheelScale;                                        // 0x0030(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.SpinnerWheelInfo
// 0x0010 (0x0010 - 0x0000)
struct FSpinnerWheelInfo final
{
public:
	bool                                          bShouldSpin;                                       // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpinAccelRate;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpinDecelRate;                                     // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpinMaxSpeed;                                      // 0x000C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.MaterialSlotWithParameterInfo
// 0x001C (0x001C - 0x0000)
struct FMaterialSlotWithParameterInfo final
{
public:
	class FName                                   MaterialSlotName;                                  // 0x0000(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MaterialParameterName;                             // 0x000C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaterialParameterValue;                            // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.WheelSetupInfo
// 0x0080 (0x0080 - 0x0000)
struct FWheelSetupInfo final
{
public:
	EVehicleWheelLocations                        WheelLocation;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                WheelOffset;                                       // 0x0008(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               WheelRotation;                                     // 0x0020(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                WheelScale;                                        // 0x0038(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMaterialSlotWithParameterInfo> WheelMaterialSlotInfos;                            // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSpinnerWheelInfo                      SpinnerWheelInfo;                                  // 0x0060(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FVehicleWheelFXInfo                    WheelFXInfo;                                       // 0x0070(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.BoosterAttachInfo
// 0x00B0 (0x00B0 - 0x0000)
struct FBoosterAttachInfo final
{
public:
	struct FBoneSocketTarget                      BoosterSocket;                                     // 0x0000(0x00A0)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         BoosterPortsNum;                                   // 0x00A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0xC];                                       // 0x00A4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VehicleCosmeticsRuntime.TirePopUsingReplacementMeshInfo
// 0x0150 (0x0150 - 0x0000)
struct FTirePopUsingReplacementMeshInfo final : public FTirePopInfo
{
public:
	TSoftObjectPtr<class USkeleton>               WheelSkeletonReference;                            // 0x0000(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneSocketTarget                      WheelBone;                                         // 0x0030(0x00A0)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>             WheelReplacementMesh;                              // 0x00D0(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EVehicleWheelLocations, struct FWheelTransformInfo> WheelTransformInfos;                               // 0x0100(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.WheelInfo
// 0x00A8 (0x00A8 - 0x0000)
struct alignas(0x08) FWheelInfo final
{
public:
	uint8                                         Pad_0[0xA8];                                       // 0x0000(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VehicleCosmeticsRuntime.VehicleCosmeticsBodyPhysicsInfo
// 0x0048 (0x0048 - 0x0000)
struct FVehicleCosmeticsBodyPhysicsInfo final
{
public:
	struct FVector                                CenterOfMass;                                      // 0x0000(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UPhysicsAsset>           PhysicsAssetOverride;                              // 0x0018(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.VehicleCosmeticsBodyPhysicsQueryInfo
// 0x0090 (0x0090 - 0x0000)
struct FVehicleCosmeticsBodyPhysicsQueryInfo final
{
public:
	struct FGameplayTagQuery                      VehicleTagQuery;                                   // 0x0000(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FVehicleCosmeticsBodyPhysicsInfo       PhysicsInfo;                                       // 0x0048(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.VehicleCosmeticsCosmeticAttachmentQueryInfo
// 0x0058 (0x0058 - 0x0000)
struct FVehicleCosmeticsCosmeticAttachmentQueryInfo final
{
public:
	struct FGameplayTagQuery                      VehicleTagQuery;                                   // 0x0000(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UClass>>           CosmeticAttachments;                               // 0x0048(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.VehicleCosmeticsAnimInfo
// 0x0078 (0x0078 - 0x0000)
struct FVehicleCosmeticsAnimInfo final
{
public:
	struct FGameplayTagQuery                      VehicleTagQuery;                                   // 0x0000(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   AnimClass;                                         // 0x0048(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.VehicleCosmeticsBodyWindowInfo
// 0x0028 (0x0028 - 0x0000)
struct FVehicleCosmeticsBodyWindowInfo final
{
public:
	class FName                                   WindowDataTableParameterName;                      // 0x0000(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    WindowRow;                                         // 0x0010(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.VehicleCosmeticsBodyWindowQueryInfo
// 0x0070 (0x0070 - 0x0000)
struct FVehicleCosmeticsBodyWindowQueryInfo final
{
public:
	struct FGameplayTagQuery                      VehicleTagQuery;                                   // 0x0000(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FVehicleCosmeticsBodyWindowInfo        WindowInfo;                                        // 0x0048(0x0028)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.VehicleCosmeticsCustomizableObjectFloatInfo
// 0x0010 (0x0010 - 0x0000)
struct FVehicleCosmeticsCustomizableObjectFloatInfo final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ParameterValue;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.VehicleCosmeticsCustomizableObjectColorInfo
// 0x001C (0x001C - 0x0000)
struct FVehicleCosmeticsCustomizableObjectColorInfo final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ParameterValue;                                    // 0x000C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.VehicleCosmeticsAdditionalParameterInfos
// 0x0030 (0x0030 - 0x0000)
struct FVehicleCosmeticsAdditionalParameterInfos final
{
public:
	TArray<struct FVehicleCosmeticsCustomizableObjectFloatInfo> FloatParameters;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FVehicleCosmeticsCustomizableObjectIntInfo> IntParameters;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FVehicleCosmeticsCustomizableObjectColorInfo> ColorParameters;                                   // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.VehicleCosmeticsBodyAttachmentQueryInfo
// 0x0060 (0x0060 - 0x0000)
struct FVehicleCosmeticsBodyAttachmentQueryInfo final
{
public:
	struct FGameplayTagQuery                      VehicleTagQuery;                                   // 0x0000(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FVehicleCosmeticsCustomizableObjectIntInfo BodyAttachmentInfo;                                // 0x0048(0x0018)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct VehicleCosmeticsRuntime.VehicleCosmeticsAnimPreviewSettings
// 0x0058 (0x0058 - 0x0000)
struct FVehicleCosmeticsAnimPreviewSettings final
{
public:
	float                                         PreviewWheelSpinVelocity;                          // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EVehicleWheelLocations, float>           PreviewWheelTravelOffset;                          // 0x0008(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

}

