#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteGameScript_fort_playspace_player_helper

#include "Basic.hpp"

#include "VerseFortniteInternal_0_structs.hpp"


namespace SDK
{

// VerseStruct VerseFortniteGameScript_fort_playspace_player_helper.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortniteGameScript_fort_playspace_player_helper.tuple_Lfort__playspace__component_Mtype_Lplayer__start__component_M_20player__start__component_R_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lfort__playspace__component_Mtype_Lplayer__start__component_M_20player__start__component_R_R final
{
public:
	class UGame_fort_playspace_component*         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortniteGameScript_fort_playspace_player_helper.tuple_Lplayer__component_Mplayer__start__component_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_Lplayer__component_Mplayer__start__component_R final
{
public:
	class USimulation_player_component*           __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGame_Player_player_start_component*    __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortniteGameScript_fort_playspace_player_helper.tuple_Lplayer_Mfloat_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lplayer_Mfloat_R final
{
public:
	class USimulation_player*                     __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortniteGameScript_fort_playspace_player_helper.tuple_Lplayer_Mfort__item__definition_Mint_Mlogic_R
// 0x0020 (0x0020 - 0x0000)
struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_Lplayer_Mfort__item__definition_Mint_Mlogic_R final
{
public:
	class USimulation_player*                     __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGame_fort_item_definition*             __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xF64C4596_Elem3 : 1;                      // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};

// VerseStruct VerseFortniteGameScript_fort_playspace_player_helper.tuple_Lplayer_Mlogic_Mlogic_Mlogic_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_Lplayer_Mlogic_Mlogic_Mlogic_R final
{
public:
	class USimulation_player*                     __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         __verse_0x7D844C3C_Elem1 : 1;                      // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_8_1 : 7;                                    // 0x0008(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x932BF92E_Elem2 : 1;                      // 0x0009(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_9_1 : 7;                                    // 0x0009(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0xF64C4596_Elem3 : 1;                      // 0x000A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};

// VerseStruct VerseFortniteGameScript_fort_playspace_player_helper.tuple_Lplayer_Mlogic_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_Lplayer_Mlogic_R final
{
public:
	class USimulation_player*                     __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         __verse_0x7D844C3C_Elem1 : 1;                      // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};

// VerseStruct VerseFortniteGameScript_fort_playspace_player_helper.tuple_Lplayer_Mplayer__team_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_Lplayer_Mplayer__team_R final
{
public:
	class USimulation_player*                     __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGame_Player_player_team               __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0004)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
};

// VerseStruct VerseFortniteGameScript_fort_playspace_player_helper.tuple_Lplayer_Mplayer_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_Lplayer_Mplayer_R final
{
public:
	class USimulation_player*                     __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_player*                     __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortniteGameScript_fort_playspace_player_helper.tuple_Lplayer_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R
// 0x0018 (0x0018 - 0x0000)
struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_Lplayer_MPlayerAttribute_MPlayerAttributeOperation_Mfloat_R final
{
public:
	class USimulation_player*                     __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EGame_Player_PlayerAttribute                  __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGame_Player_PlayerAttributeOperation         __verse_0x932BF92E_Elem2;                          // 0x0009(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0xF64C4596_Elem3;                          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortniteGameScript_fort_playspace_player_helper.tuple_Lplayer_MPlayerAttribute_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_Lplayer_MPlayerAttribute_R final
{
public:
	class USimulation_player*                     __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EGame_Player_PlayerAttribute                  __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortniteGameScript_fort_playspace_player_helper.tuple_Lvk__component_Mtype_Lvk__component_M_20vk__component_R_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_Lvk__component_Mtype_Lvk__component_M_20vk__component_R_R final
{
public:
	class UEntityComponent*                       __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

}

