#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFramework_test_runner

#include "Basic.hpp"

#include "UnrealEngineExperimental_0_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK
{

// VerseStruct VerseFramework_test_runner.tuple_L_K_Kchar_M_Kchar_M_Kchar_R
// 0x0030 (0x0030 - 0x0000)
struct Ftuple_L_K_Kchar_M_Kchar_M_Kchar_R final
{
public:
	TArray<FVerseStringProperty_>                 __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0020(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct VerseFramework_test_runner::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_L_Kany_Mtuple_L_R_Many_R
// 0x0028 (0x0028 - 0x0000)
struct VerseFramework_test_runner::Ftuple_L_Kany_Mtuple_L_R_Many_R final
{
public:
	TArray<FVerseDynamicProperty_>                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	struct VerseFramework_test_runner::Ftuple_L_R __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        __verse_0x932BF92E_Elem2;                          // 0x0018(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_R
// 0x00A0 (0x00A0 - 0x0000)
struct Ftuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0020(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xF64C4596_Elem3;                          // 0x0030(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x4F74920B_Elem4;                          // 0x0040(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x2A132EB3_Elem5;                          // 0x0050(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xC4BC9BA1_Elem6;                          // 0x0060(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xA1DB2719_Elem7;                          // 0x0070(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xF7CB4441_Elem8;                          // 0x0080(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x92ACF8F9_Elem9;                          // 0x0090(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_R
// 0x0090 (0x0090 - 0x0000)
struct Ftuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0020(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xF64C4596_Elem3;                          // 0x0030(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x4F74920B_Elem4;                          // 0x0040(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x2A132EB3_Elem5;                          // 0x0050(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xC4BC9BA1_Elem6;                          // 0x0060(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xA1DB2719_Elem7;                          // 0x0070(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xF7CB4441_Elem8;                          // 0x0080(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_R
// 0x0080 (0x0080 - 0x0000)
struct Ftuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0020(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xF64C4596_Elem3;                          // 0x0030(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x4F74920B_Elem4;                          // 0x0040(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x2A132EB3_Elem5;                          // 0x0050(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xC4BC9BA1_Elem6;                          // 0x0060(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xA1DB2719_Elem7;                          // 0x0070(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_R
// 0x0070 (0x0070 - 0x0000)
struct Ftuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0020(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xF64C4596_Elem3;                          // 0x0030(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x4F74920B_Elem4;                          // 0x0040(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x2A132EB3_Elem5;                          // 0x0050(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xC4BC9BA1_Elem6;                          // 0x0060(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_R
// 0x0050 (0x0050 - 0x0000)
struct Ftuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_M_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0020(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xF64C4596_Elem3;                          // 0x0030(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x4F74920B_Elem4;                          // 0x0040(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_R
// 0x0040 (0x0040 - 0x0000)
struct VerseFramework_test_runner::Ftuple_L_Kchar_M_Kchar_M_Kchar_M_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0020(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xF64C4596_Elem3;                          // 0x0030(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_L_Kchar_M_Kchar_M_Kchar_R
// 0x0030 (0x0030 - 0x0000)
struct VerseFramework_test_runner::Ftuple_L_Kchar_M_Kchar_M_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0020(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_L_Kchar_M_Kchar_R
// 0x0020 (0x0020 - 0x0000)
struct VerseFramework_test_runner::Ftuple_L_Kchar_M_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R
// 0x0018 (0x0018 - 0x0000)
struct VerseFramework_test_runner::Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<EDiagnostics_log_level>             __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0002)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_L_Kchar_M_QLevel_Nlog__level_R
// 0x0018 (0x0018 - 0x0000)
struct VerseFramework_test_runner::Ftuple_L_Kchar_M_QLevel_Nlog__level_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<EDiagnostics_log_level>             __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0002)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_L_Kchar_Mlogic_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_L_Kchar_Mlogic_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         __verse_0x7D844C3C_Elem1 : 1;                      // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};

// VerseStruct VerseFramework_test_runner.tuple_L_Kfloat_M_Kfloat_M_Kchar_R
// 0x0030 (0x0030 - 0x0000)
struct Ftuple_L_Kfloat_M_Kfloat_M_Kchar_R final
{
public:
	TArray<double>                                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	TArray<double>                                __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, ContainsInstancedReference)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0020(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_L_Kint_M_Kint_M_Kchar_R
// 0x0030 (0x0030 - 0x0000)
struct Ftuple_L_Kint_M_Kint_M_Kchar_R final
{
public:
	TArray<int64>                                 __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	TArray<int64>                                 __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, ContainsInstancedReference)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0020(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_L_Qagent_M_Kchar_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_L_Qagent_M_Kchar_R final
{
public:
	TOptional<class USimulation_agent*, true>     __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_L_Qany_M_Kchar_R
// 0x0028 (0x0028 - 0x0000)
struct Ftuple_L_Qany_M_Kchar_R final
{
public:
	TOptional<FVerseDynamicProperty_>             __verse_0x18E3F084_Elem0;                          // 0x0000(0x0018)(ZeroConstructor, InstancedReference, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0018(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_Lagent_Magent_M_Kchar_R
// 0x0020 (0x0020 - 0x0000)
struct Ftuple_Lagent_Magent_M_Kchar_R final
{
public:
	class USimulation_agent*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_agent*                      __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_Lcreative__object_Mtransform_M_Kchar_M_QTolerance_Nfloat_20_3d_20_2e_2e_2e_M_QTimeout_Nfloat_20_3d_20_2e_2e_2e_R
// 0x00A0 (0x00A0 - 0x0000)
struct Ftuple_Lcreative__object_Mtransform_M_Kchar_M_QTolerance_Nfloat_20_3d_20_2e_2e_2e_M_QTimeout_Nfloat_20_3d_20_2e_2e_2e_R final
{
public:
	class UDevices_creative_object*               __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0060)(InstancedReference, NoDestructor)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0070(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<double>                             __verse_0xF64C4596_Elem3;                          // 0x0080(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<double>                             __verse_0x4F74920B_Elem4;                          // 0x0090(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_Lfloat_Mfloat_M_Kchar_R
// 0x0020 (0x0020 - 0x0000)
struct Ftuple_Lfloat_Mfloat_M_Kchar_R final
{
public:
	double                                        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_Lfort__character_Mvector3_M_Kchar_M_QTolerance_Nfloat_20_3d_20_2e_2e_2e_M_QTimeout_Nfloat_20_3d_20_2e_2e_2e_M_QCompareX_Nlogic_20_3d_20_2e_2e_2e_M_QCompareY_Nlogic_20_3d_20_2e_2e_2e_M_QCompareZ_Nlogic_20_3d_20_2e_2e_2e_R
// 0x0058 (0x0058 - 0x0000)
struct Ftuple_Lfort__character_Mvector3_M_Kchar_M_QTolerance_Nfloat_20_3d_20_2e_2e_2e_M_QTimeout_Nfloat_20_3d_20_2e_2e_2e_M_QCompareX_Nlogic_20_3d_20_2e_2e_2e_M_QCompareY_Nlogic_20_3d_20_2e_2e_2e_M_QCompareZ_Nlogic_20_3d_20_2e_2e_2e_R final
{
public:
	class UObject*                                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0020(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<double>                             __verse_0xF64C4596_Elem3;                          // 0x0030(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<double>                             __verse_0x4F74920B_Elem4;                          // 0x0040(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<uint8>                              __verse_0x2A132EB3_Elem5;                          // 0x0050(0x0002)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<uint8>                              __verse_0xC4BC9BA1_Elem6;                          // 0x0052(0x0002)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<uint8>                              __verse_0xA1DB2719_Elem7;                          // 0x0054(0x0002)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_Lint_Mint_M_Kchar_R
// 0x0020 (0x0020 - 0x0000)
struct Ftuple_Lint_Mint_M_Kchar_R final
{
public:
	int64                                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_Llog__level_M_Kchar_R
// 0x0018 (0x0018 - 0x0000)
struct VerseFramework_test_runner::Ftuple_Llog__level_M_Kchar_R final
{
public:
	EDiagnostics_log_level                        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_Llogic_M_Kchar_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Llogic_M_Kchar_R final
{
public:
	uint8                                         __verse_0x18E3F084_Elem0 : 1;                      // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_Lrotation_Mrotation_R
// 0x0040 (0x0040 - 0x0000)
struct VerseFramework_test_runner::Ftuple_Lrotation_Mrotation_R final
{
public:
	struct FVerseRotation                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0020)(InstancedReference, NoDestructor)
	struct FVerseRotation                         __verse_0x7D844C3C_Elem1;                          // 0x0020(0x0020)(InstancedReference, NoDestructor)
};

// VerseStruct VerseFramework_test_runner.tuple_Ltransform_Mtransform_M_Kchar_M_QTolerance_Nfloat_20_3d_20_2e_2e_2e_R
// 0x00E0 (0x00E0 - 0x0000)
struct Ftuple_Ltransform_Mtransform_M_Kchar_M_QTolerance_Nfloat_20_3d_20_2e_2e_2e_R final
{
public:
	struct FSpatialMath_transform                 __verse_0x18E3F084_Elem0;                          // 0x0000(0x0060)(InstancedReference, NoDestructor)
	struct FSpatialMath_transform                 __verse_0x7D844C3C_Elem1;                          // 0x0060(0x0060)(InstancedReference, NoDestructor)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x00C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<double>                             __verse_0xF64C4596_Elem3;                          // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_Ltransform_Mtransform_Mfloat_R
// 0x00D0 (0x00D0 - 0x0000)
struct Ftuple_Ltransform_Mtransform_Mfloat_R final
{
public:
	struct FSpatialMath_transform                 __verse_0x18E3F084_Elem0;                          // 0x0000(0x0060)(InstancedReference, NoDestructor)
	struct FSpatialMath_transform                 __verse_0x7D844C3C_Elem1;                          // 0x0060(0x0060)(InstancedReference, NoDestructor)
	double                                        __verse_0x932BF92E_Elem2;                          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_runner.tuple_Lvector3_Mvector3_Mfloat_R
// 0x0038 (0x0038 - 0x0000)
struct VerseFramework_test_runner::Ftuple_Lvector3_Mvector3_Mfloat_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0x18E3F084_Elem0;                          // 0x0000(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0x7D844C3C_Elem1;                          // 0x0018(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	double                                        __verse_0x932BF92E_Elem2;                          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

