#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseCamera

#include "Basic.hpp"

#include "VerseCamera_structs.hpp"
#include "VerseGameplayTags_0_structs.hpp"
#include "Verse_structs.hpp"
#include "VerseNative_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK::Params
{

// Function VerseCamera.VerseCamera_camera_director.$InitCDO
// 0x0090 (0x0090 - 0x0000)
struct VerseCamera_camera_director__InitCDO final
{
public:
	TArray<struct FVerseCamera_camera_mode_context> _ExprResult_0;                                     // 0x0000(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0010(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseCamera_camera_mode_context> _ForResult_1;                                      // 0x0020(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_2;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0041(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVerseCamera_camera_mode_context> _ExprResult_5;                                     // 0x0048(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x0058(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseCamera_camera_mode_context> _ForResult_6;                                      // 0x0068(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_7;                                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_8;                                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_9 : 1;                                 // 0x0089(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseCamera.VerseCamera_camera_director._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RAddCameraMode_L_Ncamera__mode__context_R
// 0x0010 (0x0010 - 0x0000)
struct VerseCamera_camera_director__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RAddCameraMode_L_Ncamera__mode__context_R final
{
public:
	struct FVerseCamera_camera_mode_context       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
};

// Function VerseCamera.VerseCamera_camera_director._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RDetermineActiveCameraModes
// 0x0088 (0x0088 - 0x0000)
struct VerseCamera_camera_director__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RDetermineActiveCameraModes final
{
public:
	struct VerseCamera::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVerseCamera_camera_mode_context> RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0018(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseCamera_camera_mode_context> _ForResult_0;                                      // 0x0028(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_1;                                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_2;                                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_3 : 1;                                 // 0x0049(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x0050(0x0010)(ContainsInstancedReference)
	TArray<struct FVerseCamera_camera_mode_context> _ForResult_4;                                      // 0x0060(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_5;                                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_6;                                      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_7 : 1;                                 // 0x0081(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseCamera.VerseCamera_camera_director._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RRemoveCameraMode_L_Ncamera__mode__context_R
// 0x0010 (0x0010 - 0x0000)
struct VerseCamera_camera_director__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RRemoveCameraMode_L_Ncamera__mode__context_R final
{
public:
	struct FVerseCamera_camera_mode_context       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor)
};

// Function VerseCamera.VerseCamera.VerseCamera_camera_mode_context$Factory
// 0x0010 (0x0010 - 0x0000)
struct VerseCamera_VerseCamera_camera_mode_context_Factory final
{
public:
	struct FVerseCamera_camera_mode_context       RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseCamera.VerseCamera.VerseCamera_camera_mode_context$OverrideFactory
// 0x0060 (0x0060 - 0x0000)
struct VerseCamera_VerseCamera_camera_mode_context_OverrideFactory final
{
public:
	struct FVerseCamera_camera_mode_context       RetVal;                                            // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0010(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function VerseCamera.VerseCamera_camera_mode.$InitCDO
// 0x0060 (0x0060 - 0x0000)
struct VerseCamera_camera_mode__InitCDO final
{
public:
	struct FVerseGameplayTag                      _ExprResult_0;                                     // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAssets_camera_rig_asset*               _ExprResult_1;                                     // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_2;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UVerseCamera_camera_operation*, true> _ExprResult_3;                                     // 0x0018(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0020(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0022(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_5;                                // 0x0023(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_6 : 1;                                 // 0x0025(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_7;                                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseGameplayTag                      _ExprResult_8;                                     // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAssets_camera_rig_asset*               _ExprResult_9;                                     // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_10;                               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UVerseCamera_camera_operation*, true> _ExprResult_11;                                    // 0x0048(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__4;                             // 0x0050(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_12 : 1;                                // 0x0052(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_13;                               // 0x0053(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_14 : 1;                                // 0x0055(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_15;                                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_mode._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RGetCameraModeTag
// 0x0010 (0x0010 - 0x0000)
struct VerseCamera_camera_mode__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RGetCameraModeTag final
{
public:
	struct VerseCamera::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVerseCamera_verse_camera_mode_tag*, true> RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_mode._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RGetPriority_L_Naccessor_R
// 0x0010 (0x0010 - 0x0000)
struct VerseCamera_camera_mode__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RGetPriority_L_Naccessor_R final
{
public:
	EVerse_accessor                               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_mode._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RSetPriority_L_Naccessor_M_Nfloat_R
// 0x0010 (0x0010 - 0x0000)
struct VerseCamera_camera_mode__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RSetPriority_L_Naccessor_M_Nfloat_R final
{
public:
	struct VerseCamera::Ftuple_Laccessor_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_behavior_component.$InitCDO
// 0x0030 (0x0030 - 0x0000)
struct VerseCamera_camera_behavior_component__InitCDO final
{
public:
	uint8                                         _ExprResult_0 : 1;                                 // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerseCamera_camera_director_priority_list* _ExprResult_1;                                     // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_2;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_3 : 1;                                 // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerseCamera_camera_director_priority_list* _ExprResult_4;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_behavior_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct VerseCamera_camera_behavior_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient final
{
public:
	struct VerseCamera::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseCamera.VerseCamera_camera_behavior_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__behavior__component_N_RGetCameraDirector_L_Naccessor_R
// 0x0010 (0x0010 - 0x0000)
struct VerseCamera_camera_behavior_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__behavior__component_N_RGetCameraDirector_L_Naccessor_R final
{
public:
	EVerse_accessor                               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerseCamera_camera_director*           RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_behavior_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__behavior__component_N_RSetCameraDirector_L_Naccessor_M_Ncamera__director_R
// 0x0010 (0x0010 - 0x0000)
struct VerseCamera_camera_behavior_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__behavior__component_N_RSetCameraDirector_L_Naccessor_M_Ncamera__director_R final
{
public:
	struct Ftuple_Laccessor_Mcamera__director_R   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct VerseCamera_camera_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient final
{
public:
	struct VerseCamera::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseCamera.VerseCamera_camera_director_priority_list._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RDetermineActiveCameraModes
// 0x0018 (0x0018 - 0x0000)
struct VerseCamera_camera_director_priority_list__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RDetermineActiveCameraModes final
{
public:
	struct VerseCamera::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVerseCamera_camera_mode_context> RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseCamera.VerseCamera_camera_operation.$InitCDO
// 0x0060 (0x0060 - 0x0000)
struct VerseCamera_camera_operation__InitCDO final
{
public:
	class UVerseCamera_camera_operation_initialization_parameters* _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseCamera_camera_operation_input_parameters* _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseCamera_camera_operation_output_parameters* _ExprResult_4;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseCamera_camera_operation_initialization_parameters* _ExprResult_6;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_7;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseCamera_camera_operation_input_parameters* _ExprResult_8;                                     // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_9;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseCamera_camera_operation_output_parameters* _ExprResult_10;                                    // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_11;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_operation._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation_N_RInitialize_L_Ncamera__operation__initialization__parameters_R
// 0x0010 (0x0010 - 0x0000)
struct VerseCamera_camera_operation__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation_N_RInitialize_L_Ncamera__operation__initialization__parameters_R final
{
public:
	class UVerseCamera_camera_operation_initialization_parameters* __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_0;                                     // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_1;                                     // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_operation._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation_N_RUpdate_L_Ncamera__operation__input__parameters_M_Ncamera__operation__output__parameters_R
// 0x0010 (0x0010 - 0x0000)
struct VerseCamera_camera_operation__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation_N_RUpdate_L_Ncamera__operation__input__parameters_M_Ncamera__operation__output__parameters_R final
{
public:
	struct Ftuple_Lcamera__operation__input__parameters_Mcamera__operation__output__parameters_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_operation_input_parameters.$InitCDO
// 0x00D0 (0x00D0 - 0x0000)
struct VerseCamera_camera_operation_input_parameters__InitCDO final
{
public:
	TOptional<class UVerseCamera_camera_behavior_component*, true> _ExprResult_0;                                     // 0x0000(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0008(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x000A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_2;                                // 0x000B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVerseCamera_camera_component*, true> _ExprResult_3;                                     // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0018(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x001A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_5;                                // 0x001B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _ExprResult_6;                                     // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         _ExprResult_7;                                     // 0x0040(0x0020)(NoDestructor)
	double                                        _ExprResult_8;                                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UVerseCamera_camera_behavior_component*, true> _ExprResult_9;                                     // 0x0068(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__5;                             // 0x0070(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_10 : 1;                                // 0x0072(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_11;                               // 0x0073(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVerseCamera_camera_component*, true> _ExprResult_12;                                    // 0x0078(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__7;                             // 0x0080(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_13 : 1;                                // 0x0082(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_14;                               // 0x0083(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _ExprResult_15;                                    // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVerseRotation                         _ExprResult_16;                                    // 0x00A0(0x0020)(NoDestructor)
	double                                        _ExprResult_17;                                    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_operation_input_parameters._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__float_R
// 0x0018 (0x0018 - 0x0000)
struct VerseCamera_camera_operation_input_parameters__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__float_R final
{
public:
	class UVerseCamera_camera_parameter_float*    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<double>                             RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_operation_input_parameters._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__integer_R
// 0x0018 (0x0018 - 0x0000)
struct VerseCamera_camera_operation_input_parameters__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__integer_R final
{
public:
	class UVerseCamera_camera_parameter_integer*  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<int64>                              RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_operation_input_parameters._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__logic_R
// 0x0010 (0x0010 - 0x0000)
struct VerseCamera_camera_operation_input_parameters__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__logic_R final
{
public:
	class UVerseCamera_camera_parameter_logic*    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_operation_input_parameters._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__rotation_R
// 0x0040 (0x0040 - 0x0000)
struct VerseCamera_camera_operation_input_parameters__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__rotation_R final
{
public:
	class UVerseCamera_camera_parameter_rotation* __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FVerseRotation>              RetVal;                                            // 0x0010(0x0030)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
};

// Function VerseCamera.VerseCamera_camera_operation_input_parameters._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__transform_R
// 0x0080 (0x0080 - 0x0000)
struct VerseCamera_camera_operation_input_parameters__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__transform_R final
{
public:
	class UVerseCamera_camera_parameter_transform* __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FSpatialMath_transform>      RetVal;                                            // 0x0010(0x0070)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
};

// Function VerseCamera.VerseCamera_camera_operation_input_parameters._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__vector2_R
// 0x0020 (0x0020 - 0x0000)
struct VerseCamera_camera_operation_input_parameters__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__vector2_R final
{
public:
	class UVerseCamera_camera_parameter_vector2*  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<struct FSpatialMath_vector2>        RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseCamera.VerseCamera_camera_operation_input_parameters._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__vector3_R
// 0x0028 (0x0028 - 0x0000)
struct VerseCamera_camera_operation_input_parameters__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__vector3_R final
{
public:
	class UVerseCamera_camera_parameter_vector3*  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<struct FSpatialMath_vector3>        RetVal;                                            // 0x0008(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseCamera.VerseCamera_camera_output_parameters.$InitCDO
// 0x0100 (0x0100 - 0x0000)
struct VerseCamera_camera_output_parameters__InitCDO final
{
public:
	TOptional<struct FSpatialMath_vector3>        _ExprResult_0;                                     // 0x0000(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0020(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x0022(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_2;                                // 0x0023(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0xB];                                       // 0x0025(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FVerseRotation>              _ExprResult_3;                                     // 0x0030(0x0030)(ZeroConstructor, NoDestructor)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0060(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0062(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_5;                                // 0x0063(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<double>                             _ExprResult_6;                                     // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__5;                             // 0x0078(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_7 : 1;                                 // 0x007A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_8;                                // 0x007B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FSpatialMath_vector3>        _ExprResult_9;                                     // 0x0080(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TOptional<EVerseFalse>                        __verse_0x00000000__7;                             // 0x00A0(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_10 : 1;                                // 0x00A2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_11;                               // 0x00A3(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0xB];                                       // 0x00A5(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FVerseRotation>              _ExprResult_12;                                    // 0x00B0(0x0030)(ZeroConstructor, NoDestructor)
	TOptional<EVerseFalse>                        __verse_0x00000000__9;                             // 0x00E0(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_13 : 1;                                // 0x00E2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_14;                               // 0x00E3(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<double>                             _ExprResult_15;                                    // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__11;                            // 0x00F8(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_16 : 1;                                // 0x00FA(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_17;                               // 0x00FB(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_output_parameters._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RReset__Internal
// 0x0001 (0x0001 - 0x0000)
struct VerseCamera_camera_output_parameters__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RReset__Internal final
{
public:
	struct VerseCamera::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_output_parameters._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__float_M_Nfloat_R
// 0x0018 (0x0018 - 0x0000)
struct VerseCamera_camera_output_parameters__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__float_M_Nfloat_R final
{
public:
	struct Ftuple_Lcamera__variable__float_Mfloat_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_output_parameters._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__integer_M_Nint_R
// 0x0018 (0x0018 - 0x0000)
struct VerseCamera_camera_output_parameters__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__integer_M_Nint_R final
{
public:
	struct Ftuple_Lcamera__variable__integer_Mint_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_output_parameters._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__logic_M_Nlogic_R
// 0x0018 (0x0018 - 0x0000)
struct VerseCamera_camera_output_parameters__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__logic_M_Nlogic_R final
{
public:
	struct Ftuple_Lcamera__variable__logic_Mlogic_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_output_parameters._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__rotation_M_Nrotation_R
// 0x0040 (0x0040 - 0x0000)
struct VerseCamera_camera_output_parameters__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__rotation_M_Nrotation_R final
{
public:
	struct Ftuple_Lcamera__variable__rotation_Mrotation_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0030(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_output_parameters._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__transform_M_Ntransform_R
// 0x0080 (0x0080 - 0x0000)
struct VerseCamera_camera_output_parameters__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__transform_M_Ntransform_R final
{
public:
	struct Ftuple_Lcamera__variable__transform_Mtransform_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0070)(Parm, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0070(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_output_parameters._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__vector2_M_Nvector2_R
// 0x0020 (0x0020 - 0x0000)
struct VerseCamera_camera_output_parameters__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__vector2_M_Nvector2_R final
{
public:
	struct Ftuple_Lcamera__variable__vector2_Mvector2_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0018(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_output_parameters._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__vector3_M_Nvector3_R
// 0x0028 (0x0028 - 0x0000)
struct VerseCamera_camera_output_parameters__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__vector3_M_Nvector3_R final
{
public:
	struct Ftuple_Lcamera__variable__vector3_Mvector3_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0020(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_parameter_float.$InitCDO
// 0x0020 (0x0020 - 0x0000)
struct VerseCamera_camera_parameter_float__InitCDO final
{
public:
	class UAssets_camera_variable_float*          _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAssets_camera_variable_float*          _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_parameter_integer.$InitCDO
// 0x0020 (0x0020 - 0x0000)
struct VerseCamera_camera_parameter_integer__InitCDO final
{
public:
	class UAssets_camera_variable_integer*        _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAssets_camera_variable_integer*        _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_parameter_logic.$InitCDO
// 0x0020 (0x0020 - 0x0000)
struct VerseCamera_camera_parameter_logic__InitCDO final
{
public:
	class UAssets_camera_variable_logic*          _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAssets_camera_variable_logic*          _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_parameter_rotation.$InitCDO
// 0x0060 (0x0060 - 0x0000)
struct VerseCamera_camera_parameter_rotation__InitCDO final
{
public:
	struct FVerseRotation                         _ExprResult_0;                                     // 0x0000(0x0020)(NoDestructor)
	class UAssets_camera_variable_rotation*       _ExprResult_1;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_2;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseRotation                         _ExprResult_3;                                     // 0x0030(0x0020)(NoDestructor)
	class UAssets_camera_variable_rotation*       _ExprResult_4;                                     // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_parameter_transform.$InitCDO
// 0x00E0 (0x00E0 - 0x0000)
struct VerseCamera_camera_parameter_transform__InitCDO final
{
public:
	struct FSpatialMath_transform                 _ExprResult_0;                                     // 0x0000(0x0060)(NoDestructor)
	class UAssets_camera_variable_transform*      _ExprResult_1;                                     // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_2;                                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_transform                 _ExprResult_3;                                     // 0x0070(0x0060)(NoDestructor)
	class UAssets_camera_variable_transform*      _ExprResult_4;                                     // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_parameter_vector2.$InitCDO
// 0x0120 (0x0120 - 0x0000)
struct VerseCamera_camera_parameter_vector2__InitCDO final
{
public:
	struct FSpatialMath_vector2                   _ExprResult_0;                                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_1;                                // 0x0010(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0060(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0070(0x0010)(HasGetValueTypeHash)
	class UAssets_camera_variable_vector2*        _ExprResult_4;                                     // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector2                   _ExprResult_6;                                     // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_7;                                // 0x00A0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_8;                                     // 0x00F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_9;                                     // 0x0100(0x0010)(HasGetValueTypeHash)
	class UAssets_camera_variable_vector2*        _ExprResult_10;                                    // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_11;                               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_parameter_vector3.$InitCDO
// 0x0150 (0x0150 - 0x0000)
struct VerseCamera_camera_parameter_vector3__InitCDO final
{
public:
	struct FSpatialMath_vector3                   _ExprResult_0;                                     // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_1;                                // 0x0018(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0068(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0078(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	class UAssets_camera_variable_vector3*        _ExprResult_5;                                     // 0x0098(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_6;                                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_7;                                     // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_8;                                // 0x00C0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_9;                                     // 0x0110(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_10;                                    // 0x0120(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x0130(0x0010)(HasGetValueTypeHash)
	class UAssets_camera_variable_vector3*        _ExprResult_12;                                    // 0x0140(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_13;                               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

