#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteGameScript_FortSceneObject

#include "Basic.hpp"

#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function VerseFortniteGameScript_FortSceneObject.FortSceneObject._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2fFortSceneObject_N_RMakeFromEntity_L_Nvk__entity_R
// 0x0278 (0x0278 - 0x0000)
struct FortSceneObject__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2fFortSceneObject_N_RMakeFromEntity_L_Nvk__entity_R final
{
public:
	class UVerseEngine_Entity_vk_entity*          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Ufort_scene_object*, true>    RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0010(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         __verse_0x0104D211_AddComponentClasses_2;          // 0x0018(0x0010)(ContainsInstancedReference)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__3;                             // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0038(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0xA82B0967_Position_4;                     // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _FallibleType_2;                                   // 0x0058(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_3;                                // 0x0060(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_4;                                     // 0x0068(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__5;                             // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0078(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* __verse_0x78C70FF3_Rotation_4;                     // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _FallibleType_6;                                   // 0x0098(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_7;                                // 0x00A0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_8;                                     // 0x00A8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__6;                             // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x00B8(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* __verse_0xA376805D_Scale_4;                        // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_scale_component*, true> _FallibleType_10;                                  // 0x00D8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_11;                               // 0x00E0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_12;                                    // 0x00E8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__7;                             // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_13;                                        // 0x00F8(0x0018)(HasGetValueTypeHash)
	class Ufort_scene_object*                     __verse_0x95D09D0E_Result_8;                       // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_14;                               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          _ArchetypeFieldValue_15;                           // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* _ArchetypeFieldValue_16;                           // 0x0128(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* _ArchetypeFieldValue_17;                           // 0x0130(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* _ArchetypeFieldValue_18;                           // 0x0138(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         _ExprResult_19 : 1;                                // 0x0140(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_20;                               // 0x0141(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__10;                            // 0x0143(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         __verse_0x0104D211_AddComponentClasses_11;         // 0x0148(0x0010)(ContainsInstancedReference)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__12;                            // 0x0158(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_21;                         // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_22;                                        // 0x0168(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0xA82B0967_Position_13;                    // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _FallibleType_23;                                  // 0x0188(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_24;                               // 0x0190(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_25;                                    // 0x0198(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__14;                            // 0x01A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_26;                                        // 0x01A8(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* __verse_0x78C70FF3_Rotation_13;                    // 0x01C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _FallibleType_27;                                  // 0x01C8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_28;                               // 0x01D0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_29;                                    // 0x01D8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__15;                            // 0x01E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_30;                                        // 0x01E8(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* __verse_0xA376805D_Scale_13;                       // 0x0200(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_scale_component*, true> _FallibleType_31;                                  // 0x0208(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_32;                               // 0x0210(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_33;                                    // 0x0218(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__16;                            // 0x0220(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_34;                                        // 0x0228(0x0018)(HasGetValueTypeHash)
	class Ufort_scene_object*                     __verse_0x95D09D0E_Result_17;                      // 0x0240(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_35;                               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          _ArchetypeFieldValue_36;                           // 0x0250(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* _ArchetypeFieldValue_37;                           // 0x0258(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* _ArchetypeFieldValue_38;                           // 0x0260(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* _ArchetypeFieldValue_39;                           // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         _ExprResult_40 : 1;                                // 0x0270(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_41;                               // 0x0271(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

