#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteGameScript_fort_game_script_base

#include "Basic.hpp"

#include "VerseColors_structs.hpp"
#include "UnrealEngineExperimental_0_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"


namespace SDK
{

// VerseStruct VerseFortniteGameScript_fort_game_script_base.tuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R
// 0x0040 (0x0040 - 0x0000)
struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_Kchar_M_QDuration_Nfloat_20_3d_20_2e_2e_2e_M_QColor_Ncolor_20_3d_20_2e_2e_2e_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<double>                             __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<struct FColors_color>               __verse_0x932BF92E_Elem2;                          // 0x0020(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};

// VerseStruct VerseFortniteGameScript_fort_game_script_base.tuple_L_Kchar_M_QDuration_Nfloat_M_QColor_Ncolor_R
// 0x0040 (0x0040 - 0x0000)
struct Ftuple_L_Kchar_M_QDuration_Nfloat_M_QColor_Ncolor_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<double>                             __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<struct FColors_color>               __verse_0x932BF92E_Elem2;                          // 0x0020(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};

// VerseStruct VerseFortniteGameScript_fort_game_script_base.tuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R
// 0x0018 (0x0018 - 0x0000)
struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<EDiagnostics_log_level>             __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0002)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortniteGameScript_fort_game_script_base.tuple_L_Kchar_M_QLevel_Nlog__level_R
// 0x0018 (0x0018 - 0x0000)
struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_Kchar_M_QLevel_Nlog__level_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<EDiagnostics_log_level>             __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0002)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortniteGameScript_fort_game_script_base.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortniteGameScript_fort_game_script_base.tuple_Lfort__game__script__base_Mtype_Lvk__component_M_20vk__component_R_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lfort__game__script__base_Mtype_Lvk__component_M_20vk__component_R_R final
{
public:
	class Ufort_game_script_base*                 __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortniteGameScript_fort_game_script_base.tuple_Llog__level_Mtype_Llog__channel_M_20log__channel_R_M_Kchar_Mlogic_Mcolor_Mfloat_R
// 0x0048 (0x0048 - 0x0000)
struct Ftuple_Llog__level_Mtype_Llog__channel_M_20log__channel_R_M_Kchar_Mlogic_Mcolor_Mfloat_R final
{
public:
	EDiagnostics_log_level                        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         __verse_0xF64C4596_Elem3 : 1;                      // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColors_color                          __verse_0x4F74920B_Elem4;                          // 0x0028(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	double                                        __verse_0x2A132EB3_Elem5;                          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortniteGameScript_fort_game_script_base.tuple_Lvector3_M_Kchar_R
// 0x0028 (0x0028 - 0x0000)
struct VerseFortniteGameScript_fort_game_script_base::Ftuple_Lvector3_M_Kchar_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0x18E3F084_Elem0;                          // 0x0000(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0018(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortniteGameScript_fort_game_script_base.tuple_Lvk__component_Mtype_Lvk__component_M_20vk__component_R_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortniteGameScript_fort_game_script_base::Ftuple_Lvk__component_Mtype_Lvk__component_M_20vk__component_R_R final
{
public:
	class UEntityComponent*                       __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

}

