#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteGameScript_fort_game_script_base

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "UnrealEngineExperimental_0_structs.hpp"
#include "VGameplayRst_0_classes.hpp"
#include "VerseNative_0_classes.hpp"
#include "VerseFortniteInternal_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "VerseFortniteGameScript_fort_game_script_base_structs.hpp"


namespace SDK
{

// VerseClass VerseFortniteGameScript_fort_game_script_base.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class VerseFortniteGameScript_fort_game_script_base::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseFortniteGameScript_fort_game_script_base.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseFortniteGameScript_fort_game_script_base::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseFortniteGameScript_fort_game_script_base::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseFortniteGameScript_fort_game_script_base.task_fort_game_script_base$WaitForMatchBeginTimeout
// 0x00B0 (0x0178 - 0x00C8)
class Utask_fort_game_script_base_WaitForMatchBeginTimeout final : public UConcurrency_task
{
public:
	class Ufort_game_script_base*                 _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_0;                                      // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_1;                                 // 0x00E0(0x0018)(HasGetValueTypeHash)
	int64                                         _AsyncResult_2;                                    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_3;                                // 0x0100(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResultStack_4 : 1;                            // 0x0102(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	EVerseTrue                                    _InvokeSureResultDummy_5;                          // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0108(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R _ExprResult_7;                                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_8;                                      // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_9;                                 // 0x0130(0x0018)(HasGetValueTypeHash)
	int64                                         _AsyncResult_10;                                   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_11;                               // 0x0150(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResultStack_12 : 1;                           // 0x0152(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	EVerseTrue                                    _InvokeSureResultDummy_13;                         // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_14;                                        // 0x0158(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R _ExprResult_15;                                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_fort_game_script_base$WaitForMatchBeginTimeout">();
	}
	static class Utask_fort_game_script_base_WaitForMatchBeginTimeout* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_fort_game_script_base_WaitForMatchBeginTimeout>();
	}
};

// VerseClass VerseFortniteGameScript_fort_game_script_base.fort_game_script_base
// 0x0030 (0x0140 - 0x0110)
class Ufort_game_script_base final : public UVGameplayRst_Components_script_component
{
public:
	TOptional<class UGame_fort_playspace_component*, true> __verse_0x6E372923_FortPlayspace;                  // 0x0110(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_building_settings_component*, true> __verse_0x0E407413_FortBuildingSettings;           // 0x0118(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Messaging_debug_command_component*, true> __verse_0xB4C664BA_DebugCommands;                  // 0x0120(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Ufort_playspace_player_helper*, true> __verse_0x4CB321FA_Players;                        // 0x0128(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         __verse_0x30E6F5B4_MatchStarted : 1;               // 0x0130(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0xB5CFB9AF_MatchBeginTimeout;              // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__game__script__base_N_RBeginMatch(const struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__game__script__base_N_RCreateStormController_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	TArray<class UEntityComponent*> _L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__game__script__base_N_RHACK__getAllScriptObjectsOfType_L_NType_20where_20Type_R(class UClass* __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__game__script__base_N_RIsSoloGame(const struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__game__script__base_N_RLogMessage_L_Nlog__level_M_NInChannel_M_N_Kchar_M_Nlogic_M_Ncolor_M_Nfloat_20where_20InChannel_R(const struct Ftuple_Llog__level_Mtype_Llog__channel_M_20log__channel_R_M_Kchar_Mlogic_Mcolor_Mfloat_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__game__script__base_N_ROnInitialize(const struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__game__script__base_N_ROnMatchBegin(const struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__game__script__base_N_ROnPlayerEliminated_L_Nplayer__eliminated__result_R(class UGame_player_eliminated_result* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__game__script__base_N_ROnPlayerJoined_L_Nplayer__component_R(class USimulation_player_component* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__game__script__base_N_ROnPlayerLeft_L_Nplayer__component_R(class USimulation_player_component* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__game__script__base_N_RSetBuildingAllowed(const struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__game__script__base_N_RSetBuildingDisallowed(const struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__game__script__base_N_RToggleBuildingAllowed_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnBegin(const struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnCreate(const struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnPostCreate(const struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* WaitForDebugCommand_L_N_Kchar_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, FVerseStringProperty_ __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* WaitForMatchBegin_L_Nfort__playspace__component_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class UGame_fort_playspace_component* __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* WaitForMatchBeginTimeout(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* WaitForMatchEnd_L_Nfort__playspace__component_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class UGame_fort_playspace_component* __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* WaitForPlayerAdded_L_Nfort__playspace__component_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class UGame_fort_playspace_component* __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* WaitForPlayerEliminated(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* WaitForPlayerRemoved_L_Nfort__playspace__component_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class UGame_fort_playspace_component* __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* WaitForSetupComplete_L_Nfort__playspace__component_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class UGame_fort_playspace_component* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"fort_game_script_base">();
	}
	static class Ufort_game_script_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ufort_game_script_base>();
	}
};

// VerseClass VerseFortniteGameScript_fort_game_script_base.task_fort_game_script_base$WaitForPlayerAdded_L_Nfort__playspace__component_R
// 0x00D0 (0x0198 - 0x00C8)
class Utask_fort_game_script_base_WaitForPlayerAdded_L_Nfort__playspace__component_R final : public UConcurrency_task
{
public:
	class Ufort_game_script_base*                 _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0xBB5C3E3E_TmpPlayer_1;                    // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__2;                             // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_0;                                      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_1;                                 // 0x00F0(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R _ExprResult_2;                                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_3;                                    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_4;                          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0120(0x0018)(HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0xBB5C3E3E_TmpPlayer_3;                    // 0x0138(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__4;                             // 0x0140(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_6;                                      // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_7;                                 // 0x0150(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R _ExprResult_8;                                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_9;                                    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_10;                         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x0180(0x0018)(HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_fort_game_script_base$WaitForPlayerAdded_L_Nfort__playspace__component_R">();
	}
	static class Utask_fort_game_script_base_WaitForPlayerAdded_L_Nfort__playspace__component_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_fort_game_script_base_WaitForPlayerAdded_L_Nfort__playspace__component_R>();
	}
};

// VerseClass VerseFortniteGameScript_fort_game_script_base.task_fort_game_script_base$WaitForDebugCommand_L_N_Kchar_R
// 0x00E8 (0x01B0 - 0x00C8)
class Utask_fort_game_script_base_WaitForDebugCommand_L_N_Kchar_R final : public UConcurrency_task
{
public:
	class Ufort_game_script_base*                 _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0010)(Parm, HasGetValueTypeHash)
	FVerseStringProperty_                         _RetVal;                                           // 0x00E0(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	class UVGameplayRst_Messaging_debug_command_component* __verse_0xA20F68CB_DebugCommandComp_1;             // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Messaging_debug_command_component*, true> _ExprResultStack_0;                                // 0x00F8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Messaging_debug_command_component*, true> _ExprResultStack_1;                                // 0x0100(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Messaging_debug_command_component* __verse_0x00000000__2;                             // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_2;                                      // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_3;                                 // 0x0118(0x0018)(HasGetValueTypeHash)
	int64                                         _AsyncResult_4;                                    // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_5;                                 // 0x0138(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Messaging_debug_command_component* __verse_0xA20F68CB_DebugCommandComp_4;             // 0x0150(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Messaging_debug_command_component*, true> _ExprResultStack_6;                                // 0x0158(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Messaging_debug_command_component*, true> _ExprResultStack_7;                                // 0x0160(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Messaging_debug_command_component* __verse_0x00000000__5;                             // 0x0168(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_8;                                      // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_9;                                 // 0x0178(0x0018)(HasGetValueTypeHash)
	int64                                         _AsyncResult_10;                                   // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_11;                                // 0x0198(0x0018)(HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_fort_game_script_base$WaitForDebugCommand_L_N_Kchar_R">();
	}
	static class Utask_fort_game_script_base_WaitForDebugCommand_L_N_Kchar_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_fort_game_script_base_WaitForDebugCommand_L_N_Kchar_R>();
	}
};

// VerseClass VerseFortniteGameScript_fort_game_script_base.task_fort_game_script_base$WaitForPlayerEliminated
// 0x0100 (0x01C8 - 0x00C8)
class Utask_fort_game_script_base_WaitForPlayerEliminated final : public UConcurrency_task
{
public:
	class Ufort_game_script_base*                 _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGame_fort_playspace_component*         __verse_0x304EEA9E_TmpPlayspace_1;                 // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_0;                                // 0x00E0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_1;                                // 0x00E8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UGame_player_eliminated_result*         __verse_0xBD09FB30_ElimResult_2;                   // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__3;                             // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_2;                                      // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_3;                                 // 0x0108(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R _ExprResult_4;                                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_5;                                    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_6;                          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0138(0x0018)(HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x304EEA9E_TmpPlayspace_4;                 // 0x0150(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_8;                                // 0x0158(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_9;                                // 0x0160(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UGame_player_eliminated_result*         __verse_0xBD09FB30_ElimResult_5;                   // 0x0168(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__6;                             // 0x0170(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_10;                                     // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_11;                                // 0x0180(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R _ExprResult_12;                                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_13;                                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_14;                         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_15;                                        // 0x01B0(0x0018)(HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_fort_game_script_base$WaitForPlayerEliminated">();
	}
	static class Utask_fort_game_script_base_WaitForPlayerEliminated* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_fort_game_script_base_WaitForPlayerEliminated>();
	}
};

// VerseClass VerseFortniteGameScript_fort_game_script_base.task_fort_game_script_base$WaitForMatchBegin_L_Nfort__playspace__component_R
// 0x0100 (0x01C8 - 0x00C8)
class Utask_fort_game_script_base_WaitForMatchBegin_L_Nfort__playspace__component_R final : public UConcurrency_task
{
public:
	class Ufort_game_script_base*                 _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__2;                             // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_0;                                      // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_1;                                 // 0x00E8(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R _ExprResult_2;                                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_3;                                    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_4;                                 // 0x0110(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_5;                          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0130(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R _ExprResult_7;                                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGame_fort_playspace_component*         __verse_0x00000000__4;                             // 0x0150(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_8;                                      // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_9;                                 // 0x0160(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R _ExprResult_10;                                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_11;                                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_12;                                // 0x0188(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_13;                         // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_14;                                        // 0x01A8(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R _ExprResult_15;                                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_fort_game_script_base$WaitForMatchBegin_L_Nfort__playspace__component_R">();
	}
	static class Utask_fort_game_script_base_WaitForMatchBegin_L_Nfort__playspace__component_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_fort_game_script_base_WaitForMatchBegin_L_Nfort__playspace__component_R>();
	}
};

// VerseClass VerseFortniteGameScript_fort_game_script_base.task_fort_game_script_base$WaitForMatchEnd_L_Nfort__playspace__component_R
// 0x0080 (0x0148 - 0x00C8)
class Utask_fort_game_script_base_WaitForMatchEnd_L_Nfort__playspace__component_R final : public UConcurrency_task
{
public:
	class Ufort_game_script_base*                 _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__1;                             // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_0;                                      // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_1;                                 // 0x00E8(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R _ExprResult_2;                                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_3;                                    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__2;                             // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_4;                                      // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_5;                                 // 0x0120(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R _ExprResult_6;                                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_7;                                    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_fort_game_script_base$WaitForMatchEnd_L_Nfort__playspace__component_R">();
	}
	static class Utask_fort_game_script_base_WaitForMatchEnd_L_Nfort__playspace__component_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_fort_game_script_base_WaitForMatchEnd_L_Nfort__playspace__component_R>();
	}
};

// VerseClass VerseFortniteGameScript_fort_game_script_base.task_fort_game_script_base$WaitForPlayerRemoved_L_Nfort__playspace__component_R
// 0x00D0 (0x0198 - 0x00C8)
class Utask_fort_game_script_base_WaitForPlayerRemoved_L_Nfort__playspace__component_R final : public UConcurrency_task
{
public:
	class Ufort_game_script_base*                 _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0xBB5C3E3E_TmpPlayer_1;                    // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__2;                             // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_0;                                      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_1;                                 // 0x00F0(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R _ExprResult_2;                                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_3;                                    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_4;                          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0120(0x0018)(HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0xBB5C3E3E_TmpPlayer_3;                    // 0x0138(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__4;                             // 0x0140(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_6;                                      // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_7;                                 // 0x0150(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R _ExprResult_8;                                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_9;                                    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_10;                         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x0180(0x0018)(HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_fort_game_script_base$WaitForPlayerRemoved_L_Nfort__playspace__component_R">();
	}
	static class Utask_fort_game_script_base_WaitForPlayerRemoved_L_Nfort__playspace__component_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_fort_game_script_base_WaitForPlayerRemoved_L_Nfort__playspace__component_R>();
	}
};

// VerseClass VerseFortniteGameScript_fort_game_script_base.task_fort_game_script_base$WaitForSetupComplete_L_Nfort__playspace__component_R
// 0x0080 (0x0148 - 0x00C8)
class Utask_fort_game_script_base_WaitForSetupComplete_L_Nfort__playspace__component_R final : public UConcurrency_task
{
public:
	class Ufort_game_script_base*                 _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__1;                             // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_0;                                      // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_1;                                 // 0x00E8(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R _ExprResult_2;                                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_3;                                    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__2;                             // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_4;                                      // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_5;                                 // 0x0120(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_game_script_base::Ftuple_L_R _ExprResult_6;                                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_7;                                    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_fort_game_script_base$WaitForSetupComplete_L_Nfort__playspace__component_R">();
	}
	static class Utask_fort_game_script_base_WaitForSetupComplete_L_Nfort__playspace__component_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_fort_game_script_base_WaitForSetupComplete_L_Nfort__playspace__component_R>();
	}
};

}

