#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseQuery_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"
#include "VerseQuery_0_structs.hpp"
#include "VerseGameplayTags_0_structs.hpp"
#include "Verse_structs.hpp"
#include "Entity_0_classes.hpp"
#include "EpicGamesTemporary_0_structs.hpp"


namespace SDK
{

// VerseClass VerseQuery.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class VerseQuery_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseQuery.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseQuery_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseQuery_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseQuery.component_query_iterator_interface
// 0x0000 (0x0030 - 0x0030)
class Ucomponent_query_iterator_interface final : public UObject
{
public:
	TOptional<class Ucomponent*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent__query__iterator__interface_N_RNextValue(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"component_query_iterator_interface">();
	}
	static class Ucomponent_query_iterator_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ucomponent_query_iterator_interface>();
	}
};

// VerseClass VerseQuery._Root
// 0x0000 (0x0030 - 0x0030)
class VerseQuery_0::U_Root final : public UObject
{
public:
	static TOptional<class Uphysics_scene_component*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_RGetPhysicsSceneForEntity_L_Nentity_R(class Uentity* __verse_0xB2CDDD72_Argument);
	static struct Fcollision_channel _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_RMakeCollisionChannel_L_Nint_R(int64 __verse_0xB2CDDD72_Argument);
	static TArray<class Ucomponent*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindComponents_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R(const struct Ftuple_Lentity_Mtuple_L_R_Mtype_Lcomponent_M_20component_R_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Uentity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntities_U_L_Nentity_M_Ntuple_L_R_M_NEntityType_20where_20EntityType_R(const struct Ftuple_Lentity_Mtuple_L_R_Mtype_Lentity_M_20entity_R_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Uentity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesInside_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__volume3_R(const struct Ftuple_Lentity_Mtuple_L_R_Mconvex__volume3_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Uentity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesOriginInside_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__volume3_R(const struct Ftuple_Lentity_Mtuple_L_R_Mconvex__volume3_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Uentity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesOverlapping_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__volume3_R(const struct Ftuple_Lentity_Mtuple_L_R_Mconvex__volume3_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Uentity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesWithComponent_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R(const struct Ftuple_Lentity_Mtuple_L_R_Mtype_Lcomponent_M_20component_R_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Uentity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesWithTag_U_L_Nentity_M_Ntuple_L_R_M_Ntag_R(const struct Ftuple_Lentity_Mtuple_L_R_Mtag_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Ucomponent*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentComponents_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R(const struct Ftuple_Lentity_Mtuple_L_R_Mtype_Lcomponent_M_20component_R_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Uentity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntities_U_L_Nentity_M_Ntuple_L_R_M_NEntityType_20where_20EntityType_R(const struct Ftuple_Lentity_Mtuple_L_R_Mtype_Lentity_M_20entity_R_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Uentity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesInside_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__volume3_R(const struct Ftuple_Lentity_Mtuple_L_R_Mconvex__volume3_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Uentity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesOriginInside_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__volume3_R(const struct Ftuple_Lentity_Mtuple_L_R_Mconvex__volume3_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Uentity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesOverlapping_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__volume3_R(const struct Ftuple_Lentity_Mtuple_L_R_Mconvex__volume3_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Uentity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesWithComponent_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R(const struct Ftuple_Lentity_Mtuple_L_R_Mtype_Lcomponent_M_20component_R_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Uentity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesWithTag_U_L_Nentity_M_Ntuple_L_R_M_Ntag_R(const struct Ftuple_Lentity_Mtuple_L_R_Mtag_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class Uphysics_scene_component*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eGetPhysicsScene_U_L_Nentity_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct VerseQuery_0::Ftuple_Lentity_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static struct Fcollision_channel collision_channel_Factory();
	static struct Fcollision_channel collision_channel_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static struct Fcollision_query_params collision_query_params_Factory();
	static struct Fcollision_query_params collision_query_params_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static struct Foverlap_hit overlap_hit_Factory();
	static struct Foverlap_hit overlap_hit_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static struct Foverlap_hit_container overlap_hit_container_Factory();
	static struct Foverlap_hit_container overlap_hit_container_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static struct Foverlap_result overlap_result_Factory();
	static struct Foverlap_result overlap_result_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static struct Ftrace_hit trace_hit_Factory();
	static struct Ftrace_hit trace_hit_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static struct Ftrace_hit_container trace_hit_container_Factory();
	static struct Ftrace_hit_container trace_hit_container_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseQuery._Root", true>();
	}
	static class VerseQuery_0::U_Root* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseQuery_0::U_Root>();
	}
};

// VerseClass VerseQuery.null_entity_query_iterator
// 0x0000 (0x0030 - 0x0030)
class Unull_entity_query_iterator final : public UObject
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class Uentity*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"null_entity_query_iterator">();
	}
	static class Unull_entity_query_iterator* GetDefaultObj()
	{
		return GetDefaultObjImpl<Unull_entity_query_iterator>();
	}
};

// VerseClass VerseQuery.collision_channel_responses
// 0x0020 (0x0050 - 0x0030)
class Ucollision_channel_responses final : public UObject
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	Ecollision_channel_response _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__channel__responses_N_RGetChannelResponse_L_Ncollision__channel_R(const struct Fcollision_channel& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__channel__responses_N_RSetChannelResponse_L_Ncollision__channel_M_Ncollision__channel__response_R(const struct Ftuple_Lcollision__channel_Mcollision__channel__response_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"collision_channel_responses">();
	}
	static class Ucollision_channel_responses* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ucollision_channel_responses>();
	}
};

// VerseClass VerseQuery.collision_component
// 0x0110 (0x0160 - 0x0050)
class Ucollision_component final : public Ucomponent
{
public:
	class Ucollision_override*                    __verse_0xF8DD4357_CollisionOverride;              // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         __verse_0x245B71B9_SendHitEvents : 1;              // 0x0058(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x4BFA8E15_HitEvent;                       // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         __verse_0x25242D26_SendOverlapEvents : 1;          // 0x0068(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0xE76A7DE7_BeginOverlapEvent;              // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x22B50534_EndOverlapEvent;                // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Ucollision_override*                    __verse_0x8B7A1A4B_InternalCollisionOverride;      // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_88[0x98];                                      // 0x0088(0x0098)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         __verse_0x8892301A_bWantsImplementation : 1;       // 0x0120(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_120_1 : 7;                                  // 0x0120(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x5CDFC2A5_Enabled : 1;                    // 0x0121(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Net, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_122[0x36];                                     // 0x0122(0x0036)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<Ecollision_channel_response>        __verse_0x480529D2_VisibilityChannelResponseOverride; // 0x0158(0x0002)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class Ucollision_override* _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__component_N_RGetCollisionOverride_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	TOptional<class Ucollision_profile*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__component_N_RGetCollisionProfile(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__component_N_ROnRep__Enabled(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__component_N_RSetCollisionOverride_L_Naccessor_M_Ncollision__override_R(const struct Ftuple_Laccessor_Mcollision__override_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__component_N_RSetCollisionProfile_L_Ncollision__profile_R(class Ucollision_profile* __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"collision_component">();
	}
	static class Ucollision_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ucollision_component>();
	}
};

// VerseClass VerseQuery.entity_query_iterator
// 0x0048 (0x0078 - 0x0030)
class Uentity_query_iterator final : public UObject
{
public:
	uint8                                         Pad_30[0x48];                                      // 0x0030(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class Uentity*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"entity_query_iterator">();
	}
	static class Uentity_query_iterator* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uentity_query_iterator>();
	}
};

// VerseClass VerseQuery.collision_override
// 0x0000 (0x0030 - 0x0030)
class Ucollision_override : public UObject
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"collision_override">();
	}
	static class Ucollision_override* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ucollision_override>();
	}
};

// VerseClass VerseQuery.collision_profile
// 0x0028 (0x0058 - 0x0030)
class Ucollision_profile final : public UObject
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	struct Fcollision_channel _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__profile_N_RGetChannel(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__profile_N_RGetName(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Ucollision_channel_responses* _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__profile_N_RGetResponses(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__profile_N_RSetChannel_L_Ncollision__channel_R(const struct Fcollision_channel& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__profile_N_RSetName_L_N_Kchar_R(FVerseStringProperty_ __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__profile_N_RSetResponses_L_Ncollision__channel__responses_R(class Ucollision_channel_responses* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"collision_profile">();
	}
	static class Ucollision_profile* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ucollision_profile>();
	}
};

// VerseClass VerseQuery.entity_query_iterator_interface
// 0x0000 (0x0030 - 0x0030)
class Uentity_query_iterator_interface final : public UObject
{
public:
	TOptional<class Uentity*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"entity_query_iterator_interface">();
	}
	static class Uentity_query_iterator_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uentity_query_iterator_interface>();
	}
};

// VerseClass VerseQuery.entity_query_manager_component
// 0x0008 (0x0058 - 0x0050)
class Uentity_query_manager_component final : public Ucomponent
{
public:
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"entity_query_manager_component">();
	}
	static class Uentity_query_manager_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uentity_query_manager_component>();
	}
};

// VerseClass VerseQuery.NamedCollisionChannels
// 0x0080 (0x00B0 - 0x0030)
class UNamedCollisionChannels final : public UObject
{
public:
	struct Fcollision_channel                     __verse_0x31078CAB_WorldStatic;                    // 0x0030(0x0010)(InstancedReference, NoDestructor)
	struct Fcollision_channel                     __verse_0xCCF262C4_WorldDynamic;                   // 0x0040(0x0010)(InstancedReference, NoDestructor)
	struct Fcollision_channel                     __verse_0xEFBB79EA_Pawn;                           // 0x0050(0x0010)(InstancedReference, NoDestructor)
	struct Fcollision_channel                     __verse_0x2322BFED_Visibility;                     // 0x0060(0x0010)(InstancedReference, NoDestructor)
	struct Fcollision_channel                     __verse_0xAB80757A_Camera;                         // 0x0070(0x0010)(InstancedReference, NoDestructor)
	struct Fcollision_channel                     __verse_0xB23D1958_PhysicsBody;                    // 0x0080(0x0010)(InstancedReference, NoDestructor)
	struct Fcollision_channel                     __verse_0x4BB95041_Vehicle;                        // 0x0090(0x0010)(InstancedReference, NoDestructor)
	struct Fcollision_channel                     __verse_0xE0D148D8_Destructible;                   // 0x00A0(0x0010)(InstancedReference, NoDestructor)

public:
	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NamedCollisionChannels">();
	}
	static class UNamedCollisionChannels* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNamedCollisionChannels>();
	}
};

// VerseClass VerseQuery.no_collision_override
// 0x0000 (0x0030 - 0x0030)
class Uno_collision_override final : public Ucollision_override
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"no_collision_override">();
	}
	static class Uno_collision_override* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uno_collision_override>();
	}
};

// VerseClass VerseQuery.null_component_query_iterator
// 0x0000 (0x0030 - 0x0030)
class Unull_component_query_iterator final : public UObject
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class Ucomponent*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent__query__iterator__interface_N_RNextValue(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"null_component_query_iterator">();
	}
	static class Unull_component_query_iterator* GetDefaultObj()
	{
		return GetDefaultObjImpl<Unull_component_query_iterator>();
	}
};

// VerseClass VerseQuery.physics_scene_component
// 0x0008 (0x0058 - 0x0050)
class Uphysics_scene_component final : public Ucomponent
{
public:
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct Foverlap_hit_container _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fphysics__scene__component_N_ROverlapCollision_L_Ncollision__component_M_Nvector3_M_Nrotation_R(const struct Ftuple_Lcollision__component_Mvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);
	struct Foverlap_hit_container _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fphysics__scene__component_N_ROverlapShape_L_Nconvex__volume3_M_Nvector3_M_Nrotation_M_Ncollision__channel_M_Ncollision__query__params_R(const struct Ftuple_Lconvex__volume3_Mvector3_Mrotation_Mcollision__channel_Mcollision__query__params_R& __verse_0xB2CDDD72_Argument);
	struct Ftrace_hit_container _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fphysics__scene__component_N_RTraceCollision_L_Ncollision__component_M_Nvector3_M_Nvector3_M_Nrotation_R(const struct Ftuple_Lcollision__component_Mvector3_Mvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);
	struct Ftrace_hit_container _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fphysics__scene__component_N_RTraceLine_L_Nvector3_M_Nvector3_M_Ncollision__channel_M_Ncollision__query__params_R(const struct Ftuple_Lvector3_Mvector3_Mcollision__channel_Mcollision__query__params_R& __verse_0xB2CDDD72_Argument);
	struct Ftrace_hit_container _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fphysics__scene__component_N_RTraceShape_L_Nconvex__volume3_M_Nvector3_M_Nvector3_M_Ncollision__channel_M_Ncollision__query__params_R(const struct Ftuple_Lconvex__volume3_Mvector3_Mvector3_Mcollision__channel_Mcollision__query__params_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"physics_scene_component">();
	}
	static class Uphysics_scene_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uphysics_scene_component>();
	}
};

// VerseClass VerseQuery.shape2
// 0x0000 (0x0030 - 0x0030)
class Ushape2 final : public UObject
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"shape2">();
	}
	static class Ushape2* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ushape2>();
	}
};

// VerseClass VerseQuery.shape3
// 0x0000 (0x0030 - 0x0030)
class Ushape3 : public UObject
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"shape3">();
	}
	static class Ushape3* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ushape3>();
	}
};

// VerseClass VerseQuery.slow_component_array_copy_query_iterator
// 0x0018 (0x0048 - 0x0030)
class Uslow_component_array_copy_query_iterator final : public UObject
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class Ucomponent*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent__query__iterator__interface_N_RNextValue(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"slow_component_array_copy_query_iterator">();
	}
	static class Uslow_component_array_copy_query_iterator* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uslow_component_array_copy_query_iterator>();
	}
};

// VerseClass VerseQuery.slow_entity_array_copy_query_iterator
// 0x0018 (0x0048 - 0x0030)
class Uslow_entity_array_copy_query_iterator final : public UObject
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class Uentity*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"slow_entity_array_copy_query_iterator">();
	}
	static class Uslow_entity_array_copy_query_iterator* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uslow_entity_array_copy_query_iterator>();
	}
};

// VerseClass VerseQuery.tag_component
// 0x0020 (0x0070 - 0x0050)
class Utag_component final : public Ucomponent
{
public:
	class UTags_tag_container*                    __verse_0x5C685848_InternalTags;                   // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVerseGameplayTagContainer             __verse_0x322F2385_TagSelector;                    // 0x0058(0x0010)(Edit, InstancedReference, SaveGame)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftag__component_N_RAddTag_L_Ntag_R(class UTags_tag* __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftag__component_N_RGetTags(const struct VerseQuery_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftag__component_N_RRemoveTag_L_Ntag_R(class UTags_tag* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"tag_component">();
	}
	static class Utag_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utag_component>();
	}
};

// VerseClass VerseQuery.volume3
// 0x0000 (0x0030 - 0x0030)
class Uvolume3 : public Ushape3
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"volume3">();
	}
	static class Uvolume3* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uvolume3>();
	}
};

// VerseClass VerseQuery.convex_volume3
// 0x0000 (0x0030 - 0x0030)
class Uconvex_volume3 : public Uvolume3
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fconvex__volume3_N_RContains_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"convex_volume3">();
	}
	static class Uconvex_volume3* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uconvex_volume3>();
	}
};

// VerseClass VerseQuery.axis_aligned_box3
// 0x0030 (0x0060 - 0x0030)
class Uaxis_aligned_box3 final : public Uconvex_volume3
{
public:
	struct FSpatialMath_vector3                   __verse_0xD0BE3FBE_Center;                         // 0x0030(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0xA327BDA5_Extent;                         // 0x0048(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"axis_aligned_box3">();
	}
	static class Uaxis_aligned_box3* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uaxis_aligned_box3>();
	}
};

// VerseClass VerseQuery.sphere3
// 0x0020 (0x0050 - 0x0030)
class Usphere3 final : public Uconvex_volume3
{
public:
	struct FSpatialMath_vector3                   __verse_0xD0BE3FBE_Center;                         // 0x0030(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	double                                        __verse_0xE34F9FAC_Radius;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"sphere3">();
	}
	static class Usphere3* GetDefaultObj()
	{
		return GetDefaultObjImpl<Usphere3>();
	}
};

// VerseClass VerseQuery.volume_collision_override
// 0x0008 (0x0038 - 0x0030)
class Uvolume_collision_override final : public Ucollision_override
{
public:
	class Uconvex_volume3*                        __verse_0xACEB3EE3_CollisionVolume;                // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"volume_collision_override">();
	}
	static class Uvolume_collision_override* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uvolume_collision_override>();
	}
};

}

