#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VersePrototypeGameplay

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK
{

// VerseStruct VersePrototypeGameplay.tuple_L_Knav__grid__node__2d_Mnav__grid__node__2d_R
// 0x0018 (0x0018 - 0x0000)
struct VersePrototypeGameplay::Ftuple_L_Knav__grid__node__2d_Mnav__grid__node__2d_R final
{
public:
	TArray<class Unav_grid_node_2d*>              __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	class Unav_grid_node_2d*                      __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VersePrototypeGameplay.tuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_Mmaterial_R
// 0x0090 (0x0090 - 0x0000)
struct VersePrototypeGameplay::Ftuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_Mmaterial_R final
{
public:
	TArray<class UClass*>                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	struct FSpatialMath_transform                 __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0060)(InstancedReference, NoDestructor)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0070(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UAssets_mesh*                           __verse_0xF64C4596_Elem3;                          // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x4F74920B_Elem4;                          // 0x0088(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VersePrototypeGameplay.tuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_R
// 0x0090 (0x0090 - 0x0000)
struct VersePrototypeGameplay::Ftuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_R final
{
public:
	TArray<class UClass*>                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	struct FSpatialMath_transform                 __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0060)(InstancedReference, NoDestructor)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0070(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UAssets_mesh*                           __verse_0xF64C4596_Elem3;                          // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VersePrototypeGameplay.tuple_L_Ksubtype_Lvk__component_R_Mvector3_Mrotation_Mvector3_M_Kchar_Mmesh_Mmaterial_R
// 0x0090 (0x0090 - 0x0000)
struct VersePrototypeGameplay::Ftuple_L_Ksubtype_Lvk__component_R_Mvector3_Mrotation_Mvector3_M_Kchar_Mmesh_Mmaterial_R final
{
public:
	TArray<class UClass*>                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	struct FSpatialMath_vector3                   __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         __verse_0x932BF92E_Elem2;                          // 0x0030(0x0020)(InstancedReference, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0xF64C4596_Elem3;                          // 0x0050(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         __verse_0x4F74920B_Elem4;                          // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UAssets_mesh*                           __verse_0x2A132EB3_Elem5;                          // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xC4BC9BA1_Elem6;                          // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VersePrototypeGameplay.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct VersePrototypeGameplay::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VersePrototypeGameplay.tuple_Lfloat_Mfloat_R
// 0x0010 (0x0010 - 0x0000)
struct VersePrototypeGameplay::Ftuple_Lfloat_Mfloat_R final
{
public:
	double                                        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VersePrototypeGameplay.tuple_Li__grid__occupancy_Mvector2i_Mvector2i_Mvector2i_R
// 0x0038 (0x0038 - 0x0000)
struct Ftuple_Li__grid__occupancy_Mvector2i_Mvector2i_Mvector2i_R final
{
public:
	class UObject*                                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSpatialMath_vector2i                  __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2i                  __verse_0x932BF92E_Elem2;                          // 0x0018(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2i                  __verse_0xF64C4596_Elem3;                          // 0x0028(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
};

// VerseStruct VersePrototypeGameplay.tuple_Llogic_Mlogic_R
// 0x0002 (0x0002 - 0x0000)
struct VersePrototypeGameplay::Ftuple_Llogic_Mlogic_R final
{
public:
	uint8                                         __verse_0x18E3F084_Elem0 : 1;                      // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_0_1 : 7;                                    // 0x0000(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x7D844C3C_Elem1 : 1;                      // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};

// VerseStruct VersePrototypeGameplay.tuple_Lnav__grid__node__2d_M_K_Knav__grid__node__2d_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lnav__grid__node__2d_M_K_Knav__grid__node__2d_R final
{
public:
	class Unav_grid_node_2d*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<TArray<class Unav_grid_node_2d*>>      __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, ContainsInstancedReference)
};

// VerseStruct VersePrototypeGameplay.tuple_Lnav__grid__node__2d_M_Knav__grid__node__2d_R
// 0x0018 (0x0018 - 0x0000)
struct VersePrototypeGameplay::Ftuple_Lnav__grid__node__2d_M_Knav__grid__node__2d_R final
{
public:
	class Unav_grid_node_2d*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, ContainsInstancedReference)
};

// VerseStruct VersePrototypeGameplay.tuple_Ltransform_M_Kchar_Mmesh_Mmaterial_R
// 0x0080 (0x0080 - 0x0000)
struct VersePrototypeGameplay::Ftuple_Ltransform_M_Kchar_Mmesh_Mmaterial_R final
{
public:
	struct FSpatialMath_transform                 __verse_0x18E3F084_Elem0;                          // 0x0000(0x0060)(InstancedReference, NoDestructor)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0060(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UAssets_mesh*                           __verse_0x932BF92E_Elem2;                          // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xF64C4596_Elem3;                          // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VersePrototypeGameplay.tuple_Ltransform_M_Kchar_Mmesh_R
// 0x0080 (0x0080 - 0x0000)
struct VersePrototypeGameplay::Ftuple_Ltransform_M_Kchar_Mmesh_R final
{
public:
	struct FSpatialMath_transform                 __verse_0x18E3F084_Elem0;                          // 0x0000(0x0060)(InstancedReference, NoDestructor)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0060(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UAssets_mesh*                           __verse_0x932BF92E_Elem2;                          // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VersePrototypeGameplay.tuple_Ltransform_M_Kchar_R
// 0x0070 (0x0070 - 0x0000)
struct VersePrototypeGameplay::Ftuple_Ltransform_M_Kchar_R final
{
public:
	struct FSpatialMath_transform                 __verse_0x18E3F084_Elem0;                          // 0x0000(0x0060)(InstancedReference, NoDestructor)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0060(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VersePrototypeGameplay.tuple_Lvector2i_Mvector2i_Mtype_7b___L_Nvector2i_M_Nvector2i_R_3ctransacts_3e_Nfloat_7d_R
// 0x0038 (0x0038 - 0x0000)
struct Ftuple_Lvector2i_Mvector2i_Mtype_7b___L_Nvector2i_M_Nvector2i_R_3ctransacts_3e_Nfloat_7d_R final
{
public:
	struct FSpatialMath_vector2i                  __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2i                  __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	FVerseFunctionProperty_                       __verse_0x932BF92E_Elem2;                          // 0x0020(0x0018)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VersePrototypeGameplay.tuple_Lvector2i_Mvector2i_R
// 0x0020 (0x0020 - 0x0000)
struct VersePrototypeGameplay::Ftuple_Lvector2i_Mvector2i_R final
{
public:
	struct FSpatialMath_vector2i                  __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector2i                  __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
};

// VerseStruct VersePrototypeGameplay.tuple_Lvector3_M_Kchar_Mmesh_Mmaterial_R
// 0x0038 (0x0038 - 0x0000)
struct VersePrototypeGameplay::Ftuple_Lvector3_M_Kchar_Mmesh_Mmaterial_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0x18E3F084_Elem0;                          // 0x0000(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0018(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UAssets_mesh*                           __verse_0x932BF92E_Elem2;                          // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xF64C4596_Elem3;                          // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VersePrototypeGameplay.tuple_Lvector3_Mrotation_M_Kchar_Mmesh_Mmaterial_R
// 0x0060 (0x0060 - 0x0000)
struct VersePrototypeGameplay::Ftuple_Lvector3_Mrotation_M_Kchar_Mmesh_Mmaterial_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0x18E3F084_Elem0;                          // 0x0000(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         __verse_0x7D844C3C_Elem1;                          // 0x0020(0x0020)(InstancedReference, NoDestructor)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0040(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UAssets_mesh*                           __verse_0xF64C4596_Elem3;                          // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x4F74920B_Elem4;                          // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VersePrototypeGameplay.tuple_Lvector3_Mrotation_Mvector3_M_Kchar_Mmesh_Mmaterial_R
// 0x0080 (0x0080 - 0x0000)
struct VersePrototypeGameplay::Ftuple_Lvector3_Mrotation_Mvector3_M_Kchar_Mmesh_Mmaterial_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0x18E3F084_Elem0;                          // 0x0000(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         __verse_0x7D844C3C_Elem1;                          // 0x0020(0x0020)(InstancedReference, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0x932BF92E_Elem2;                          // 0x0040(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         __verse_0xF64C4596_Elem3;                          // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UAssets_mesh*                           __verse_0x4F74920B_Elem4;                          // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x2A132EB3_Elem5;                          // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VersePrototypeGameplay.tuple_Lvk__entity_M_Ksubtype_Lvk__component_R_R
// 0x0018 (0x0018 - 0x0000)
struct VersePrototypeGameplay::Ftuple_Lvk__entity_M_Ksubtype_Lvk__component_R_R final
{
public:
	class UVerseEngine_Entity_vk_entity*          __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UClass*>                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(InstancedReference, ContainsInstancedReference)
};

}

