#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteGameScript_FortModel

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"


namespace SDK
{

// VerseStruct VerseFortniteGameScript_FortModel.tuple_Llogic_Mlogic_R
// 0x0002 (0x0002 - 0x0000)
struct VerseFortniteGameScript_FortModel::Ftuple_Llogic_Mlogic_R final
{
public:
	uint8                                         __verse_0x18E3F084_Elem0 : 1;                      // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_0_1 : 7;                                    // 0x0000(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x7D844C3C_Elem1 : 1;                      // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};

// VerseStruct VerseFortniteGameScript_FortModel.tuple_Ltransform_M_Kchar_Mmesh_Mmaterial_R
// 0x0080 (0x0080 - 0x0000)
struct VerseFortniteGameScript_FortModel::Ftuple_Ltransform_M_Kchar_Mmesh_Mmaterial_R final
{
public:
	struct FSpatialMath_transform                 __verse_0x18E3F084_Elem0;                          // 0x0000(0x0060)(InstancedReference, NoDestructor)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0060(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UAssets_mesh*                           __verse_0x932BF92E_Elem2;                          // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xF64C4596_Elem3;                          // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortniteGameScript_FortModel.tuple_Ltransform_M_Kchar_Mmesh_R
// 0x0080 (0x0080 - 0x0000)
struct VerseFortniteGameScript_FortModel::Ftuple_Ltransform_M_Kchar_Mmesh_R final
{
public:
	struct FSpatialMath_transform                 __verse_0x18E3F084_Elem0;                          // 0x0000(0x0060)(InstancedReference, NoDestructor)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0060(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UAssets_mesh*                           __verse_0x932BF92E_Elem2;                          // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortniteGameScript_FortModel.tuple_Ltransform_M_Kchar_R
// 0x0070 (0x0070 - 0x0000)
struct VerseFortniteGameScript_FortModel::Ftuple_Ltransform_M_Kchar_R final
{
public:
	struct FSpatialMath_transform                 __verse_0x18E3F084_Elem0;                          // 0x0000(0x0060)(InstancedReference, NoDestructor)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0060(0x0010)(InstancedReference, HasGetValueTypeHash)
};

}

