#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteGameScript_FortModel

#include "Basic.hpp"

#include "VerseFortniteGameScript_FortModel_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function VerseFortniteGameScript_FortModel.FortModel._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2fFortModel_N_RMakeFromEntity_L_Nvk__entity_R
// 0x0418 (0x0418 - 0x0000)
struct FortModel__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2fFortModel_N_RMakeFromEntity_L_Nvk__entity_R final
{
public:
	class UVerseEngine_Entity_vk_entity*          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Ufort_model*, true>           RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0010(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         __verse_0x0104D211_AddComponentClasses_2;          // 0x0018(0x0010)(ContainsInstancedReference)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__3;                             // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0038(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x71AD33A7_Mesh_4;                         // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Geometry_fixed_mesh_component*, true> _FallibleType_2;                                   // 0x0058(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_3;                                // 0x0060(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_4;                                     // 0x0068(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__5;                             // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0078(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__6;                             // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_6;                          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x00A0(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_FortModel::Ftuple_Llogic_Mlogic_R _ExprResult_8;                                     // 0x00B8(0x0002)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x802C815C_Collision_4;                    // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Physics_vk_collision_component*, true> _FallibleType_9;                                   // 0x00C8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_10;                               // 0x00D0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_11;                                    // 0x00D8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__7;                             // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_12;                                        // 0x00E8(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0xA82B0967_Position_4;                     // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _FallibleType_13;                                  // 0x0108(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_14;                               // 0x0110(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_15;                                    // 0x0118(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__8;                             // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_16;                                        // 0x0128(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* __verse_0x78C70FF3_Rotation_4;                     // 0x0140(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _FallibleType_17;                                  // 0x0148(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_18;                               // 0x0150(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_19;                                    // 0x0158(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__9;                             // 0x0160(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_20;                                        // 0x0168(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* __verse_0xA376805D_Scale_4;                        // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_scale_component*, true> _FallibleType_21;                                  // 0x0188(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_22;                               // 0x0190(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_23;                                    // 0x0198(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__10;                            // 0x01A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_24;                                        // 0x01A8(0x0018)(HasGetValueTypeHash)
	class Ufort_model*                            __verse_0x95D09D0E_Result_11;                      // 0x01C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_25;                               // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          _ArchetypeFieldValue_26;                           // 0x01D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          _ExprResult_27;                                    // 0x01D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_28;                               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVGameplayRst_Physics_vk_collision_component* _ArchetypeFieldValue_29;                           // 0x01E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* _ArchetypeFieldValue_30;                           // 0x01F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* _ArchetypeFieldValue_31;                           // 0x01F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* _ArchetypeFieldValue_32;                           // 0x0200(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* _ArchetypeFieldValue_33;                           // 0x0208(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         _ExprResult_34 : 1;                                // 0x0210(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_35;                               // 0x0211(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__13;                            // 0x0213(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         __verse_0x0104D211_AddComponentClasses_14;         // 0x0218(0x0010)(ContainsInstancedReference)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__15;                            // 0x0228(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_36;                         // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_37;                                        // 0x0238(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x71AD33A7_Mesh_16;                        // 0x0250(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Geometry_fixed_mesh_component*, true> _FallibleType_38;                                  // 0x0258(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_39;                               // 0x0260(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_40;                                    // 0x0268(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__17;                            // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_41;                                        // 0x0278(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__18;                            // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_42;                         // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_43;                                        // 0x02A0(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_FortModel::Ftuple_Llogic_Mlogic_R _ExprResult_44;                                    // 0x02B8(0x0002)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x802C815C_Collision_16;                   // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Physics_vk_collision_component*, true> _FallibleType_45;                                  // 0x02C8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_46;                               // 0x02D0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_47;                                    // 0x02D8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__19;                            // 0x02E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_48;                                        // 0x02E8(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0xA82B0967_Position_16;                    // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _FallibleType_49;                                  // 0x0308(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_50;                               // 0x0310(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_51;                                    // 0x0318(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__20;                            // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_52;                                        // 0x0328(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* __verse_0x78C70FF3_Rotation_16;                    // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _FallibleType_53;                                  // 0x0348(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_54;                               // 0x0350(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_55;                                    // 0x0358(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__21;                            // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_56;                                        // 0x0368(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* __verse_0xA376805D_Scale_16;                       // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_scale_component*, true> _FallibleType_57;                                  // 0x0388(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_58;                               // 0x0390(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_59;                                    // 0x0398(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__22;                            // 0x03A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_60;                                        // 0x03A8(0x0018)(HasGetValueTypeHash)
	class Ufort_model*                            __verse_0x95D09D0E_Result_23;                      // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_61;                               // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          _ArchetypeFieldValue_62;                           // 0x03D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          _ExprResult_63;                                    // 0x03D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_64;                               // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVGameplayRst_Physics_vk_collision_component* _ArchetypeFieldValue_65;                           // 0x03E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* _ArchetypeFieldValue_66;                           // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* _ArchetypeFieldValue_67;                           // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* _ArchetypeFieldValue_68;                           // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* _ArchetypeFieldValue_69;                           // 0x0408(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         _ExprResult_70 : 1;                                // 0x0410(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_71;                               // 0x0411(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_FortModel.FortModel._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2fFortModel_N_RMakeFromStaticMesh_L_Ntransform_M_N_Kchar_M_Nmesh_R
// 0x0350 (0x0350 - 0x0000)
struct FortModel__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2fFortModel_N_RMakeFromStaticMesh_L_Ntransform_M_N_Kchar_M_Nmesh_R final
{
public:
	struct VerseFortniteGameScript_FortModel::Ftuple_Ltransform_M_Kchar_Mmesh_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0080)(Parm, HasGetValueTypeHash)
	TOptional<class Ufort_model*, true>           RetVal;                                            // 0x0080(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0088(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVerseEngine_Entity_vk_entity*, true> __verse_0x6BB06783_MaybeObj_2;                     // 0x0090(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0098(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_FortModel::Ftuple_Ltransform_M_Kchar_R _ExprResult_1;                                     // 0x00B0(0x0070)(HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x4F5E77FF_Obj_3;                          // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseEngine_Entity_vk_entity*, true> _ExprResultStack_2;                                // 0x0128(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Ufort_model*, true>           __verse_0x2BD82FE8_MaybeModel_4;                   // 0x0130(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0138(0x0018)(HasGetValueTypeHash)
	class Ufort_model*                            __verse_0x986678F9_Model_5;                        // 0x0150(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Ufort_model*, true>           _ExprResultStack_4;                                // 0x0158(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__6;                             // 0x0160(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_5;                          // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0170(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__7;                             // 0x0188(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_7;                          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x0198(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x00000000__8;                             // 0x01B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_9;                          // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_10;                                        // 0x01C0(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x01D8(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_12 : 1;                                // 0x01E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_13;                               // 0x01E9(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__10;                            // 0x01EB(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVerseEngine_Entity_vk_entity*, true> __verse_0x6BB06783_MaybeObj_11;                    // 0x01F0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_14;                                        // 0x01F8(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_FortModel::Ftuple_Ltransform_M_Kchar_R _ExprResult_15;                                    // 0x0210(0x0070)(HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x4F5E77FF_Obj_12;                         // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseEngine_Entity_vk_entity*, true> _ExprResultStack_16;                               // 0x0288(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Ufort_model*, true>           __verse_0x2BD82FE8_MaybeModel_13;                  // 0x0290(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_17;                                        // 0x0298(0x0018)(HasGetValueTypeHash)
	class Ufort_model*                            __verse_0x986678F9_Model_14;                       // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Ufort_model*, true>           _ExprResultStack_18;                               // 0x02B8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__15;                            // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_19;                         // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_20;                                        // 0x02D0(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__16;                            // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_21;                         // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_22;                                        // 0x02F8(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x00000000__17;                            // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_23;                         // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_24;                                        // 0x0320(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_25;                                    // 0x0338(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_26 : 1;                                // 0x0348(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_27;                               // 0x0349(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_FortModel.FortModel._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2fFortModel_N_RMakeFromStaticMeshAndMaterial_L_Ntransform_M_N_Kchar_M_Nmesh_M_Nmaterial_R
// 0x0250 (0x0250 - 0x0000)
struct FortModel__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2fFortModel_N_RMakeFromStaticMeshAndMaterial_L_Ntransform_M_N_Kchar_M_Nmesh_M_Nmaterial_R final
{
public:
	struct VerseFortniteGameScript_FortModel::Ftuple_Ltransform_M_Kchar_Mmesh_Mmaterial_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0080)(Parm, HasGetValueTypeHash)
	TOptional<class Ufort_model*, true>           RetVal;                                            // 0x0080(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Ufort_model*, true>           __verse_0x2BD82FE8_MaybeModel_1;                   // 0x0088(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0090(0x0018)(HasGetValueTypeHash)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct VerseFortniteGameScript_FortModel::Ftuple_Ltransform_M_Kchar_Mmesh_R _ExprResult_1;                                     // 0x00B0(0x0080)(HasGetValueTypeHash)
	class Ufort_model*                            __verse_0x986678F9_Model_2;                        // 0x0130(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Ufort_model*, true>           _ExprResultStack_2;                                // 0x0138(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__3;                             // 0x0140(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0150(0x0018)(HasGetValueTypeHash)
	TOptional<class Ufort_model*, true>           __verse_0x2BD82FE8_MaybeModel_4;                   // 0x0168(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0170(0x0018)(HasGetValueTypeHash)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct VerseFortniteGameScript_FortModel::Ftuple_Ltransform_M_Kchar_Mmesh_R _ExprResult_6;                                     // 0x0190(0x0080)(HasGetValueTypeHash)
	class Ufort_model*                            __verse_0x986678F9_Model_5;                        // 0x0210(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Ufort_model*, true>           _ExprResultStack_7;                                // 0x0218(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__6;                             // 0x0220(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_8;                          // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x0230(0x0018)(HasGetValueTypeHash)
};

}

