#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteInternal

#include "Basic.hpp"

#include "EntityCore_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "EntityActor_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "VerseFortniteInternal_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VerseFortniteInternal.BuildingActorEntityInteropComponent
// 0x0008 (0x0078 - 0x0070)
class UBuildingActorEntityInteropComponent final : public UEntityComponent
{
public:
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuildingActorEntityInteropComponent">();
	}
	static class UBuildingActorEntityInteropComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuildingActorEntityInteropComponent>();
	}
};

// Class VerseFortniteInternal.VerseFortniteMovementComponentBase
// 0x0000 (0x00F8 - 0x00F8)
class UVerseFortniteMovementComponentBase : public UEntityActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteMovementComponentBase">();
	}
	static class UVerseFortniteMovementComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteMovementComponentBase>();
	}
};

// Class VerseFortniteInternal.FortControllerStateHandlerComponent
// 0x0000 (0x00D8 - 0x00D8)
class UFortControllerStateHandlerComponent final : public UControllerComponent
{
public:
	void NotifyOfStateChange(class FString* State, bool Active);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortControllerStateHandlerComponent">();
	}
	static class UFortControllerStateHandlerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerStateHandlerComponent>();
	}
};

// Class VerseFortniteInternal.FortAthenaMutator_BuildingSettings
// 0x0018 (0x04E8 - 0x04D0)
class AFortAthenaMutator_BuildingSettings final : public AFortAthenaMutator
{
public:
	uint8                                         Pad_4D0[0x18];                                     // 0x04D0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_BuildingSettings">();
	}
	static class AFortAthenaMutator_BuildingSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_BuildingSettings>();
	}
};

// Class VerseFortniteInternal.FortBuildingSettingsComponentBase
// 0x0010 (0x00A8 - 0x0098)
class UFortBuildingSettingsComponentBase : public UEntityEnableableComponent
{
public:
	class AFortAthenaMutator_BuildingSettings*    Mutator;                                           // 0x0098(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPlayerSettingStateInternal                   Building;                                          // 0x00A0(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPlayerSettingStateInternal                   BuildingOnWater;                                   // 0x00A1(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPlayerSettingStateInternal                   Editing;                                           // 0x00A2(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPlayerSettingStateInternal                   EditingHostile;                                    // 0x00A3(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPlayerSettingStateInternal                   TrapPlacement;                                     // 0x00A4(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_Settings();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBuildingSettingsComponentBase">();
	}
	static class UFortBuildingSettingsComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBuildingSettingsComponentBase>();
	}
};

// Class VerseFortniteInternal.FortPlayspaceComponentHelper
// 0x0008 (0x0038 - 0x0030)
class UFortPlayspaceComponentHelper final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandlePlayerDied(class AFortPlayerPawnAthena* FortPlayerPawnAthena);
	void HandlePlayerPawnPossessed(class APawn* Pawn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayspaceComponentHelper">();
	}
	static class UFortPlayspaceComponentHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayspaceComponentHelper>();
	}
};

// Class VerseFortniteInternal.VerseFortniteEntitySubsystem
// 0x0010 (0x0048 - 0x0038)
class UVerseFortniteEntitySubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteEntitySubsystem">();
	}
	static class UVerseFortniteEntitySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteEntitySubsystem>();
	}
};

}

