#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteGameScript_fort_playspace_player_helper

#include "Basic.hpp"

#include "VerseFortniteGameScript_fort_playspace_player_helper_structs.hpp"
#include "VerseNative_structs.hpp"
#include "VerseFortniteInternal_0_structs.hpp"


namespace SDK::Params
{

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper.$InitCDO
// 0x0020 (0x0020 - 0x0000)
struct fort_playspace_player_helper__InitCDO final
{
public:
	TOptional<class UGame_fort_playspace_component*, true> _ExprResult_0;                                     // 0x0000(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0008(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x000A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_2;                                // 0x000B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UGame_fort_playspace_component*, true> _ExprResult_3;                                     // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0018(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x001A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_5;                                // 0x001B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RAddToInventory_L_Nplayer_M_Nfort__item__definition_M_Nint_M_Nlogic_R
// 0x00A0 (0x00A0 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RAddToInventory_L_Nplayer_M_Nfort__item__definition_M_Nint_M_Nlogic_R final
{
public:
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_Lplayer_Mfort__item__definition_Mint_Mlogic_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0020(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_0;                                // 0x0022(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0028(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_Lplayer_Mfort__item__definition_Mint_Mlogic_R _ExprResult_2;                                     // 0x0040(0x0020)(NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_3;                                // 0x0060(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0068(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_Lplayer_Mfort__item__definition_Mint_Mlogic_R _ExprResult_5;                                     // 0x0080(0x0020)(NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RClearInventory_L_Nplayer_R
// 0x0048 (0x0048 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RClearInventory_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0010(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RCountActive
// 0x0080 (0x0080 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RCountActive final
{
public:
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x304EEA9E_TmpPlayspace_2;                 // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_0;                                // 0x0018(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_1;                                // 0x0020(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__4;                             // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x304EEA9E_TmpPlayspace_6;                 // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_3;                                // 0x0050(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_4;                                // 0x0058(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__8;                             // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0068(0x0018)(HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RCountAll
// 0x0080 (0x0080 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RCountAll final
{
public:
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x304EEA9E_TmpPlayspace_2;                 // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_0;                                // 0x0018(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_1;                                // 0x0020(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__4;                             // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x304EEA9E_TmpPlayspace_6;                 // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_3;                                // 0x0050(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_4;                                // 0x0058(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__8;                             // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0068(0x0018)(HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RCountSpectators
// 0x0080 (0x0080 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RCountSpectators final
{
public:
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x304EEA9E_TmpPlayspace_2;                 // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_0;                                // 0x0018(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_1;                                // 0x0020(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__4;                             // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x304EEA9E_TmpPlayspace_6;                 // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_3;                                // 0x0050(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_4;                                // 0x0058(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__8;                             // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0068(0x0018)(HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RGetActive
// 0x00F8 (0x00F8 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RGetActive final
{
public:
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_player_component*>   RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	class UGame_fort_playspace_component*         __verse_0x304EEA9E_TmpPlayspace_2;                 // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_0;                                // 0x0020(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_1;                                // 0x0028(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__4;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0038(0x0018)(HasGetValueTypeHash)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x0050(0x0010)(ContainsInstancedReference)
	TArray<class USimulation_player_component*>   _ForResult_3;                                      // 0x0060(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_4;                                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_5;                                      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_6 : 1;                                 // 0x0081(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGame_fort_playspace_component*         __verse_0x304EEA9E_TmpPlayspace_10;                // 0x0088(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_7;                                // 0x0090(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_8;                                // 0x0098(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__12;                            // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x00A8(0x0018)(HasGetValueTypeHash)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_13;                       // 0x00C0(0x0010)(ContainsInstancedReference)
	TArray<class USimulation_player_component*>   _ForResult_10;                                     // 0x00D0(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_11;                                      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_12;                                     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_15;                        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_13 : 1;                                // 0x00F1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RGetAll
// 0x00F8 (0x00F8 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RGetAll final
{
public:
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_player_component*>   RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	class UGame_fort_playspace_component*         __verse_0x304EEA9E_TmpPlayspace_2;                 // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_0;                                // 0x0020(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_1;                                // 0x0028(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__4;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0038(0x0018)(HasGetValueTypeHash)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x0050(0x0010)(ContainsInstancedReference)
	TArray<class USimulation_player_component*>   _ForResult_3;                                      // 0x0060(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_4;                                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_5;                                      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_6 : 1;                                 // 0x0081(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGame_fort_playspace_component*         __verse_0x304EEA9E_TmpPlayspace_10;                // 0x0088(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_7;                                // 0x0090(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_8;                                // 0x0098(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__12;                            // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x00A8(0x0018)(HasGetValueTypeHash)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_13;                       // 0x00C0(0x0010)(ContainsInstancedReference)
	TArray<class USimulation_player_component*>   _ForResult_10;                                     // 0x00D0(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_11;                                      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_12;                                     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_15;                        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_13 : 1;                                // 0x00F1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RGetPawnCollisionEntityID_L_Nplayer__component_R
// 0x0040 (0x0040 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RGetPawnCollisionEntityID_L_Nplayer__component_R final
{
public:
	class USimulation_player_component*           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0010(0x0018)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0028(0x0018)(HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RGetPlayersSpectatingTarget_L_Nplayer_R
// 0x0048 (0x0048 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RGetPlayersSpectatingTarget_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class USimulation_player*>             RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RGetPlayerStarts
// 0x0108 (0x0108 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RGetPlayerStarts final
{
public:
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	class UGame_fort_playspace_component*         __verse_0x304EEA9E_TmpPlayspace_2;                 // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_0;                                // 0x0020(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_1;                                // 0x0028(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Lfort__playspace__component_Mtype_Lplayer__start__component_M_20player__start__component_R_R _ExprResult_3;                                     // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_4;                        // 0x0058(0x0010)(ContainsInstancedReference)
	TArray<class UEntityComponent*>               _ForResult_4;                                      // 0x0068(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_5;                                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_6;                                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_6;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_7 : 1;                                 // 0x0089(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGame_fort_playspace_component*         __verse_0x304EEA9E_TmpPlayspace_9;                 // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_8;                                // 0x0098(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_9;                                // 0x00A0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_10;                                        // 0x00A8(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Lfort__playspace__component_Mtype_Lplayer__start__component_M_20player__start__component_R_R _ExprResult_11;                                    // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_11;                       // 0x00D0(0x0010)(ContainsInstancedReference)
	TArray<class UEntityComponent*>               _ForResult_12;                                     // 0x00E0(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_13;                                      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_14;                                     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_13;                        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_15 : 1;                                // 0x0101(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RGetSpectators
// 0x00F8 (0x00F8 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RGetSpectators final
{
public:
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_player_component*>   RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	class UGame_fort_playspace_component*         __verse_0x304EEA9E_TmpPlayspace_2;                 // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_0;                                // 0x0020(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_1;                                // 0x0028(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__4;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0038(0x0018)(HasGetValueTypeHash)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x0050(0x0010)(ContainsInstancedReference)
	TArray<class USimulation_player_component*>   _ForResult_3;                                      // 0x0060(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_4;                                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_5;                                      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_6 : 1;                                 // 0x0081(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGame_fort_playspace_component*         __verse_0x304EEA9E_TmpPlayspace_10;                // 0x0088(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_7;                                // 0x0090(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_8;                                // 0x0098(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UGame_fort_playspace_component*         __verse_0x00000000__12;                            // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x00A8(0x0018)(HasGetValueTypeHash)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_13;                       // 0x00C0(0x0010)(ContainsInstancedReference)
	TArray<class USimulation_player_component*>   _ForResult_10;                                     // 0x00D0(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_11;                                      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_12;                                     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_15;                        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_13 : 1;                                // 0x00F1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RGetTeam_L_Nplayer_R
// 0x0040 (0x0040 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RGetTeam_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGame_Player_player_team               RetVal;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0010(0x0018)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0028(0x0018)(HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RInit_L_Nfort__playspace__component_R
// 0x0038 (0x0038 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RInit_L_Nfort__playspace__component_R final
{
public:
	class UGame_fort_playspace_component*         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_0;                                // 0x0008(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> VerseClassVarProxySetterRHS_1;                     // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResult_2;                                     // 0x0018(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResultStack_3;                                // 0x0020(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> VerseClassVarProxySetterRHS_4;                     // 0x0028(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UGame_fort_playspace_component*, true> _ExprResult_5;                                     // 0x0030(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RPutAllInStasis
// 0x0138 (0x0138 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RPutAllInStasis final
{
public:
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_player_component*>   __verse_0x250A5060_ActivePlayers_2;                // 0x0008(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R _ExprResult_1;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ForIndex_2;                                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0xBB5C3E3E_TmpPlayer_5;                    // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_4;                          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0058(0x0018)(HasGetValueTypeHash)
	class USimulation_player*                     _ExprResult_6;                                     // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0x00000000__8;                             // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0080(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R _ExprResult_8;                                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_player_component*>   __verse_0x250A5060_ActivePlayers_10;               // 0x00A0(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x00B0(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R _ExprResult_10;                                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ForIndex_11;                                      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_12;                                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0xBB5C3E3E_TmpPlayer_13;                   // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_13;                         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_14;                                        // 0x00F0(0x0018)(HasGetValueTypeHash)
	class USimulation_player*                     _ExprResult_15;                                    // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0x00000000__16;                            // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_16;                                        // 0x0118(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R _ExprResult_17;                                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RPutAllInStasisAllowEmotes
// 0x0138 (0x0138 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RPutAllInStasisAllowEmotes final
{
public:
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_player_component*>   __verse_0x250A5060_ActivePlayers_2;                // 0x0008(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R _ExprResult_1;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ForIndex_2;                                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0xBB5C3E3E_TmpPlayer_5;                    // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_4;                          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0058(0x0018)(HasGetValueTypeHash)
	class USimulation_player*                     _ExprResult_6;                                     // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0x00000000__8;                             // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0080(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R _ExprResult_8;                                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_player_component*>   __verse_0x250A5060_ActivePlayers_10;               // 0x00A0(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x00B0(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R _ExprResult_10;                                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ForIndex_11;                                      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_12;                                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0xBB5C3E3E_TmpPlayer_13;                   // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_13;                         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_14;                                        // 0x00F0(0x0018)(HasGetValueTypeHash)
	class USimulation_player*                     _ExprResult_15;                                    // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0x00000000__16;                            // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_16;                                        // 0x0118(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R _ExprResult_17;                                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RPutInStasis_L_Nplayer_R
// 0x0048 (0x0048 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RPutInStasis_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0010(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RPutInStasisWithEmotes_L_Nplayer_R
// 0x0068 (0x0068 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RPutInStasisWithEmotes_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0010(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_Lplayer_Mlogic_Mlogic_Mlogic_R _ExprResult_2;                                     // 0x0028(0x0010)(NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_Lplayer_Mlogic_Mlogic_Mlogic_R _ExprResult_5;                                     // 0x0058(0x0010)(NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RReleaseFromStasis_L_Nplayer_R
// 0x0048 (0x0048 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RReleaseFromStasis_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0010(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_playspace_player_helper.fort_playspace_player_helper._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RRemoveAllFromStasis
// 0x0138 (0x0138 - 0x0000)
struct fort_playspace_player_helper__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__playspace__player__helper_N_RRemoveAllFromStasis final
{
public:
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_player_component*>   __verse_0x250A5060_ActivePlayers_2;                // 0x0008(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_playspace_player_helper::Ftuple_L_R _ExprResult_1;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ForIndex_2;                                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0xBB5C3E3E_TmpPlayer_5;                    // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_4;                          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0058(0x0018)(HasGetValueTypeHash)
