#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseAbilities

#include "Basic.hpp"

#include "GameplayAbilities_classes.hpp"
#include "VerseAbilities_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VerseAbilities.GameplayAbility_Verse
// 0x0000 (0x03C0 - 0x03C0)
class UGameplayAbility_Verse final : public UGameplayAbility
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayAbility_Verse">();
	}
	static class UGameplayAbility_Verse* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayAbility_Verse>();
	}
};

// Class VerseAbilities.VerseAbility
// 0x0018 (0x0048 - 0x0030)
class UVerseAbility : public UObject
{
public:
	TSubclassOf<class UGameplayAbility>           GameplayAbilityClass;                              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAbilityPropertyLink>           PropertyLinks;                                     // 0x0038(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAbility">();
	}
	static class UVerseAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAbility>();
	}
};

// Class VerseAbilities.VerseAbilitySource
// 0x0188 (0x01B8 - 0x0030)
class UVerseAbilitySource final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseAbilityMappingContainer          ActivatableAbilities;                              // 0x0038(0x0120)(Net, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UAbilitySystemComponent> AbilitySystemComponent;                            // 0x0158(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_160[0x58];                                     // 0x0160(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_AbilitySystemComponent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAbilitySource">();
	}
	static class UVerseAbilitySource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAbilitySource>();
	}
};

// Class VerseAbilities.VerseAbilitySubsystem
// 0x0050 (0x0088 - 0x0038)
class UVerseAbilitySubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAbilitySubsystem">();
	}
	static class UVerseAbilitySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAbilitySubsystem>();
	}
};

}

