#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseDevices_0

#include "Basic.hpp"

#include "VerseDevices_0_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameFeatures_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VerseDevices.VerseCreativePropAsset
// 0x00B0 (0x00E0 - 0x0030)
class UVerseCreativePropAsset : public UObject
{
public:
	TSoftObjectPtr<class UObject>                 AssetForEditor;                                    // 0x0030(0x0030)(Edit, Transient, EditorOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AssetPathName;                                     // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSaveRecord*                       LevelSaveRecord;                                   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   ActorClass;                                        // 0x0078(0x0030)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x38];                                      // 0x00A8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCreativePropAsset">();
	}
	static class UVerseCreativePropAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCreativePropAsset>();
	}
};

// Class VerseDevices.VerseDeviceHealth
// 0x0008 (0x0038 - 0x0030)
class UVerseDeviceHealth final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseDeviceHealth">();
	}
	static class UVerseDeviceHealth* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseDeviceHealth>();
	}
};

// Class VerseDevices.PlaylistUserOptionScript
// 0x0018 (0x0208 - 0x01F0)
class UPlaylistUserOptionScript final : public UPlaylistUserOptionBase
{
public:
	TArray<struct FPlaylistOptionScriptValue>     OptionValues;                                      // 0x01F0(0x0010)(Edit, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	int32                                         DefaultValueIndex;                                 // 0x0200(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlaylistUserOptionScript">();
	}
	static class UPlaylistUserOptionScript* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlaylistUserOptionScript>();
	}
};

// Class VerseDevices.ScriptDevice
// 0x0060 (0x1228 - 0x11C8)
class AScriptDevice final : public ABuildingProp
{
public:
	uint8                                         Pad_11C8[0x8];                                     // 0x11C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerseCreativeDevice*                   Script;                                            // 0x11D0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11D8[0x8];                                     // 0x11D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerseCreativeDevice*                   ScriptInstance;                                    // 0x11E0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11E8[0x8];                                     // 0x11E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTopLevelAssetPath                     ScriptClassPath;                                   // 0x11F0(0x0018)(EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EScriptPropertyOverridesVersion               ScriptPropertyOverridesVersion;                    // 0x1208(0x0004)(ZeroConstructor, IsPlainOldData, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_120C[0x4];                                     // 0x120C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 ScriptPropertyOverrides;                           // 0x1210(0x0010)(ZeroConstructor, EditorOnly, NativeAccessSpecifierPrivate)
	uint8                                         bIsUsingSoftObjectPathSerialization : 1;           // 0x1220(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Deprecated, EditorOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_1221[0x7];                                     // 0x1221(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_SetVisibility(bool bVisible);
	void SetEnabled(bool bInEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ScriptDevice">();
	}
	static class AScriptDevice* GetDefaultObj()
	{
		return GetDefaultObjImpl<AScriptDevice>();
	}
};

// Class VerseDevices.VerseMovableObjectBase
// 0x0070 (0x00A0 - 0x0030)
class UVerseMovableObjectBase : public UObject
{
public:
	uint8                                         Pad_30[0x70];                                      // 0x0030(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseMovableObjectBase">();
	}
	static class UVerseMovableObjectBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseMovableObjectBase>();
	}
};

// Class VerseDevices.VerseCreativeDevice
// 0x0020 (0x00C0 - 0x00A0)
class UVerseCreativeDevice : public UVerseMovableObjectBase
{
public:
	uint8                                         Pad_A0[0x20];                                      // 0x00A0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCreativeDevice">();
	}
	static class UVerseCreativeDevice* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCreativeDevice>();
	}
};

// Class VerseDevices.VerseCreativeObject
// 0x0020 (0x00C0 - 0x00A0)
class alignas(0x10) UVerseCreativeObject : public UVerseMovableObjectBase
{
public:
	class AActor*                                 SavedActor;                                        // 0x00A0(0x0008)(Edit, ZeroConstructor, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCreativeObject">();
	}
	static class UVerseCreativeObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCreativeObject>();
	}
};

// Class VerseDevices.VerseCreativeObjectQuotaHelperComponent
// 0x0018 (0x00F0 - 0x00D8)
class UVerseCreativeObjectQuotaHelperComponent final : public UActorComponent
{
public:
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCreativeObjectQuotaHelperComponent">();
	}
	static class UVerseCreativeObjectQuotaHelperComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCreativeObjectQuotaHelperComponent>();
	}
};

// Class VerseDevices.VerseDevicesFeatureAction_RegisterWrapperClasses
// 0x0038 (0x0068 - 0x0030)
class UVerseDevicesFeatureAction_RegisterWrapperClasses final : public UGameFeatureAction
{
public:
	TSoftObjectPtr<class UVerseDeviceWrapperClassMap> DeviceToWrapperClassMapAsset;                      // 0x0030(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseDevicesFeatureAction_RegisterWrapperClasses">();
	}
	static class UVerseDevicesFeatureAction_RegisterWrapperClasses* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseDevicesFeatureAction_RegisterWrapperClasses>();
	}
};

// Class VerseDevices.VerseDeviceSubsystem
// 0x0118 (0x0150 - 0x0038)
class UVerseDeviceSubsystem final : public UWorldSubsystem
{
public:
	TMap<TSoftClassPtr<class UClass>, TSubclassOf<class UObject>> DeviceClassToVerseClassMap;                        // 0x0038(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_88[0xC8];                                      // 0x0088(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOnActorEndPlay(class AActor* Actor, EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseDeviceSubsystem">();
	}
	static class UVerseDeviceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseDeviceSubsystem>();
	}
};

// Class VerseDevices.VerseDeviceWrapperClassMap
// 0x0050 (0x0088 - 0x0038)
class UVerseDeviceWrapperClassMap final : public UDataAsset
{
public:
	TMap<TSoftClassPtr<class UClass>, TSubclassOf<class UVerseCreativeObject>> DeviceClassMap;                                    // 0x0038(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseDeviceWrapperClassMap">();
	}
	static class UVerseDeviceWrapperClassMap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseDeviceWrapperClassMap>();
	}
};

}

