#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseCamera

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseGameplayTags_0_structs.hpp"
#include "Verse_structs.hpp"
#include "Entity_0_classes.hpp"
#include "VerseCamera_0_classes.hpp"
#include "Component_0_classes.hpp"
#include "VerseCamera_structs.hpp"
#include "VerseNative_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"
#include "VerseGameplayTags_classes.hpp"


namespace SDK
{

// VerseClass VerseCamera.VerseCamera_camera_director
// 0x0010 (0x0040 - 0x0030)
class UVerseCamera_camera_director : public UVerseCameraDirectorBase
{
public:
	TArray<struct FVerseCamera_camera_mode_context> __verse_0x8B879483_CameraModeContexts;             // 0x0030(0x0010)(Net, InstancedReference, ContainsInstancedReference)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RAddCameraMode_L_Ncamera__mode__context_R(const struct FVerseCamera_camera_mode_context& __verse_0xB2CDDD72_Argument);
	TArray<struct FVerseCamera_camera_mode_context> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RDetermineActiveCameraModes(const struct VerseCamera::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RRemoveCameraMode_L_Ncamera__mode__context_R(const struct FVerseCamera_camera_mode_context& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_director">();
	}
	static class UVerseCamera_camera_director* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_director>();
	}
};

// VerseClass VerseCamera.VerseCamera
// 0x0000 (0x0030 - 0x0030)
class UVerseCamera final : public UObject
{
public:
	static struct FVerseCamera_camera_mode_context VerseCamera_camera_mode_context_Factory();
	static struct FVerseCamera_camera_mode_context VerseCamera_camera_mode_context_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera">();
	}
	static class UVerseCamera* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_operation_initialization_parameters
// 0x0008 (0x0038 - 0x0030)
class UVerseCamera_camera_operation_initialization_parameters final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_operation_initialization_parameters">();
	}
	static class UVerseCamera_camera_operation_initialization_parameters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_operation_initialization_parameters>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_mode
// 0x0030 (0x0060 - 0x0030)
class UVerseCamera_camera_mode final : public UObject
{
public:
	double                                        __verse_0x1F226B39_Priority;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseGameplayTag                      __verse_0x91F24AC5_CameraModeTag;                  // 0x0038(0x0008)(Edit, Net, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UAssets_camera_rig_asset*               __verse_0x12FB9690_CameraRigAsset;                 // 0x0040(0x0008)(Edit, ExportObject, Net, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseCamera_camera_operation*, true> __verse_0x3DB81447_RootCameraOperation;            // 0x0048(0x0008)(Edit, Net, InstancedReference, SaveGame, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	double                                        __verse_0x8EB061B4__Priority;                      // 0x0050(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class UVerseCamera_verse_camera_mode_tag*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RGetCameraModeTag(const struct VerseCamera::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RGetPriority_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RSetPriority_L_Naccessor_M_Nfloat_R(const struct VerseCamera::Ftuple_Laccessor_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_mode">();
	}
	static class UVerseCamera_camera_mode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_mode>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_behavior_component
// 0x0028 (0x0078 - 0x0050)
class UVerseCamera_camera_behavior_component final : public Ucomponent
{
public:
	class UVerseCamera_camera_director*           __verse_0xD629CD21_CameraDirector;                 // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseCamera_camera_director*           __verse_0x135D3B78__CameraDirector;                // 0x0058(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_60[0x18];                                      // 0x0060(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct VerseCamera::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UVerseCamera_camera_director* _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__behavior__component_N_RGetCameraDirector_L_Naccessor_R(EVerse_accessor __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__behavior__component_N_RSetCameraDirector_L_Naccessor_M_Ncamera__director_R(const struct Ftuple_Laccessor_Mcamera__director_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_behavior_component">();
	}
	static class UVerseCamera_camera_behavior_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_behavior_component>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_component
// 0x0000 (0x0080 - 0x0080)
class UVerseCamera_camera_component final : public Ubasic_camera_component
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct VerseCamera::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_component">();
	}
	static class UVerseCamera_camera_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_component>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_director_priority_list
// 0x0000 (0x0040 - 0x0040)
class UVerseCamera_camera_director_priority_list final : public UVerseCamera_camera_director
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TArray<struct FVerseCamera_camera_mode_context> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RDetermineActiveCameraModes(const struct VerseCamera::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_director_priority_list">();
	}
	static class UVerseCamera_camera_director_priority_list* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_director_priority_list>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_operation
// 0x0018 (0x0078 - 0x0060)
class UVerseCamera_camera_operation final : public UVerseCameraNode
{
public:
	class UVerseCamera_camera_operation_initialization_parameters* __verse_0x6F32B15D_InitParameters_Internal;        // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseCamera_camera_operation_input_parameters* __verse_0x1470B699_InputParameters_Internal;       // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseCamera_camera_operation_output_parameters* __verse_0x037EA061_OutputParameters_Internal;      // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation_N_RInitialize_L_Ncamera__operation__initialization__parameters_R(class UVerseCamera_camera_operation_initialization_parameters* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation_N_RUpdate_L_Ncamera__operation__input__parameters_M_Ncamera__operation__output__parameters_R(const struct Ftuple_Lcamera__operation__input__parameters_Mcamera__operation__output__parameters_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_operation">();
	}
	static class UVerseCamera_camera_operation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_operation>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_operation_input_parameters
// 0x0060 (0x0090 - 0x0030)
class UVerseCamera_camera_operation_input_parameters final : public UObject
{
public:
	TOptional<class UVerseCamera_camera_behavior_component*, true> __verse_0xD5C3408F_CameraBehaviorComponent;        // 0x0030(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVerseCamera_camera_component*, true> __verse_0x84C54853_CameraComponent;                // 0x0038(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0x512060E4_CameraLocation;                 // 0x0040(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         __verse_0x9925111D_CameraRotation;                 // 0x0060(0x0020)(InstancedReference, NoDestructor)
	double                                        __verse_0xEDA0BF94_DeltaTime;                      // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<double> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__float_R(class UVerseCamera_camera_parameter_float* __verse_0xB2CDDD72_Argument);
	TOptional<int64> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__integer_R(class UVerseCamera_camera_parameter_integer* __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__logic_R(class UVerseCamera_camera_parameter_logic* __verse_0xB2CDDD72_Argument);
	TOptional<struct FVerseRotation> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__rotation_R(class UVerseCamera_camera_parameter_rotation* __verse_0xB2CDDD72_Argument);
	TOptional<struct FSpatialMath_transform> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__transform_R(class UVerseCamera_camera_parameter_transform* __verse_0xB2CDDD72_Argument);
	TOptional<struct FSpatialMath_vector2> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__vector2_R(class UVerseCamera_camera_parameter_vector2* __verse_0xB2CDDD72_Argument);
	TOptional<struct FSpatialMath_vector3> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__vector3_R(class UVerseCamera_camera_parameter_vector3* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_operation_input_parameters">();
	}
	static class UVerseCamera_camera_operation_input_parameters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_operation_input_parameters>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_output_parameters
// 0x0070 (0x00A0 - 0x0030)
class UVerseCamera_camera_output_parameters : public UObject
{
public:
	TOptional<struct FSpatialMath_vector3>        __verse_0x512060E4_CameraLocation;                 // 0x0030(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TOptional<struct FVerseRotation>              __verse_0x9925111D_CameraRotation;                 // 0x0050(0x0030)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference)
	TOptional<double>                             __verse_0x5948B835_CameraFieldOfViewDegrees;       // 0x0080(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_90[0x10];                                      // 0x0090(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RReset__Internal(const struct VerseCamera::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__float_M_Nfloat_R(const struct Ftuple_Lcamera__variable__float_Mfloat_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__integer_M_Nint_R(const struct Ftuple_Lcamera__variable__integer_Mint_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__logic_M_Nlogic_R(const struct Ftuple_Lcamera__variable__logic_Mlogic_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__rotation_M_Nrotation_R(const struct Ftuple_Lcamera__variable__rotation_Mrotation_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__transform_M_Ntransform_R(const struct Ftuple_Lcamera__variable__transform_Mtransform_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__vector2_M_Nvector2_R(const struct Ftuple_Lcamera__variable__vector2_Mvector2_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__vector3_M_Nvector3_R(const struct Ftuple_Lcamera__variable__vector3_Mvector3_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_output_parameters">();
	}
	static class UVerseCamera_camera_output_parameters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_output_parameters>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_operation_output_parameters
// 0x0000 (0x00A0 - 0x00A0)
class UVerseCamera_camera_operation_output_parameters final : public UVerseCamera_camera_output_parameters
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_operation_output_parameters">();
	}
	static class UVerseCamera_camera_operation_output_parameters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_operation_output_parameters>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_parameter_float
// 0x0020 (0x0050 - 0x0030)
class UVerseCamera_camera_parameter_float final : public UObject
{
public:
	double                                        __verse_0x31A8F10C_Value;                          // 0x0030(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAssets_camera_variable_float*          __verse_0x72781213_Variable;                       // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_parameter_float">();
	}
	static class UVerseCamera_camera_parameter_float* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_parameter_float>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_parameter_integer
// 0x0020 (0x0050 - 0x0030)
class UVerseCamera_camera_parameter_integer final : public UObject
{
public:
	int64                                         __verse_0x31A8F10C_Value;                          // 0x0030(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAssets_camera_variable_integer*        __verse_0x72781213_Variable;                       // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_parameter_integer">();
	}
	static class UVerseCamera_camera_parameter_integer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_parameter_integer>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_parameter_logic
// 0x0020 (0x0050 - 0x0030)
class UVerseCamera_camera_parameter_logic final : public UObject
{
public:
	uint8                                         __verse_0x31A8F10C_Value : 1;                      // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAssets_camera_variable_logic*          __verse_0x72781213_Variable;                       // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_parameter_logic">();
	}
	static class UVerseCamera_camera_parameter_logic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_parameter_logic>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_parameter_rotation
// 0x0050 (0x0080 - 0x0030)
class UVerseCamera_camera_parameter_rotation final : public UObject
{
public:
	struct FVerseRotation                         __verse_0x31A8F10C_Value;                          // 0x0030(0x0020)(Edit, InstancedReference, SaveGame, NoDestructor)
	class UAssets_camera_variable_rotation*       __verse_0x72781213_Variable;                       // 0x0050(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_58[0x28];                                      // 0x0058(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_parameter_rotation">();
	}
	static class UVerseCamera_camera_parameter_rotation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_parameter_rotation>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_parameter_transform
// 0x00E0 (0x0110 - 0x0030)
class UVerseCamera_camera_parameter_transform final : public UObject
{
public:
	struct FSpatialMath_transform                 __verse_0x31A8F10C_Value;                          // 0x0030(0x0060)(Edit, InstancedReference, SaveGame, NoDestructor)
	class UAssets_camera_variable_transform*      __verse_0x72781213_Variable;                       // 0x0090(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_98[0x78];                                      // 0x0098(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_parameter_transform">();
	}
	static class UVerseCamera_camera_parameter_transform* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_parameter_transform>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_parameter_vector2
// 0x0030 (0x0060 - 0x0030)
class UVerseCamera_camera_parameter_vector2 final : public UObject
{
public:
	struct FSpatialMath_vector2                   __verse_0x31A8F10C_Value;                          // 0x0030(0x0010)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor)
	class UAssets_camera_variable_vector2*        __verse_0x72781213_Variable;                       // 0x0040(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_parameter_vector2">();
	}
	static class UVerseCamera_camera_parameter_vector2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_parameter_vector2>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_parameter_vector3
// 0x0040 (0x0070 - 0x0030)
class UVerseCamera_camera_parameter_vector3 final : public UObject
{
public:
	struct FSpatialMath_vector3                   __verse_0x31A8F10C_Value;                          // 0x0030(0x0018)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor)
	class UAssets_camera_variable_vector3*        __verse_0x72781213_Variable;                       // 0x0048(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_50[0x20];                                      // 0x0050(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_parameter_vector3">();
	}
	static class UVerseCamera_camera_parameter_vector3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_parameter_vector3>();
	}
};

// VerseClass VerseCamera.VerseCamera_player_camera_view
// 0x0000 (0x00E8 - 0x00E8)
class UVerseCamera_player_camera_view : public UVersePlayerCameraViewComponent
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_player_camera_view">();
	}
	static class UVerseCamera_player_camera_view* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_player_camera_view>();
	}
};

// VerseClass VerseCamera.VerseCamera_verse_camera_mode_tag
// 0x0000 (0x0030 - 0x0030)
class UVerseCamera_verse_camera_mode_tag final : public UTags_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_verse_camera_mode_tag">();
	}
	static class UVerseCamera_verse_camera_mode_tag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_verse_camera_mode_tag>();
	}
};

}

