#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseAbilities_0

#include "Basic.hpp"

#include "VerseAbilities_0_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function VerseAbilities.ability.$InitCDO
// 0x0040 (0x0040 - 0x0000)
struct ability__InitCDO final
{
public:
	TOptional<FVerseStringProperty_>              _ExprResult_0;                                     // 0x0000(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0018(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x001A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_2;                                // 0x001B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<FVerseStringProperty_>              _ExprResult_3;                                     // 0x0020(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0038(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x003A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_5;                                // 0x003B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAbilities.ability._L_2fUnrealEngine_2ecom_2fAbilities_2fability_N_REndAbility
// 0x0001 (0x0001 - 0x0000)
struct ability__L_2fUnrealEngine_2ecom_2fAbilities_2fability_N_REndAbility final
{
public:
	struct VerseAbilities_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAbilities.ability.Activate
// 0x0028 (0x0028 - 0x0000)
struct ability_Activate final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseAbilities_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAbilities.ability.CallActivate
// 0x0028 (0x0028 - 0x0000)
struct ability_CallActivate final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseAbilities_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAbilities.ability_component._L_2fUnrealEngine_2ecom_2fAbilities_2fability__component_N_RActivateAbility_L_NAbility_20where_20Ability_R
// 0x0008 (0x0008 - 0x0000)
struct ability_component__L_2fUnrealEngine_2ecom_2fAbilities_2fability__component_N_RActivateAbility_L_NAbility_20where_20Ability_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAbilities.ability_component._L_2fUnrealEngine_2ecom_2fAbilities_2fability__component_N_RActivateAbility_L_Nability_R
// 0x0008 (0x0008 - 0x0000)
struct ability_component__L_2fUnrealEngine_2ecom_2fAbilities_2fability__component_N_RActivateAbility_L_Nability_R final
{
public:
	class Uability*                               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseAbilities.ability_component._L_2fUnrealEngine_2ecom_2fAbilities_2fability__component_N_RGiveAbility_L_NAbility_20where_20Ability_R
// 0x0010 (0x0010 - 0x0000)
struct ability_component__L_2fUnrealEngine_2ecom_2fAbilities_2fability__component_N_RGiveAbility_L_NAbility_20where_20Ability_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAbilities.ability_component._L_2fUnrealEngine_2ecom_2fAbilities_2fability__component_N_RGiveAbility_L_Nability_R
// 0x0010 (0x0010 - 0x0000)
struct ability_component__L_2fUnrealEngine_2ecom_2fAbilities_2fability__component_N_RGiveAbility_L_Nability_R final
{
public:
	class Uability*                               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAbilities.task_ability$Activate.Update
// 0x0008 (0x0008 - 0x0000)
struct task_ability_Activate_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseAbilities.task_ability$CallActivate.Update
// 0x0008 (0x0008 - 0x0000)
struct task_ability_CallActivate_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

