#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VersePrototypeGameplay_simple_gameplay_script_component

#include "Basic.hpp"

#include "VersePrototypeGameplay_simple_gameplay_script_component_structs.hpp"
#include "VerseNative_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"
#include "VGameplayRst_0_structs.hpp"


namespace SDK::Params
{

// Function VersePrototypeGameplay_simple_gameplay_script_component.simple_gameplay_script_component.$InitCDO
// 0x00C0 (0x00C0 - 0x0000)
struct simple_gameplay_script_component__InitCDO final
{
public:
	TOptional<class UVerseEngine_Entity_vk_entity*, true> _ExprResult_0;                                     // 0x0000(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0008(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x000A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_2;                                // 0x000B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVGameplayRst_Physics_vk_collision_component*, true> _ExprResult_3;                                     // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0018(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x001A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_5;                                // 0x001B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVGameplayRst_Geometry_fixed_mesh_component*, true> _ExprResult_6;                                     // 0x0020(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__5;                             // 0x0028(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_7 : 1;                                 // 0x002A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_8;                                // 0x002B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVGameplayRst_Transform_position_component*, true> _ExprResult_9;                                     // 0x0030(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__7;                             // 0x0038(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_10 : 1;                                // 0x003A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_11;                               // 0x003B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _ExprResult_12;                                    // 0x0040(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__9;                             // 0x0048(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_13 : 1;                                // 0x004A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_14;                               // 0x004B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVGameplayRst_Transform_scale_component*, true> _ExprResult_15;                                    // 0x0050(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__11;                            // 0x0058(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_16 : 1;                                // 0x005A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_17;                               // 0x005B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVerseEngine_Entity_vk_entity*, true> _ExprResult_18;                                    // 0x0060(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__13;                            // 0x0068(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_19 : 1;                                // 0x006A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_20;                               // 0x006B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVGameplayRst_Physics_vk_collision_component*, true> _ExprResult_21;                                    // 0x0070(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__15;                            // 0x0078(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_22 : 1;                                // 0x007A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_23;                               // 0x007B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVGameplayRst_Geometry_fixed_mesh_component*, true> _ExprResult_24;                                    // 0x0080(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__17;                            // 0x0088(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_25 : 1;                                // 0x008A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_26;                               // 0x008B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVGameplayRst_Transform_position_component*, true> _ExprResult_27;                                    // 0x0090(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__19;                            // 0x0098(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_28 : 1;                                // 0x009A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_29;                               // 0x009B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _ExprResult_30;                                    // 0x00A0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__21;                            // 0x00A8(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_31 : 1;                                // 0x00AA(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_32;                               // 0x00AB(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVGameplayRst_Transform_scale_component*, true> _ExprResult_33;                                    // 0x00B0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__23;                            // 0x00B8(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_34 : 1;                                // 0x00BA(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_35;                               // 0x00BB(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VersePrototypeGameplay_simple_gameplay_script_component.simple_gameplay_script_component._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RAddToPosition_L_Nvector3_R
// 0x0098 (0x0098 - 0x0000)
struct simple_gameplay_script_component__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RAddToPosition_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVGameplayRst_Transform_position_component* __verse_0x7AF6BB5D_position_1;                     // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _ExprResultStack_0;                                // 0x0020(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _ExprResultStack_1;                                // 0x0028(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0x7AF6BB5D_position_3;                     // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _ExprResultStack_4;                                // 0x0060(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _ExprResultStack_5;                                // 0x0068(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0x00000000__4;                             // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_6;                          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0080(0x0018)(HasGetValueTypeHash)
};

// Function VersePrototypeGameplay_simple_gameplay_script_component.simple_gameplay_script_component._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RApplyAdditionalRotation_L_Nrotation_R
// 0x00A0 (0x00A0 - 0x0000)
struct simple_gameplay_script_component__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RApplyAdditionalRotation_L_Nrotation_R final
{
public:
	struct FVerseRotation                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, NoDestructor)
	class UVGameplayRst_Transform_rotation_component* __verse_0x78C70FF3_Rotation_1;                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _ExprResultStack_0;                                // 0x0028(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _ExprResultStack_1;                                // 0x0030(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* __verse_0x78C70FF3_Rotation_3;                     // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _ExprResultStack_4;                                // 0x0068(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _ExprResultStack_5;                                // 0x0070(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* __verse_0x00000000__4;                             // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_6;                          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0088(0x0018)(HasGetValueTypeHash)
};

// Function VersePrototypeGameplay_simple_gameplay_script_component.simple_gameplay_script_component._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RDisableCollision
// 0x0088 (0x0088 - 0x0000)
struct simple_gameplay_script_component__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RDisableCollision final
{
public:
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x79EE7245_collision_1;                    // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Physics_vk_collision_component*, true> _ExprResultStack_0;                                // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Physics_vk_collision_component*, true> _ExprResultStack_1;                                // 0x0018(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x00000000__2;                             // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x79EE7245_collision_3;                    // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Physics_vk_collision_component*, true> _ExprResultStack_4;                                // 0x0050(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Physics_vk_collision_component*, true> _ExprResultStack_5;                                // 0x0058(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x00000000__4;                             // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_6;                          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0070(0x0018)(HasGetValueTypeHash)
};

// Function VersePrototypeGameplay_simple_gameplay_script_component.simple_gameplay_script_component._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_REnableCollision
// 0x0088 (0x0088 - 0x0000)
struct simple_gameplay_script_component__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_REnableCollision final
{
public:
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x79EE7245_collision_1;                    // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Physics_vk_collision_component*, true> _ExprResultStack_0;                                // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Physics_vk_collision_component*, true> _ExprResultStack_1;                                // 0x0018(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x00000000__2;                             // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x79EE7245_collision_3;                    // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Physics_vk_collision_component*, true> _ExprResultStack_4;                                // 0x0050(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Physics_vk_collision_component*, true> _ExprResultStack_5;                                // 0x0058(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x00000000__4;                             // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_6;                          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0070(0x0018)(HasGetValueTypeHash)
};

// Function VersePrototypeGameplay_simple_gameplay_script_component.simple_gameplay_script_component._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RGetPosition
// 0x01A0 (0x01A0 - 0x0000)
struct simple_gameplay_script_component__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RGetPosition final
{
public:
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	class UVGameplayRst_Transform_position_component* __verse_0x7AF6BB5D_position_1;                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _ExprResultStack_0;                                // 0x0028(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _ExprResultStack_1;                                // 0x0030(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R _ExprResult_3;                                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_4;                                // 0x0060(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x00B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x00C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x00D0(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0x7AF6BB5D_position_4;                     // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _ExprResultStack_8;                                // 0x00E8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _ExprResultStack_9;                                // 0x00F0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0x00000000__5;                             // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_10;                                        // 0x0100(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R _ExprResult_11;                                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_12;                               // 0x0120(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_13;                                    // 0x0170(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_14;                                    // 0x0180(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x0190(0x0010)(HasGetValueTypeHash)
};

// Function VersePrototypeGameplay_simple_gameplay_script_component.simple_gameplay_script_component._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RGetRotation
// 0x00F0 (0x00F0 - 0x0000)
struct simple_gameplay_script_component__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RGetRotation final
{
public:
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         RetVal;                                            // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	class UVGameplayRst_Transform_rotation_component* __verse_0x78C70FF3_Rotation_1;                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _ExprResultStack_0;                                // 0x0038(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _ExprResultStack_1;                                // 0x0040(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* __verse_0x00000000__2;                             // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0050(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R _ExprResult_3;                                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0070(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R _ExprResult_5;                                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVGameplayRst_Transform_rotation_component* __verse_0x78C70FF3_Rotation_4;                     // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _ExprResultStack_6;                                // 0x0098(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _ExprResultStack_7;                                // 0x00A0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* __verse_0x00000000__5;                             // 0x00A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x00B0(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R _ExprResult_9;                                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_10;                                        // 0x00D0(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R _ExprResult_11;                                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VersePrototypeGameplay_simple_gameplay_script_component.simple_gameplay_script_component._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RGetScale
// 0x01A0 (0x01A0 - 0x0000)
struct simple_gameplay_script_component__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RGetScale final
{
public:
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	class UVGameplayRst_Transform_scale_component* __verse_0xA8267C47_scale_1;                        // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_scale_component*, true> _ExprResultStack_0;                                // 0x0028(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_scale_component*, true> _ExprResultStack_1;                                // 0x0030(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* __verse_0x00000000__2;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R _ExprResult_3;                                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_4;                                // 0x0060(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x00B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x00C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x00D0(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* __verse_0xA8267C47_scale_4;                        // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_scale_component*, true> _ExprResultStack_8;                                // 0x00E8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_scale_component*, true> _ExprResultStack_9;                                // 0x00F0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* __verse_0x00000000__5;                             // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_10;                                        // 0x0100(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R _ExprResult_11;                                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_12;                               // 0x0120(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_13;                                    // 0x0170(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_14;                                    // 0x0180(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x0190(0x0010)(HasGetValueTypeHash)
};

// Function VersePrototypeGameplay_simple_gameplay_script_component.simple_gameplay_script_component._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RGetTransform
// 0x0780 (0x0780 - 0x0000)
struct simple_gameplay_script_component__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RGetTransform final
{
public:
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 RetVal;                                            // 0x0010(0x0060)(Parm, OutParm, ReturnParm, NoDestructor)
	class UVGameplayRst_Transform_position_component* __verse_0x7AF6BB5D_position_1;                     // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _ExprResultStack_0;                                // 0x0078(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _ExprResultStack_1;                                // 0x0080(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* __verse_0x78C70FF3_Rotation_1;                     // 0x0088(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _ExprResultStack_2;                                // 0x0090(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _ExprResultStack_3;                                // 0x0098(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* __verse_0xA8267C47_scale_1;                        // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_scale_component*, true> _ExprResultStack_4;                                // 0x00A8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_scale_component*, true> _ExprResultStack_5;                                // 0x00B0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_6;                                // 0x00B8(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0108(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_8;                                     // 0x0118(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_9;                                     // 0x0128(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_10;                                    // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVGameplayRst_Transform_position_component* __verse_0x00000000__2;                             // 0x0150(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x0158(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R _ExprResult_12;                                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0xF];                                      // 0x0171(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         _ExprResult_13;                                    // 0x0180(0x0020)(NoDestructor)
	class UVGameplayRst_Transform_rotation_component* __verse_0x00000000__3;                             // 0x01A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_14;                                        // 0x01A8(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R _ExprResult_15;                                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _ExprResult_16;                                    // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVGameplayRst_Transform_scale_component* __verse_0x00000000__4;                             // 0x01E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_17;                                        // 0x01E8(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R _ExprResult_18;                                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_19;                               // 0x0208(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_20;                                    // 0x0258(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_21;                                    // 0x0268(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_22;                                    // 0x0278(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_23;                                    // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_24;                               // 0x02A0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_25;                                    // 0x02F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_26;                                    // 0x0300(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_27;                                    // 0x0310(0x0010)(HasGetValueTypeHash)
	struct FVerseRotation                         _ExprResultStack_28;                               // 0x0320(0x0020)(NoDestructor)
	FVerseFunctionProperty_                       _Callee_29;                                        // 0x0340(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R _ExprResult_30;                                    // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _ExprResult_31;                                    // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_32;                               // 0x0378(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_33;                                    // 0x03C8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_34;                                    // 0x03D8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_35;                                    // 0x03E8(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0x7AF6BB5D_position_6;                     // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _ExprResultStack_36;                               // 0x0400(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _ExprResultStack_37;                               // 0x0408(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* __verse_0x78C70FF3_Rotation_6;                     // 0x0410(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _ExprResultStack_38;                               // 0x0418(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _ExprResultStack_39;                               // 0x0420(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* __verse_0xA8267C47_scale_6;                        // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_scale_component*, true> _ExprResultStack_40;                               // 0x0430(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_scale_component*, true> _ExprResultStack_41;                               // 0x0438(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_42;                               // 0x0440(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_43;                                    // 0x0490(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_44;                                    // 0x04A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_45;                                    // 0x04B0(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_46;                                    // 0x04C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVGameplayRst_Transform_position_component* __verse_0x00000000__7;                             // 0x04D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_47;                                        // 0x04E0(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R _ExprResult_48;                                    // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         _ExprResult_49;                                    // 0x0500(0x0020)(NoDestructor)
	class UVGameplayRst_Transform_rotation_component* __verse_0x00000000__8;                             // 0x0520(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_50;                                        // 0x0528(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R _ExprResult_51;                                    // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _ExprResult_52;                                    // 0x0548(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVGameplayRst_Transform_scale_component* __verse_0x00000000__9;                             // 0x0560(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_53;                                        // 0x0568(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R _ExprResult_54;                                    // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_55;                               // 0x0588(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_56;                                    // 0x05D8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_57;                                    // 0x05E8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_58;                                    // 0x05F8(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_59;                                    // 0x0608(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_60;                               // 0x0620(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_61;                                    // 0x0670(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_62;                                    // 0x0680(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_63;                                    // 0x0690(0x0010)(HasGetValueTypeHash)
	struct FVerseRotation                         _ExprResultStack_64;                               // 0x06A0(0x0020)(NoDestructor)
	FVerseFunctionProperty_                       _Callee_65;                                        // 0x06C0(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R _ExprResult_66;                                    // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _ExprResult_67;                                    // 0x06E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_68;                               // 0x06F8(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_69;                                    // 0x0748(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_70;                                    // 0x0758(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_71;                                    // 0x0768(0x0010)(HasGetValueTypeHash)
};

// Function VersePrototypeGameplay_simple_gameplay_script_component.simple_gameplay_script_component._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RHandleOnBegin
// 0x0001 (0x0001 - 0x0000)
struct simple_gameplay_script_component__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RHandleOnBegin final
{
public:
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VersePrototypeGameplay_simple_gameplay_script_component.simple_gameplay_script_component._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RHandleOnCreate
// 0x0001 (0x0001 - 0x0000)
struct simple_gameplay_script_component__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RHandleOnCreate final
{
public:
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VersePrototypeGameplay_simple_gameplay_script_component.simple_gameplay_script_component._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RHandleOnPostCreate
// 0x0001 (0x0001 - 0x0000)
struct simple_gameplay_script_component__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RHandleOnPostCreate final
{
public:
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VersePrototypeGameplay_simple_gameplay_script_component.simple_gameplay_script_component._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RHide
// 0x0108 (0x0108 - 0x0000)
struct simple_gameplay_script_component__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fsimple__gameplay__script__component_N_RHide final
{
public:
	struct VersePrototypeGameplay_simple_gameplay_script_component::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x71AD33A7_Mesh_2;                         // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Geometry_fixed_mesh_component*, true> _ExprResultStack_0;                                // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Geometry_fixed_mesh_component*, true> _ExprResultStack_1;                                // 0x0018(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__3;                             // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x79EE7245_collision_4;                    // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Physics_vk_collision_component*, true> _ExprResultStack_4;                                // 0x0050(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
