#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseUI

#include "Basic.hpp"

#include "VerseUI_structs.hpp"
#include "UIFramework_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "EntityActor_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VerseUI.VerseUIUserWidget
// 0x0130 (0x0340 - 0x0210)
class UVerseUIUserWidget final : public UUIFrameworkUserWidget
{
public:
	struct FVerseUIUserWidgetViewmodelList        ReplicatedViewmodelList;                           // 0x0210(0x0128)(Net, NativeAccessSpecifierPrivate)
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseUIUserWidget">();
	}
	static class UVerseUIUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseUIUserWidget>();
	}
};

// Class VerseUI.VersePlayerUIEntityComponent
// 0x0008 (0x0118 - 0x0110)
class UVersePlayerUIEntityComponent : public UEntityActorPlayerComponent
{
public:
	class UUIFrameworkPlayerComponent*            UIFComponent;                                      // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VersePlayerUIEntityComponent">();
	}
	static class UVersePlayerUIEntityComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVersePlayerUIEntityComponent>();
	}
};

// Class VerseUI.VerseWidgetNativeBase
// 0x0010 (0x0040 - 0x0030)
class UVerseWidgetNativeBase : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIFrameworkWidget*                     UIFWidgetInstance;                                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseWidgetNativeBase">();
	}
	static class UVerseWidgetNativeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseWidgetNativeBase>();
	}
};

// Class VerseUI.VerseUIWorldSubsystem
// 0x0050 (0x0088 - 0x0038)
class UVerseUIWorldSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseUIWorldSubsystem">();
	}
	static class UVerseUIWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseUIWorldSubsystem>();
	}
};

}

