#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseAssets

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "VerseNative_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class VerseAssets.VerseMaterialInstanceDynamic
// 0x0038 (0x0790 - 0x0758)
class UVerseMaterialInstanceDynamic final : public UMaterialInstanceDynamic
{
public:
	uint8                                         Pad_758[0x38];                                     // 0x0758(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseMaterialInstanceDynamic">();
	}
	static class UVerseMaterialInstanceDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseMaterialInstanceDynamic>();
	}
};

// Class VerseAssets.VerseAssetPtr
// 0x0080 (0x00B8 - 0x0038)
class UVerseAssetPtr : public UVerseAsset
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 AssetForEditor;                                    // 0x0040(0x0030)(Edit, SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AssetPathName;                                     // 0x0070(0x000C)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Object;                                            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x30];                                      // 0x0088(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_AssetPathName();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAssetPtr">();
	}
	static class UVerseAssetPtr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAssetPtr>();
	}
};

// Class VerseAssets.ParameterCollection
// 0x0020 (0x0050 - 0x0030)
class UParameterCollection final : public UObject
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ParameterCollection">();
	}
	static class UParameterCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParameterCollection>();
	}
};

// Class VerseAssets.ParameterCollectionGeneratedClass
// 0x0000 (0x0658 - 0x0658)
class UParameterCollectionGeneratedClass final : public UBlueprintGeneratedClass
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ParameterCollectionGeneratedClass">();
	}
	static class UParameterCollectionGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParameterCollectionGeneratedClass>();
	}
};

}

