#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VersePrototypeGameplay_NodePriorityQueue

#include "Basic.hpp"

#include "VersePrototypeGameplay_NodePriorityQueue_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function VersePrototypeGameplay_NodePriorityQueue.NodePriorityQueue._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fNodePriorityQueue_N_RInsert_L_N_Knav__grid__node__2d_M_Nnav__grid__node__2d_R
// 0x0048 (0x0048 - 0x0000)
struct NodePriorityQueue__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fNodePriorityQueue_N_RInsert_L_N_Knav__grid__node__2d_M_Nnav__grid__node__2d_R final
{
public:
	struct VersePrototypeGameplay_NodePriorityQueue::Ftuple_L_Knav__grid__node__2d_Mnav__grid__node__2d_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class Unav_grid_node_2d*>              _ExprResult_0;                                     // 0x0028(0x0010)(ContainsInstancedReference)
	TArray<class Unav_grid_node_2d*>              _ExprResult_1;                                     // 0x0038(0x0010)(ContainsInstancedReference)
};

// Function VersePrototypeGameplay_NodePriorityQueue.NodePriorityQueue._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fNodePriorityQueue_N_RPop_L_N_Knav__grid__node__2d_R
// 0x01D0 (0x01D0 - 0x0000)
struct NodePriorityQueue__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fNodePriorityQueue_N_RPop_L_N_Knav__grid__node__2d_R final
{
public:
	TArray<class Unav_grid_node_2d*>              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ContainsInstancedReference)
	TOptional<struct VersePrototypeGameplay_NodePriorityQueue::Ftuple_Lnav__grid__node__2d_M_Knav__grid__node__2d_R> RetVal;                                            // 0x0010(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_0;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Unav_grid_node_2d*, true>     __verse_0x9A09D051_MaybeResult_1;                  // 0x0038(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__2;                             // 0x0040(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x0042(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_2;                                // 0x0043(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         __verse_0x98DC86C6_Index_6;                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Unav_grid_node_2d*                      __verse_0x0D11D8E0_Node_6;                         // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<double>                             _ExprResultStack_4;                                // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_5;                                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_6;                                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _ExprResultStack_7;                                // 0x0080(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _AssignmentScratch_8;                              // 0x0088(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _ExprResult_9;                                     // 0x0090(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class Unav_grid_node_2d*                      __verse_0x95D09D0E_Result_1;                       // 0x0098(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _ExprResultStack_10;                               // 0x00A0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct VersePrototypeGameplay_NodePriorityQueue::Ftuple_Lnav__grid__node__2d_M_Knav__grid__node__2d_R _ExprResult_11;                                    // 0x00A8(0x0018)(HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              _ExprResultStack_12;                               // 0x00C0(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_13;                                        // 0x00D0(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay_NodePriorityQueue::Ftuple_L_Knav__grid__node__2d_Mnav__grid__node__2d_R _ExprResult_14;                                    // 0x00E8(0x0018)(HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_15;                                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Unav_grid_node_2d*, true>     __verse_0x9A09D051_MaybeResult_11;                 // 0x0108(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__12;                            // 0x0110(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_16 : 1;                                // 0x0112(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_17;                               // 0x0113(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         __verse_0x98DC86C6_Index_16;                       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_18;                                     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Unav_grid_node_2d*                      __verse_0x0D11D8E0_Node_16;                        // 0x0128(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<double>                             _ExprResultStack_19;                               // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_20;                               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_21;                                    // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _ExprResultStack_22;                               // 0x0150(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _AssignmentScratch_23;                             // 0x0158(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _ExprResult_24;                                    // 0x0160(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class Unav_grid_node_2d*                      __verse_0x95D09D0E_Result_11;                      // 0x0168(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _ExprResultStack_25;                               // 0x0170(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct VersePrototypeGameplay_NodePriorityQueue::Ftuple_Lnav__grid__node__2d_M_Knav__grid__node__2d_R _ExprResult_26;                                    // 0x0178(0x0018)(HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              _ExprResultStack_27;                               // 0x0190(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_28;                                        // 0x01A0(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay_NodePriorityQueue::Ftuple_L_Knav__grid__node__2d_Mnav__grid__node__2d_R _ExprResult_29;                                    // 0x01B8(0x0018)(HasGetValueTypeHash)
};

// Function VersePrototypeGameplay_NodePriorityQueue.NodePriorityQueue._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fNodePriorityQueue_N_RRemove_L_N_Knav__grid__node__2d_M_Nnav__grid__node__2d_R
// 0x0138 (0x0138 - 0x0000)
struct NodePriorityQueue__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_2fNodePriorityQueue_N_RRemove_L_N_Knav__grid__node__2d_M_Nnav__grid__node__2d_R final
{
public:
	struct VersePrototypeGameplay_NodePriorityQueue::Ftuple_L_Knav__grid__node__2d_Mnav__grid__node__2d_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class Unav_grid_node_2d*>              _ForResult_0;                                      // 0x0028(0x0010)(ContainsInstancedReference)
	TArray<class Unav_grid_node_2d*>              _ForIterable_1;                                    // 0x0038(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_2;                                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Unav_grid_node_2d*                      __verse_0xA881B3E4_QueueNode_3;                    // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_4;                               // 0x0060(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_5;                                // 0x0070(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_6;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_7;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	class Unav_grid_node_2d*                      _ExprResult_8;                                     // 0x00A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              _ForResult_9;                                      // 0x00B0(0x0010)(ContainsInstancedReference)
	TArray<class Unav_grid_node_2d*>              _ForIterable_10;                                   // 0x00C0(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_11;                                      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_12;                                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Unav_grid_node_2d*                      __verse_0xA881B3E4_QueueNode_8;                    // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_13;                              // 0x00E8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_14;                               // 0x00F8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_15;                                    // 0x0110(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_16;                                    // 0x0120(0x0010)(HasGetValueTypeHash)
	class Unav_grid_node_2d*                      _ExprResult_17;                                    // 0x0130(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

}

