#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseQuery

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Entity_classes.hpp"


namespace SDK
{

// Class VerseQuery.CollisionComponent_Implementation
// 0x01A8 (0x01D8 - 0x0030)
class UCollisionComponent_Implementation final : public UObject
{
public:
	struct FBodyInstance                          BodyInstance;                                      // 0x0030(0x0198)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C8[0x10];                                     // 0x01C8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CollisionComponent_Implementation">();
	}
	static class UCollisionComponent_Implementation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollisionComponent_Implementation>();
	}
};

// Class VerseQuery.CollisionComponentBridgeHelper
// 0x0030 (0x0060 - 0x0030)
class UCollisionComponentBridgeHelper final : public UObject
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleActorComponentBeginOverlap(class UPrimitiveComponent* PrimitiveComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComponent, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void HandleActorComponentEndOverlap(class UPrimitiveComponent* PrimitiveComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComponent, int32 OtherBodyIndex);
	void HandleActorComponentHit(class UPrimitiveComponent* PrimitiveComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComponent, const struct FVector& NormalImpulse, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CollisionComponentBridgeHelper">();
	}
	static class UCollisionComponentBridgeHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollisionComponentBridgeHelper>();
	}
};

// Class VerseQuery.EntityQueryManager
// 0x0010 (0x0040 - 0x0030)
class UEntityQueryManager final : public UObject
{
public:
	class UEntityTypeQueryContainer*              EntityTypeQueryContainer;                          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTaggedObjectQueryContainer*            TagQueryContainer;                                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityQueryManager">();
	}
	static class UEntityQueryManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityQueryManager>();
	}
};

// Class VerseQuery.EntityRegistry
// 0x0000 (0x0038 - 0x0038)
class UEntityRegistry final : public UEntityRegistryBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityRegistry">();
	}
	static class UEntityRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityRegistry>();
	}
};

// Class VerseQuery.EntityTypeQueryContainer
// 0x00A0 (0x00D0 - 0x0030)
class UEntityTypeQueryContainer final : public UObject
{
public:
	uint8                                         Pad_30[0xA0];                                      // 0x0030(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityTypeQueryContainer">();
	}
	static class UEntityTypeQueryContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityTypeQueryContainer>();
	}
};

// Class VerseQuery.TaggedObjectQueryContainer
// 0x0050 (0x0080 - 0x0030)
class UTaggedObjectQueryContainer final : public UObject
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TaggedObjectQueryContainer">();
	}
	static class UTaggedObjectQueryContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTaggedObjectQueryContainer>();
	}
};

}

