#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseQuery_0

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "Verse_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK
{

// VerseEnum VerseQuery.collision_channel_response
// NumValues: 0x0004
enum class Ecollision_channel_response : uint8
{
	Ignore                                   = 0,
	Overlap                                  = 1,
	Block                                    = 2,
	collision_channel_MAX                    = 3,
};

// VerseStruct VerseQuery.collision_channel
// 0x0010 (0x0010 - 0x0000)
struct Fcollision_channel final
{
public:
	int64                                         __verse_0x96B895E5_ChannelIndex;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// VerseStruct VerseQuery.collision_query_params
// 0x0018 (0x0018 - 0x0000)
struct Fcollision_query_params final
{
public:
	uint8                                         __verse_0xDC858D83_DetectOverlapping : 1;          // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_0_1 : 7;                                    // 0x0000(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x487997B9_DetectBlocking : 1;             // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Ucollision_component*>           __verse_0x8D4F251C_IgnoredComponents;              // 0x0008(0x0010)(InstancedReference, ContainsInstancedReference)
};

// VerseStruct VerseQuery.overlap_hit
// 0x0008 (0x0008 - 0x0000)
struct Foverlap_hit final
{
public:
	TOptional<class Ucomponent*, true>            __verse_0xB7171E04_Component;                      // 0x0000(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseQuery.overlap_hit_container
// 0x0010 (0x0010 - 0x0000)
struct Foverlap_hit_container final
{
public:
	TArray<struct Foverlap_hit>                   __verse_0x61E4BD55_Hits;                           // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
};

// VerseStruct VerseQuery.overlap_result
// 0x0020 (0x0020 - 0x0000)
struct Foverlap_result final
{
public:
	TOptional<class Uentity*, true>               __verse_0x9C8E9A95_ThisEntity;                     // 0x0000(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Ucomponent*, true>            __verse_0x0170A73A_ThisComponent;                  // 0x0008(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Uentity*, true>               __verse_0x9E548E88_OtherEntity;                    // 0x0010(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Ucomponent*, true>            __verse_0x15DAA648_OtherComponent;                 // 0x0018(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseQuery.trace_hit
// 0x0078 (0x0078 - 0x0000)
struct Ftrace_hit final
{
public:
	TOptional<class Ucomponent*, true>            __verse_0x43EA13DA_HitComponent;                   // 0x0000(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xF98E448C_HitPosition;                    // 0x0008(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0xA0175DA6_HitNormal;                      // 0x0020(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0x8DA8C548_HitFaceNormal;                  // 0x0038(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0x69A0C784_TraceHitPosition;               // 0x0050(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	double                                        __verse_0x25EF77D3_TraceHitDistance;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Ecollision_channel_response                   __verse_0x26884E96_HitResponse;                    // 0x0070(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// VerseStruct VerseQuery.trace_hit_container
// 0x0010 (0x0010 - 0x0000)
struct Ftrace_hit_container final
{
public:
	TArray<struct Ftrace_hit>                     __verse_0x61E4BD55_Hits;                           // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
};

// VerseStruct VerseQuery.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct VerseQuery_0::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseQuery.tuple_Laccessor_Mcollision__override_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Laccessor_Mcollision__override_R final
{
public:
	EVerse_accessor                               __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Ucollision_override*                    __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseQuery.tuple_Lcollision__channel_Mcollision__channel__response_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lcollision__channel_Mcollision__channel__response_R final
{
public:
	struct Fcollision_channel                     __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, NoDestructor)
	Ecollision_channel_response                   __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseQuery.tuple_Lcollision__component_Mvector3_Mrotation_R
// 0x0040 (0x0040 - 0x0000)
struct Ftuple_Lcollision__component_Mvector3_Mrotation_R final
{
public:
	class Ucollision_component*                   __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FVerseRotation                         __verse_0x932BF92E_Elem2;                          // 0x0020(0x0020)(InstancedReference, NoDestructor)
};

// VerseStruct VerseQuery.tuple_Lcollision__component_Mvector3_Mvector3_Mrotation_R
// 0x0060 (0x0060 - 0x0000)
struct Ftuple_Lcollision__component_Mvector3_Mvector3_Mrotation_R final
{
public:
	class Ucollision_component*                   __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0x932BF92E_Elem2;                          // 0x0020(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         __verse_0xF64C4596_Elem3;                          // 0x0040(0x0020)(InstancedReference, NoDestructor)
};

// VerseStruct VerseQuery.tuple_Lconvex__volume3_Mvector3_Mrotation_Mcollision__channel_Mcollision__query__params_R
// 0x0070 (0x0070 - 0x0000)
struct Ftuple_Lconvex__volume3_Mvector3_Mrotation_Mcollision__channel_Mcollision__query__params_R final
{
public:
	class Uconvex_volume3*                        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FVerseRotation                         __verse_0x932BF92E_Elem2;                          // 0x0020(0x0020)(InstancedReference, NoDestructor)
	struct Fcollision_channel                     __verse_0xF64C4596_Elem3;                          // 0x0040(0x0010)(InstancedReference, NoDestructor)
	struct Fcollision_query_params                __verse_0x4F74920B_Elem4;                          // 0x0050(0x0018)(InstancedReference)
};

// VerseStruct VerseQuery.tuple_Lconvex__volume3_Mvector3_Mvector3_Mcollision__channel_Mcollision__query__params_R
// 0x0060 (0x0060 - 0x0000)
struct Ftuple_Lconvex__volume3_Mvector3_Mvector3_Mcollision__channel_Mcollision__query__params_R final
{
public:
	class Uconvex_volume3*                        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0x932BF92E_Elem2;                          // 0x0020(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct Fcollision_channel                     __verse_0xF64C4596_Elem3;                          // 0x0038(0x0010)(InstancedReference, NoDestructor)
	struct Fcollision_query_params                __verse_0x4F74920B_Elem4;                          // 0x0048(0x0018)(InstancedReference)
};

// VerseStruct VerseQuery.tuple_Lentity_Mtuple_L_R_Mconvex__volume3_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lentity_Mtuple_L_R_Mconvex__volume3_R final
{
public:
	class Uentity*                                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseQuery_0::Ftuple_L_R               __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Uconvex_volume3*                        __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseQuery.tuple_Lentity_Mtuple_L_R_Mtag_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lentity_Mtuple_L_R_Mtag_R final
{
public:
	class Uentity*                                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseQuery_0::Ftuple_L_R               __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTags_tag*                              __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseQuery.tuple_Lentity_Mtuple_L_R_Mtuple_L_R_R
// 0x0010 (0x0010 - 0x0000)
struct VerseQuery_0::Ftuple_Lentity_Mtuple_L_R_Mtuple_L_R_R final
{
public:
	class Uentity*                                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseQuery_0::Ftuple_L_R               __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseQuery_0::Ftuple_L_R               __verse_0x932BF92E_Elem2;                          // 0x0009(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseQuery.tuple_Lentity_Mtuple_L_R_Mtype_Lcomponent_M_20component_R_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lentity_Mtuple_L_R_Mtype_Lcomponent_M_20component_R_R final
{
public:
	class Uentity*                                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseQuery_0::Ftuple_L_R               __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseQuery.tuple_Lentity_Mtuple_L_R_Mtype_Lentity_M_20entity_R_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lentity_Mtuple_L_R_Mtype_Lentity_M_20entity_R_R final
{
public:
	class Uentity*                                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseQuery_0::Ftuple_L_R               __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseQuery.tuple_Lvector3_Mvector3_Mcollision__channel_Mcollision__query__params_R
// 0x0058 (0x0058 - 0x0000)
struct Ftuple_Lvector3_Mvector3_Mcollision__channel_Mcollision__query__params_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0x18E3F084_Elem0;                          // 0x0000(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0x7D844C3C_Elem1;                          // 0x0018(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct Fcollision_channel                     __verse_0x932BF92E_Elem2;                          // 0x0030(0x0010)(InstancedReference, NoDestructor)
	struct Fcollision_query_params                __verse_0xF64C4596_Elem3;                          // 0x0040(0x0018)(InstancedReference)
};

}

