#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseBasicGameplay

#include "Basic.hpp"

#include "VerseBasicGameplay_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"
#include "VerseNative_0_classes.hpp"


namespace SDK
{

// VerseClass VerseBasicGameplay.VerseBasicGameplay_PlayerManager_basic_player_manager
// 0x0018 (0x0048 - 0x0030)
class UVerseBasicGameplay_PlayerManager_basic_player_manager : public UObject
{
public:
	class UPlayspace_playspace_component*         __verse_0xBC454097_ThePlayspace;                   // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x7DC483AF_PlayerAddedEvent;               // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x5DE94DD9_PlayerRemovedEvent;             // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	int64 _L_2fUnrealEngine_2ecom_2fTemporary_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RGetPlayerCount(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TArray<class USimulation_player*> _L_2fUnrealEngine_2ecom_2fTemporary_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RGetPlayers(const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseBasicGameplay_PlayerManager_basic_player_manager">();
	}
	static class UVerseBasicGameplay_PlayerManager_basic_player_manager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseBasicGameplay_PlayerManager_basic_player_manager>();
	}
};

// VerseClass VerseBasicGameplay.VerseBasicGameplay_PlayerManager_basic_player_manager_impl
// 0x0000 (0x0048 - 0x0048)
class UVerseBasicGameplay_PlayerManager_basic_player_manager_impl final : public UVerseBasicGameplay_PlayerManager_basic_player_manager
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UConcurrency_task* BeginWaitingForEvents(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseBasicGameplay::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseBasicGameplay_PlayerManager_basic_player_manager_impl">();
	}
	static class UVerseBasicGameplay_PlayerManager_basic_player_manager_impl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseBasicGameplay_PlayerManager_basic_player_manager_impl>();
	}
};

// VerseClass VerseBasicGameplay.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class VerseBasicGameplay::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseBasicGameplay.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseBasicGameplay::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseBasicGameplay::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseBasicGameplay.task_VerseBasicGameplay_PlayerManager_basic_player_manager_impl$BeginWaitingForEvents
// 0x0300 (0x03C8 - 0x00C8)
class Utask_VerseBasicGameplay_PlayerManager_basic_player_manager_impl_BeginWaitingForEvents final : public UConcurrency_task
{
public:
	class UVerseBasicGameplay_PlayerManager_basic_player_manager_impl* _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncEndCount_0;                                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_1 : 1;                            // 0x00E0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_player*                     __verse_0x31268F5C_PlayerAdded_1;                  // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0x00000000__2;                             // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayspace_playspace_component*         __verse_0x00000000__3;                             // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_2;                                      // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_3;                                 // 0x0108(0x0018)(HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _ExprResult_4;                                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_5;                                    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0130(0x0018)(HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _ExprResult_7;                                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_player_multicast_delegate*  __verse_0x8C908304_MulticastDelegate_4;            // 0x0150(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class USimulation_player_multicast_delegate*, true> _FallibleType_8;                                   // 0x0158(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class USimulation_player_multicast_delegate*  __verse_0x00000000__5;                             // 0x0160(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_9;                          // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_10;                                        // 0x0170(0x0018)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_11;                                    // 0x0188(0x0010)(HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_12 : 1;                           // 0x0198(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_player*                     __verse_0x0B5DEACA_PlayerRemoved_6;                // 0x01A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0x00000000__7;                             // 0x01A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayspace_playspace_component*         __verse_0x00000000__8;                             // 0x01B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_13;                                     // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_14;                                // 0x01C0(0x0018)(HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _ExprResult_15;                                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_16;                                   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_17;                                        // 0x01E8(0x0018)(HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _ExprResult_18;                                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_player_multicast_delegate*  __verse_0x8C908304_MulticastDelegate_9;            // 0x0208(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class USimulation_player_multicast_delegate*, true> _FallibleType_19;                                  // 0x0210(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class USimulation_player_multicast_delegate*  __verse_0x00000000__10;                            // 0x0218(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_20;                         // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_21;                                        // 0x0228(0x0018)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_22;                                    // 0x0240(0x0010)(HasGetValueTypeHash)
	int64                                         _AsyncEndCount_23;                                 // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_24 : 1;                           // 0x0258(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_player*                     __verse_0x31268F5C_PlayerAdded_11;                 // 0x0260(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0x00000000__12;                            // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayspace_playspace_component*         __verse_0x00000000__13;                            // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_25;                                     // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_26;                                // 0x0280(0x0018)(HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _ExprResult_27;                                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_28;                                   // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_29;                                        // 0x02A8(0x0018)(HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _ExprResult_30;                                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_player_multicast_delegate*  __verse_0x8C908304_MulticastDelegate_14;           // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class USimulation_player_multicast_delegate*, true> _FallibleType_31;                                  // 0x02D0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class USimulation_player_multicast_delegate*  __verse_0x00000000__15;                            // 0x02D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_32;                         // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_33;                                        // 0x02E8(0x0018)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_34;                                    // 0x0300(0x0010)(HasGetValueTypeHash)
	uint8                                         _AsyncBeginCount_35 : 1;                           // 0x0310(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_player*                     __verse_0x0B5DEACA_PlayerRemoved_16;               // 0x0318(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0x00000000__17;                            // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayspace_playspace_component*         __verse_0x00000000__18;                            // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_36;                                     // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_37;                                // 0x0338(0x0018)(HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _ExprResult_38;                                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_39;                                   // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_40;                                        // 0x0360(0x0018)(HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _ExprResult_41;                                    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_player_multicast_delegate*  __verse_0x8C908304_MulticastDelegate_19;           // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class USimulation_player_multicast_delegate*, true> _FallibleType_42;                                  // 0x0388(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class USimulation_player_multicast_delegate*  __verse_0x00000000__20;                            // 0x0390(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_43;                         // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_44;                                        // 0x03A0(0x0018)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_45;                                    // 0x03B8(0x0010)(HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseBasicGameplay_PlayerManager_basic_player_manager_impl$BeginWaitingForEvents">();
	}
	static class Utask_VerseBasicGameplay_PlayerManager_basic_player_manager_impl_BeginWaitingForEvents* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseBasicGameplay_PlayerManager_basic_player_manager_impl_BeginWaitingForEvents>();
	}
};

// VerseClass VerseBasicGameplay.VerseBasicGameplay_PlayerManager
// 0x0000 (0x0030 - 0x0030)
class UVerseBasicGameplay_PlayerManager final : public UObject
{
public:
	static TOptional<class UVerseBasicGameplay_PlayerManager_basic_player_manager*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fVerseBasicGameplay_2fPlayerManager_N_RGetPlayerManagerForLocation_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseBasicGameplay_PlayerManager">();
	}
	static class UVerseBasicGameplay_PlayerManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseBasicGameplay_PlayerManager>();
	}
};

}

