#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VersePrototypeGameplay

#include "Basic.hpp"

#include "VersePrototypeGameplay_build_path_astar_args_structs.hpp"
#include "VersePrototypeGameplay_structs.hpp"
#include "VerseNative_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK::Params
{

// Function VersePrototypeGameplay.VersePrototypeGameplay.build_path_astar_args$Factory
// 0x0068 (0x0068 - 0x0000)
struct VersePrototypeGameplay_build_path_astar_args_Factory final
{
public:
	struct Fbuild_path_astar_args                 RetVal;                                            // 0x0000(0x0068)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function VersePrototypeGameplay.VersePrototypeGameplay.build_path_astar_args$OverrideFactory
// 0x00B8 (0x00B8 - 0x0000)
struct VersePrototypeGameplay_build_path_astar_args_OverrideFactory final
{
public:
	struct Fbuild_path_astar_args                 RetVal;                                            // 0x0000(0x0068)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0068(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function VersePrototypeGameplay.VersePrototypeGameplay._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_N_RBuildPathUsingAStar_L_Nbuild__path__astar__args_R
// 0x0A00 (0x0A00 - 0x0000)
struct VersePrototypeGameplay__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_N_RBuildPathUsingAStar_L_Nbuild__path__astar__args_R final
{
public:
	struct Fbuild_path_astar_args                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0068)(Parm, HasGetValueTypeHash)
	TOptional<TArray<struct FSpatialMath_vector2i>> RetVal;                                            // 0x0068(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
	EVerseFalse                                   _ExprResult_0;                                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TArray<class Unav_grid_node_2d*>>      __verse_0x2ABBC497_NavGrid_1;                      // 0x0088(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0098(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Lvector2i_Mvector2i_Mtype_7b___L_Nvector2i_M_Nvector2i_R_3ctransacts_3e_Nfloat_7d_R _ExprResult_2;                                     // 0x00B0(0x0038)(HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              __verse_0x2A460A42_Queue_1;                        // 0x00E8(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_2;                        // 0x00F8(0x0010)(ContainsInstancedReference)
	TArray<class Unav_grid_node_2d*>              _ForResult_3;                                      // 0x0108(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_4;                                       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_5;                                      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_4;                         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_6 : 1;                                 // 0x0129(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class Unav_grid_node_2d*                      __verse_0x09789756_StartNode_6;                    // 0x0130(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _ExprResultStack_7;                                // 0x0138(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              _ExprResultStack_8;                                // 0x0140(0x0010)(ContainsInstancedReference)
	TOptional<TArray<class Unav_grid_node_2d*>>   _ExprResultStack_9;                                // 0x0150(0x0018)(ZeroConstructor, ContainsInstancedReference)
	double                                        _ExprResultStack_10;                               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VerseClassVarProxySetterRHS_11;                    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_12;                               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VerseClassVarProxySetterRHS_13;                    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_14;                               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              _AssignmentScratch_15;                             // 0x0190(0x0010)(ContainsInstancedReference)
	TArray<class Unav_grid_node_2d*>              _ExprResultStack_16;                               // 0x01A0(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_17;                                        // 0x01B0(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay::Ftuple_L_Knav__grid__node__2d_Mnav__grid__node__2d_R _ExprResult_18;                                    // 0x01C8(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay::Ftuple_Lnav__grid__node__2d_M_Knav__grid__node__2d_R __verse_0x493A8541_PopResult_9;                    // 0x01E0(0x0018)(HasGetValueTypeHash)
	TOptional<struct VersePrototypeGameplay::Ftuple_Lnav__grid__node__2d_M_Knav__grid__node__2d_R> _ExprResultStack_19;                               // 0x01F8(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_20;                                        // 0x0218(0x0018)(HasGetValueTypeHash)
	class Unav_grid_node_2d*                      __verse_0x32234590_CurrentNode_9;                  // 0x0230(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              _AssignmentScratch_21;                             // 0x0238(0x0010)(ContainsInstancedReference)
	TArray<class Unav_grid_node_2d*>              _ExprResultDummy_22;                               // 0x0248(0x0010)(ContainsInstancedReference)
	uint8                                         _ExprResultStack_23 : 1;                           // 0x0258(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_258_1 : 7;                                  // 0x0258(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         VerseClassVarProxySetterRHS_24 : 1;                // 0x0259(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Unav_grid_node_2d*>              _ForIterable_25;                                   // 0x0260(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_26;                                        // 0x0270(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Lnav__grid__node__2d_M_K_Knav__grid__node__2d_R _ExprResult_27;                                    // 0x0288(0x0018)(HasGetValueTypeHash)
	int64                                         _ForIndex_28;                                      // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_29;                                     // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Unav_grid_node_2d*                      __verse_0xBECC80A3_neighbor_12;                    // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__16;                            // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_30;                               // 0x02C0(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_31;                                        // 0x02C8(0x0018)(HasGetValueTypeHash)
	double                                        _ExprResultStack_32;                               // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VerseClassVarProxySetterRHS_33;                    // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_34;                               // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_35;                                        // 0x02F8(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay::Ftuple_Lfloat_Mfloat_R _ExprResult_36;                                    // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_37;                               // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_38;                               // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_39;                               // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_40;                                        // 0x0338(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay::Ftuple_Lvector2i_Mvector2i_R _ExprResult_41;                                    // 0x0350(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x46640D39_MinDistance_17;                 // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_42;                                        // 0x0378(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay::Ftuple_Lfloat_Mfloat_R _ExprResult_43;                                    // 0x0390(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_44;                               // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_45;                               // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              _AssignmentScratch_46;                             // 0x03B0(0x0010)(ContainsInstancedReference)
	TArray<class Unav_grid_node_2d*>              _ExprResultStack_47;                               // 0x03C0(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_48;                                        // 0x03D0(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay::Ftuple_L_Knav__grid__node__2d_Mnav__grid__node__2d_R _ExprResult_49;                                    // 0x03E8(0x0018)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_50;                              // 0x0400(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_51;                               // 0x0410(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_52;                                    // 0x0428(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_53;                                    // 0x0438(0x0010)(HasGetValueTypeHash)
	double                                        _ExprResultStack_54;                               // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_55;                               // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VerseClassVarProxySetterRHS_56;                    // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _ExprResultStack_57;                               // 0x0460(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     VerseClassVarProxySetterRHS_58;                    // 0x0468(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _ExprResult_59;                                    // 0x0470(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              _AssignmentScratch_60;                             // 0x0478(0x0010)(ContainsInstancedReference)
	TArray<class Unav_grid_node_2d*>              _ExprResultStack_61;                               // 0x0488(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_62;                                        // 0x0498(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay::Ftuple_L_Knav__grid__node__2d_Mnav__grid__node__2d_R _ExprResult_63;                                    // 0x04B0(0x0018)(HasGetValueTypeHash)
	class Unav_grid_node_2d*                      __verse_0xFD12DD3D_EndNode_1;                      // 0x04C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _ExprResultStack_64;                               // 0x04D0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              _ExprResultStack_65;                               // 0x04D8(0x0010)(ContainsInstancedReference)
	TOptional<TArray<class Unav_grid_node_2d*>>   _ExprResultStack_66;                               // 0x04E8(0x0018)(ZeroConstructor, ContainsInstancedReference)
	class Unav_grid_node_2d*                      __verse_0xD38C1E79_Parent_1;                       // 0x0500(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _ExprResultStack_67;                               // 0x0508(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _ExprResultStack_68;                               // 0x0510(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FSpatialMath_vector2i>          _ExprResultStack_69;                               // 0x0518(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_70;                                        // 0x0528(0x0018)(HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_71;                                    // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TArray<class Unav_grid_node_2d*>>      __verse_0x2ABBC497_NavGrid_22;                     // 0x0548(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_72;                                        // 0x0558(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Lvector2i_Mvector2i_Mtype_7b___L_Nvector2i_M_Nvector2i_R_3ctransacts_3e_Nfloat_7d_R _ExprResult_73;                                    // 0x0570(0x0038)(HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              __verse_0x2A460A42_Queue_22;                       // 0x05A8(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_23;                       // 0x05B8(0x0010)(ContainsInstancedReference)
	TArray<class Unav_grid_node_2d*>              _ForResult_74;                                     // 0x05C8(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_75;                                      // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_76;                                     // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_25;                        // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_77 : 1;                                // 0x05E9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_5EA[0x6];                                      // 0x05EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class Unav_grid_node_2d*                      __verse_0x09789756_StartNode_27;                   // 0x05F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _ExprResultStack_78;                               // 0x05F8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              _ExprResultStack_79;                               // 0x0600(0x0010)(ContainsInstancedReference)
	TOptional<TArray<class Unav_grid_node_2d*>>   _ExprResultStack_80;                               // 0x0610(0x0018)(ZeroConstructor, ContainsInstancedReference)
	double                                        _ExprResultStack_81;                               // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VerseClassVarProxySetterRHS_82;                    // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_83;                               // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VerseClassVarProxySetterRHS_84;                    // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_85;                               // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              _AssignmentScratch_86;                             // 0x0650(0x0010)(ContainsInstancedReference)
	TArray<class Unav_grid_node_2d*>              _ExprResultStack_87;                               // 0x0660(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_88;                                        // 0x0670(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay::Ftuple_L_Knav__grid__node__2d_Mnav__grid__node__2d_R _ExprResult_89;                                    // 0x0688(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay::Ftuple_Lnav__grid__node__2d_M_Knav__grid__node__2d_R __verse_0x493A8541_PopResult_30;                   // 0x06A0(0x0018)(HasGetValueTypeHash)
	TOptional<struct VersePrototypeGameplay::Ftuple_Lnav__grid__node__2d_M_Knav__grid__node__2d_R> _ExprResultStack_90;                               // 0x06B8(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_91;                                        // 0x06D8(0x0018)(HasGetValueTypeHash)
	class Unav_grid_node_2d*                      __verse_0x32234590_CurrentNode_30;                 // 0x06F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              _AssignmentScratch_92;                             // 0x06F8(0x0010)(ContainsInstancedReference)
	TArray<class Unav_grid_node_2d*>              _ExprResultDummy_93;                               // 0x0708(0x0010)(ContainsInstancedReference)
	uint8                                         _ExprResultStack_94 : 1;                           // 0x0718(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_718_1 : 7;                                  // 0x0718(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         VerseClassVarProxySetterRHS_95 : 1;                // 0x0719(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_71A[0x6];                                      // 0x071A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class Unav_grid_node_2d*>              _ForIterable_96;                                   // 0x0720(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_97;                                        // 0x0730(0x0018)(HasGetValueTypeHash)
	struct Ftuple_Lnav__grid__node__2d_M_K_Knav__grid__node__2d_R _ExprResult_98;                                    // 0x0748(0x0018)(HasGetValueTypeHash)
	int64                                         _ForIndex_99;                                      // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_100;                                    // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Unav_grid_node_2d*                      __verse_0xBECC80A3_neighbor_33;                    // 0x0770(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__37;                            // 0x0778(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_101;                              // 0x0780(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_782[0x6];                                      // 0x0782(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_102;                                       // 0x0788(0x0018)(HasGetValueTypeHash)
	double                                        _ExprResultStack_103;                              // 0x07A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VerseClassVarProxySetterRHS_104;                   // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_105;                              // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_106;                                       // 0x07B8(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay::Ftuple_Lfloat_Mfloat_R _ExprResult_107;                                   // 0x07D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_108;                              // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_109;                              // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_110;                              // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_111;                                       // 0x07F8(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay::Ftuple_Lvector2i_Mvector2i_R _ExprResult_112;                                   // 0x0810(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x46640D39_MinDistance_38;                 // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_113;                                       // 0x0838(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay::Ftuple_Lfloat_Mfloat_R _ExprResult_114;                                   // 0x0850(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_115;                              // 0x0860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_116;                              // 0x0868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              _AssignmentScratch_117;                            // 0x0870(0x0010)(ContainsInstancedReference)
	TArray<class Unav_grid_node_2d*>              _ExprResultStack_118;                              // 0x0880(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_119;                                       // 0x0890(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay::Ftuple_L_Knav__grid__node__2d_Mnav__grid__node__2d_R _ExprResult_120;                                   // 0x08A8(0x0018)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_121;                             // 0x08C0(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_122;                              // 0x08D0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_123;                                   // 0x08E8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_124;                                   // 0x08F8(0x0010)(HasGetValueTypeHash)
	double                                        _ExprResultStack_125;                              // 0x0908(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_126;                              // 0x0910(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VerseClassVarProxySetterRHS_127;                   // 0x0918(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _ExprResultStack_128;                              // 0x0920(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     VerseClassVarProxySetterRHS_129;                   // 0x0928(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _ExprResult_130;                                   // 0x0930(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              _AssignmentScratch_131;                            // 0x0938(0x0010)(ContainsInstancedReference)
	TArray<class Unav_grid_node_2d*>              _ExprResultStack_132;                              // 0x0948(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_133;                                       // 0x0958(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay::Ftuple_L_Knav__grid__node__2d_Mnav__grid__node__2d_R _ExprResult_134;                                   // 0x0970(0x0018)(HasGetValueTypeHash)
	class Unav_grid_node_2d*                      __verse_0xFD12DD3D_EndNode_22;                     // 0x0988(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _ExprResultStack_135;                              // 0x0990(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class Unav_grid_node_2d*>              _ExprResultStack_136;                              // 0x0998(0x0010)(ContainsInstancedReference)
	TOptional<TArray<class Unav_grid_node_2d*>>   _ExprResultStack_137;                              // 0x09A8(0x0018)(ZeroConstructor, ContainsInstancedReference)
	class Unav_grid_node_2d*                      __verse_0xD38C1E79_Parent_22;                      // 0x09C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _ExprResultStack_138;                              // 0x09C8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Unav_grid_node_2d*, true>     _ExprResultStack_139;                              // 0x09D0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FSpatialMath_vector2i>          _ExprResultStack_140;                              // 0x09D8(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_141;                                       // 0x09E8(0x0018)(HasGetValueTypeHash)
};

// Function VersePrototypeGameplay.VersePrototypeGameplay._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_N_RBuildPathUsingAStarSimple_L_Ni__grid__occupancy_M_Nvector2i_M_Nvector2i_M_Nvector2i_R
// 0x0300 (0x0300 - 0x0000)
struct VersePrototypeGameplay__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_N_RBuildPathUsingAStarSimple_L_Ni__grid__occupancy_M_Nvector2i_M_Nvector2i_M_Nvector2i_R final
{
public:
	struct Ftuple_Li__grid__occupancy_Mvector2i_Mvector2i_Mvector2i_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0038)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<TArray<struct FSpatialMath_vector2i>> RetVal;                                            // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference)
	TArray<struct FSpatialMath_vector2i>          _ExprResultStack_0;                                // 0x0050(0x0010)(ContainsInstancedReference)
	TOptional<TArray<struct FSpatialMath_vector2i>> _ExprResultStack_1;                                // 0x0060(0x0018)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0078(0x0018)(HasGetValueTypeHash)
	struct Fbuild_path_astar_args                 _ExprResult_3;                                     // 0x0090(0x0068)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_4;                                // 0x00F8(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0148(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x0158(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0168(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_8;                                     // 0x0178(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_9;                                     // 0x0188(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_10;                                    // 0x0198(0x0010)(HasGetValueTypeHash)
	TArray<struct FSpatialMath_vector2i>          _ExprResultStack_11;                               // 0x01A8(0x0010)(ContainsInstancedReference)
	TOptional<TArray<struct FSpatialMath_vector2i>> _ExprResultStack_12;                               // 0x01B8(0x0018)(ZeroConstructor, ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_13;                                        // 0x01D0(0x0018)(HasGetValueTypeHash)
	struct Fbuild_path_astar_args                 _ExprResult_14;                                    // 0x01E8(0x0068)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_15;                               // 0x0250(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_16;                                    // 0x02A0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_17;                                    // 0x02B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_18;                                    // 0x02C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_19;                                    // 0x02D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_20;                                    // 0x02E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_21;                                    // 0x02F0(0x0010)(HasGetValueTypeHash)
};

// Function VersePrototypeGameplay.VersePrototypeGameplay._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_N_RCreateModelAdvanced_L_N_Ksubtype_Lvk__component_R_M_Ntransform_M_N_Kchar_M_Nmesh_M_Nmaterial_R
// 0x0280 (0x0280 - 0x0000)
struct VersePrototypeGameplay__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_N_RCreateModelAdvanced_L_N_Ksubtype_Lvk__component_R_M_Ntransform_M_N_Kchar_M_Nmesh_M_Nmaterial_R final
{
public:
	struct VersePrototypeGameplay::Ftuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_Mmaterial_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0090)(Parm, HasGetValueTypeHash)
	TOptional<class Umodel_advanced*, true>       RetVal;                                            // 0x0090(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Umodel_advanced*, true>       __verse_0x7376A746_OptionModel_1;                  // 0x0098(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x00A0(0x0018)(HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct VersePrototypeGameplay::Ftuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_R _ExprResult_1;                                     // 0x00C0(0x0090)(HasGetValueTypeHash)
	class Umodel_advanced*                        __verse_0x986678F9_Model_2;                        // 0x0150(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Umodel_advanced*, true>       _ExprResultStack_2;                                // 0x0158(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__3;                             // 0x0160(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0170(0x0018)(HasGetValueTypeHash)
	TOptional<class Umodel_advanced*, true>       __verse_0x7376A746_OptionModel_4;                  // 0x0188(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0190(0x0018)(HasGetValueTypeHash)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct VersePrototypeGameplay::Ftuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_R _ExprResult_6;                                     // 0x01B0(0x0090)(HasGetValueTypeHash)
	class Umodel_advanced*                        __verse_0x986678F9_Model_5;                        // 0x0240(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Umodel_advanced*, true>       _ExprResultStack_7;                                // 0x0248(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__6;                             // 0x0250(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_8;                          // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x0260(0x0018)(HasGetValueTypeHash)
};

// Function VersePrototypeGameplay.VersePrototypeGameplay._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_N_RCreateModelAdvanced_L_N_Ksubtype_Lvk__component_R_M_Ntransform_M_N_Kchar_M_Nmesh_R
// 0x03A0 (0x03A0 - 0x0000)
struct VersePrototypeGameplay__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_N_RCreateModelAdvanced_L_N_Ksubtype_Lvk__component_R_M_Ntransform_M_N_Kchar_M_Nmesh_R final
{
public:
	struct VersePrototypeGameplay::Ftuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0090)(Parm, HasGetValueTypeHash)
	TOptional<class Umodel_advanced*, true>       RetVal;                                            // 0x0090(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0098(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVerseEngine_Entity_vk_entity*, true> __verse_0xDD525F24_OptionObj_2;                    // 0x00A0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x00A8(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay::Ftuple_Ltransform_M_Kchar_R _ExprResult_1;                                     // 0x00C0(0x0070)(HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x4F5E77FF_Obj_3;                          // 0x0130(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseEngine_Entity_vk_entity*, true> _ExprResultStack_2;                                // 0x0138(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Umodel_advanced*, true>       __verse_0x7376A746_OptionModel_4;                  // 0x0140(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0148(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay::Ftuple_Lvk__entity_M_Ksubtype_Lvk__component_R_R _ExprResult_4;                                     // 0x0160(0x0018)(HasGetValueTypeHash)
	class Umodel_advanced*                        __verse_0x986678F9_Model_5;                        // 0x0178(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Umodel_advanced*, true>       _ExprResultStack_5;                                // 0x0180(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__6;                             // 0x0188(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_6;                          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0198(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__7;                             // 0x01B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_8;                          // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x01C0(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x00000000__8;                             // 0x01D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_10;                         // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x01E8(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_12;                                    // 0x0200(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_13 : 1;                                // 0x0210(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_14;                               // 0x0211(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__10;                            // 0x0213(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVerseEngine_Entity_vk_entity*, true> __verse_0xDD525F24_OptionObj_11;                   // 0x0218(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_15;                                        // 0x0220(0x0018)(HasGetValueTypeHash)
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct VersePrototypeGameplay::Ftuple_Ltransform_M_Kchar_R _ExprResult_16;                                    // 0x0240(0x0070)(HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x4F5E77FF_Obj_12;                         // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseEngine_Entity_vk_entity*, true> _ExprResultStack_17;                               // 0x02B8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Umodel_advanced*, true>       __verse_0x7376A746_OptionModel_13;                 // 0x02C0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_18;                                        // 0x02C8(0x0018)(HasGetValueTypeHash)
	struct VersePrototypeGameplay::Ftuple_Lvk__entity_M_Ksubtype_Lvk__component_R_R _ExprResult_19;                                    // 0x02E0(0x0018)(HasGetValueTypeHash)
	class Umodel_advanced*                        __verse_0x986678F9_Model_14;                       // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Umodel_advanced*, true>       _ExprResultStack_20;                               // 0x0300(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__15;                            // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_21;                         // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_22;                                        // 0x0318(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__16;                            // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_23;                         // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_24;                                        // 0x0340(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x00000000__17;                            // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_25;                         // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_26;                                        // 0x0368(0x0018)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_27;                                    // 0x0380(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_28 : 1;                                // 0x0390(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_29;                               // 0x0391(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VersePrototypeGameplay.VersePrototypeGameplay._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_N_RCreateModelAdvanced_L_N_Ksubtype_Lvk__component_R_M_Nvector3_M_Nrotation_M_Nvector3_M_N_Kchar_M_Nmesh_M_Nmaterial_R
// 0x0440 (0x0440 - 0x0000)
struct VersePrototypeGameplay__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_N_RCreateModelAdvanced_L_N_Ksubtype_Lvk__component_R_M_Nvector3_M_Nrotation_M_Nvector3_M_N_Kchar_M_Nmesh_M_Nmaterial_R final
{
public:
	struct VersePrototypeGameplay::Ftuple_L_Ksubtype_Lvk__component_R_Mvector3_Mrotation_Mvector3_M_Kchar_Mmesh_Mmaterial_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0090)(Parm, HasGetValueTypeHash)
	TOptional<class Umodel_advanced*, true>       RetVal;                                            // 0x0090(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Umodel_advanced*, true>       __verse_0x7376A746_OptionModel_1;                  // 0x0098(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x00A0(0x0018)(HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct VersePrototypeGameplay::Ftuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_R _ExprResult_1;                                     // 0x00C0(0x0090)(HasGetValueTypeHash)
	struct FSpatialMath_transform                 _ExprResult_2;                                     // 0x0150(0x0060)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_3;                                // 0x01B0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x0200(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0210(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x0220(0x0010)(HasGetValueTypeHash)
	class Umodel_advanced*                        __verse_0x986678F9_Model_2;                        // 0x0230(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Umodel_advanced*, true>       _ExprResultStack_7;                                // 0x0238(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__3;                             // 0x0240(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_8;                          // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x0250(0x0018)(HasGetValueTypeHash)
	TOptional<class Umodel_advanced*, true>       __verse_0x7376A746_OptionModel_4;                  // 0x0268(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_10;                                        // 0x0270(0x0018)(HasGetValueTypeHash)
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct VersePrototypeGameplay::Ftuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_R _ExprResult_11;                                    // 0x0290(0x0090)(HasGetValueTypeHash)
	struct FSpatialMath_transform                 _ExprResult_12;                                    // 0x0320(0x0060)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_13;                               // 0x0380(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_14;                                    // 0x03D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x03E0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_16;                                    // 0x03F0(0x0010)(HasGetValueTypeHash)
	class Umodel_advanced*                        __verse_0x986678F9_Model_5;                        // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Umodel_advanced*, true>       _ExprResultStack_17;                               // 0x0408(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__6;                             // 0x0410(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_18;                         // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_19;                                        // 0x0420(0x0018)(HasGetValueTypeHash)
};

// Function VersePrototypeGameplay.VersePrototypeGameplay._L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_N_RCreateModelAdvanced_L_Ntag_R
// 0x00F8 (0x00F8 - 0x0000)
struct VersePrototypeGameplay__L_2fUnrealEngine_2ecom_2fTests_2fVersePrototypeGameplay_N_RCreateModelAdvanced_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class Umodel_advanced*, true>       RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0010(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEntityComponent*                       __verse_0x44719314_FoundComponent_3;               // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_0;                                // 0x0020(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0028(0x0018)(HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x5F5E89D8_ValidEntity_3;                  // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseEngine_Entity_vk_entity*, true> _ExprResultStack_2;                                // 0x0048(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0050(0x0018)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0068(0x0018)(HasGetValueTypeHash)
	uint8                                         _ExprResult_5 : 1;                                 // 0x0080(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_6;                                // 0x0081(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__6;                             // 0x0083(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UEntityComponent*                       __verse_0x44719314_FoundComponent_8;               // 0x0088(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_7;                                // 0x0090(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x0098(0x0018)(HasGetValueTypeHash)
