#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteGameScript_fort_scene_object

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"
#include "VerseFortniteGameScript_fort_scene_object_structs.hpp"


namespace SDK::Params
{

// Function VerseFortniteGameScript_fort_scene_object.fort_scene_object._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__scene__object_N_RGetEntity
// 0x0010 (0x0010 - 0x0000)
struct fort_scene_object__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__scene__object_N_RGetEntity final
{
public:
	struct VerseFortniteGameScript_fort_scene_object::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerseEngine_Entity_vk_entity*          RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_scene_object.fort_scene_object._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__scene__object_N_RGetPosition
// 0x0070 (0x0070 - 0x0000)
struct fort_scene_object__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__scene__object_N_RGetPosition final
{
public:
	struct VerseFortniteGameScript_fort_scene_object::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	class UVGameplayRst_Transform_position_component* __verse_0x00000000__1;                             // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0028(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_scene_object::Ftuple_L_R _ExprResult_1;                                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVGameplayRst_Transform_position_component* __verse_0x00000000__2;                             // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0050(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_scene_object::Ftuple_L_R _ExprResult_3;                                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_scene_object.fort_scene_object._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__scene__object_N_RGetRotation
// 0x0080 (0x0080 - 0x0000)
struct fort_scene_object__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__scene__object_N_RGetRotation final
{
public:
	struct VerseFortniteGameScript_fort_scene_object::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         RetVal;                                            // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	class UVGameplayRst_Transform_rotation_component* __verse_0x00000000__1;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0038(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_scene_object::Ftuple_L_R _ExprResult_1;                                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVGameplayRst_Transform_rotation_component* __verse_0x00000000__2;                             // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0060(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_scene_object::Ftuple_L_R _ExprResult_3;                                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_scene_object.fort_scene_object._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__scene__object_N_RGetScale
// 0x0070 (0x0070 - 0x0000)
struct fort_scene_object__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__scene__object_N_RGetScale final
{
public:
	struct VerseFortniteGameScript_fort_scene_object::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	class UVGameplayRst_Transform_scale_component* __verse_0x00000000__1;                             // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0028(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_scene_object::Ftuple_L_R _ExprResult_1;                                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVGameplayRst_Transform_scale_component* __verse_0x00000000__2;                             // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0050(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_scene_object::Ftuple_L_R _ExprResult_3;                                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_scene_object.fort_scene_object._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__scene__object_N_RGetTransform
// 0x0310 (0x0310 - 0x0000)
struct fort_scene_object__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__scene__object_N_RGetTransform final
{
public:
	struct VerseFortniteGameScript_fort_scene_object::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 RetVal;                                            // 0x0010(0x0060)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_0;                                // 0x0070(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_1;                                     // 0x00C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x00D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x00E0(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_4;                                     // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVGameplayRst_Transform_position_component* __verse_0x00000000__1;                             // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0110(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_scene_object::Ftuple_L_R _ExprResult_6;                                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         _ExprResult_7;                                     // 0x0130(0x0020)(NoDestructor)
	class UVGameplayRst_Transform_rotation_component* __verse_0x00000000__2;                             // 0x0150(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x0158(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_scene_object::Ftuple_L_R _ExprResult_9;                                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _ExprResult_10;                                    // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVGameplayRst_Transform_scale_component* __verse_0x00000000__3;                             // 0x0190(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x0198(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_scene_object::Ftuple_L_R _ExprResult_12;                                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_13;                               // 0x01B8(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_14;                                    // 0x0208(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x0218(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_16;                                    // 0x0228(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_17;                                    // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVGameplayRst_Transform_position_component* __verse_0x00000000__4;                             // 0x0250(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_18;                                        // 0x0258(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_scene_object::Ftuple_L_R _ExprResult_19;                                    // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0xF];                                      // 0x0271(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         _ExprResult_20;                                    // 0x0280(0x0020)(NoDestructor)
	class UVGameplayRst_Transform_rotation_component* __verse_0x00000000__5;                             // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_21;                                        // 0x02A8(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_scene_object::Ftuple_L_R _ExprResult_22;                                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _ExprResult_23;                                    // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVGameplayRst_Transform_scale_component* __verse_0x00000000__6;                             // 0x02E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_24;                                        // 0x02E8(0x0018)(HasGetValueTypeHash)
	struct VerseFortniteGameScript_fort_scene_object::Ftuple_L_R _ExprResult_25;                                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_scene_object.fort_scene_object._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__scene__object_N_RSetPosition_L_Nvector3_R
// 0x0068 (0x0068 - 0x0000)
struct fort_scene_object__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__scene__object_N_RSetPosition_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVGameplayRst_Transform_position_component* __verse_0x00000000__1;                             // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0028(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0x00000000__2;                             // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0050(0x0018)(HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_scene_object.fort_scene_object._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__scene__object_N_RSetRotation_L_Nrotation_R
// 0x0070 (0x0070 - 0x0000)
struct fort_scene_object__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__scene__object_N_RSetRotation_L_Nrotation_R final
{
public:
	struct FVerseRotation                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0020)(Parm, NoDestructor)
	class UVGameplayRst_Transform_rotation_component* __verse_0x00000000__1;                             // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* __verse_0x00000000__2;                             // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0058(0x0018)(HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_scene_object.fort_scene_object._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__scene__object_N_RSetScale_L_Nvector3_R
// 0x0068 (0x0068 - 0x0000)
struct fort_scene_object__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__scene__object_N_RSetScale_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVGameplayRst_Transform_scale_component* __verse_0x00000000__1;                             // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0028(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* __verse_0x00000000__2;                             // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0050(0x0018)(HasGetValueTypeHash)
};

// Function VerseFortniteGameScript_fort_scene_object.fort_scene_object._L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__scene__object_N_RSetTransform_L_Ntransform_R
// 0x0150 (0x0150 - 0x0000)
struct fort_scene_object__L_2fFortnite_2ecom_2fVerseFortniteGameScript_2ffort__scene__object_N_RSetTransform_L_Ntransform_R final
{
public:
	struct FSpatialMath_transform                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0060)(Parm, NoDestructor)
	class UVGameplayRst_Transform_position_component* __verse_0x00000000__2;                             // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0070(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* __verse_0x00000000__3;                             // 0x0088(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0098(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* __verse_0x00000000__4;                             // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_4;                          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x00C0(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0x00000000__6;                             // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_6;                          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x00E8(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* __verse_0x00000000__7;                             // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_8;                          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x0110(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* __verse_0x00000000__8;                             // 0x0128(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_10;                         // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x0138(0x0018)(HasGetValueTypeHash)
};

}

