#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFramework_test_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "UnrealEngineExperimental_0_structs.hpp"
#include "VerseFramework_test_device_structs.hpp"
#include "VerseNative_0_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass VerseFramework_test_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class VerseFramework_test_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseFramework_test_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseFramework_test_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseFramework_test_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseFramework_test_device.task_test_device$OnBegin
// 0x0048 (0x0110 - 0x00C8)
class Utask_test_device_OnBegin final : public UConcurrency_task
{
public:
	class Utest_device*                           _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseFramework_test_device::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x00D8(0x0018)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_2;                          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x00F8(0x0018)(HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_test_device$OnBegin">();
	}
	static class Utask_test_device_OnBegin* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_test_device_OnBegin>();
	}
};

// VerseClass VerseFramework_test_device.task_test_device$AfterAll
// 0x0010 (0x00D8 - 0x00C8)
class Utask_test_device_AfterAll final : public UConcurrency_task
{
public:
	class Utest_device*                           _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseFramework_test_device::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_test_device$AfterAll">();
	}
	static class Utask_test_device_AfterAll* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_test_device_AfterAll>();
	}
};

// VerseClass VerseFramework_test_device.test_device
// 0x0020 (0x00F0 - 0x00D0)
class Utest_device final : public UDevices_creative_device
{
public:
	TOptional<class Utest_runner_device*, true>   __verse_0x0B873A9F_TestRunnerDevice;               // 0x00D0(0x0008)(Edit, InstancedReference, SaveGame, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class Utest_runner*                           __verse_0xD5B44017_TestRunner;                     // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x4D9F0069_SuiteName;                      // 0x00E0(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fVerseInternalTesting_2fVerseFramework_2ftest__device_N_ROnBegin_L_R_Nvoid(const struct VerseFramework_test_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fVerseInternalTesting_2fVerseFramework_2ftest__device_N_RRegisterTests(const struct VerseFramework_test_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TArray<struct Ftest_case> _L_2fFortnite_2ecom_2fVerseInternalTesting_2fVerseFramework_2ftest__device_N_RTestCases(const struct VerseFramework_test_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* AfterAll(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFramework_test_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* AfterEach(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFramework_test_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* BeforeAll(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFramework_test_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* BeforeEach(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFramework_test_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* OnBegin(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFramework_test_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"test_device">();
	}
	static class Utest_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utest_device>();
	}
};

// VerseClass VerseFramework_test_device.task_test_device$AfterEach
// 0x0010 (0x00D8 - 0x00C8)
class Utask_test_device_AfterEach final : public UConcurrency_task
{
public:
	class Utest_device*                           _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseFramework_test_device::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_test_device$AfterEach">();
	}
	static class Utask_test_device_AfterEach* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_test_device_AfterEach>();
	}
};

// VerseClass VerseFramework_test_device.task_test_device$BeforeAll
// 0x0010 (0x00D8 - 0x00C8)
class Utask_test_device_BeforeAll final : public UConcurrency_task
{
public:
	class Utest_device*                           _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseFramework_test_device::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_test_device$BeforeAll">();
	}
	static class Utask_test_device_BeforeAll* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_test_device_BeforeAll>();
	}
};

// VerseClass VerseFramework_test_device.task_test_device$BeforeEach
// 0x0010 (0x00D8 - 0x00C8)
class Utask_test_device_BeforeEach final : public UConcurrency_task
{
public:
	class Utest_device*                           _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseFramework_test_device::Ftuple_L_R __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_test_device$BeforeEach">();
	}
	static class Utask_test_device_BeforeEach* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_test_device_BeforeEach>();
	}
};

}

