#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseColors

#include "Basic.hpp"

#include "VerseColors_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// VerseClass VerseColors.Colors_NamedColors
// 0x0DC8 (0x0DF8 - 0x0030)
class UColors_NamedColors final : public UObject
{
public:
	struct FColors_color                          __verse_0x9FBDE6AE_AliceBlue;                      // 0x0030(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xB3F7599D_AntiqueWhite;                   // 0x0048(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x37EE68B4_Aqua;                           // 0x0060(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xA52EBB79_Aquamarine;                     // 0x0078(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xD06EFB2A_Azure;                          // 0x0090(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x8CE5D6D0_Beige;                          // 0x00A8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC6B3972A_Bisque;                         // 0x00C0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x65E4346F_Black;                          // 0x00D8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x513D3B5F_BlanchedAlmond;                 // 0x00F0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x80217580_Blue;                           // 0x0108(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x31D0653D_BlueViolet;                     // 0x0120(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xAD308F8F_Brown;                          // 0x0138(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xED3A42A8_Burlywood;                      // 0x0150(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x921A6303_CadetBlue;                      // 0x0168(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x9E2BDE1B_Chartreuse;                     // 0x0180(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x082AED19_Chocolate;                      // 0x0198(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x196BEF87_Coral;                          // 0x01B0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC6BCD84F_CornflowerBlue;                 // 0x01C8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xEE818697_Cornsilk;                       // 0x01E0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x6733DEF7_Crimson;                        // 0x01F8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x2D925695_Cyan;                           // 0x0210(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x935B7248_DarkBlue;                       // 0x0228(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x3EE8515D_DarkCyan;                       // 0x0240(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x5817F032_DarkGoldenrod;                  // 0x0258(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x916F3C35_DarkGray;                       // 0x0270(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x37F798B1_DarkGreen;                      // 0x0288(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x6B6176B1_DarkGrey;                       // 0x02A0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x9A5F61FB_DarkKhaki;                      // 0x02B8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x97899EDF_DarkMagenta;                    // 0x02D0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC2E62C73_DarkOliveGreen;                 // 0x02E8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x7431D49D_DarkOrange;                     // 0x0300(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xA0C47F58_DarkOrchid;                     // 0x0318(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xA3246E28_DarkRed;                        // 0x0330(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x5A06EB6C_DarkSalmon;                     // 0x0348(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xF141484E_DarkSeaGreen;                   // 0x0360(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x4167AB57_DarkSlateBlue;                  // 0x0378(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x4353E52A_DarkSlateGray;                  // 0x0390(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xB95DAFAE_DarkSlateGrey;                  // 0x03A8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x26DA5155_DarkTurquoise;                  // 0x03C0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x3E781A05_DarkViolet;                     // 0x03D8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x53E148EA_DeepPink;                       // 0x03F0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xA474CD21_DeepSkyBlue;                    // 0x0408(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xEC312FE8_DimGray;                        // 0x0420(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x163F656C_DimGrey;                        // 0x0438(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x617B6862_DodgerBlue;                     // 0x0450(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC636E104_Firebrick;                      // 0x0468(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x06164DB2_FloralWhite;                    // 0x0480(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x4939E624_ForestGreen;                    // 0x0498(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x8069E472_Fuchsia;                        // 0x04B0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x71D0705F_Gainsboro;                      // 0x04C8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x1EDD5A5B_GhostWhite;                     // 0x04E0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x0363FA56_Gold;                           // 0x04F8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x13A0B098_Goldenrod;                      // 0x0510(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x82153BFD_Gray;                           // 0x0528(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x853EAC70_Green;                          // 0x0540(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x94CAEBA0_GreenYellow;                    // 0x0558(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x781B7179_Grey;                           // 0x0570(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x6FB30324_Honeydew;                       // 0x0588(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x2D404B19_Hotpink;                        // 0x05A0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x2CE09720_IndianRed;                      // 0x05B8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x180B2901_Indigo;                         // 0x05D0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x1086E2EC_Ivory;                          // 0x05E8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x2896553A_Khaki;                          // 0x0600(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xB93AFCDC_Lavender;                       // 0x0618(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x4CF8F931_LavenderBlush;                  // 0x0630(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x08B4792E_LawnGreen;                      // 0x0648(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xCC22276F_LemonChiffon;                   // 0x0660(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x607C97F4_LightBlue;                      // 0x0678(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x89B3D40E_LightCoral;                     // 0x0690(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xCDCFB4E1_LightCyan;                      // 0x06A8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x6C11FD65_LightGoldenrodYellow;           // 0x06C0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x6248D989_LightGray;                      // 0x06D8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x15E697F9_LightGreen;                     // 0x06F0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x9846930D_LightGrey;                      // 0x0708(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC34ABDCC_LightPink;                      // 0x0720(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC57DAB84_LightSalmon;                    // 0x0738(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x0FE57B41_LightSeaGreen;                  // 0x0750(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x4077C098_LightSkyBlue;                   // 0x0768(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xCABFF9F6_LightSlateGray;                 // 0x0780(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x30B1B372_LightSlateGrey;                 // 0x0798(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xEFD2DF75_LightSteelBlue;                 // 0x07B0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x5732C477_LightYellow;                    // 0x07C8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xA58A0A97_Lime;                           // 0x07E0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC8D6E552_LimeGreen;                      // 0x07F8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xD014B08F_Linen;                          // 0x0810(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC5065659_Magenta;                        // 0x0828(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x2C6B6225_Maroon;                         // 0x0840(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x603DC640_MediumAquamarine;               // 0x0858(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x03344EDD_MediumBlue;                     // 0x0870(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xEB235F60_MediumOrchid;                   // 0x0888(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x80AC62AF_MediumPurple;                   // 0x08A0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xA2F1456A_MediumSeaGreen;                 // 0x08B8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x81A3E0C2_MediumSlateBlue;                // 0x08D0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x8259C923_MediumSpringGreen;              // 0x08E8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xE61E1AC0_MediumTurquoise;                // 0x0900(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x750A73D1_MediumVioletRed;                // 0x0918(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x54B068FD_MidnightBlue;                   // 0x0930(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x2D5517E3_MintCream;                      // 0x0948(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC9B38859_MistyRose;                      // 0x0960(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x045E548D_Moccasin;                       // 0x0978(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x66A473BA_NavajoWhite;                    // 0x0990(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x621CB82D_Navy;                           // 0x09A8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x4433768E_OldLace;                        // 0x09C0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x4ADCED0B_Olive;                          // 0x09D8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x662F5053_OliveDrab;                      // 0x09F0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x7B1B98E3_Orange;                         // 0x0A08(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x31DF128E_OrangeRed;                      // 0x0A20(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xAFEE3326_Orchid;                         // 0x0A38(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xA90612F2_PaleGoldenrod;                  // 0x0A50(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x6494F519_PaleGreen;                      // 0x0A68(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xD7CBB395_PaleTurquoise;                  // 0x0A80(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xBC04EB9C_PaleVioletred;                  // 0x0A98(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x1267A5CE_PapayaWhip;                     // 0x0AB0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x5B815063_PeachPuff;                      // 0x0AC8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x6A5E8726_Peru;                           // 0x0AE0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x23175FB8_Pink;                           // 0x0AF8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x92124624_Plum;                           // 0x0B10(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x315A9690_PowderBlue;                     // 0x0B28(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC4610EE9_Purple;                         // 0x0B40(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x77CCDA87_Red;                            // 0x0B58(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xFB01846B_RosyBrown;                      // 0x0B70(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xA95C80D8_RoyalBlue;                      // 0x0B88(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xFCC2BB8C_SaddleBrown;                    // 0x0BA0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x552CA712_Salmon;                         // 0x0BB8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xE1C22521_SandyBrown;                     // 0x0BD0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x36A1DDC2_SeaGreen;                       // 0x0BE8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x58B624CB_SeaShell;                       // 0x0C00(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x013650B1_Sienna;                         // 0x0C18(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xFA47F979_Silver;                         // 0x0C30(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x1EAB27FD_SkyBlue;                        // 0x0C48(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x0AD0EBFD_SlateBlue;                      // 0x0C60(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x08E4A580_SlateGray;                      // 0x0C78(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xF2EAEF04_SlateGrey;                      // 0x0C90(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xE7A26A33_Snow;                           // 0x0CA8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x2CD5AEB9_SpringGreen;                    // 0x0CC0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x2D898303_SteelBlue;                      // 0x0CD8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x09871083_Tan;                            // 0x0CF0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x303C932D_Teal;                           // 0x0D08(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x303F6677_Thistle;                        // 0x0D20(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x4DC64808_Tomato;                         // 0x0D38(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x6D6D11FF_Turquoise;                      // 0x0D50(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x3152567B_Violet;                         // 0x0D68(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x13A81039_Wheat;                          // 0x0D80(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0x27EAE4E0_White;                          // 0x0D98(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xBE90A762_WhiteSmoke;                     // 0x0DB0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xC763C8E1_Yellow;                         // 0x0DC8(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FColors_color                          __verse_0xF10B434A_YellowGreen;                    // 0x0DE0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Colors_NamedColors">();
	}
	static class UColors_NamedColors* GetDefaultObj()
	{
		return GetDefaultObjImpl<UColors_NamedColors>();
	}
};

// VerseClass VerseColors.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class VerseColors::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseColors.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseColors::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseColors::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseColors.Colors
// 0x0000 (0x0030 - 0x0030)
class UColors final : public UObject
{
public:
