#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFramework_test_case

#include "Basic.hpp"


namespace SDK
{

// VerseStruct VerseFramework_test_case.test_case
// 0x0048 (0x0048 - 0x0000)
struct Ftest_case final
{
public:
	FVerseStringProperty_                         __verse_0x38D9A616_Name;                           // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCBC84FC1_Func;                           // 0x0010(0x0018)(InstancedReference, HasGetValueTypeHash)
	TArray<FVerseStringProperty_>                 __verse_0x94C5D053_Category;                       // 0x0028(0x0010)(InstancedReference, ContainsInstancedReference)
	TOptional<double>                             __verse_0x393D8F28_TimeoutOverride;                // 0x0038(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFramework_test_case.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct VerseFramework_test_case::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

