#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortnite_0

#include "Basic.hpp"

#include "VerseFortnite_0_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "VerseGameplayTags_0_structs.hpp"
#include "Verse_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"
#include "UnrealEngineExperimental_0_structs.hpp"


namespace SDK::Params
{

// Function VerseFortnite.task_AI_fort_guard_actions_component$Revive_L_Nagent_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_AI_fort_guard_actions_component_Revive_L_Nagent_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl.$InitCDO
// 0x0100 (0x0100 - 0x0000)
struct Characters_fort_character_impl__InitCDO final
{
public:
	class UVerseEngine_subscribable_event*        _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_4;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_6;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_7;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_8;                                     // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_9;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_10;                                    // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_11;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_12;                                    // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_13;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_14;                                    // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_15;                               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_16;                                    // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_17;                               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_18;                                    // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_19;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_20;                                    // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_21;                               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_22;                                    // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_23;                               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_24;                                    // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_25;                               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_26;                                    // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_27;                               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_28;                                    // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_29;                               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_30;                                    // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_31;                               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character__impl_N_RTeleportToInternal_L_Nvector3_M_Nrotation_R
// 0x0050 (0x0050 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character__impl_N_RTeleportToInternal_L_Nvector3_M_Nrotation_R final
{
public:
	struct VerseFortnite_0::Ftuple_Lvector3_Mrotation_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0040)(Parm, NoDestructor, HasGetValueTypeHash)
	EGame_teleport_to_result                      RetVal;                                            // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class USimulation_agent*, true>     RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetEntity
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetEntity final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Uentity*, true>               RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewLocation
// 0x0020 (0x0020 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewLocation final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation
// 0x0030 (0x0030 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         RetVal;                                            // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide
// 0x0001 (0x0001 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive
// 0x0003 (0x0003 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsCrouching
// 0x0003 (0x0003 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsCrouching final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut
// 0x0003 (0x0003 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFalling
// 0x0003 (0x0003 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFalling final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFlying
// 0x0003 (0x0003 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFlying final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsGliding
// 0x0003 (0x0003 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsGliding final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInAir
// 0x0003 (0x0003 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInAir final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInWater
// 0x0003 (0x0003 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInWater final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsOnGround
// 0x0003 (0x0003 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsOnGround final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable
// 0x0003 (0x0003 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R
// 0x0003 (0x0003 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R final
{
public:
	struct FCharacters_stasis_args                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0003)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis
// 0x0001 (0x0001 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow
// 0x0001 (0x0001 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RTeleportTo_L_Nvector3_M_Nrotation_R
// 0x03A0 (0x03A0 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RTeleportTo_L_Nvector3_M_Nrotation_R final
{
public:
	struct VerseFortnite_0::Ftuple_Lvector3_Mrotation_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0040)(Parm, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0040(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_0;                                     // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGame_teleport_to_result                      __verse_0x95D09D0E_Result_1;                       // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_Lvector3_Mrotation_R _ExprResult_2;                                     // 0x0060(0x0040)(NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_transform                 __verse_0x61C3007D_Transform_1;                    // 0x00A0(0x0060)(NoDestructor)
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0100(0x0018)(HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            _ExprResult_4;                                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _AssignmentScratch_5;                              // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         _AssignmentScratch_6;                              // 0x0140(0x0020)(NoDestructor)
	TOptional<EVerseTrue>                         _ExprResultStack_7;                                // 0x0160(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x0168(0x0018)(HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_Lteleport__to__result_Mtransform_R _ExprResult_9;                                     // 0x0180(0x0070)(NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_10;                                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGame_teleport_to_result                      __verse_0x95D09D0E_Result_2;                       // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x01F8(0x0018)(HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_Lvector3_Mrotation_R _ExprResult_12;                                    // 0x0210(0x0040)(NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_transform                 __verse_0x61C3007D_Transform_2;                    // 0x0250(0x0060)(NoDestructor)
	FVerseFunctionProperty_                       _Callee_13;                                        // 0x02B0(0x0018)(HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            _ExprResult_14;                                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _AssignmentScratch_15;                             // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         _AssignmentScratch_16;                             // 0x02F0(0x0020)(NoDestructor)
	TOptional<EVerseTrue>                         _ExprResultStack_17;                               // 0x0310(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_18;                                        // 0x0318(0x0018)(HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_Lteleport__to__result_Mtransform_R _ExprResult_19;                                    // 0x0330(0x0070)(NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R
// 0x0018 (0x0018 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R final
{
public:
	struct FGame_damage_args                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, NoDestructor)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R
// 0x0018 (0x0018 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R final
{
public:
	struct FGame_healing_args                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, NoDestructor)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform
// 0x0070 (0x0070 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 RetVal;                                            // 0x0010(0x0060)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_impl._L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Characters_fort_character_impl__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.task_AI_fort_guard_actions_component$PlayEmote_L_Nemote_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_AI_fort_guard_actions_component_PlayEmote_L_Nemote_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Building_building_component.$InitCDO
// 0x0004 (0x0004 - 0x0000)
struct Building_building_component__InitCDO final
{
public:
	EVerseFalse                                   _ExprResult_0;                                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_1;                                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_2;                                     // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   _ExprResult_3;                                     // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Building_building_component._L_2fFortnite_2ecom_2fBuilding_2fbuilding__component_N_RDamage_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Building_building_component__L_2fFortnite_2ecom_2fBuilding_2fbuilding__component_N_RDamage_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Building_building_component._L_2fFortnite_2ecom_2fBuilding_2fbuilding__component_N_RGetCanBeDamaged_L_Naccessor_R
// 0x0002 (0x0002 - 0x0000)
struct Building_building_component__L_2fFortnite_2ecom_2fBuilding_2fbuilding__component_N_RGetCanBeDamaged_L_Naccessor_R final
{
public:
	EVerse_accessor                               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortnite.Building_building_component._L_2fFortnite_2ecom_2fBuilding_2fbuilding__component_N_RGetCanBeReplaced_L_Naccessor_R
// 0x0002 (0x0002 - 0x0000)
struct Building_building_component__L_2fFortnite_2ecom_2fBuilding_2fbuilding__component_N_RGetCanBeReplaced_L_Naccessor_R final
{
public:
	EVerse_accessor                               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortnite.Building_building_component._L_2fFortnite_2ecom_2fBuilding_2fbuilding__component_N_RIsPlayerBuilt
// 0x0003 (0x0003 - 0x0000)
struct Building_building_component__L_2fFortnite_2ecom_2fBuilding_2fbuilding__component_N_RIsPlayerBuilt final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Building_building_component._L_2fFortnite_2ecom_2fBuilding_2fbuilding__component_N_RSetCanBeDamaged_L_Naccessor_M_Nlogic_R
// 0x0002 (0x0002 - 0x0000)
struct Building_building_component__L_2fFortnite_2ecom_2fBuilding_2fbuilding__component_N_RSetCanBeDamaged_L_Naccessor_M_Nlogic_R final
{
public:
	struct VerseFortnite_0::Ftuple_Laccessor_Mlogic_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0002)(Parm, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Building_building_component._L_2fFortnite_2ecom_2fBuilding_2fbuilding__component_N_RSetCanBeReplaced_L_Naccessor_M_Nlogic_R
// 0x0002 (0x0002 - 0x0000)
struct Building_building_component__L_2fFortnite_2ecom_2fBuilding_2fbuilding__component_N_RSetCanBeReplaced_L_Naccessor_M_Nlogic_R final
{
public:
	struct VerseFortnite_0::Ftuple_Laccessor_Mlogic_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0002)(Parm, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Building_building_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct Building_building_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient final
{
public:
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortnite.AI_focus_interface.MaintainFocus_L_Nagent_R
// 0x0028 (0x0028 - 0x0000)
struct AI_focus_interface_MaintainFocus_L_Nagent_R final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.AI_focus_interface.MaintainFocus_L_Nvector3_R
// 0x0038 (0x0038 - 0x0000)
struct AI_focus_interface_MaintainFocus_L_Nvector3_R final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UConcurrency_task*                      RetVal;                                            // 0x0030(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nagent_R
// 0x0010 (0x0010 - 0x0000)
struct AI__L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAI_navigation_target*                  RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nentity_R
// 0x0010 (0x0010 - 0x0000)
struct AI__L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nentity_R final
{
public:
	class Uentity*                                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UAI_navigation_target*, true> RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Ntarget__info_R
// 0x0030 (0x0030 - 0x0000)
struct AI__L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Ntarget__info_R final
{
public:
	struct FAI_target_info                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0028)(Parm, NoDestructor)
	class UAI_navigation_target*                  RetVal;                                            // 0x0028(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nvector3_R
// 0x0020 (0x0020 - 0x0000)
struct AI__L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAI_navigation_target*                  RetVal;                                            // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetEntity_U_L_Nnpc__behavior_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct AI__L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetEntity_U_L_Nnpc__behavior_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct VerseFortnite_0::Ftuple_Lnpc__behavior_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<class Uentity*, true>               RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetFocusInterface_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct AI__L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetFocusInterface_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct VerseFortnite_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<class UObject*, true>               RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetFortLeashable_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct AI__L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetFortLeashable_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct VerseFortnite_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<class UObject*, true>               RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetNavigatable_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct AI__L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetNavigatable_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct VerseFortnite_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<class UObject*, true>               RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetNPCBehavior_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct AI__L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetNPCBehavior_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct VerseFortnite_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<class UAI_npc_behavior*, true>      RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortnite.AI.AI_fort_obstacle_info$Factory
// 0x0028 (0x0028 - 0x0000)
struct AI_AI_fort_obstacle_info_Factory final
{
public:
	struct FAI_fort_obstacle_info                 RetVal;                                            // 0x0000(0x0028)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseFortnite.AI.AI_fort_obstacle_info$OverrideFactory
// 0x0078 (0x0078 - 0x0000)
struct AI_AI_fort_obstacle_info_OverrideFactory final
{
public:
	struct FAI_fort_obstacle_info                 RetVal;                                            // 0x0000(0x0028)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0028(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function VerseFortnite.AI.AI_target_info$Factory
// 0x0028 (0x0028 - 0x0000)
struct AI_AI_target_info_Factory final
{
public:
	struct FAI_target_info                        RetVal;                                            // 0x0000(0x0028)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseFortnite.AI.AI_target_info$OverrideFactory
// 0x0078 (0x0078 - 0x0000)
struct AI_AI_target_info_OverrideFactory final
{
public:
	struct FAI_target_info                        RetVal;                                            // 0x0000(0x0028)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0028(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function VerseFortnite.Game._L_2fFortnite_2ecom_2fGame_N_RGetPlayerCameraView_L_Nplayer_R
// 0x0010 (0x0010 - 0x0000)
struct Game__L_2fFortnite_2ecom_2fGame_N_RGetPlayerCameraView_L_Nplayer_R final
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UGame_fort_player_camera_view*, true> RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortnite.Game._L_2fFortnite_2ecom_2fGame_N_RGetPlayerCameraViewByIndex_L_Nint_R
// 0x0010 (0x0010 - 0x0000)
struct Game__L_2fFortnite_2ecom_2fGame_N_RGetPlayerCameraViewByIndex_L_Nint_R final
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UGame_fort_player_camera_view*, true> RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortnite.Game._L_2fFortnite_2ecom_2fGame_N_RHandleTeleportToResult_L_Nteleport__to__result_M_Ntransform_R
// 0x1680 (0x1680 - 0x0000)
struct Game__L_2fFortnite_2ecom_2fGame_N_RHandleTeleportToResult_L_Nteleport__to__result_M_Ntransform_R final
{
public:
	struct VerseFortnite_0::Ftuple_Lteleport__to__result_Mtransform_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0070)(Parm, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0070(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_0 : 1;                                 // 0x0072(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        InvokeResultDummy_1;                               // 0x0078(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_2;                                // 0x0088(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_3;                                     // 0x00A0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_4;                                     // 0x00B0(0x0010)(HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x63A8D5FA_DebugLog_3;                     // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
