#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFramework_device_event_optional_agent_handler_mock

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "VerseFramework_device_event_optional_agent_handler_mock_structs.hpp"


namespace SDK::Params
{

// Function VerseFramework_device_event_optional_agent_handler_mock.device_event_optional_agent_handler_mock.$InitCDO
// 0x0020 (0x0020 - 0x0000)
struct device_event_optional_agent_handler_mock__InitCDO final
{
public:
	TOptional<class USimulation_agent*, true>     _ExprResult_0;                                     // 0x0000(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0008(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x000A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_2;                                // 0x000B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class USimulation_agent*, true>     _ExprResult_3;                                     // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0018(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x001A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_5;                                // 0x001B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFramework_device_event_optional_agent_handler_mock.device_event_optional_agent_handler_mock._L_2fFortnite_2ecom_2fVerseInternalTesting_2fVerseFramework_2fdevice__event__optional__agent__handler__mock_N_RHandleEvent0_L_Nany_R_Nvoid
// 0x0060 (0x0060 - 0x0000)
struct device_event_optional_agent_handler_mock__L_2fFortnite_2ecom_2fVerseInternalTesting_2fVerseFramework_2fdevice__event__optional__agent__handler__mock_N_RHandleEvent0_L_Nany_R_Nvoid final
{
public:
	FVerseDynamicProperty_                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0018)(HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResult_2;                                     // 0x0030(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0040(0x0018)(HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResult_5;                                     // 0x0058(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFramework_device_event_optional_agent_handler_mock.device_event_optional_agent_handler_mock._L_2fFortnite_2ecom_2fVerseInternalTesting_2fVerseFramework_2fdevice__event__optional__agent__handler__mock_N_RHandleEvent_L_N_Qagent_R
// 0x0078 (0x0078 - 0x0000)
struct device_event_optional_agent_handler_mock__L_2fFortnite_2ecom_2fVerseInternalTesting_2fVerseFramework_2fdevice__event__optional__agent__handler__mock_N_RHandleEvent_L_N_Qagent_R final
{
public:
	TOptional<class USimulation_agent*, true>     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0010(0x0018)(HasGetValueTypeHash)
	struct VerseFramework_device_event_optional_agent_handler_mock::Ftuple_L_R _ExprResult_2;                                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class USimulation_agent*, true>     _ExprResultStack_3;                                // 0x0030(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     VerseClassVarProxySetterRHS_4;                     // 0x0038(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_5;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0048(0x0018)(HasGetValueTypeHash)
	struct VerseFramework_device_event_optional_agent_handler_mock::Ftuple_L_R _ExprResult_7;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class USimulation_agent*, true>     _ExprResultStack_8;                                // 0x0068(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     VerseClassVarProxySetterRHS_9;                     // 0x0070(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFramework_device_event_optional_agent_handler_mock.device_event_optional_agent_handler_mock._L_2fFortnite_2ecom_2fVerseInternalTesting_2fVerseFramework_2fdevice__event__optional__agent__handler__mock_N_RSubscribe_L_Nlistenable_L_Qagent_R_R
// 0x0088 (0x0088 - 0x0000)
struct device_event_optional_agent_handler_mock__L_2fFortnite_2ecom_2fVerseInternalTesting_2fVerseFramework_2fdevice__event__optional__agent__handler__mock_N_RSubscribe_L_Nlistenable_L_Qagent_R_R final
{
public:
	class UObject*                                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_0;                                // 0x0008(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UObject*, true>               VerseClassVarProxySetterRHS_1;                     // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResult_2;                                     // 0x0018(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                _ExprResult_3;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__2;                             // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0030(0x0018)(HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_5;                                // 0x0048(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UObject*, true>               VerseClassVarProxySetterRHS_6;                     // 0x0050(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResult_7;                                     // 0x0058(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                _ExprResult_8;                                     // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__4;                             // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x0070(0x0018)(HasGetValueTypeHash)
};

}

