#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseAbilities_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseAbilities_classes.hpp"
#include "VerseNative_structs.hpp"
#include "Entity_0_classes.hpp"
#include "VerseNative_0_classes.hpp"
#include "VerseAbilities_0_structs.hpp"


namespace SDK
{

// VerseClass VerseAbilities.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class VerseAbilities_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseAbilities.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseAbilities_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseAbilities_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseAbilities.ability
// 0x0018 (0x0060 - 0x0048)
class Uability final : public UVerseAbility
{
public:
	TOptional<FVerseStringProperty_>              __verse_0x404BB66C_GameplayAbilityPath;            // 0x0048(0x0018)(ZeroConstructor, InstancedReference, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fAbilities_2fability_N_REndAbility(const struct VerseAbilities_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Activate(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseAbilities_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* CallActivate(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseAbilities_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ability">();
	}
	static class Uability* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uability>();
	}
};

// VerseClass VerseAbilities.ability_component
// 0x0008 (0x0058 - 0x0050)
class Uability_component : public Ucomponent
{
public:
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fAbilities_2fability__component_N_RActivateAbility_L_NAbility_20where_20Ability_R(class UClass* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fAbilities_2fability__component_N_RActivateAbility_L_Nability_R(class Uability* __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fAbilities_2fability__component_N_RGiveAbility_L_NAbility_20where_20Ability_R(class UClass* __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fAbilities_2fability__component_N_RGiveAbility_L_Nability_R(class Uability* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ability_component">();
	}
	static class Uability_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uability_component>();
	}
};

// VerseClass VerseAbilities.task_ability$Activate
// 0x0010 (0x00D8 - 0x00C8)
class Utask_ability_Activate final : public UConcurrency_task
{
public:
	class Uability*                               _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAbilities_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_ability$Activate">();
	}
	static class Utask_ability_Activate* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_ability_Activate>();
	}
};

// VerseClass VerseAbilities.task_ability$CallActivate
// 0x00C0 (0x0188 - 0x00C8)
class Utask_ability_CallActivate final : public UConcurrency_task
{
public:
	class Uability*                               _Self;                                             // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseAbilities_0::Ftuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_0;                                      // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_1;                                 // 0x00E0(0x0018)(HasGetValueTypeHash)
	struct VerseAbilities_0::Ftuple_L_R           _ExprResult_2;                                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_3;                                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_4;                          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0110(0x0018)(HasGetValueTypeHash)
	struct VerseAbilities_0::Ftuple_L_R           _ExprResult_6;                                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_7;                                      // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_8;                                 // 0x0138(0x0018)(HasGetValueTypeHash)
	struct VerseAbilities_0::Ftuple_L_R           _ExprResult_9;                                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_10;                                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_11;                         // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_12;                                        // 0x0168(0x0018)(HasGetValueTypeHash)
	struct VerseAbilities_0::Ftuple_L_R           _ExprResult_13;                                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_ability$CallActivate">();
	}
	static class Utask_ability_CallActivate* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_ability_CallActivate>();
	}
};

}

