#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VGameplayRst

#include "Basic.hpp"

#include "VGameplayRst_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "EntityActor_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VGameplayRst.AudioComponentBase
// 0x0010 (0x0108 - 0x00F8)
class UAudioComponentBase : public UEntityActorComponent
{
public:
	class UVerseAssetPtr*                         SoundAsset;                                        // 0x00F8(0x0008)(Net, ZeroConstructor, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FActiveSoundInfo                       ActiveSoundInfo;                                   // 0x0100(0x0008)(Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void OnRep_ActiveSoundInfo();
	void OnRep_SoundAsset();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioComponentBase">();
	}
	static class UAudioComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioComponentBase>();
	}
};

// Class VGameplayRst.ControllerStateComponent
// 0x0030 (0x0108 - 0x00D8)
class UControllerStateComponent final : public UControllerComponent
{
public:
	TArray<class FString>                         ActiveStates;                                      // 0x00D8(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x20];                                      // 0x00E8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_ActiveStates();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControllerStateComponent">();
	}
	static class UControllerStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControllerStateComponent>();
	}
};

// Class VGameplayRst.DatastoreComponentBase
// 0x0148 (0x0258 - 0x0110)
class UDatastoreComponentBase : public UEntityActorPlayerComponent
{
public:
	struct FDatastoreState                        ReplicatedDatastoreState;                          // 0x0110(0x0130)(Net, NativeAccessSpecifierPrivate)
	uint8                                         Pad_240[0x18];                                     // 0x0240(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DatastoreComponentBase">();
	}
	static class UDatastoreComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatastoreComponentBase>();
	}
};

// Class VGameplayRst.VerseLevelStreamingPlayerControllerRpcComponent
// 0x0000 (0x00D8 - 0x00D8)
class UVerseLevelStreamingPlayerControllerRpcComponent final : public UActorComponent
{
public:
	void TellServer_ClientLevelLoaded(class UVerseLevelStreamingComponentBase* LevelStreamingComponent);
	void TellServer_ClientLevelUnloaded(class UVerseLevelStreamingComponentBase* LevelStreamingComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseLevelStreamingPlayerControllerRpcComponent">();
	}
	static class UVerseLevelStreamingPlayerControllerRpcComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseLevelStreamingPlayerControllerRpcComponent>();
	}
};

// Class VGameplayRst.VerseLevelStreamingComponentBase
// 0x00C8 (0x01C0 - 0x00F8)
class UVerseLevelStreamingComponentBase : public UEntityActorComponent
{
public:
	struct FVerseLevelStreamingLevelIdentifier    NewLevel;                                          // 0x00F8(0x0038)(Net, RepNotify, NativeAccessSpecifierPublic)
	struct FVerseLevelStreamingLevelStatus        LevelStatus;                                       // 0x0130(0x0028)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_158[0x68];                                     // 0x0158(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLevelShown_Client();
	void OnLevelShown_Server();
	void OnLevelUnloaded_Client();
	void OnLevelUnloaded_Server();
	void OnRep_NewLevel();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseLevelStreamingComponentBase">();
	}
	static class UVerseLevelStreamingComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseLevelStreamingComponentBase>();
	}
};

// Class VGameplayRst.PointLightComponentBase
// 0x0008 (0x0100 - 0x00F8)
class UPointLightComponentBase : public UEntityActorComponent
{
public:
	class UVerseLightPropertiesBase*              ReplicatedLightProperties;                         // 0x00F8(0x0008)(Net, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PointLightComponentBase">();
	}
	static class UPointLightComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPointLightComponentBase>();
	}
};

// Class VGameplayRst.SpotLightComponentBase
// 0x0008 (0x0100 - 0x00F8)
class USpotLightComponentBase : public UEntityActorComponent
{
public:
	class UVerseLightPropertiesBase*              ReplicatedLightProperties;                         // 0x00F8(0x0008)(Net, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpotLightComponentBase">();
	}
	static class USpotLightComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpotLightComponentBase>();
	}
};

// Class VGameplayRst.VerseLightPropertiesBase
// 0x0028 (0x0058 - 0x0030)
class UVerseLightPropertiesBase : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Intensity;                                         // 0x0038(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           LightColor;                                        // 0x003C(0x0010)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponentBase*                    LightComponent;                                    // 0x0050(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnRep_Intensity();
	void OnRep_LightColor();
	void OnRep_LightComponent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseLightPropertiesBase">();
	}
	static class UVerseLightPropertiesBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseLightPropertiesBase>();
	}
};

// Class VGameplayRst.VerseLocalLightProperties
// 0x0008 (0x0060 - 0x0058)
class UVerseLocalLightProperties : public UVerseLightPropertiesBase
{
public:
	float                                         AttenuationRadius;                                 // 0x0058(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_AttenuationRadius();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseLocalLightProperties">();
	}
	static class UVerseLocalLightProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseLocalLightProperties>();
	}
};

// Class VGameplayRst.VersePointLightProperties
// 0x0008 (0x0068 - 0x0060)
class UVersePointLightProperties : public UVerseLocalLightProperties
{
public:
	float                                         SourceRadius;                                      // 0x0060(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SourceLength;                                      // 0x0064(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void OnRep_SourceLength();
	void OnRep_SourceRadius();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VersePointLightProperties">();
	}
	static class UVersePointLightProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVersePointLightProperties>();
	}
};

// Class VGameplayRst.VerseSpotLightProperties
// 0x0008 (0x0070 - 0x0068)
class UVerseSpotLightProperties final : public UVersePointLightProperties
{
public:
	float                                         InnerConeAngle;                                    // 0x0068(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OuterConeAngle;                                    // 0x006C(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void OnRep_InnerConeAngle();
	void OnRep_OuterConeAngle();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseSpotLightProperties">();
	}
	static class UVerseSpotLightProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseSpotLightProperties>();
	}
};

}

