#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VictoryCrownsUI

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// Class VictoryCrownsUI.FortUIManagerComponent_VictoryCrowns
// 0x00B0 (0x0190 - 0x00E0)
class UFortUIManagerComponent_VictoryCrowns final : public UFortControllerComponent
{
public:
	TSubclassOf<class UVictoryCrownsIndicator>    VictoryCrownsIndicatorClass;                       // 0x00E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FUserWidgetPool                        IndicatorPool;                                     // 0x00E8(0x0088)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_170[0x20];                                     // 0x0170(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RebuildBearerIndicators(const TArray<class AFortPlayerStateAthena*>& CrownBearerList);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIManagerComponent_VictoryCrowns">();
	}
	static class UFortUIManagerComponent_VictoryCrowns* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIManagerComponent_VictoryCrowns>();
	}
};

// Class VictoryCrownsUI.VictoryCrownsBearerInfoBase
// 0x0010 (0x0450 - 0x0440)
class UVictoryCrownsBearerInfoBase final : public UCommonUserWidget
{
public:
	TWeakObjectPtr<class AFortPlayerStateAthena>  WeakPSA;                                           // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_PlayerName;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnSetPlayerState(class AFortPlayerStateAthena* PSA);
	void SetPlayerState(class AFortPlayerStateAthena* InPlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VictoryCrownsBearerInfoBase">();
	}
	static class UVictoryCrownsBearerInfoBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVictoryCrownsBearerInfoBase>();
	}
};

// Class VictoryCrownsUI.VictoryCrownsIndicator
// 0x0028 (0x0558 - 0x0530)
class UVictoryCrownsIndicator final : public UFortActorIndicatorWidget
{
public:
	uint8                                         Pad_530[0x28];                                     // 0x0530(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDistanceChanged(int32 Distance);
	void OnScreenClampChanged(bool bIsClamped);

	const class AFortPlayerStateAthena* GetIndicatedPlayerStateAthena() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VictoryCrownsIndicator">();
	}
	static class UVictoryCrownsIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVictoryCrownsIndicator>();
	}
};

// Class VictoryCrownsUI.PlacementOverlayCondition_VictoryCrowns
// 0x0000 (0x0030 - 0x0030)
class UPlacementOverlayCondition_VictoryCrowns final : public UPlacementOverlayCondition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlacementOverlayCondition_VictoryCrowns">();
	}
	static class UPlacementOverlayCondition_VictoryCrowns* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlacementOverlayCondition_VictoryCrowns>();
	}
};

// Class VictoryCrownsUI.VictoryCrownsPlacementOverlay
// 0x0000 (0x0668 - 0x0668)
class UVictoryCrownsPlacementOverlay : public UPostGamePlacementOverlay
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VictoryCrownsPlacementOverlay">();
	}
	static class UVictoryCrownsPlacementOverlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVictoryCrownsPlacementOverlay>();
	}
};

// Class VictoryCrownsUI.VictoryCrownsPlayerInfoWidget
// 0x0010 (0x0498 - 0x0488)
class UVictoryCrownsPlayerInfoWidget final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_488[0x10];                                     // 0x0488(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCrownBearerListChanged(const TArray<class AFortPlayerStateAthena*>& CrownBearerList);
	void OnPlayerVictoryCrownStatusChanged(const bool bHasCrown);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VictoryCrownsPlayerInfoWidget">();
	}
	static class UVictoryCrownsPlayerInfoWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVictoryCrownsPlayerInfoWidget>();
	}
};

// Class VictoryCrownsUI.VictoryCrownsPreGameWidget
// 0x0058 (0x05D0 - 0x0578)
class UVictoryCrownsPreGameWidget final : public UCommonActivatableWidget
{
public:
	class UDynamicEntryBox*                       EntryBox_BearerList;                               // 0x0578(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                    TipActionWidget;                                   // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    CloseObjectInputAction;                            // 0x0588(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A0[0x30];                                     // 0x05A0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FadeOutTimerFinished();
	void OnButtonClose();
	void OnButtonCloseProgress(float Progress);
	void OnCloseActionsComplete();
	void OnInputMethodChanged(ECommonInputType CurrentInput);
	void RebuildBearerList(const TArray<class AFortPlayerStateAthena*>& CrownBearerList);
	void RegisterCloseButtonInput();
	void StartFadeOut();
	void UnregisterCloseButtonInput();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VictoryCrownsPreGameWidget">();
	}
	static class UVictoryCrownsPreGameWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVictoryCrownsPreGameWidget>();
	}
};

}

