#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VictoryCrownsRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "ModelViewViewModel_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class VictoryCrownsRuntime.FortGameplayCueNotify_CrownWear
// 0x00E8 (0x0C80 - 0x0B98)
class AFortGameplayCueNotify_CrownWear final : public AFortGameplayCueNotify_Loop
{
public:
	struct FScalableFloat                         IntroFXVisualVolume;                               // 0x0B98(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         IntroFXTimelineRate;                               // 0x0BD0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         IntroFXUpdatePrecision;                            // 0x0C08(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FScalableFloat>                 IntroFXUpdateFrequencies;                          // 0x0C40(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UCurveVector*                           IntroFXCurve;                                      // 0x0C50(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTimelineComponent*                     IntroFXTimeline;                                   // 0x0C58(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFXSystemComponent*                     CrownParticleComponent;                            // 0x0C60(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C68[0x18];                                     // 0x0C68(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyCrownWear(const TArray<class UFXSystemComponent*>& ParticleComponents);
	void OnIntroFXTimelineTick(const struct FVector& CurveValue);
	void RemoveCrownWear();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayCueNotify_CrownWear">();
	}
	static class AFortGameplayCueNotify_CrownWear* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortGameplayCueNotify_CrownWear>();
	}
};

// Class VictoryCrownsRuntime.FortVictoryCrownViewModel
// 0x0010 (0x0080 - 0x0070)
class UFortVictoryCrownViewModel final : public UMVVMViewModelBase
{
public:
	int32                                         BestowedCount;                                     // 0x0070(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasWonCrownInMatch;                               // 0x0074(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasWonRoyalRoyale;                                // 0x0075(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UFortControllerComponent_VictoryCrowns> BoundVictoryCrownsComponent;                       // 0x0078(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleOnHasWonCrownInMatch();
	void HandleOnHasWonRoyalRoyale();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVictoryCrownViewModel">();
	}
	static class UFortVictoryCrownViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVictoryCrownViewModel>();
	}
};

// Class VictoryCrownsRuntime.FortCheatManager_VictoryCrowns
// 0x0000 (0x0030 - 0x0030)
class UFortCheatManager_VictoryCrowns final : public UChildCheatManager
{
public:
	void VictoryCrownsGrantCrown(const int32 CrownLevel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_VictoryCrowns">();
	}
	static class UFortCheatManager_VictoryCrowns* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_VictoryCrowns>();
	}
};

// Class VictoryCrownsRuntime.FortControllerComponent_VictoryCrowns
// 0x0200 (0x02E0 - 0x00E0)
class UFortControllerComponent_VictoryCrowns final : public UFortControllerComponent
{
public:
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AFortPlayerControllerAthena* FortPlayerControllerAthena, class UFortItem* CrownItem)> OnVictoryCrownStatusChanged;                       // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnHasWonCrownInMatch;                              // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnHasWonRoyalRoyale;                               // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x30];                                     // 0x0118(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UFortWorldItemDefinition> CrownInventoryItemClass;                           // 0x0148(0x0030)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWonCrownInMatch;                                  // 0x0178(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWonRoyalRoyale;                                   // 0x0179(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortVictoryCrownAccountItemDefinition* VictoryCrownAccountItemDefinition;                 // 0x0180(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UFortMontageItemDefinitionBase> RoyalRoyaleEmoteItemDefinition;                    // 0x0188(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             VictoryCrownPlaylistData;                          // 0x01B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  SourceTagsForRoyalRoyale;                          // 0x01C0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FVictoryCrownAccountData               VictoryCrownAccountData;                           // 0x01E0(0x0014)(Net, Transient, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         InitialGrantDelay;                                 // 0x01F8(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_230[0xA8];                                     // 0x0230(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bKillFeedBroadcastReady;                           // 0x02D8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CacheAccountItemData();
	void DebugForceSetRoyalRoyaleAchievedCount(int32 NewRoyalRoyaleCount);
	void HandleEnterAircraft();
	void HandleExitAircraft(class AController* ExitingController);
	void HandlePawnChanged(class APawn* OldPawn, class APawn* NewPawn);
	void OnAthenaProfileInitialized();
	void OnEnterAircraft(class AController* EnteringController);
	void OnRep_VictoryCrownAccountData();
	void OnRep_WonCrownInMatch();
	void OnRep_WonRoyalRoyale();

	bool AuthorityHasDroppedCrownItem(const class UFortItem* CrownItem) const;
	bool AuthorityHasHeldCrownItem(const class UFortItem* CrownItem) const;
	bool AuthorityHasSquadDroppedCrownItem(const class UFortItem* CrownItem) const;
	bool AuthorityHasSquadHeldCrownItem(const class UFortItem* CrownItem) const;
	bool AuthoritySquadHasSeenCrownItem(const class UFortItem* CrownItem, const bool bDropped) const;
	const class UFortWorldItem* GetCrownInPlayerInventory() const;
	const int32 GetRoyalRoyaleAchievedCount() const;
	const int32 GetVictoryCrownLevel() const;
	const int32 GetVictoryCrownsBestowedCount() const;
	bool HasWonCrownInMatch() const;
	bool HasWonRoyalRoyale() const;
	bool IsCrownInPlayerInventory() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortControllerComponent_VictoryCrowns">();
	}
	static class UFortControllerComponent_VictoryCrowns* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerComponent_VictoryCrowns>();
	}
};

// Class VictoryCrownsRuntime.FortGameStateComponent_VictoryCrowns
// 0x0098 (0x0170 - 0x00D8)
class UFortGameStateComponent_VictoryCrowns final : public UFortGameStateComponent
{
public:
	TArray<class AFortPlayerStateAthena*>         CrownBearerPlayerStates;                           // 0x00D8(0x0010)(Net, ZeroConstructor, Transient, RepNotify, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x50];                                      // 0x00E8(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   KillFeedFormat_Dropped;                            // 0x0138(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   KillFeedFormat_PickedUp;                           // 0x0148(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_158[0x18];                                     // 0x0158(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientKillFeedMessage(const class AFortPlayerStateAthena* FortPSA, bool bAdded);
	void HandleCrownStatusChanged(class AFortPlayerControllerAthena* FortPlayerControllerAthena, const class UFortItem* CrownItem);
	void OnRep_CrownBearerPlayerStates();

	bool GetVictoryCrownLevelFromItemTrackerGuid(int32* OutVictoryCrownLevel, const struct FGuid& VictoryCrownItemTrackerGuid) const;
	bool IsCrownBearer(const class AFortPlayerStateAthena* FortPSA) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameStateComponent_VictoryCrowns">();
	}
	static class UFortGameStateComponent_VictoryCrowns* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameStateComponent_VictoryCrowns>();
	}
};

// Class VictoryCrownsRuntime.FortPawnComponent_VictoryCrownsFrontEnd
// 0x0018 (0x00F8 - 0x00E0)
class UFortPawnComponent_VictoryCrownsFrontEnd final : public UFortPawnComponent
{
public:
	class UDataTable*                             VictoryCrownPlaylistData;                          // 0x00E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInitializeSuccess;                                // 0x00E8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSelectedPlaylistSupportCrown;                     // 0x00E9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSocialParty*                       PersistentParty;                                   // 0x00F0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void PlaylistChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPawnComponent_VictoryCrownsFrontEnd">();
	}
	static class UFortPawnComponent_VictoryCrownsFrontEnd* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPawnComponent_VictoryCrownsFrontEnd>();
	}
};

// Class VictoryCrownsRuntime.FortPlayerStateComponent_VictoryCrowns
// 0x0008 (0x00E0 - 0x00D8)
class UFortPlayerStateComponent_VictoryCrowns final : public UFortPlayerStateComponent
{
public:
	bool                                          bHasWonRoyalRoyale;                                // 0x00D8(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetWonRoyalRoyale() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerStateComponent_VictoryCrowns">();
	}
	static class UFortPlayerStateComponent_VictoryCrowns* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerStateComponent_VictoryCrowns>();
	}
};

}

