#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ViewportInteraction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ViewportInteraction_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ViewportInteraction.ViewportTransformer.Init
// 0x0008 (0x0008 - 0x0000)
struct ViewportTransformer_Init final
{
public:
	class UViewportWorldInteraction*              InitViewportWorldInteraction;                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportTransformer.OnStartDragging
// 0x0008 (0x0008 - 0x0000)
struct ViewportTransformer_OnStartDragging final
{
public:
	class UViewportInteractor*                    Interactor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportTransformer.OnStopDragging
// 0x0008 (0x0008 - 0x0000)
struct ViewportTransformer_OnStopDragging final
{
public:
	class UViewportInteractor*                    Interactor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportTransformer.CanAlignToActors
// 0x0001 (0x0001 - 0x0000)
struct ViewportTransformer_CanAlignToActors final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportTransformer.ShouldCenterTransformGizmoPivot
// 0x0001 (0x0001 - 0x0000)
struct ViewportTransformer_ShouldCenterTransformGizmoPivot final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportInteractor.GetHoverLocation
// 0x0018 (0x0018 - 0x0000)
struct ViewportInteractor_GetHoverLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportInteractor.GetLaserPointer
// 0x0040 (0x0040 - 0x0000)
struct ViewportInteractor_GetLaserPointer final
{
public:
	struct FVector                                LaserPointerStart;                                 // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LaserPointerEnd;                                   // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEvenIfBlocked;                                    // 0x0030(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LaserLengthOverride;                               // 0x0034(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ViewportInteraction.ViewportInteractor.HandleInputAxis_BP
// 0x0040 (0x0040 - 0x0000)
struct ViewportInteractor_HandleInputAxis_BP final
{
public:
	struct FViewportActionKeyInput                Action;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   Key;                                               // 0x0010(0x0020)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delta;                                             // 0x0030(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0034(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutWasHandled;                                    // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ViewportInteraction.ViewportInteractor.HandleInputKey_BP
// 0x0038 (0x0038 - 0x0000)
struct ViewportInteractor_HandleInputKey_BP final
{
public:
	struct FViewportActionKeyInput                Action;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   Key;                                               // 0x0010(0x0020)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   Event;                                             // 0x0030(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutWasHandled;                                    // 0x0031(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ViewportInteraction.ViewportInteractor.SetCanCarry
// 0x0001 (0x0001 - 0x0000)
struct ViewportInteractor_SetCanCarry final
{
public:
	bool                                          bInCanCarry;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportInteractor.SetDraggingMode
// 0x0001 (0x0001 - 0x0000)
struct ViewportInteractor_SetDraggingMode final
{
public:
	EViewportInteractionDraggingMode              NewDraggingMode;                                   // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportInteractor.SetHitResultGizmoFilterMode
// 0x0001 (0x0001 - 0x0000)
struct ViewportInteractor_SetHitResultGizmoFilterMode final
{
public:
	EHitResultGizmoFilterMode                     newFilter;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportInteractor.Tick
// 0x0004 (0x0004 - 0x0000)
struct ViewportInteractor_Tick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportInteractor.CanCarry
// 0x0001 (0x0001 - 0x0000)
struct ViewportInteractor_CanCarry final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportInteractor.GetDraggingMode
// 0x0001 (0x0001 - 0x0000)
struct ViewportInteractor_GetDraggingMode final
{
public:
	EViewportInteractionDraggingMode              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportInteractor.GetHitResultGizmoFilterMode
// 0x0001 (0x0001 - 0x0000)
struct ViewportInteractor_GetHitResultGizmoFilterMode final
{
public:
	EHitResultGizmoFilterMode                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportInteractor.GetLastRoomSpaceTransform
// 0x0060 (0x0060 - 0x0000)
struct ViewportInteractor_GetLastRoomSpaceTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportInteractor.GetLastTransform
// 0x0060 (0x0060 - 0x0000)
struct ViewportInteractor_GetLastTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportInteractor.GetOtherInteractor
// 0x0008 (0x0008 - 0x0000)
struct ViewportInteractor_GetOtherInteractor final
{
public:
	class UViewportInteractor*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportInteractor.GetRoomSpaceTransform
// 0x0060 (0x0060 - 0x0000)
struct ViewportInteractor_GetRoomSpaceTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportInteractor.GetTransform
// 0x0060 (0x0060 - 0x0000)
struct ViewportInteractor_GetTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportInteractor.GetTransformAndForwardVector
// 0x0080 (0x0080 - 0x0000)
struct ViewportInteractor_GetTransformAndForwardVector final
{
public:
	struct FTransform                             OutHandTransform;                                  // 0x0000(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutForwardVector;                                  // 0x0060(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ViewportInteraction.ViewportInteractor.GetWorldInteraction
// 0x0008 (0x0008 - 0x0000)
struct ViewportInteractor_GetWorldInteraction final
{
public:
	class UViewportWorldInteraction*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportInteractor.IsHoveringOverGizmo
// 0x0001 (0x0001 - 0x0000)
struct ViewportInteractor_IsHoveringOverGizmo final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportWorldInteraction.AddActorToExcludeFromHitTests
// 0x0008 (0x0008 - 0x0000)
struct ViewportWorldInteraction_AddActorToExcludeFromHitTests final
{
public:
	class AActor*                                 ActorToExcludeFromHitTests;                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportWorldInteraction.AddInteractor
// 0x0008 (0x0008 - 0x0000)
struct ViewportWorldInteraction_AddInteractor final
{
public:
	class UViewportInteractor*                    Interactor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportWorldInteraction.GetTransformGizmoActor
// 0x0008 (0x0008 - 0x0000)
struct ViewportWorldInteraction_GetTransformGizmoActor final
{
public:
	class ABaseTransformGizmo*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportWorldInteraction.RemoveInteractor
// 0x0008 (0x0008 - 0x0000)
struct ViewportWorldInteraction_RemoveInteractor final
{
public:
	class UViewportInteractor*                    Interactor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportWorldInteraction.SetHeadTransform
// 0x0060 (0x0060 - 0x0000)
struct ViewportWorldInteraction_SetHeadTransform final
{
public:
	struct FTransform                             NewHeadTransform;                                  // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportWorldInteraction.SetRoomTransformForNextFrame
// 0x0060 (0x0060 - 0x0000)
struct ViewportWorldInteraction_SetRoomTransformForNextFrame final
{
public:
	struct FTransform                             NewRoomTransform;                                  // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportWorldInteraction.SetWorldToMetersScale
// 0x0008 (0x0008 - 0x0000)
struct ViewportWorldInteraction_SetWorldToMetersScale final
{
public:
	float                                         NewWorldToMetersScale;                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCompensateRoomWorldScale;                         // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ViewportInteraction.ViewportWorldInteraction.GetHeadTransform
// 0x0060 (0x0060 - 0x0000)
struct ViewportWorldInteraction_GetHeadTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportWorldInteraction.GetInteractors
// 0x0010 (0x0010 - 0x0000)
struct ViewportWorldInteraction_GetInteractors final
{
public:
	TArray<class UViewportInteractor*>            ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportWorldInteraction.GetRoomSpaceHeadTransform
// 0x0060 (0x0060 - 0x0000)
struct ViewportWorldInteraction_GetRoomSpaceHeadTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportWorldInteraction.GetRoomTransform
// 0x0060 (0x0060 - 0x0000)
struct ViewportWorldInteraction_GetRoomTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ViewportInteraction.ViewportWorldInteraction.GetWorldScaleFactor
// 0x0004 (0x0004 - 0x0000)
struct ViewportWorldInteraction_GetWorldScaleFactor final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

