#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VKDownloadOnDemandUI

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CommonUILegacy_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Class VKDownloadOnDemandUI.DownloadOnDemandProjectManagementTab
// 0x00A0 (0x04B8 - 0x0418)
class UDownloadOnDemandProjectManagementTab final : public UUserWidget
{
public:
	uint8                                         Pad_418[0x30];                                     // 0x0418(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UDownloadOnDemandProject*               Project;                                           // 0x0448(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_450[0x10];                                     // 0x0450(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       TextBlock_ProjectTitle;                            // 0x0460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_LinkCode;                                // 0x0468(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_VersionNumber;                           // 0x0470(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_LatestVersionNumber;                     // 0x0478(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_LatestVersionSpinner;                        // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_Description;                             // 0x0488(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_RemoveProject;                              // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_UpdateProject;                              // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*              Switcher_Props;                                    // 0x04A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTileView*                        CommonTileView_ProjectAssetTiles;                  // 0x04A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_NoPropsMessage;                          // 0x04B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void RemoveProjectConfirmed();
	void UpdateProjectConfirmed();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProjectManagementTab">();
	}
	static class UDownloadOnDemandProjectManagementTab* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProjectManagementTab>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandTabPanel
// 0x00C0 (0x0680 - 0x05C0)
class UDownloadOnDemandTabPanel final : public UFortCreativeContentBrowserTabPanelBase
{
public:
	struct FDataTableRowHandle                    AddProjectWithLinkCodeInputRowHandle;              // 0x05C0(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    AddSelectedProjectInputRowHandle;                  // 0x05D8(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    ManageSelectedProjectInputRowHandle;               // 0x05F0(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	TSubclassOf<class UDownloadOnDemandProjectDetailsSidePanel> DownloadOnDemandProjectDetailsSidePanelClass;      // 0x0608(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UDownloadOnDemandAddProjectModal> DownloadOnDemandAddProjectModalClass;              // 0x0610(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UDownloadOnDemandMessageModal> DownloadOnDemandMessageModalClass;                 // 0x0618(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 AddProjectsWithMnemonicEntitlementName;            // 0x0620(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDownloadOnDemandProject*               SelectedProject;                                   // 0x0630(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_638[0x10];                                     // 0x0638(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlay*                               Overlay_AddProjectParent;                          // 0x0648(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTileView*                        CommonTileView_ProjectTiles;                       // 0x0650(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*              Switcher_DownloadOnDemandPanels;                   // 0x0658(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_AddProject;                                 // 0x0660(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHorizontalBox*                         HorizontalBox_EntitlementCheckMessage;             // 0x0668(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHorizontalBox*                         HorizontalBox_EntitlementCheckFailed;              // 0x0670(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDownloadOnDemandProjectManagementTab*  ProjectManagementTab;                              // 0x0678(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandTabPanel">();
	}
	static class UDownloadOnDemandTabPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandTabPanel>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandTab_EntitlementCreationCondition
// 0x0010 (0x0040 - 0x0030)
class UDownloadOnDemandTab_EntitlementCreationCondition final : public UCreativeContentBrowserTab_CreationCondition
{
public:
	class FString                                 EntitlementName;                                   // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandTab_EntitlementCreationCondition">();
	}
	static class UDownloadOnDemandTab_EntitlementCreationCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandTab_EntitlementCreationCondition>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandAddProjectModal
// 0x0048 (0x05C0 - 0x0578)
class UDownloadOnDemandAddProjectModal final : public UCommonActivatableWidget
{
public:
	class UDownloadOnDemandProject*               Project;                                           // 0x0578(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_580[0x10];                                     // 0x0580(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UEditableTextBox*                       EditableTextBox_DownloadLinkCode;                  // 0x0590(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_AddProject;                                 // 0x0598(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Cancel;                                     // 0x05A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDownloadOnDemandProjectTileImage*      ProjectTileImage_Preview;                          // 0x05A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_ProjectTitle;                              // 0x05B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_ProjectTitle;                            // 0x05B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleDownloadLinkIdTextChanged(const class FText& InputLinkCode);
	void UpdateLightningViolator(ESlateVisibility InVisibility, const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandAddProjectModal">();
	}
	static class UDownloadOnDemandAddProjectModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandAddProjectModal>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandMessageModal
// 0x0018 (0x0590 - 0x0578)
class UDownloadOnDemandMessageModal final : public UCommonActivatableWidget
{
public:
	class UCommonTextBlock*                       TextBlock_MessageTitle;                            // 0x0578(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_Message;                                 // 0x0580(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Close;                                      // 0x0588(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandMessageModal">();
	}
	static class UDownloadOnDemandMessageModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandMessageModal>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandProjectDetailsSidePanel
// 0x0010 (0x0428 - 0x0418)
class UDownloadOnDemandProjectDetailsSidePanel final : public UUserWidget
{
public:
	class UDownloadOnDemandProjectTile*           DownloadOnDemandProjectTile_CurrentProjectEntry;   // 0x0418(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCreativeContentBrowserItemInfo*        ContentBrowserItemInfo_ItemDetails;                // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProjectDetailsSidePanel">();
	}
	static class UDownloadOnDemandProjectDetailsSidePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProjectDetailsSidePanel>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandStatusFeed
// 0x0010 (0x0428 - 0x0418)
class UDownloadOnDemandStatusFeed final : public UUserWidget
{
public:
	bool                                          bOverrideOldStatusWithNewStatus;                   // 0x0418(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortDynamicEntryBox*                   EntryBox_DownloadStatusContainer;                  // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandStatusFeed">();
	}
	static class UDownloadOnDemandStatusFeed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandStatusFeed>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandStatusFeedLine
// 0x0008 (0x0420 - 0x0418)
class UDownloadOnDemandStatusFeedLine final : public UUserWidget
{
public:
	class UCommonTextBlock*                       TextBlock_DownloadStatus;                          // 0x0418(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandStatusFeedLine">();
	}
	static class UDownloadOnDemandStatusFeedLine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandStatusFeedLine>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandProjectAssetTileInitializer
// 0x0010 (0x0040 - 0x0030)
class UDownloadOnDemandProjectAssetTileInitializer final : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaysetPropItemDefinition*         PropItemDefinition;                                // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProjectAssetTileInitializer">();
	}
	static class UDownloadOnDemandProjectAssetTileInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProjectAssetTileInitializer>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandProjectAssetTile
// 0x0040 (0x1890 - 0x1850)
class UDownloadOnDemandProjectAssetTile final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_1850[0x8];                                     // 0x1850(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UDownloadOnDemandProjectAssetTileInitializer* Initializer;                                       // 0x1858(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1860[0x10];                                    // 0x1860(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 Image_Item;                                        // 0x1870(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_Spinner;                                     // 0x1878(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonNumericTextBlock*                NumericTextBlock_ItemCount;                        // 0x1880(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1888[0x8];                                     // 0x1888(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProjectAssetTile">();
	}
	static class UDownloadOnDemandProjectAssetTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProjectAssetTile>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandProjectTile
// 0x0210 (0x1A60 - 0x1850)
class UDownloadOnDemandProjectTile final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_1850[0x10];                                    // 0x1850(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SelectedHighlightBrush;                            // 0x1860(0x00D0)(Edit, NativeAccessSpecifierPrivate)
	struct FSlateBrush                            HoveredHighlightBrush;                             // 0x1930(0x00D0)(Edit, NativeAccessSpecifierPrivate)
	bool                                          bIsSelected;                                       // 0x1A00(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A01[0x7];                                     // 0x1A01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDownloadOnDemandProject*               Project;                                           // 0x1A08(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A10[0x10];                                    // 0x1A10(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UDownloadOnDemandProjectTileImage*      ProjectTileImage_Preview;                          // 0x1A20(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_UpdatePending;                               // 0x1A28(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_AddProject;                                  // 0x1A30(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_Spinner;                                     // 0x1A38(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_Error;                                       // 0x1A40(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                               SizeBox_Label;                                     // 0x1A48(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       TextBlock_Label;                                   // 0x1A50(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonBorder*                          Border_Highlight;                                  // 0x1A58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnLabelUpdated();
	void UpdateLabel(bool bShowLabel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProjectTile">();
	}
	static class UDownloadOnDemandProjectTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProjectTile>();
	}
};

// Class VKDownloadOnDemandUI.DownloadOnDemandProjectTileImage
// 0x0038 (0x0450 - 0x0418)
class UDownloadOnDemandProjectTileImage final : public UUserWidget
{
public:
	class UTexture*                               EmptyProjectTexture;                               // 0x0418(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bOverrideGrayScale : 1;                            // 0x0420(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GreyScaleOverride;                                 // 0x0424(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDownloadOnDemandProject*               Project;                                           // 0x0428(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_430[0x10];                                     // 0x0430(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 Image_ProjectPreview;                              // 0x0440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_LoadingImageSpinner;                         // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProjectTileImage">();
	}
	static class UDownloadOnDemandProjectTileImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProjectTileImage>();
	}
};

}

