#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VKDownloadOnDemandGameplay

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ModularGameplay_classes.hpp"


namespace SDK
{

// Class VKDownloadOnDemandGameplay.DownloadOnDemandComponent
// 0x01C0 (0x0298 - 0x00D8)
class UDownloadOnDemandComponent final : public UControllerComponent
{
public:
	uint8                                         Pad_D8[0x198];                                     // 0x00D8(0x0198)(Fixing Size After Last Property [ Dumper-7 ])
	class UDownloadOnDemandPlot*                  Plot;                                              // 0x0270(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UDownloadOnDemandProject*>       UserOwnedProjects;                                 // 0x0278(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UDownloadOnDemandProjectContent*> ShelvedContents;                                   // 0x0288(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void HandleMnemonicsFromValkyriePaletteProviderReceived(const TArray<class FString>& Mnemonics);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandComponent">();
	}
	static class UDownloadOnDemandComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandComponent>();
	}
};

// Class VKDownloadOnDemandGameplay.DownloadOnDemandPlot
// 0x0098 (0x00C8 - 0x0030)
class UDownloadOnDemandPlot final : public UObject
{
public:
	uint8                                         Pad_30[0x78];                                      // 0x0030(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDownloadOnDemandProject*>       ActiveProjects;                                    // 0x00A8(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UDownloadOnDemandProject*>       PendingProjects;                                   // 0x00B8(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandPlot">();
	}
	static class UDownloadOnDemandPlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandPlot>();
	}
};

// Class VKDownloadOnDemandGameplay.DownloadOnDemandProject
// 0x0108 (0x0138 - 0x0030)
class UDownloadOnDemandProject final : public UObject
{
public:
	uint8                                         Pad_30[0x90];                                      // 0x0030(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class UDownloadOnDemandProjectDescriptor*     Descriptor;                                        // 0x00C0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FString, class UDownloadOnDemandProjectContent*> Contents;                                          // 0x00C8(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_118[0x20];                                     // 0x0118(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProject">();
	}
	static class UDownloadOnDemandProject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProject>();
	}
};

// Class VKDownloadOnDemandGameplay.DownloadOnDemandProjectContent
// 0x0078 (0x00A8 - 0x0030)
class UDownloadOnDemandProjectContent final : public UObject
{
public:
	uint8                                         Pad_30[0x48];                                      // 0x0030(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortItemDefinition*>            ContentItemDefinitions;                            // 0x0078(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FSoftObjectPath>                ContentSoftObjectPaths;                            // 0x0088(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FSoftObjectPath>                LoadFailedContentObjectPaths;                      // 0x0098(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProjectContent">();
	}
	static class UDownloadOnDemandProjectContent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProjectContent>();
	}
};

// Class VKDownloadOnDemandGameplay.DownloadOnDemandProjectDescriptor
// 0x0058 (0x0088 - 0x0030)
class UDownloadOnDemandProjectDescriptor final : public UObject
{
public:
	uint8                                         Pad_30[0x48];                                      // 0x0030(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UDownloadOnDemandProjectImage*          Image;                                             // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProjectDescriptor">();
	}
	static class UDownloadOnDemandProjectDescriptor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProjectDescriptor>();
	}
};

// Class VKDownloadOnDemandGameplay.DownloadOnDemandProjectImage
// 0x0038 (0x0068 - 0x0030)
class UDownloadOnDemandProjectImage final : public UObject
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2DDynamic*                      PreviewTexture;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadOnDemandProjectImage">();
	}
	static class UDownloadOnDemandProjectImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadOnDemandProjectImage>();
	}
};

}

