#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VkRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class VkRuntime.ValkyrieGameFeatureSetDefinition
// 0x0040 (0x0088 - 0x0048)
class UValkyrieGameFeatureSetDefinition final : public UPrimaryDataAsset
{
public:
	class FString                                 GameFeatureSet;                                    // 0x0048(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                   DisplayName;                                       // 0x0058(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FString                                 ContentGuidelinesUrl;                              // 0x0068(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 CreationAccessUrl;                                 // 0x0078(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieGameFeatureSetDefinition">();
	}
	static class UValkyrieGameFeatureSetDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieGameFeatureSetDefinition>();
	}
};

// Class VkRuntime.ValkyrieGameFeatureSetMetadataSubsystem
// 0x00D8 (0x0110 - 0x0038)
class UValkyrieGameFeatureSetMetadataSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_38[0xD8];                                      // 0x0038(0x00D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieGameFeatureSetMetadataSubsystem">();
	}
	static class UValkyrieGameFeatureSetMetadataSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieGameFeatureSetMetadataSubsystem>();
	}
};

}

