#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceRep

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "VoiceRep_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class VoiceRep.FortVoiceReportIntroModal
// 0x0010 (0x0588 - 0x0578)
class UFortVoiceReportIntroModal final : public UCommonActivatableWidget
{
public:
	class UCommonTextBlock*                       Text_VoiceReportingTitle;                          // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_580[0x8];                                      // 0x0580(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleLearnMore();
	void HandleTurnOffClicked();
	void HandleTurnOnClicked();
	void UpdateVisuals(const EUFortVoiceReportIntroModalType DescriptionType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVoiceReportIntroModal">();
	}
	static class UFortVoiceReportIntroModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVoiceReportIntroModal>();
	}
};

// Class VoiceRep.VoiceRepTooltipBase
// 0x0008 (0x05E8 - 0x05E0)
class UVoiceRepTooltipBase final : public UFortSidebarOnboardTooltipWidget
{
public:
	int32                                         AutoDismissTimerInterval;                          // 0x05E0(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoiceRepTooltipBase">();
	}
	static class UVoiceRepTooltipBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoiceRepTooltipBase>();
	}
};

// Class VoiceRep.VoiceRepDataAsset
// 0x0020 (0x0058 - 0x0038)
class UVoiceRepDataAsset final : public UDataAsset
{
public:
	TSubclassOf<class UWidget>                    VoiceChatTooltipWidgetClass;                       // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UWidget>                    FirstOnboardingWidgetClass;                        // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UWidget>                    SecondOnboardingWidgetClass;                       // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UWidget>                    ReportVoiceWidgetClass;                            // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoiceRepDataAsset">();
	}
	static class UVoiceRepDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoiceRepDataAsset>();
	}
};

}

