#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VotingFramework

#include "Basic.hpp"

#include "VotingFramework_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MeshNetwork_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class VotingFramework.VoteBroadcasterComponent
// 0x03D8 (0x0560 - 0x0188)
class UVoteBroadcasterComponent final : public UMeshNetworkComponent
{
public:
	TArray<struct FVoteSessionSettings>           VoteSessionSettingsList;                           // 0x0188(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FVoteSessionRuntimeArray               VoteSessionRuntimeList;                            // 0x0198(0x0128)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	struct FVoteRuntimeArray                      VoteRuntimeList;                                   // 0x02C0(0x0128)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	struct FVoteSelectionResultsArray             VoteResultsList;                                   // 0x03E8(0x0128)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<struct FUniqueNetIdRepl, struct FCastedVote> PlayerCastedVotesMap;                              // 0x0510(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	void OnVoteCasted(const struct FUniqueNetIdRepl& UserNetId, const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& VoteId, const struct FGameplayTag& VoteSelectionId);
	void ServerSubmitVotesAggregated(class FName VoteSessionId, class FName VoteId, class FName VoteSelectionId, int32 VoteDelta);
	void VoteEnd(class FName VoteSessionId, class FName VoteId, class FName WinningVoteSelectionId);
	void VoteSessionComplete(class FName VoteSessionId);
	void VoteSessionSetup(class FName VoteSessionId, class FName StartingVoteId, EVoteSessionNetworkType NetworkType);
	void VoteSessionShutdown(class FName VoteSessionId);
	void VoteSetup(class FName VoteSessionId, class FName VoteId);
	void VoteStart(class FName VoteSessionId, class FName VoteId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoteBroadcasterComponent">();
	}
	static class UVoteBroadcasterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoteBroadcasterComponent>();
	}
};

// Class VotingFramework.VoteDispatchSubsystem
// 0x00A0 (0x00D8 - 0x0038)
class UVoteDispatchSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_38[0x90];                                      // 0x0038(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVoteSelectionResults>          VotingResults;                                     // 0x00C8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoteDispatchSubsystem">();
	}
	static class UVoteDispatchSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoteDispatchSubsystem>();
	}
};

// Class VotingFramework.VoteInitiationActor
// 0x0010 (0x0438 - 0x0428)
class AVoteInitiationActor final : public AInfo
{
public:
	uint8                                         Pad_428[0x8];                                      // 0x0428(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoteBroadcasterComponent*              VoteBroadcasterComponent;                          // 0x0430(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoteInitiationActor">();
	}
	static class AVoteInitiationActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVoteInitiationActor>();
	}
};

// Class VotingFramework.VoteListenerComponent
// 0x00E0 (0x01B8 - 0x00D8)
class UVoteListenerComponent : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(struct FGameplayTag& VoteSessionId, struct FGameplayTag& StartingVoteId, EVoteSessionNetworkType NetworkType, EVoteSessionState SessionState)> OnVoteSessionSetupEvent;                           // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(struct FGameplayTag& VoteSessionId, struct FGameplayTag& StartingVoteId, EVoteSessionState SessionState)> OnVoteSessionVotingEvent;                          // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(struct FGameplayTag& VoteSessionId, struct FGameplayTag& VoteId, EVoteState VoteState)> OnVoteSetupEvent;                                  // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(struct FGameplayTag& VoteSessionId, struct FGameplayTag& VoteId, EVoteState VoteState)> OnVoteStartEvent;                                  // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(struct FGameplayTag& VoteSessionId, struct FGameplayTag& VoteId, struct FGameplayTag& VoteSelectionId, int32 ServerVoteTotal, int32 AllServersVoteTotal)> OnVoteChangeEvent;                                 // 0x0118(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(struct FGameplayTag& VoteSessionId, struct FGameplayTag& VoteId, struct FGameplayTag& WinningVoteSelectionId, EVoteState VoteState)> OnVoteEndEvent;                                    // 0x0128(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(struct FGameplayTag& VoteSessionId)> OnVoteSessionCompleteEvent;                        // 0x0138(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(struct FGameplayTag& VoteSessionId)> OnVoteSessionShutdownEvent;                        // 0x0148(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  RequestedVoteSessionIds;                           // 0x0158(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  RequestedVoteIds;                                  // 0x0178(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  RequestedVoteSelectionIds;                         // 0x0198(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	void OnVoteChange(const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& VoteId, const struct FGameplayTag& VoteSelectionId, int32 ServerVoteTotal, int32 AllServersVoteTotal);
	void OnVoteEnd(const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& VoteId, const struct FGameplayTag& WinningVoteSelectionId, EVoteState VoteState);
	void OnVoteSessionComplete(const struct FGameplayTag& VoteSessionId);
	void OnVoteSessionSetup(const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& StartingVoteId, EVoteSessionNetworkType NetworkType, EVoteSessionState SessionState);
	void OnVoteSessionShutdown(const struct FGameplayTag& VoteSessionId);
	void OnVoteSessionVoting(const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& StartingVoteId, EVoteSessionState SessionState);
	void OnVoteSetup(const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& VoteId, EVoteState VoteState);
	void OnVoteStart(const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& VoteId, EVoteState VoteState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoteListenerComponent">();
	}
	static class UVoteListenerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoteListenerComponent>();
	}
};

// Class VotingFramework.VoteResponderComponent
// 0x0080 (0x0238 - 0x01B8)
class UVoteResponderComponent final : public UVoteListenerComponent
{
public:
	TArray<struct FVoteSelection>                 SupportedVoteSelections;                           // 0x01B8(0x0010)(Edit, Net, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bShouldLockVotingAfterCasted;                      // 0x01C8(0x0001)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FUniqueNetIdRepl, struct FCastedVote> PlayerCastedVotesMap;                              // 0x01D0(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	class FName                                   ActiveVoteSessionId;                               // 0x0220(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ActiveVoteId;                                      // 0x022C(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void CastDefaultVoteSelection(const class APlayerState* InPlayerState);
	void CastManualVoteSelection(const class APlayerState* InPlayerState, const struct FGameplayTag& VoteSelection);
	void CastManualVoteSelectionAtIndex(const class APlayerState* InPlayerState, const int32 SelectionIndex);
	void ServerCastVoteSelection(const struct FUniqueNetIdRepl& InUserId, const struct FCastedVote& CastedVote);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoteResponderComponent">();
	}
	static class UVoteResponderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoteResponderComponent>();
	}
};

}

