#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VREditor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum VREditor.EControllerType
// NumValues: 0x0006
enum class EControllerType : uint8
{
	Laser                                    = 0,
	AssistingLaser                           = 1,
	UI                                       = 2,
	Navigation                               = 3,
	Unknown                                  = 4,
	EControllerType_MAX                      = 5,
};

// Enum VREditor.ETouchSwipeDirection
// NumValues: 0x0006
enum class ETouchSwipeDirection : uint8
{
	None                                     = 0,
	Left                                     = 1,
	Right                                    = 2,
	Up                                       = 3,
	Down                                     = 4,
	ETouchSwipeDirection_MAX                 = 5,
};

// Enum VREditor.EVREditorWidgetDrawingPolicy
// NumValues: 0x0003
enum class EVREditorWidgetDrawingPolicy : uint8
{
	Always                                   = 0,
	Hovering                                 = 1,
	EVREditorWidgetDrawingPolicy_MAX         = 2,
};

// Enum VREditor.EInteractorHand
// NumValues: 0x0003
enum class EInteractorHand : uint8
{
	Right                                    = 0,
	Left                                     = 1,
	EInteractorHand_MAX                      = 2,
};

// ScriptStruct VREditor.VREditorFloatingUICreationContext
// 0x00A0 (0x00A0 - 0x0000)
struct FVREditorFloatingUICreationContext final
{
public:
	TSubclassOf<class UUserWidget>                WidgetClass;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PanelID;                                           // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ParentActor;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             PanelSpawnOffset;                                  // 0x0020(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              PanelSize;                                         // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            PanelMesh;                                         // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EditorUISize;                                      // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideWindowHandles;                                // 0x009C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMaskOutWidgetBackground;                          // 0x009D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNoCloseButton;                                    // 0x009E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VREditor.VRButton
// 0x0038 (0x0038 - 0x0000)
struct FVRButton final
{
public:
	class UVREditorWidgetComponent*               ButtonWidget;                                      // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x30];                                       // 0x0008(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

