#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VREditor

#include "Basic.hpp"

#include "UnrealEd_classes.hpp"
#include "ViewportInteraction_structs.hpp"
#include "ViewportInteraction_classes.hpp"
#include "Engine_classes.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "InputCore_structs.hpp"
#include "VREditor_structs.hpp"


namespace SDK
{

// Class VREditor.VREditorAssetContainer
// 0x0168 (0x01A0 - 0x0038)
class UVREditorAssetContainer final : public UDataAsset
{
public:
	class USoundBase*                             DockableWindowCloseSound;                          // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             DockableWindowOpenSound;                           // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             DockableWindowDropSound;                           // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             DockableWindowDragSound;                           // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             DropFromContentBrowserSound;                       // 0x0058(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             RadialMenuOpenSound;                               // 0x0060(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             RadialMenuCloseSound;                              // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             TeleportSound;                                     // 0x0070(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                              ButtonPressSound;                                  // 0x0078(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             AutoScaleSound;                                    // 0x0080(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            GenericHMDMesh;                                    // 0x0088(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            PlaneMesh;                                         // 0x0090(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            CylinderMesh;                                      // 0x0098(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            LaserPointerStartMesh;                             // 0x00A0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            LaserPointerMesh;                                  // 0x00A8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            LaserPointerEndMesh;                               // 0x00B0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            LaserPointerHoverMesh;                             // 0x00B8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            VivePreControllerMesh;                             // 0x00C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            OculusControllerMesh;                              // 0x00C8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            GenericControllerMesh;                             // 0x00D0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            TeleportRootMesh;                                  // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            WindowMesh;                                        // 0x00E0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            WindowSelectionBarMesh;                            // 0x00E8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            WindowCloseButtonMesh;                             // 0x00F0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            RadialMenuMainMesh;                                // 0x00F8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            RadialMenuPointerMesh;                             // 0x0100(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            PointerCursorMesh;                                 // 0x0108(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            LineSegmentCylinderMesh;                           // 0x0110(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            JointSphereMesh;                                   // 0x0118(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            DockingButtonMesh;                                 // 0x0120(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     GridMaterial;                                      // 0x0128(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     LaserPointerMaterial;                              // 0x0130(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     LaserPointerTranslucentMaterial;                   // 0x0138(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                              WorldMovementPostProcessMaterial;                  // 0x0140(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     TextMaterial;                                      // 0x0148(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     VivePreControllerMaterial;                         // 0x0150(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     OculusControllerMaterial;                          // 0x0158(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     TeleportMaterial;                                  // 0x0160(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     WindowMaterial;                                    // 0x0168(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     WindowTranslucentMaterial;                         // 0x0170(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                              LineMaterial;                                      // 0x0178(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     TranslucentTextMaterial;                           // 0x0180(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     WidgetMaterial;                                    // 0x0188(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     CameraWidgetMaterial;                              // 0x0190(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFont*                                  TextFont;                                          // 0x0198(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VREditorAssetContainer">();
	}
	static class UVREditorAssetContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVREditorAssetContainer>();
	}
};

// Class VREditor.VREditorAutoScaler
// 0x0008 (0x0038 - 0x0030)
class UVREditorAutoScaler final : public UObject
{
public:
	class UVREditorMode*                          VRMode;                                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VREditorAutoScaler">();
	}
	static class UVREditorAutoScaler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVREditorAutoScaler>();
	}
};

// Class VREditor.VREditorAvatarActor
// 0x0070 (0x0490 - 0x0420)
class AVREditorAvatarActor final : public AActor
{
public:
	class UStaticMeshComponent*                   HeadMeshComponent;                                 // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   WorldMovementGridMeshComponent;                    // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               WorldMovementGridMID;                              // 0x0430(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         WorldMovementGridOpacity;                          // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsDrawingWorldMovementPostProcess;                // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_43D[0x3];                                      // 0x043D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               WorldMovementPostProcessMaterial;                  // 0x0440(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   ScaleProgressMeshComponent;                        // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   CurrentScaleProgressMeshComponent;                 // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextRenderComponent*                   UserScaleIndicatorText;                            // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               FixedUserScaleMID;                                 // 0x0460(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               TranslucentFixedUserScaleMID;                      // 0x0468(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               CurrentUserScaleMID;                               // 0x0470(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               TranslucentCurrentUserScaleMID;                    // 0x0478(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPostProcessComponent*                  PostProcessComponent;                              // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVREditorMode*                          VRMode;                                            // 0x0488(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VREditorAvatarActor">();
	}
	static class AVREditorAvatarActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVREditorAvatarActor>();
	}
};

// Class VREditor.VREditorBaseActor
// 0x0190 (0x05B0 - 0x0420)
class alignas(0x10) AVREditorBaseActor : public AActor
{
public:
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UVREditorMode*                          VRMode;                                            // 0x0428(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_430[0x180];                                    // 0x0430(0x0180)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VREditorBaseActor">();
	}
	static class AVREditorBaseActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVREditorBaseActor>();
	}
};

// Class VREditor.VREditorFloatingUI
// 0x0110 (0x06C0 - 0x05B0)
#pragma pack(push, 0x1)
class alignas(0x10) AVREditorFloatingUI : public AVREditorBaseActor
{
public:
	struct FVREditorFloatingUICreationContext     CreationContext;                                   // 0x05B0(0x00A0)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_650[0x10];                                     // 0x0650(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            UserWidget;                                        // 0x0660(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVREditorWidgetComponent*               WidgetComponent;                                   // 0x0668(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   WindowMeshComponent;                               // 0x0670(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_678[0x18];                                     // 0x0678(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    UserWidgetClass;                                   // 0x0690(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_698[0x20];                                     // 0x0698(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VREditorFloatingUI">();
	}
	static class AVREditorFloatingUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVREditorFloatingUI>();
	}
};
#pragma pack(pop)

// Class VREditor.VREditorBaseUserWidget
// 0x0008 (0x0420 - 0x0418)
class UVREditorBaseUserWidget final : public UUserWidget
{
public:
	TWeakObjectPtr<class AVREditorFloatingUI>     Owner;                                             // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VREditorBaseUserWidget">();
	}
	static class UVREditorBaseUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVREditorBaseUserWidget>();
	}
};

// Class VREditor.VREditorWidgetComponent
// 0x0000 (0x06F0 - 0x06F0)
class UVREditorWidgetComponent : public UWidgetComponent
{
public:
	EVREditorWidgetDrawingPolicy                  DrawingPolicy;                                     // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsHovering;                                       // 0x06E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasEverDrawn;                                     // 0x06EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6EB[0x5];                                      // 0x06EB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VREditorWidgetComponent">();
	}
	static class UVREditorWidgetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVREditorWidgetComponent>();
	}
};

// Class VREditor.VREditorCameraWidgetComponent
// 0x0000 (0x06F0 - 0x06F0)
class UVREditorCameraWidgetComponent final : public UVREditorWidgetComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VREditorCameraWidgetComponent">();
	}
	static class UVREditorCameraWidgetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVREditorCameraWidgetComponent>();
	}
};

// Class VREditor.VREditorDockableWindow
// 0x0070 (0x0730 - 0x06C0)
class AVREditorDockableWindow : public AVREditorFloatingUI
{
public:
	uint8                                         Pad_6B8[0x8];                                      // 0x06B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   DockButtonMeshComponent;                           // 0x06C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   SelectionBarMeshComponent;                         // 0x06C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   CloseButtonMeshComponent;                          // 0x06D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               DockButtonMID;                                     // 0x06D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               SelectionBarMID;                                   // 0x06E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               SelectionBarTranslucentMID;                        // 0x06E8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               CloseButtonMID;                                    // 0x06F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               CloseButtonTranslucentMID;                         // 0x06F8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UViewportDragOperationComponent*        DragOperationComponent;                            // 0x0700(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_708[0x28];                                     // 0x0708(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VREditorDockableWindow">();
	}
	static class AVREditorDockableWindow* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVREditorDockableWindow>();
	}
};

// Class VREditor.VREditorDockableCameraWindow
// 0x0000 (0x0730 - 0x0730)
class AVREditorDockableCameraWindow final : public AVREditorDockableWindow
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VREditorDockableCameraWindow">();
	}
	static class AVREditorDockableCameraWindow* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVREditorDockableCameraWindow>();
	}
};

// Class VREditor.DockableWindowDragOperation
// 0x00E8 (0x0120 - 0x0038)
class UDockableWindowDragOperation final : public UViewportDragOperation
{
public:
	uint8                                         Pad_38[0xE8];                                      // 0x0038(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DockableWindowDragOperation">();
	}
	static class UDockableWindowDragOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDockableWindowDragOperation>();
	}
};

// Class VREditor.VREditorFloatingCameraUI
// 0x0020 (0x06E0 - 0x06C0)
class AVREditorFloatingCameraUI final : public AVREditorFloatingUI
{
public:
	struct FVector                                OffsetFromCamera;                                  // 0x06B8(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  LinkedActor;                                       // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6D8[0x8];                                      // 0x06D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VREditorFloatingCameraUI">();
	}
	static class AVREditorFloatingCameraUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVREditorFloatingCameraUI>();
	}
};

// Class VREditor.FloatingText
// 0x0048 (0x0468 - 0x0420)
class AFloatingText final : public AActor
{
public:
	class USceneComponent*                        SceneComponent;                                    // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   FirstLineComponent;                                // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   JointSphereComponent;                              // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   SecondLineComponent;                               // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextRenderComponent*                   TextComponent;                                     // 0x0440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                     MaskedTextMaterial;                                // 0x0448(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                     TranslucentTextMaterial;                           // 0x0450(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                     LineMaterial;                                      // 0x0458(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               LineMaterialMID;                                   // 0x0460(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FloatingText">();
	}
	static class AFloatingText* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFloatingText>();
	}
};

// Class VREditor.VREditorInteractor
// 0x0270 (0x0A10 - 0x07A0)
class UVREditorInteractor : public UViewportInteractor
{
public:
	bool                                          bIsUndoRedoSwipeEnabled;                           // 0x0798(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_799[0x7];                                      // 0x0799(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMotionControllerComponent*             MotionControllerComponent;                         // 0x07A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMotionControllerComponent*             LaserMotionControllerComponent;                    // 0x07A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   HandMeshComponent;                                 // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7B8[0x78];                                     // 0x07B8(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       LaserSplineComponent;                              // 0x0830(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class USplineMeshComponent*>           LaserSplineMeshComponents;                         // 0x0838(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               LaserPointerMID;                                   // 0x0848(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               TranslucentLaserPointerMID;                        // 0x0850(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   HoverMeshComponent;                                // 0x0858(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPointLightComponent*                   HoverPointLightComponent;                          // 0x0860(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               HandMeshMID;                                       // 0x0868(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 OwningAvatar;                                      // 0x0870(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_878[0x90];                                     // 0x0878(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	EControllerType                               ControllerType;                                    // 0x0908(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EControllerType                               OverrideControllerType;                            // 0x0909(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90A[0x72];                                     // 0x090A(0x0072)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ControllerMotionSource;                            // 0x097C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_988[0x80];                                     // 0x0988(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	class UVREditorMode*                          VRMode;                                            // 0x0A08(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class AVREditorTeleporter* GetTeleportActor();
	void Init(class UVREditorMode* InVRMode);
	void ReplaceHandMeshComponent(class UStaticMesh* NewMesh, const struct FVector& MeshScale);
	void SetControllerHandSide(const class FName InControllerHandSide);
	void SetControllerType(const EControllerType InControllerType);
	void SetForceLaserColor(const struct FLinearColor& InColor);
	void SetForceShowLaser(const bool bInForceShow);
	void SetupComponent(class AActor* OwningActor);
	bool TryOverrideControllerType(const EControllerType InControllerType);
	void UpdateHandMeshRelativeTransform();

	class FName GetControllerHandSide() const;
	EControllerHand GetControllerSide() const;
	EControllerType GetControllerType() const;
	class FName GetHMDDeviceType() const;
	const struct FVector GetLaserEnd() const;
	const struct FVector GetLaserStart() const;
	struct FVector2D GetLastTrackpadPosition() const;
	class UMotionControllerComponent* GetMotionControllerComponent() const;
	float GetSelectAndMoveTriggerValue() const;
	float GetSlideDelta() const;
	struct FVector2D GetTrackpadPosition() const;
	bool IsClickingOnUI() const;
	bool IsHoveringOverUI() const;
	bool IsTouchingTrackpad() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VREditorInteractor">();
	}
	static class UVREditorInteractor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVREditorInteractor>();
	}
};

// Class VREditor.VREditorModeBase
// 0x0040 (0x0090 - 0x0050)
class UVREditorModeBase : public UEditorWorldExtension
{
public:
	uint8                                         Pad_50[0x40];                                      // 0x0050(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VREditorModeBase">();
	}
	static class UVREditorModeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVREditorModeBase>();
	}
};

// Class VREditor.VREditorMode
// 0x0180 (0x0210 - 0x0090)
class UVREditorMode final : public UVREditorModeBase
{
public:
	uint8                                         Pad_90[0x30];                                      // 0x0090(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class AVREditorAvatarActor*                   AvatarActor;                                       // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0x58];                                      // 0x00C8(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	class UVREditorUISystem*                      UISystem;                                          // 0x0120(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AVREditorTeleporter*                    TeleportActor;                                     // 0x0128(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVREditorAutoScaler*                    AutoScalerSystem;                                  // 0x0130(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UViewportWorldInteraction*              WorldInteraction;                                  // 0x0138(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_140[0x8];                                      // 0x0140(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UVREditorPlacement*                     PlacementSystem;                                   // 0x0148(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UVREditorInteractor*>            Interactors;                                       // 0x0150(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   InteractorClass;                                   // 0x0160(0x0030)(Edit, BlueprintVisible, NoClear, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   TeleporterClass;                                   // 0x0190(0x0030)(Edit, BlueprintVisible, NoClear, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C0[0x20];                                     // 0x01C0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UVREditorAssetContainer*                AssetContainer;                                    // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1E8[0x28];                                     // 0x01E8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetGameView(bool bGameView);

	float GetWorldScaleFactor() const;
	bool IsInGameView() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VREditorMode">();
	}
	static class UVREditorMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVREditorMode>();
	}
};

// Class VREditor.VREditorPlacement
// 0x0020 (0x0050 - 0x0030)
class UVREditorPlacement final : public UObject
{
public:
	class UVREditorMode*                          VRMode;                                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UViewportWorldInteraction*              ViewportWorldInteraction;                          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetComponent*                       FloatingUIAssetDraggedFrom;                        // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                PlacingMaterialOrTextureAsset;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VREditorPlacement">();
	}
	static class UVREditorPlacement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVREditorPlacement>();
	}
};

// Class VREditor.VREditorRadialFloatingUI
// 0x00B0 (0x0660 - 0x05B0)
class AVREditorRadialFloatingUI final : public AVREditorBaseActor
{
public:
	uint8                                         Pad_5B0[0x20];                                     // 0x05B0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVREditorWidgetComponent*>       WidgetComponents;                                  // 0x05D0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   WindowMeshComponent;                               // 0x05E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   ArrowMeshComponent;                                // 0x05E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVREditorWidgetComponent*               CentralWidgetComponent;                            // 0x05F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F8[0x68];                                     // 0x05F8(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VREditorRadialFloatingUI">();
	}
	static class AVREditorRadialFloatingUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVREditorRadialFloatingUI>();
	}
};

// Class VREditor.VREditorTeleporter
// 0x00B0 (0x04D0 - 0x0420)
class AVREditorTeleporter final : public AActor
{
public:
	class UVREditorMode*                          VRMode;                                            // 0x0420(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_428[0x38];                                     // 0x0428(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   TeleportDirectionMeshComponent;                    // 0x0460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   HMDMeshComponent;                                  // 0x0468(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   LeftMotionControllerMeshComponent;                 // 0x0470(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   RightMotionControllerMeshComponent;                // 0x0478(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               TeleportMID;                                       // 0x0480(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UViewportInteractor*                    InteractorTryingTeleport;                          // 0x0488(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_490[0x40];                                     // 0x0490(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DoTeleport();
	float GetSlideDelta(class UVREditorInteractor* Interactor, const bool Axis);
	void Init(class UVREditorMode* InMode);
	void SetColor(const struct FLinearColor& Color);
	void SetVisibility(const bool bVisible);
	void Shutdown();
	void StartAiming(class UViewportInteractor* Interactor);
	void StartTeleport();
	void StopAiming();
	void TeleportDone();

	class UViewportInteractor* GetInteractorTryingTeleport() const;
	class UVREditorMode* GetVRMode() const;
	bool IsAiming() const;
	bool IsTeleporting() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VREditorTeleporter">();
	}
	static class AVREditorTeleporter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVREditorTeleporter>();
	}
};

// Class VREditor.VREditorUISystem
// 0x01F0 (0x0220 - 0x0030)
class alignas(0x10) UVREditorUISystem final : public UObject
{
public:
	class UVREditorMode*                          VRMode;                                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, class AVREditorFloatingUI*> FloatingUIs;                                       // 0x0038(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<class FName, class AActor*>              PreviewWindowInfo;                                 // 0x0088(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class AVREditorFloatingUI*                    InfoDisplayPanel;                                  // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x10];                                      // 0x00E0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AVREditorRadialFloatingUI*              QuickRadialMenu;                                   // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F8[0x78];                                      // 0x00F8(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class AVREditorDockableWindow*                DraggingUI;                                        // 0x0170(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AVREditorDockableWindow*                ColorPickerUI;                                     // 0x0178(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVREditorInteractor*                    LaserInteractor;                                   // 0x0180(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVREditorInteractor*                    UIInteractor;                                      // 0x0188(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_190[0x30];                                     // 0x0190(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVRButton>                      VRButtons;                                         // 0x01C0(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UVRRadialMenuHandler*                   RadialMenuHandler;                                 // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D8[0x48];                                     // 0x01D8(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VREditorUISystem">();
	}
	static class UVREditorUISystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVREditorUISystem>();
	}
};

// Class VREditor.VRModeSettings
// 0x00B0 (0x00E8 - 0x0038)
class UVRModeSettings final : public UVISettings
{
public:
	uint8                                         bEnableAutoVREditMode : 1;                         // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAutokeySequences : 1;                             // 0x0038(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EInteractorHand                               InteractorHand;                                    // 0x003C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bShowWorldMovementGrid : 1;                        // 0x0040(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowWorldMovementPostProcess : 1;                 // 0x0040(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowWorldScaleProgressBar : 1;                    // 0x0040(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UIBrightness;                                      // 0x0044(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GizmoScale;                                        // 0x0048(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DoubleClickTime;                                   // 0x004C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggerPressedThreshold_Vive;                      // 0x0050(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggerPressedThreshold_Rift;                      // 0x0054(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   InteractorClass;                                   // 0x0058(0x0030)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   TeleporterClass;                                   // 0x0088(0x0030)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   ModeClass;                                         // 0x00B8(0x0030)(Edit, Config, NoClear, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VRModeSettings">();
	}
	static class UVRModeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVRModeSettings>();
	}
};

// Class VREditor.VRRadialMenuHandler
// 0x0078 (0x00A8 - 0x0030)
class UVRRadialMenuHandler final : public UObject
{
public:
	uint8                                         Pad_30[0x78];                                      // 0x0030(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VRRadialMenuHandler">();
	}
	static class UVRRadialMenuHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVRRadialMenuHandler>();
	}
};

// Class VREditor.VRScoutingInteractor
// 0x0020 (0x0A30 - 0x0A10)
class UVRScoutingInteractor final : public UVREditorInteractor
{
public:
	class UStaticMeshComponent*                   FlyingIndicatorComponent;                          // 0x0A10(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputComponent*                        EditorOnlyInputComponent;                          // 0x0A18(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bReceivesEditorInput;                              // 0x0A20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A21[0xF];                                      // 0x0A21(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static TArray<class AActor*> GetSelectedActors();

	void SetGizmoMode(EGizmoHandleTypes InGizmoMode);
	void SetReceivesEditorInput(bool bInValue);

	EGizmoHandleTypes GetGizmoMode() const;
	class UInputComponent* GetInputComponent() const;
	bool GetReceivesEditorInput() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VRScoutingInteractor">();
	}
	static class UVRScoutingInteractor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVRScoutingInteractor>();
	}
};

}

