#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaterAdvanced

#include "Basic.hpp"

#include "WaterAdvanced_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class WaterAdvanced.ShallowWaterPhysicsAssetOverridesDataAsset
// 0x0050 (0x0088 - 0x0038)
class UShallowWaterPhysicsAssetOverridesDataAsset final : public UDataAsset
{
public:
	TMap<struct FGameplayTag, struct FShallowWaterPhysicsAssetOverride> Overrides;                                         // 0x0038(0x0050)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ShallowWaterPhysicsAssetOverridesDataAsset">();
	}
	static class UShallowWaterPhysicsAssetOverridesDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShallowWaterPhysicsAssetOverridesDataAsset>();
	}
};

// Class WaterAdvanced.ShallowWaterRiverComponent
// 0x0110 (0x0680 - 0x0570)
class UShallowWaterRiverComponent final : public UPrimitiveComponent
{
public:
	class UNiagaraSystem*                         NiagaraRiverSimulation;                            // 0x0570(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ResolutionMaxAxis;                                 // 0x0578(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SourceSize;                                        // 0x057C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SimSpeed;                                          // 0x0580(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSteps;                                          // 0x0584(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AWaterBody*                             SourceRiverWaterBody;                              // 0x0588(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AWaterBody*                             SinkRiverWaterBody;                                // 0x0590(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AWaterBody*>                     AdditonalRiverWaterBodies;                         // 0x0598(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          PreviewBakedSim;                                   // 0x05A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             BakedWaterSurfaceTexture;                          // 0x05B0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         BottomContourActors;                               // 0x05B8(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                         BottomContourCaptureOffset;                        // 0x05C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5CC[0x4];                                      // 0x05CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      RiverSimSystem;                                    // 0x05D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextureRenderTarget2D*                 WaterInfoTexture;                                  // 0x05D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextureRenderTarget2D*                 BakedWaterSurfaceRT;                               // 0x05E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E8[0x8];                                      // 0x05E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class AWaterBody*>                       AllWaterBodies;                                    // 0x05F0(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FVector2D                              WorldGridSize;                                     // 0x0640(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                SystemPos;                                         // 0x0650(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FVector4>                       ShallowWaterSimArrayValues;                        // 0x0668(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_678[0x8];                                      // 0x0678(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ShallowWaterRiverComponent">();
	}
	static class UShallowWaterRiverComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShallowWaterRiverComponent>();
	}
};

// Class WaterAdvanced.ShallowWaterRiver
// 0x0008 (0x0428 - 0x0420)
class AShallowWaterRiver final : public AActor
{
public:
	class UShallowWaterRiverComponent*            ShallowWaterRiverComponent;                        // 0x0420(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ShallowWaterRiver">();
	}
	static class AShallowWaterRiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<AShallowWaterRiver>();
	}
};

// Class WaterAdvanced.ShallowWaterSettings
// 0x0110 (0x0170 - 0x0060)
class UShallowWaterSettings final : public UDeveloperSettings
{
public:
	TSoftObjectPtr<class UNiagaraSystem>          DefaultShallowWaterNiagaraSimulation;              // 0x0060(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UNiagaraDataChannelAsset> DefaultShallowWaterCollisionNDC;                   // 0x0090(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FShallowWaterSimParameters             ShallowWaterSimParameters;                         // 0x00C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NoDestructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialParameterCollection> WaterMPC;                                          // 0x00C8(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GridCenterMPCName;                                 // 0x00F8(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   WorldGridSizeMPCName;                              // 0x0104(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ResolutionMaxAxisMPCName;                          // 0x0110(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NormalRTMaterialName;                              // 0x011C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseDefaultShallowWaterSubsystem;                   // 0x0128(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxActivePawnNum;                                  // 0x012C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxImpulseForceNum;                                // 0x0130(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UShallowWaterPhysicsAssetOverridesDataAsset> PhysicsAssetProxiesDataAsset;                      // 0x0138(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisualizeActivePawn;                              // 0x0168(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ShallowWaterSettings">();
	}
	static class UShallowWaterSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShallowWaterSettings>();
	}
};

// Class WaterAdvanced.ShallowWaterSubsystem
// 0x01D8 (0x0220 - 0x0048)
class UShallowWaterSubsystem : public UTickableWorldSubsystem
{
public:
	class UNiagaraComponent*                      ShallowWaterNiagaraSimulation;                     // 0x0048(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextureRenderTarget2DArray*            WaterInfoTexture;                                  // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextureRenderTarget2D*                 NormalRT;                                          // 0x0058(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UShallowWaterSettings*                  Settings;                                          // 0x0060(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialParameterCollection*           MPC;                                               // 0x0068(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class APawn>>           ActivePawns;                                       // 0x0070(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_80[0x58];                                      // 0x0080(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<TWeakObjectPtr<class UWaterBodyComponent>> WaterBodyComponentsWithProperMIDParameters;        // 0x00D8(0x0050)(ExportObject, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AWaterBody>>      PendingWaterBodiesToSetMIDOnInitialize;            // 0x0128(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FShallowWaterCollisionContext>  PreviousContexts;                                  // 0x0138(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FShallowWaterCollisionContext>  PendingContexts;                                   // 0x0148(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<struct FShallowWaterCollisionContext, class USkeletalMeshComponent*> VehicleCollisionProxies;                           // 0x0158(0x0050)(ExportObject, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FShallowWaterCollisionTracker_Actor> Tracker_Actors;                                    // 0x01B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FShallowWaterCollisionTracker_Direct> Tracker_Directs;                                   // 0x01C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D0[0x50];                                     // 0x01D0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddCollisionTrackerForActor(class AActor* CollisionTrackerActor, float MaxLifespan);
	TSet<class AWaterBody*> GetAllOverlappingWaterBodiesAndUpdateCollisionTrackers();
	void OnLocalPlayerControllerBecomesValid(class APlayerController* InPlayerController);
	void OnLocalPlayerPawnBecomesValid(class APawn* OldPawn, class APawn* NewPawn);
	void OnWaterInfoTextureArrayCreated(const class UTextureRenderTarget2DArray* WaterInfoTexture_0);
	void RegisterImpact(const struct FVector& ImpactPosition, const struct FVector& ImpactVelocity, float ImpactRadius);
	void RemoveCollisionTrackerForActor(class AActor* CollisionTrackerActor);
	void SetWaterBodyMIDParameters(class AWaterBody* WaterBody);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ShallowWaterSubsystem">();
	}
	static class UShallowWaterSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShallowWaterSubsystem>();
	}
};

}

