#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaterEditor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UnrealEd_classes.hpp"
#include "WaterEditor_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "LandscapeEditorUtilities_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "EditorSubsystem_classes.hpp"
#include "ComponentVisualizers_classes.hpp"
#include "DetailCustomizations_classes.hpp"


namespace SDK
{

// Class WaterEditor.AssetDefinition_WaterWaves
// 0x0000 (0x0048 - 0x0048)
class UAssetDefinition_WaterWaves final : public UAssetDefinitionDefault
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDefinition_WaterWaves">();
	}
	static class UAssetDefinition_WaterWaves* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDefinition_WaterWaves>();
	}
};

// Class WaterEditor.CausticsGeneratorActor
// 0x0010 (0x0430 - 0x0420)
class ACausticsGeneratorActor final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EditorTickIsEnabled;                               // 0x0428(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EditorTick(float DeltaSeconds);
	void SetEditorTickEnabled(bool bEnabled);
	void SpawnCausticParticleGrid(class UHierarchicalInstancedStaticMeshComponent* HISMC, float GridSize, int32 GridTiles);
	void SpawnWaterPreviewGrid(class UHierarchicalInstancedStaticMeshComponent* HISMC, float GridSize, int32 GridTiles);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CausticsGeneratorActor">();
	}
	static class ACausticsGeneratorActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACausticsGeneratorActor>();
	}
};

// Class WaterEditor.JumpFloodComponent2D
// 0x0058 (0x0130 - 0x00D8)
class UJumpFloodComponent2D final : public UActorComponent
{
public:
	class UMaterialInterface*                     JumpStepMaterial;                                  // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     FindEdgesMaterial;                                 // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     BlurEdgesMaterial;                                 // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseBlur;                                           // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BlurPasses;                                        // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 RTA;                                               // 0x00F8(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 RTB;                                               // 0x0100(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               JumpStepMID;                                       // 0x0108(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               FindEdgesMID;                                      // 0x0110(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               BlurEdgesMID;                                      // 0x0118(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         RequiredPasses;                                    // 0x0120(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CompletedPasses;                                   // 0x0124(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CompletedBlurPasses;                               // 0x0128(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AssignRenderTargets(class UTextureRenderTarget2D* InRTA, class UTextureRenderTarget2D* InRTB);
	bool CreateMIDs();
	class UTextureRenderTarget2D* FindEdges(class UTextureRenderTarget2D* SeedRT, float CaptureZ, const struct FLinearColor& Curl, bool UseDepth, float ZxLocationT);
	void FindEdges_Debug(class UTextureRenderTarget2D* SeedRT, float CaptureZ, const struct FLinearColor& Curl, class UTextureRenderTarget2D* DestRT, float ZOffset);
	void JumpFlood(class UTextureRenderTarget2D* SeedRT, float SceneCaptureZ, const struct FLinearColor& Curl, bool UseDepth, float ZxLocationT);
	class UTextureRenderTarget2D* SingleBlurStep();
	class UTextureRenderTarget2D* SingleJumpStep();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JumpFloodComponent2D">();
	}
	static class UJumpFloodComponent2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJumpFloodComponent2D>();
	}
};

// Class WaterEditor.WaterBodyActorFactory
// 0x0000 (0x0090 - 0x0090)
class UWaterBodyActorFactory : public UActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyActorFactory">();
	}
	static class UWaterBodyActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterBodyActorFactory>();
	}
};

// Class WaterEditor.WaterBodyRiverActorFactory
// 0x0000 (0x0090 - 0x0090)
class UWaterBodyRiverActorFactory final : public UWaterBodyActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyRiverActorFactory">();
	}
	static class UWaterBodyRiverActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterBodyRiverActorFactory>();
	}
};

// Class WaterEditor.WaterBodyOceanActorFactory
// 0x0000 (0x0090 - 0x0090)
class UWaterBodyOceanActorFactory final : public UWaterBodyActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyOceanActorFactory">();
	}
	static class UWaterBodyOceanActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterBodyOceanActorFactory>();
	}
};

// Class WaterEditor.WaterBodyLakeActorFactory
// 0x0000 (0x0090 - 0x0090)
class UWaterBodyLakeActorFactory final : public UWaterBodyActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyLakeActorFactory">();
	}
	static class UWaterBodyLakeActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterBodyLakeActorFactory>();
	}
};

// Class WaterEditor.WaterBodyCustomActorFactory
// 0x0000 (0x0090 - 0x0090)
class UWaterBodyCustomActorFactory final : public UWaterBodyActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyCustomActorFactory">();
	}
	static class UWaterBodyCustomActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterBodyCustomActorFactory>();
	}
};

// Class WaterEditor.WaterBodyBrushCacheContainerThumbnailRenderer
// 0x0000 (0x0030 - 0x0030)
class UWaterBodyBrushCacheContainerThumbnailRenderer final : public UTextureThumbnailRenderer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyBrushCacheContainerThumbnailRenderer">();
	}
	static class UWaterBodyBrushCacheContainerThumbnailRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterBodyBrushCacheContainerThumbnailRenderer>();
	}
};

// Class WaterEditor.WaterBodyIslandActorFactory
// 0x0000 (0x0090 - 0x0090)
class UWaterBodyIslandActorFactory final : public UActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyIslandActorFactory">();
	}
	static class UWaterBodyIslandActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterBodyIslandActorFactory>();
	}
};

// Class WaterEditor.WaterBodyBrushCacheContainer
// 0x0010 (0x0040 - 0x0030)
class UWaterBodyBrushCacheContainer final : public UObject
{
public:
	struct FWaterBodyBrushCache                   Cache;                                             // 0x0030(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyBrushCacheContainer">();
	}
	static class UWaterBodyBrushCacheContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterBodyBrushCacheContainer>();
	}
};

// Class WaterEditor.WaterLandscapeBrush
// 0x00A8 (0x04F8 - 0x0450)
class AWaterLandscapeBrush : public ALandscapeBlueprintBrush
{
public:
	class UBillboardComponent*                    ActorIcon;                                         // 0x0450(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_458[0x50];                                     // 0x0458(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<TSoftObjectPtr<class AActor>, class UObject*> Cache;                                             // 0x04A8(0x0050)(Edit, Transient, EditConst, DuplicateTransient, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void BlueprintGetRenderTargets(class UTextureRenderTarget2D* InHeightRenderTarget, class UTextureRenderTarget2D** OutVelocityRenderTarget);
	void BlueprintOnRenderTargetTexturesUpdated(class UTexture2D* VelocityTexture);
	void BlueprintWaterBodiesChanged();
	void BlueprintWaterBodyChanged(class AActor* Actor);
	void ClearActorCache(class AActor* InActor);
	void ClearWaterBodyCache(class AWaterBody* WaterBody);
	void ForceWaterTextureUpdate();
	void SetActorCache(class AActor* InActor, class UObject* InCache);
	void SetWaterBodyCache(class AWaterBody* WaterBody, class UObject* InCache);

	class UObject* GetActorCache(class AActor* InActor, TSubclassOf<class UObject> CacheClass) const;
	void GetActorsAffectingLandscape(TArray<TScriptInterface<class IWaterBrushActorInterface>>* OutWaterBrushActors) const;
	void GetWaterBodies(TSubclassOf<class AWaterBody> WaterBodyClass, TArray<class AWaterBody*>* OutWaterBodies) const;
	class UObject* GetWaterBodyCache(class AWaterBody* WaterBody, TSubclassOf<class UObject> CacheClass) const;
	void GetWaterBodyIslands(TSubclassOf<class AWaterBodyIsland> WaterBodyIslandClass, TArray<class AWaterBodyIsland*>* OutWaterBodyIslands) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterLandscapeBrush">();
	}
	static class AWaterLandscapeBrush* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWaterLandscapeBrush>();
	}
};

// Class WaterEditor.WaterBrushManager
// 0x0248 (0x0740 - 0x04F8)
class AWaterBrushManager final : public AWaterLandscapeBrush
{
public:
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x04F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJumpFloodComponent2D*                  JumpFloodComponent2D;                              // 0x0500(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 HeightmapRTA;                                      // 0x0508(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 HeightmapRTB;                                      // 0x0510(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 JumpFloodRTA;                                      // 0x0518(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 JumpFloodRTB;                                      // 0x0520(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 DepthAndShapeRT;                                   // 0x0528(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 WaterDepthAndVelocityRT;                           // 0x0530(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 CombinedVelocityAndHeightRTA;                      // 0x0538(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 CombinedVelocityAndHeightRTB;                      // 0x0540(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 LandscapeRTRef;                                    // 0x0548(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 WeightmapRTA;                                      // 0x0550(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 WeightmapRTB;                                      // 0x0558(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     BrushAngleFalloffMaterial;                         // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     BrushWidthFalloffMaterial;                         // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     DistanceFieldCacheMaterial;                        // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     RenderRiverSplineDepthMaterial;                    // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     DebugDistanceFieldMaterial;                        // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     WeightmapMaterial;                                 // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     DrawCanvasMaterial;                                // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     CompositeWaterBodyTextureMaterial;                 // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     IslandFalloffMaterial;                             // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     JumpStepMaterial;                                  // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     FindEdgesMaterial;                                 // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     BlurEdgesMaterial;                                 // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               BrushAngleFalloffMID;                              // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               BrushWidthFalloffMID;                              // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               DistanceFieldCacheMID;                             // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInstanceDynamic*>       RiverSplineMIDs;                                   // 0x05D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               DebugDistanceFieldMID;                             // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               WeightmapMID;                                      // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               DrawCanvasMID;                                     // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               CompositeWaterBodyTextureMID;                      // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               IslandFalloffMID;                                  // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UCurveFloat*, struct FWaterBodyBrushCache> BrushCurveRTCache;                                 // 0x0610(0x0050)(Edit, BlueprintVisible, Transient, EditConst, NativeAccessSpecifierPublic)
	struct FVector                                WorldSize;                                         // 0x0660(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              LandscapeRTRes;                                    // 0x0678(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              LandscapeQuads;                                    // 0x0680(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_688[0x8];                                      // 0x0688(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LandscapeTransform;                                // 0x0690(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShowGradient;                                      // 0x06F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6F1[0x3];                                      // 0x06F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceDivisor;                                   // 0x06F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShowDistance;                                      // 0x06F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShowGrid;                                          // 0x06F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6FA[0x2];                                      // 0x06FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CanvasSegmentSize;                                 // 0x06FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaterClearHeight;                                  // 0x0700(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SplineMeshExtension;                               // 0x0704(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseDynamicPreviewRT;                               // 0x0708(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisableBrushTextureEffects;                        // 0x0709(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedsForceUpdate;                                 // 0x070A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_70B[0x5];                                      // 0x070B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     FinalizeVelocityHeightMaterial;                    // 0x0710(0x0008)(ZeroConstructor, Deprecated, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               FinalizeVelocityHeightMID;                         // 0x0718(0x0008)(ZeroConstructor, Deprecated, EditorOnly, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_720[0x20];                                     // 0x0720(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FindEdges();
	void ForceUpdate();
	void GetWaterCacheKey(class AActor* WaterBrush, class UWaterBodyBrushCacheContainer** ContainerObject, struct FWaterBodyBrushCache* Value);
	void SetupDefaultMaterials();
	void SingleBlurStep();
	void SingleJumpStep();

	void SortWaterBodiesForBrushRender(TArray<class AWaterBody*>* InOutWaterBodies) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBrushManager">();
	}
	static class AWaterBrushManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWaterBrushManager>();
	}
};

// Class WaterEditor.WaterBrushManagerFactory
// 0x0000 (0x0090 - 0x0090)
class UWaterBrushManagerFactory final : public UActorFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBrushManagerFactory">();
	}
	static class UWaterBrushManagerFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterBrushManagerFactory>();
	}
};

// Class WaterEditor.WaterEditorSettings
// 0x0B28 (0x0B88 - 0x0060)
class UWaterEditorSettings final : public UDeveloperSettings
{
public:
	ETextureGroup                                 TextureGroupForGeneratedTextures;                  // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxWaterVelocityAndHeightTextureSize;              // 0x0064(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VisualizeWaterVelocityScale;                       // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialParameterCollection> LandscapeMaterialParameterCollection;              // 0x0070(0x0030)(Edit, Config, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWaterZoneActorDefaults                WaterZoneActorDefaults;                            // 0x00A0(0x0040)(Edit, Config, NativeAccessSpecifierPublic)
	struct FWaterBodyRiverDefaults                WaterBodyRiverDefaults;                            // 0x00E0(0x0248)(Edit, Config, NativeAccessSpecifierPublic)
	struct FWaterBodyLakeDefaults                 WaterBodyLakeDefaults;                             // 0x0328(0x01F0)(Edit, Config, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FWaterBodyOceanDefaults                WaterBodyOceanDefaults;                            // 0x0518(0x01F0)(Edit, Config, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FWaterBodyCustomDefaults               WaterBodyCustomDefaults;                           // 0x0708(0x0100)(Edit, Config, NativeAccessSpecifierPublic)
	struct FWaterBodyIslandDefaults               WaterBodyIslandDefaults;                           // 0x0808(0x0118)(Edit, Config, NativeAccessSpecifierPublic)
	bool                                          bUpdateLandscapeDuringInteractiveChanges;          // 0x0920(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUpdateWaterMeshDuringInteractiveChanges;          // 0x0921(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_922[0x6];                                      // 0x0922(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         WaterZoneClassPath;                                // 0x0928(0x0028)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSoftClassPath                         WaterManagerClassPath;                             // 0x0950(0x0028)(Edit, ZeroConstructor, Config, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>      DefaultBrushAngleFalloffMaterial;                  // 0x0978(0x0030)(Edit, Config, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>      DefaultBrushIslandFalloffMaterial;                 // 0x09A8(0x0030)(Edit, Config, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>      DefaultBrushWidthFalloffMaterial;                  // 0x09D8(0x0030)(Edit, Config, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>      DefaultBrushWeightmapMaterial;                     // 0x0A08(0x0030)(Edit, Config, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>      DefaultCacheDistanceFieldCacheMaterial;            // 0x0A38(0x0030)(Edit, Config, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>      DefaultCompositeWaterBodyTextureMaterial;          // 0x0A68(0x0030)(Edit, Config, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>      DefaultJumpFloodStepMaterial;                      // 0x0A98(0x0030)(Edit, Config, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>      DefaultBlurEdgesMaterial;                          // 0x0AC8(0x0030)(Edit, Config, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>      DefaultFindEdgesMaterial;                          // 0x0AF8(0x0030)(Edit, Config, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>      DefaultDrawCanvasMaterial;                         // 0x0B28(0x0030)(Edit, Config, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>      DefaultRenderRiverSplineDepthsMaterial;            // 0x0B58(0x0030)(Edit, Config, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterEditorSettings">();
	}
	static class UWaterEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterEditorSettings>();
	}
};

// Class WaterEditor.WaterEditorSubsystem
// 0x00C8 (0x0100 - 0x0038)
class UWaterEditorSubsystem final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialParameterCollection*           LandscapeMaterialParameterCollection;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class UObject>, class UTexture2D*> WaterActorSprites;                                 // 0x0048(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	class UTexture2D*                             DefaultWaterActorSprite;                           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture2D*                             ErrorSprite;                                       // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x58];                                      // 0x00A8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterEditorSubsystem">();
	}
	static class UWaterEditorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterEditorSubsystem>();
	}
};

// Class WaterEditor.WaterSplineComponentVisualizerSelectionState
// 0x0010 (0x0100 - 0x00F0)
class UWaterSplineComponentVisualizerSelectionState final : public USplineComponentVisualizerSelectionState
{
public:
	bool                                          bWaterVelocityIsSelected;                          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDepthIsSelected;                                  // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRiverWidthIsSelected;                             // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRiverWidthSelectedPosHandle;                      // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F4[0xC];                                       // 0x00F4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterSplineComponentVisualizerSelectionState">();
	}
	static class UWaterSplineComponentVisualizerSelectionState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterSplineComponentVisualizerSelectionState>();
	}
};

// Class WaterEditor.WaterSplineMetadataDetailsFactory
// 0x0000 (0x0030 - 0x0030)
class UWaterSplineMetadataDetailsFactory final : public USplineMetadataDetailsFactoryBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterSplineMetadataDetailsFactory">();
	}
	static class UWaterSplineMetadataDetailsFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterSplineMetadataDetailsFactory>();
	}
};

// Class WaterEditor.WaterWavesAssetFactory
// 0x0000 (0x0088 - 0x0088)
class UWaterWavesAssetFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
