#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaveformTransformations

#include "Basic.hpp"

#include "AudioExtensions_classes.hpp"
#include "WaveformTransformations_structs.hpp"


namespace SDK
{

// Class WaveformTransformations.WaveformTransformationEffectChain
// 0x0018 (0x0048 - 0x0030)
class UWaveformTransformationEffectChain final : public UWaveformTransformationBase
{
public:
	class USoundEffectSourcePresetChain*          EffectChain;                                       // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class USoundEffectSourcePreset*>       InlineEffects;                                     // 0x0038(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaveformTransformationEffectChain">();
	}
	static class UWaveformTransformationEffectChain* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaveformTransformationEffectChain>();
	}
};

// Class WaveformTransformations.WaveformTransformationNormalize
// 0x0010 (0x0040 - 0x0030)
class UWaveformTransformationNormalize final : public UWaveformTransformationBase
{
public:
	float                                         Target;                                            // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxGain;                                           // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENormalizationMode                            Mode;                                              // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaveformTransformationNormalize">();
	}
	static class UWaveformTransformationNormalize* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaveformTransformationNormalize>();
	}
};

// Class WaveformTransformations.WaveformTransformationTrimFade
// 0x0028 (0x0058 - 0x0030)
class UWaveformTransformationTrimFade final : public UWaveformTransformationBase
{
public:
	double                                        StartTime;                                         // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        EndTime;                                           // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartFadeTime;                                     // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartFadeCurve;                                    // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndFadeTime;                                       // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndFadeCurve;                                      // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaveformTransformationTrimFade">();
	}
	static class UWaveformTransformationTrimFade* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaveformTransformationTrimFade>();
	}
};

}

