#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Dialog_Base

#include "Basic.hpp"

#include "S_UI_SizeBox_structs.hpp"
#include "S_UI_Placement_structs.hpp"
#include "Engine_structs.hpp"
#include "S_UI_Backplate_structs.hpp"
#include "S_UI_DialogButtons_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_UI_DialogTextType_structs.hpp"
#include "S_UI_Image_structs.hpp"
#include "S_UI_Text_structs.hpp"
#include "SlateCore_structs.hpp"
#include "S_UI_BackplateCornerRadiusValues_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Dialog_Base.WBP_UIKit_Dialog_Base_C
// 0x05A0 (0x09B8 - 0x0418)
class UWBP_UIKit_Dialog_Base_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIKitDialogViewModel*                  UIKitDialogViewModel;                              // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_OnDeactivate_Base;                            // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_OnActivate_Base;                              // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         ButtonsContainer;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Content;                                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Main;                                              // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CaptureForPostBufferUpdate_C*      PostBufferUpdate_Content;                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Root;                                              // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Text;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Dialog;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Background;                                   // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Content;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Main;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Root;                                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TitleContainer;                                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_UIKit_ButtonCTA_Base_C*>    ButtonWidgets;                                     // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UCommonButtonGroupBase*                 ButtonGroup;                                       // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 ButtonIndex)> DialogButtonClickedDispatcher;                     // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UDataTable*                             DefaultInputActionDataTable;                       // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Scrim_C*                     Scrim;                                             // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          UseScrim;                                          // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Blur;                                              // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DimColor;                                          // 0x04E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      DimMaterial;                                       // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UseClickCatch;                                     // 0x04F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseTitle;                                          // 0x04F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FA[0x6];                                      // 0x04FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       ContentTitle;                                      // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       ContentText;                                       // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   ContentRichText;                                   // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_UI_DialogTextType                           UseText;                                           // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseTitleImage;                                     // 0x0519(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51A[0x6];                                      // 0x051A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_UI_Text                             TitleProperties;                                   // 0x0520(0x00D8)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_UI_Text                             TextProperties;                                    // 0x05F8(0x00D8)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UImage*                                 ContentImage;                                      // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          UseImage;                                          // 0x06D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_UI_Image                            ImageProperties;                                   // 0x06E0(0x0058)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ContentBackground;                                 // 0x0738(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          UseBackplate;                                      // 0x0740(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_741[0x7];                                      // 0x0741(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_UI_Backplate                        BackplateProperties;                               // 0x0748(0x0050)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseBackground;                                     // 0x0798(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_799[0x7];                                      // 0x0799(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_UI_Image                            BackgroundProperties;                              // 0x07A0(0x0058)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_SizeBox                          DialogSIze;                                        // 0x07F8(0x0080)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_DialogButtons                    Buttons;                                           // 0x0878(0x0070)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_UI_Placement                        DialogPlacement;                                   // 0x08E8(0x0040)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Backplate_Base_C*            ContentBackplate;                                  // 0x0928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ImageMID;                                          // 0x0930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_BackplateCornerRadiusValues      CornerRadiusValues;                                // 0x0938(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ContentTitleImage;                                 // 0x0960(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          TitleImageHorizontalAligment;                      // 0x0968(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            TitleImageVerticalAligment;                        // 0x0969(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96A[0x6];                                      // 0x096A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TitleImageSizeX;                                   // 0x0970(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TitleImageSizeY;                                   // 0x0978(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          TitleTextHorizontalAligment;                       // 0x0980(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            TitleTextVerticalAligment;                         // 0x0981(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_982[0x2];                                      // 0x0982(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                TitleImagePadding;                                 // 0x0984(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                TitleTextPadding;                                  // 0x0994(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateChildSize                        TitleTextSizeRule;                                 // 0x09A4(0x0008)(Edit, BlueprintVisible, NoDestructor)
	struct FSlateChildSize                        TitleImageSizeRule;                                // 0x09AC(0x0008)(Edit, BlueprintVisible, NoDestructor)

public:
	void ActivateDialog(class UWidgetAnimation* IntroAnimation);
	void AddBackground();
	void AddBackplate();
	void AddDialogButtons(TArray<class UUIKitDialogButtonViewModel*>& Action_Buttons);
	void AddImage();
	void AddScrim();
	void AddText();
	void AddTitle();
	void Cleanup(class UWidget* Widget);
	void ClearButtonWidgets();
	void DeactivateDialog(class UWidgetAnimation* OutroAnimation);
	void ExecuteUbergraph_WBP_UIKit_Dialog_Base(int32 EntryPoint);
	void InitializeDialog();
	void OnDialogButtonClicked(class UCommonButtonBase* AssociatedButton, int32 ButtonIndex);
	void PreConstruct(bool IsDesignTime);
	void PresetForDesignTime();
	void SetBackgroundProperties(const struct FS_UI_Image& Data);
	void SetBackplateProperties(const struct FS_UI_Backplate& Data);
	void SetButton(class UWBP_UIKit_ButtonCTA_Base_C*& Button, class UUIKitDialogButtonViewModel* Button_Data);
	void SetButtonFocus(int32& Focus_Index);
	void SetButtonsProperties(const struct FS_UI_DialogButtons& Data);
	void SetDialogData(class UUIKitDialogViewModel* Data);
	void SetDialogImage(class UTexture2D* Texture);
	void SetDialogText(const class FText& Text);
	void SetDialogTitle(const class FText& Title);
	void SetDialogTitleImage(class UMaterialInstance* MaterialInstance);
	void SetGridAlignment(class UWidget* WIdget, EHorizontalAlignment Horizontal, EVerticalAlignment Vertical);
	void SetGridColumnAndRow(class UWidget* WIdget, int32 Row, int32 Row_Span, int32 Column, int32 Column_Span);
	void SetGridLayer(class UWidget* WIdget, int32 Layer);
	void SetGridNudge(class UWidget* WIdget, const struct FVector2D& Nudge);
	void SetGridPadding(class UWidget* WIdget, const struct FMargin& Padding_0);
	void SetImageProperties(const struct FS_UI_Image& Data);
	void SetPlacement(class UWidget* Widget, const struct FS_UI_Placement& Placement);
	void SetScrim(float Blur_Strength, const struct FLinearColor& Color, class UMaterialInstance* Material_Instance, bool Enable);
	void SetSizeBox(const struct FS_UI_SizeBox& Data);
	void SetTextProperties(const struct FS_UI_Text& Data);
	void SetTitleImageProperties(class UImage* Image);
	void SetTitleProperties(const struct FS_UI_Text& Data);
	void SetTitleTextProperties(class UWidget* Widget);
	void SetUIKitDialogViewModel(class UUIKitDialogViewModel* Viewmodel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Dialog_Base_C">();
	}
	static class UWBP_UIKit_Dialog_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Dialog_Base_C>();
	}
};

}

