#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Button_TopNavBar

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "WBP_UIKit_ButtonGeneric_Base_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Button_TopNavBar.WBP_UIKit_Button_TopNavBar_C
// 0x0050 (0x1C30 - 0x1BE0)
class UWBP_UIKit_Button_TopNavBar_C final : public UWBP_UIKit_ButtonGeneric_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_Button_TopNavBar_C;       // 0x1BE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortTabViewModel*                      FortTabViewModel;                                  // 0x1BE8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInstance*                      TextMaterial;                                      // 0x1BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      TextOutlineMaterial;                               // 0x1BF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      MobileTextMaterial;                                // 0x1C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      MobileTextOutlineMaterial;                         // 0x1C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMobile;                                          // 0x1C10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C11[0x7];                                     // 0x1C11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             IconVBuck;                                         // 0x1C18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Block_Text_C*                Block_Text_Secondary;                              // 0x1C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void BP_OnWidgetStyled();
	void Construct();
	void ExecuteUbergraph_WBP_UIKit_Button_TopNavBar(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetBangType(EFortBangType EBangType);
	void SetData(class UUIKitSelectableButtonViewModel* VM_Button);
	void SetFontStyle();
	void SetFortTabViewModel(class UFortTabViewModel* Viewmodel);
	void SetIcon(class UObject* Icon_0);
	void SetText(const class FText& Text_0);
	void SetTextLayout();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Button_TopNavBar_C">();
	}
	static class UWBP_UIKit_Button_TopNavBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Button_TopNavBar_C>();
	}
};

}

