#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Button_Regular

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_UI_CTAButtonType_structs.hpp"
#include "WBP_UIKit_ButtonCTA_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Button_Regular.WBP_UIKit_Button_Regular_C
// 0x0050 (0x1D60 - 0x1D10)
class UWBP_UIKit_Button_Regular_C final : public UWBP_UIKit_ButtonCTA_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_Button_Regular_C;         // 0x1D08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	E_UI_CTAButtonType                            ButtonType;                                        // 0x1D10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D11[0x7];                                     // 0x1D11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      RegularFontMaterial;                               // 0x1D18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      RegularSecondaryFontMaterial;                      // 0x1D20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      RegularBackgroundMaterial;                         // 0x1D28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      RegularOutlineMaterial;                            // 0x1D30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      QuietFontMaterial;                                 // 0x1D38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      QuietSecondaryFontMaterial;                        // 0x1D40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      QuietBackgroundMaterial;                           // 0x1D48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      QuietOutlineMaterial;                              // 0x1D50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_UIKit_Button_Quiet_InputActionWidget_K2Node_ComponentBoundEvent_0_OnInputIconUpdated__DelegateSignature();
	void BP_OnWidgetStyled();
	void ExecuteUbergraph_WBP_UIKit_Button_Regular(int32 EntryPoint);
	void OverrideFontMaterials(class UMaterialInstance* PrimaryFontMaterial, class UMaterialInstance* SecondaryFontMaterial);
	void PreConstruct(bool IsDesignTime);
	void SetButtonType(E_UI_CTAButtonType ButtonType_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Button_Regular_C">();
	}
	static class UWBP_UIKit_Button_Regular_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Button_Regular_C>();
	}
};

}

