#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_ButtonGeneric_Base

#include "Basic.hpp"

#include "E_UI_StatusIndicator_Configuration_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_UI_Alignment_structs.hpp"
#include "CommonInput_structs.hpp"
#include "E_UI_StatusIndicator_Size_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_UI_StatusIndicator_Type_structs.hpp"
#include "Slate_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_ButtonGeneric_Base.WBP_UIKit_ButtonGeneric_Base_C
// 0x03C0 (0x1BE0 - 0x1820)
class UWBP_UIKit_ButtonGeneric_Base_C : public UUIKitModularButton
{
public:
	uint8                                         Pad_1818[0x8];                                     // 0x1818(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1820(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Focused_Base;                                 // 0x1828(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 HoldIcon;                                          // 0x1830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoldProgressBar;                                   // 0x1838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Main;                                              // 0x1840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStackBox*                              Main_Stack;                                        // 0x1848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Main_StackSize;                                    // 0x1850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Prompt;                                            // 0x1858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Root;                                              // 0x1860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Background;                                   // 0x1868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Main;                                         // 0x1870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisualAttachment*                VisualAttachment;                                  // 0x1878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EHorizontalAlignment                          ContentHorizontalAlignment;                        // 0x1880(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            ContentVerticalAlignment;                          // 0x1881(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1882[0x2];                                     // 0x1882(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                ButtonPadding;                                     // 0x1884(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1894[0x4];                                     // 0x1894(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FadeInTime;                                        // 0x1898(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeOutTime;                                       // 0x18A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             PressedSound;                                      // 0x18A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoveredSound;                                      // 0x18B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldPressedSound;                                  // 0x18B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldSound;                                         // 0x18C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldReleasedSound;                                 // 0x18C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldCompletedSound;                                // 0x18D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        HoldSoundAudioComponent;                           // 0x18D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        PressedSoundAudioComponent;                        // 0x18E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x18E8(0x0010)(Edit, BlueprintVisible)
	bool                                          UseIconBlock;                                      // 0x18F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18F9[0x7];                                     // 0x18F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 IconClass;                                         // 0x1900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      IconMaterial;                                      // 0x1908(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x1910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              IconSize;                                          // 0x1918(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          IconHorizontalAlignment;                           // 0x1928(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            IconVerticalAlignment;                             // 0x1929(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192A[0x2];                                     // 0x192A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                IconPadding;                                       // 0x192C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseBackgroundBlock;                                // 0x193C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_193D[0x3];                                     // 0x193D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 BackgroundClass;                                   // 0x1940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      BackgroundMaterial;                                // 0x1948(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      OutlineMaterial;                                   // 0x1950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          PromptHorizontalAlignment;                         // 0x1958(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            PromptVerticalAlignment;                           // 0x1959(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldPromptImpactLayout;                          // 0x195A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_195B[0x1];                                     // 0x195B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                PromptPadding;                                     // 0x195C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_196C[0x4];                                     // 0x196C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              PromptNudge;                                       // 0x1970(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MobileFontSizeMultiplier;                          // 0x1980(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideDefaultMobileFontSizeMultiplier;           // 0x1988(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1989[0x7];                                     // 0x1989(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MobileFontSizeMultiplierOverride;                  // 0x1990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MobileMinWidth;                                    // 0x1998(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MobileMinHeight;                                   // 0x199C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnHoldCompleted;                                   // 0x19A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UMaterialInstanceDynamic*               InputActionProgressMaterial;                       // 0x19B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_BlockBackground_Base_C*      Block_Background;                                  // 0x19B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Block_Text_C*                Block_Text;                                        // 0x19C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Block_Text_C*                Block_SecondText;                                  // 0x19C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Block_Image_C*               Block_Icon;                                        // 0x19D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_StatusIndicator_C*           StatusIndicator;                                   // 0x19D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CurrentInputType;                                  // 0x19E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19E1[0x7];                                     // 0x19E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentHoldProgress;                               // 0x19E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseTextBlock;                                      // 0x19F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19F1[0x7];                                     // 0x19F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 TextClass;                                         // 0x19F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         Font;                                              // 0x1A00(0x0070)(Edit, BlueprintVisible, HasGetValueTypeHash)
	E_UI_Alignment                                TextBlockAlignment;                                // 0x1A70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTextOutsideBackground;                           // 0x1A71(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldTextImpactLayout;                            // 0x1A72(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextTransformPolicy                          TextTransformPolicy;                               // 0x1A73(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                TextPadding;                                       // 0x1A74(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A84[0x4];                                     // 0x1A84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              TextNudge;                                         // 0x1A88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                MobileButtonPadding;                               // 0x1A98(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsInstantSelection;                                // 0x1AA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LastEnabledEvent;                                  // 0x1AA9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AAA[0x6];                                     // 0x1AAA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(double HoldPercentage)> OnHoldActionProgress;                              // 0x1AB0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWBP_UIKit_ButtonGeneric_Base_C* Button)> OnReleased;                                        // 0x1AC0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          EnableFocusedSelectedState;                        // 0x1AD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD1[0x7];                                     // 0x1AD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              VisualAttachmentContentAnchor;                     // 0x1AD8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseStatusIndicator;                                // 0x1AE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AE9[0x7];                                     // 0x1AE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 StatusIndicatorClass;                              // 0x1AF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_UI_StatusIndicator_Configuration            Configuration;                                     // 0x1AF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_StatusIndicator_Type                     Type;                                              // 0x1AF9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          StatusIndicatorHorizontalAlignment;                // 0x1AFA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            StatusIndicatorVerticalAlignment;                  // 0x1AFB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                StatusIndicatorPadding;                            // 0x1AFC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B0C[0x4];                                     // 0x1B0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              StatusIndicatorNudge;                              // 0x1B10(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseSecondTextBlock;                                // 0x1B20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B21[0x7];                                     // 0x1B21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 SecondTextClass;                                   // 0x1B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   SecondText;                                        // 0x1B30(0x0010)(Edit, BlueprintVisible)
	struct FSlateFontInfo                         SecondFont;                                        // 0x1B40(0x0070)(Edit, BlueprintVisible, HasGetValueTypeHash)
	E_UI_Alignment                                SecondTextBlockAlignment;                          // 0x1BB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextTransformPolicy                          SecondTextTransformPolicy;                         // 0x1BB1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BB2[0x2];                                     // 0x1BB2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                SecondTextPadding;                                 // 0x1BB4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ETextJustify                                  TextJustification;                                 // 0x1BC4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  TextSecondJustification;                           // 0x1BC5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          VisualAttachmentHorizontalAlignment;               // 0x1BC6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            VisualAttachmentVerticalAlignment;                 // 0x1BC7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDisabledVisualsOnLocked;                        // 0x1BC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_StatusIndicator_Size                     Icon_Size;                                         // 0x1BC9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDarkInputIcon;                                  // 0x1BCA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BCB[0x5];                                     // 0x1BCB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnBlockTextSet;                                    // 0x1BD0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AddBackground();
	void AddIconBlock();
	void AddSecondTextBlock();
	void AddStatusIndicator();
	void AddTextBlock();
	void BndEvt__WBP_UIKit_ButtonGeneric_Base_InputActionWidget_K2Node_ComponentBoundEvent_0_OnInputIconUpdated__DelegateSignature();
	void BP_OnClicked();
	void BP_OnDeselected();
	void BP_OnDisabled();
	void BP_OnEnabled();
	void BP_OnHovered();
	void BP_OnInputActionTriggered();
	void BP_OnInputMethodChanged(ECommonInputType CurrentInputType_0);
	void BP_OnLockedChanged(bool bIsLocked);
	void BP_OnPressed();
	void BP_OnReleased();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void BP_OnWidgetStyled();
	void ClearPrompt();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_UIKit_ButtonGeneric_Base(int32 EntryPoint);
	void FadeOutSound();
	void GetBackgroundDynamicMaterial(class UMaterialInstanceDynamic** Dynamic_Material);
	void IsPromptHoldable(bool* Holdable);
	void IsPromptIcon(bool* Valid);
	void OnActionProgress(float HeldPercent);
	void PlaySoundHoldCompleted();
	void PlaySoundHoldPressed();
	void PlaySoundHoldReleased();
	void PlaySoundHovered();
	void PlaySoundPressed();
	void PreConstruct(bool IsDesignTime);
	void PresetForDesignTime();
	void RemoveIconBlock();
	void RequestInstantSelection();
	void ResetButtonState();
	void Set_Language_Direction();
	void SetBackgroundMaterials(class UMaterialInstance* Background_MI, class UMaterialInstance* Outline_MI);
	void SetBlocksIsSelected(bool IsSelected);
	void SetButtonContentAlignment(EHorizontalAlignment HorizontalAlignment, EVerticalAlignment VerticalAlignment);
	void SetButtonIsEnabled();
	void SetButtonMinSize(int32 Min_Width, int32 Min_Height);
	void SetButtonPadding(const struct FMargin& Padding_0);
	void SetData(class UUIKitSelectableButtonViewModel* VM_Button);
	void SetFont(const struct FSlateFontInfo& In_Font);
	void SetHoldPercentage(double HoldPercentage);
	void SetIcon(class UObject* Icon_0);
	void SetIconAlignment(EHorizontalAlignment Horizontal, EVerticalAlignment Vertical);
	void SetIconMaterial(class UMaterialInstance* Material_Instance);
	void SetIconPadding(const struct FMargin& Padding_0);
	void SetIconSize(const struct FVector2D& Icon_0);
	void SetIconTexture(class UTexture2D* Icon_0);
	void SetInputIconDarkMode(bool UseDark);
	void SetPreviewData(class UMVVMViewModelBase* VM);
	void SetPrompt();
	void SetStatusIndicator(EFortBangType BangType);
	void SetStatusIndicatorConfiguration(E_UI_StatusIndicator_Configuration Configuration_0, int32 Count);
	void SetStatusIndicatorType(E_UI_StatusIndicator_Type Type_0);
	void SetText(const class FText& Text_0);
	void SetTextNudge(const struct FVector2D& TextNudge_0);
	void SetTextPadding(const struct FMargin& TextPadding_0);
	void ShowPromptFallbackAction(bool Show);
	void UpdateBackground();
	void UpdateButton();
	void UpdateIcon();
	void UpdateInputPrompt();
	void UpdatePrompt(ECommonInputType InputType);
	void UpdateSecondText();
	void UpdateStatusIndicator();
	void UpdateText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_ButtonGeneric_Base_C">();
	}
	static class UWBP_UIKit_ButtonGeneric_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_ButtonGeneric_Base_C>();
	}
};

}

