#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponModStationUI

#include "Basic.hpp"

#include "BlueprintContext_classes.hpp"
#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonInput_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchContext
// 0x00C0 (0x00F8 - 0x0038)
class UAthenaWeaponModsWorkbenchContext final : public UBlueprintContextBase
{
public:
	uint8                                         Pad_38[0x20];                                      // 0x0038(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnWeaponModsWorkbenchRequestClose;                 // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x18];                                      // 0x0068(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UFortWeaponModItemDefinition* CurrentlySelectedMod)> OnWeaponModsWorkbenchSelectedModChanged;           // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x68];                                      // 0x0090(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RequestCloseUI();

	struct FGameplayTag GetCurrentModCategory() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchContext">();
	}
	static class UAthenaWeaponModsWorkbenchContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchContext>();
	}
};

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchWidgetBase
// 0x0000 (0x0440 - 0x0440)
class UAthenaWeaponModsWorkbenchWidgetBase : public UCommonUserWidget
{
public:
	void HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void OnWeaponModCategoryChanged(const struct FGameplayTag& ModTypeTag);
	void OnWorkbenchClosed();
	void OnWorkbenchOpened();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchWidgetBase">();
	}
	static class UAthenaWeaponModsWorkbenchWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchWidgetBase>();
	}
};

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchEquippedModDetails
// 0x0000 (0x0440 - 0x0440)
class UAthenaWeaponModsWorkbenchEquippedModDetails final : public UAthenaWeaponModsWorkbenchWidgetBase
{
public:
	void HandleCurrentlySelectedModChanged(class UFortWeaponModItemDefinition* NewSelectedMod);
	void HandleSetEquippedModInfo(const class UFortWeaponModItemDefinition* WeaponMod);
	void OnRemoveModClicked();
	void OnSetCurrentlySelectedModInfo(const class UFortWeaponModItemDefinition* ModItemDefinition, bool bIsSameCategory, bool bIsEquippedMod);
	void OnSetEquippedModInfo(const class UFortWeaponModItemDefinition* ModItemDefinition, bool bIsDefaultMod, bool bSlotHasDefaultMod, bool bCanRemoveMod);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchEquippedModDetails">();
	}
	static class UAthenaWeaponModsWorkbenchEquippedModDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchEquippedModDetails>();
	}
};

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchModal
// 0x0038 (0x05B0 - 0x0578)
class UAthenaWeaponModsWorkbenchModal final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           BlockedInputActions;                               // 0x0580(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FPrimaryContentSetup                   PrimaryContentSetup;                               // 0x0590(0x0003)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_593[0x5];                                      // 0x0593(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        WorkbenchModalInputComp;                           // 0x0598(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A0[0x10];                                     // 0x05A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCloseUI();
	void HandleModStationComponentForceStop(class AFortWeaponModStationBase* WeaponModStation);
	void HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void OnInputTypeChanged(const ECommonInputType NewInputType);
	void OnWeaponEquipped(bool bIsModdable, const class AFortWeapon* NewWeapon);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchModal">();
	}
	static class UAthenaWeaponModsWorkbenchModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchModal>();
	}
};

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchModListEntry
// 0x0010 (0x1810 - 0x1800)
class UAthenaWeaponModsWorkbenchModListEntry final : public UCommonButtonBase
{
public:
	uint8                                         Pad_1800[0x10];                                    // 0x1800(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnListItemSet(const class UFortItemDefinition* Item);
	void OnRefreshStatus();

	bool IsEquippableMod() const;
	bool IsEquippedMod() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchModListEntry">();
	}
	static class UAthenaWeaponModsWorkbenchModListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchModListEntry>();
	}
};

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchModSelection
// 0x0050 (0x0490 - 0x0440)
class UAthenaWeaponModsWorkbenchModSelection final : public UAthenaWeaponModsWorkbenchWidgetBase
{
public:
	class UFortWorldItemDefinition*               PurchasingCurrency;                                // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonListView*                        ListView_ModChoices;                               // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_458[0x8];                                      // 0x0458(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    PreviousListEntryInputAction;                      // 0x0460(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    NextListEntryInputAction;                          // 0x0478(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)

public:
	void GetSelectedModCostAndOwnedCurrency(int32* ModCost, int32* OwnedCurrency);
	void OnBuyAndEquipClicked();
	void OnExitUIClicked();
	void OnModPurchasedSuccessfully();
	void OnModPurchaseFailed();
	void OnModRemovedCallback();
	void OnRefreshMods(const TArray<class UFortWeaponModItemDefinition*>& WeaponModItemDefinitions);
	void OnRefreshModType(const struct FGameplayTag& ModCategoryTag);
	void OnRemoveModClicked();
	void OnSetSelectedModCostAndOwnedCurrency(int32 ModCost, int32 OwnedCurrency);
	void OnSetSelectedModInfo(const class UFortWeaponModItemDefinition* ModItemDef);
	void OnSetSelectedRemoveModCostAndOwnedCurrency(int32 ModCost, int32 OwnedCurrency);
	void RequestBuyAndEquip();
	void RequestRemoveMod();
	void SetCanRemoveMod(bool bCanRemoveMod);

	bool CanApplySelectedModToEquippedWeapon() const;
	bool CanRemoveSelectedModFromWeapon() const;
	bool DoesEquippedWeaponHaveDefaultModForSlot() const;
	void GetSelectedRemoveModCostAndOwnedCurrency(int32* RemoveModCost, int32* OwnedCurrency) const;
	bool IsSelectedModEquippedOnWeapon() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchModSelection">();
	}
	static class UAthenaWeaponModsWorkbenchModSelection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchModSelection>();
	}
};

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchModTypeButton
// 0x0020 (0x1820 - 0x1800)
class UAthenaWeaponModsWorkbenchModTypeButton final : public UCommonButtonBase
{
public:
	struct FGameplayTag                           ModTypeTag;                                        // 0x1800(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_180C[0x4];                                     // 0x180C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWeaponModItemDefinition*           DefaultModItemDef;                                 // 0x1810(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1818[0x8];                                     // 0x1818(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void OnWorkbenchClosed();
	void OnWorkbenchOpened();
	void SetEquippedOrDefaultMod(class UFortWeaponModItemDefinition* ItemDefinition, bool bIsAvailableCategory);

	struct FGameplayTag GetModTypeTag() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchModTypeButton">();
	}
	static class UAthenaWeaponModsWorkbenchModTypeButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchModTypeButton>();
	}
};

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchModTypeTabs
// 0x0038 (0x0478 - 0x0440)
class UAthenaWeaponModsWorkbenchModTypeTabs final : public UAthenaWeaponModsWorkbenchWidgetBase
{
public:
	uint8                                         Pad_440[0x8];                                      // 0x0440(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    PreviousTabInputAction;                            // 0x0448(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    NextTabInputAction;                                // 0x0460(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPrivate)

public:
	TArray<class UAthenaWeaponModsWorkbenchModTypeButton*> GetTabButtons();
	void OnModTypeTabClicked(const struct FGameplayTag& ModTypeTag);
	void RequestTabInDirection_BP(const int32 Direction);
	void SetItemSlotInfo(const TArray<struct FFortWeaponModSlot>& ModSlots);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchModTypeTabs">();
	}
	static class UAthenaWeaponModsWorkbenchModTypeTabs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchModTypeTabs>();
	}
};

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchWeaponDetails
// 0x0008 (0x0448 - 0x0440)
class UAthenaWeaponModsWorkbenchWeaponDetails final : public UAthenaWeaponModsWorkbenchWidgetBase
{
public:
	uint8                                         Pad_440[0x8];                                      // 0x0440(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnWeaponEquipped(const class UItemDefinitionBase* ItemDefinition, const class FText& DisplayName, const bool bIsModdable);
	void SetWeaponType(const class FText& WeaponTypeText, class UTexture2D* WeaponTypeTexture, const bool bIsValidType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchWeaponDetails">();
	}
	static class UAthenaWeaponModsWorkbenchWeaponDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchWeaponDetails>();
	}
};

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchWeaponRenderContainer
// 0x0000 (0x0440 - 0x0440)
class UAthenaWeaponModsWorkbenchWeaponRenderContainer final : public UAthenaWeaponModsWorkbenchWidgetBase
{
public:
	void HandleWeaponModSlotPreview(class UFortWeaponModItemDefinition* PreviewingModItemDefinition);
	void OnWeaponModSlotPreview(class AFortWeapon* Weapon, class UFortWeaponModItemDefinition* PreviewingModItemDefinition);
	void OnWeaponModSlotsChanged(class AFortWeapon* Weapon);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchWeaponRenderContainer">();
	}
	static class UAthenaWeaponModsWorkbenchWeaponRenderContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchWeaponRenderContainer>();
	}
};

}

