#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponModsCodeRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "WeaponModsCodeRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class WeaponModsCodeRuntime.FortModStation_WeaponUICapture
// 0x0020 (0x0440 - 0x0420)
class AFortModStation_WeaponUICapture final : public AActor
{
public:
	uint8                                         PSOPrecachingCheckMaxRetries;                      // 0x0420(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UMeshComponent>          MeshComponentPtr;                                  // 0x0424(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_42C[0x14];                                     // 0x042C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRefreshCapture();
	void RefreshCaptureWhenPSOPrecachingDone(class UMeshComponent* PreviewMeshComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortModStation_WeaponUICapture">();
	}
	static class AFortModStation_WeaponUICapture* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortModStation_WeaponUICapture>();
	}
};

// Class WeaponModsCodeRuntime.FortWeaponModManagementComponent
// 0x0010 (0x00F0 - 0x00E0)
class UFortWeaponModManagementComponent final : public UFortControllerComponent
{
public:
	TMulticastInlineDelegate<void(class AFortWeapon* Weapon)> OnWeaponModSlotsChanged;                           // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void HandleWeaponUnequip(class AFortWeapon* Weapon);
	void ServerRequestAddModToWeaponFromInventory(const struct FGuid& WeaponModItemGUID, const struct FGuid& WeaponItemGUID);
	void ServerRequestRemoveModFromWeaponToInventory(class UFortWeaponModItemDefinition* WeaponModDef, const struct FGuid& WeaponItemGUID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortWeaponModManagementComponent">();
	}
	static class UFortWeaponModManagementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortWeaponModManagementComponent>();
	}
};

// Class WeaponModsCodeRuntime.FortWeaponModStationBase
// 0x00F8 (0x12C0 - 0x11C8)
class AFortWeaponModStationBase final : public ABuildingProp
{
public:
	struct FMarkedActorDisplayInfo                MarkerDisplay;                                     // 0x11C8(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                MarkerPositionOffset;                              // 0x1298(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnForceEndInteractionDelegate;                     // 0x12B0(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	void ForceEndInteractionsWithModStation();

	bool GetModCostOverride(float* OutModCostOverride) const;
	class UFortResourceItemDefinition* GetTransactionCurrency() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortWeaponModStationBase">();
	}
	static class AFortWeaponModStationBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortWeaponModStationBase>();
	}
};

// Class WeaponModsCodeRuntime.FortWeaponModStationSharedDataComponent
// 0x00F8 (0x01D0 - 0x00D8)
class UFortWeaponModStationSharedDataComponent final : public UFortGameStateComponent
{
public:
	class UDataTable*                             ModCostData;                                       // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FFortModSlotPurchaseList> ModSlotPurchaseLists;                              // 0x00E0(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<struct FPrimaryAssetId, struct FFortModStationDataRow> ModCostMap;                                        // 0x0130(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_180[0x50];                                     // 0x0180(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortWeaponModStationSharedDataComponent">();
	}
	static class UFortWeaponModStationSharedDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortWeaponModStationSharedDataComponent>();
	}
};

// Class WeaponModsCodeRuntime.FortWeaponModStationComponent
// 0x0110 (0x01F0 - 0x00E0)
class UFortWeaponModStationComponent final : public UFortControllerComponent
{
public:
	TMulticastInlineDelegate<void(struct FFortLocalModPurchaseEventParams& EventParams)> OnLocalModPurchaseStarted;                         // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortWeaponModStationBase* NewInteractingWeaponModStation)> OnStartInteractWithWorkbenchActor;                 // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortWeaponModStationBase* WeaponModStation)> OnStopInteractWithWorkbenchActor;                  // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AFortWeaponModStationBase*              CurrentInteractingWeaponModStation;                // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ModStationHotfixEnabled;                           // 0x0118(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RemoveModCost;                                     // 0x0150(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CancelInteractDistance;                            // 0x0188(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UFortWeaponModItemDefinition*           DefaultIronSightMod;                               // 0x01C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortWeaponModItemDefinition*           DefaultMagazineMod;                                // 0x01C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D0[0x20];                                     // 0x01D0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientNotifyServerForcedInteractOver();
	void ClientStartInteractWithWorkbenchActor(class AFortWeaponModStationBase* NewInteractingWeaponModStation);
	void HandleStopLocalInteractingWithStation();
	void LocalPurchaseRemoveMod(class UFortWeaponModItemDefinition* WeaponMod, class AFortWeapon* Weapon);
	void LocalPurchaseWeaponModForWeapon(class UFortWeaponModItemDefinition* WeaponMod, class AFortWeapon* Weapon);
	void ServerPurchaseRemoveMod(class UFortWeaponModItemDefinition* WeaponMod, class AFortWeapon* Weapon);
	void ServerPurchaseWeaponModForWeapon(class UFortWeaponModItemDefinition* WeaponMod, class AFortWeapon* Weapon);
	void ServerStopInteractWithWorkbenchActor(class AFortWeaponModStationBase* NewInteractingWeaponModStation);
	void StartInteractWithWorkbenchActor(class AFortWeaponModStationBase* NewInteractingWeaponModStation);

	bool CanPlayerAffordModForWeapon(const class UFortWeaponModItemDefinition* WeaponMod, const class AFortWeapon* Weapon, const class AController* Controller) const;
	bool CanPlayerAffordRemoveModFromWeapon(const class UFortWeaponModItemDefinition* WeaponMod, const class AFortWeapon* Weapon, const class AController* Controller) const;
	bool DoesCurrentWorkbenchHaveModsForWeapon(class AFortWeapon* Weapon) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortWeaponModStationComponent">();
	}
	static class UFortWeaponModStationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortWeaponModStationComponent>();
	}
};

// Class WeaponModsCodeRuntime.FortPickupInteractOverrideComponent_WeaponMods
// 0x0000 (0x00F8 - 0x00F8)
class UFortPickupInteractOverrideComponent_WeaponMods final : public UFortPickupInteractOverrideComponent
{
public:
	void ServerApplyWeaponModFromPickup(class AFortPickup* Pickup, const class UFortWeaponModItemDefinition* WeaponModDef, class AFortWeapon* Weapon);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPickupInteractOverrideComponent_WeaponMods">();
	}
	static class UFortPickupInteractOverrideComponent_WeaponMods* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPickupInteractOverrideComponent_WeaponMods>();
	}
};

}

