#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WidgetRegistration

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK
{

// ScriptStruct WidgetRegistration.PersistedNameArray
// 0x0010 (0x0010 - 0x0000)
struct FPersistedNameArray final
{
public:
	TArray<class FName>                           ArrayOfNamesToPersist;                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct WidgetRegistration.PersistedBool
// 0x0001 (0x0001 - 0x0000)
struct FPersistedBool final
{
public:
	bool                                          PersistedBool;                                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct WidgetRegistration.EditableToolPaletteSettings
// 0x0010 (0x0010 - 0x0000)
struct FEditableToolPaletteSettings final
{
public:
	TArray<class FString>                         PaletteCommandNames;                               // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct WidgetRegistration.ToolkitWidgetStyle
// 0x0268 (0x0270 - 0x0008)
struct FToolkitWidgetStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            TitleBackgroundBrush;                              // 0x0010(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ToolDetailsBackgroundBrush;                        // 0x00E0(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            TitleForegroundColor;                              // 0x01B0(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                                TitlePadding;                                      // 0x01C4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ActiveToolTitleBorderPadding;                      // 0x01D4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ToolContextTextBlockPadding;                       // 0x01E4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         TitleFont;                                         // 0x01F8(0x0070)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

