#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: wilds_plant_device

#include "Basic.hpp"

#include "VerseDevices_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass wilds_plant_device.$SolarisSignatureFunctionOuter
// 0x0000 (0x0030 - 0x0030)
class wilds_plant_device::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass wilds_plant_device.$SolarisSignatureFunctionOuter", true>();
	}
	static class wilds_plant_device::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<wilds_plant_device::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass wilds_plant_device.wilds_plant_device
// 0x0050 (0x0110 - 0x00C0)
class Uwilds_plant_device final : public UDevices_creative_device_base
{
public:
	class UObject*                                __verse_0xB496FDA8_GrowEvent;                      // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xFAB24E64_ExplodeEvent;                   // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x1BEE3900_LaunchEvent;                    // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x5BDC7A5C_EnableFunction;                 // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xC9184E23_DisableFunction;                // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0x23401B17_GrowFunction;                   // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function*               __verse_0xFE183EC3_ExplodeFunction;                // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_logic*     __verse_0x97B98859_SetInfiniteRegrowthsFunction;   // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDevices_device_function_set_int*       __verse_0x47BC0200_SetMaximumRegrowthsFunction;    // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fwilds__plant__device_N_RDisable(const struct wilds_plant_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fwilds__plant__device_N_REnable(const struct wilds_plant_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fwilds__plant__device_N_RExplode(const struct wilds_plant_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fwilds__plant__device_N_RGrow(const struct wilds_plant_device::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fwilds__plant__device_N_RSetInfiniteRegrowths_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fwilds__plant__device_N_RSetMaximumRegrowths_L_Nint_R(int64 __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"wilds_plant_device">();
	}
	static class Uwilds_plant_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uwilds_plant_device>();
	}
};

}

