#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorldMetricsCore

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class WorldMetricsCore.WorldMetricsActorTrackerSubscriber
// 0x0000 (0x0030 - 0x0030)
class IWorldMetricsActorTrackerSubscriber final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldMetricsActorTrackerSubscriber">();
	}
	static class IWorldMetricsActorTrackerSubscriber* GetDefaultObj()
	{
		return GetDefaultObjImpl<IWorldMetricsActorTrackerSubscriber>();
	}
};

// Class WorldMetricsCore.WorldMetricsExtension
// 0x0000 (0x0030 - 0x0030)
class UWorldMetricsExtension : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldMetricsExtension">();
	}
	static class UWorldMetricsExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldMetricsExtension>();
	}
};

// Class WorldMetricsCore.WorldMetricsSubsystem
// 0x2A10 (0x2A48 - 0x0038)
class UWorldMetricsSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWorldMetricInterface*>          Metrics;                                           // 0x0048(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x29E0];                                    // 0x0058(0x29E0)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UpdateRateInSeconds;                               // 0x2A38(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WarmUpFrames;                                      // 0x2A3C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A40[0x8];                                     // 0x2A40(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldMetricsSubsystem">();
	}
	static class UWorldMetricsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldMetricsSubsystem>();
	}
};

// Class WorldMetricsCore.WorldMetricInterface
// 0x0000 (0x0030 - 0x0030)
class UWorldMetricInterface : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldMetricInterface">();
	}
	static class UWorldMetricInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldMetricInterface>();
	}
};

// Class WorldMetricsCore.WorldMetricsActorTracker
// 0x00A8 (0x00D8 - 0x0030)
class UWorldMetricsActorTracker final : public UWorldMetricsExtension
{
public:
	uint8                                         Pad_30[0xA8];                                      // 0x0030(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldMetricsActorTracker">();
	}
	static class UWorldMetricsActorTracker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldMetricsActorTracker>();
	}
};

}

