#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorldBrowser

#include "Basic.hpp"

#include "WorldBrowser_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class WorldBrowser.EditorLevelFolders
// 0x0050 (0x0080 - 0x0030)
class UEditorLevelFolders final : public UObject
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorLevelFolders">();
	}
	static class UEditorLevelFolders* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorLevelFolders>();
	}
};

// Class WorldBrowser.WorldTileDetails
// 0x06B8 (0x06E8 - 0x0030)
class UWorldTileDetails final : public UObject
{
public:
	bool                                          bTileEditable;                                     // 0x0030(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PackageName;                                       // 0x0034(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParentPackageName;                                 // 0x0040(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             Position;                                          // 0x004C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             AbsolutePosition;                                  // 0x0058(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ZOrder;                                            // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideInTileView;                                   // 0x0068(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumLOD;                                            // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTileLODEntryDetails                   LOD1;                                              // 0x0070(0x0160)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FTileLODEntryDetails                   LOD2;                                              // 0x01D0(0x0160)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FTileLODEntryDetails                   LOD3;                                              // 0x0330(0x0160)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FTileLODEntryDetails                   LOD4;                                              // 0x0490(0x0160)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5F0[0xF8];                                     // 0x05F0(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldTileDetails">();
	}
	static class UWorldTileDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldTileDetails>();
	}
};

}

