#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorldPartitionHLODUtilities

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class WorldPartitionHLODUtilities.WorldPartitionHLODModifierMeshDestruction
// 0x0008 (0x0038 - 0x0030)
class UWorldPartitionHLODModifierMeshDestruction final : public UWorldPartitionHLODModifier
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldPartitionHLODModifierMeshDestruction">();
	}
	static class UWorldPartitionHLODModifierMeshDestruction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldPartitionHLODModifierMeshDestruction>();
	}
};

// Class WorldPartitionHLODUtilities.HLODBuilderInstancingSettings
// 0x0008 (0x0038 - 0x0030)
class UHLODBuilderInstancingSettings final : public UHLODBuilderSettings
{
public:
	bool                                          bDisallowNanite;                                   // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HLODBuilderInstancingSettings">();
	}
	static class UHLODBuilderInstancingSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHLODBuilderInstancingSettings>();
	}
};

// Class WorldPartitionHLODUtilities.HLODBuilderInstancing
// 0x0000 (0x0040 - 0x0040)
class UHLODBuilderInstancing final : public UHLODBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HLODBuilderInstancing">();
	}
	static class UHLODBuilderInstancing* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHLODBuilderInstancing>();
	}
};

// Class WorldPartitionHLODUtilities.HLODBuilderMeshApproximateSettings
// 0x0138 (0x0168 - 0x0030)
class UHLODBuilderMeshApproximateSettings final : public UHLODBuilderSettings
{
public:
	struct FMeshApproximationSettings             MeshApproximationSettings;                         // 0x0030(0x0130)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     HLODMaterial;                                      // 0x0160(0x0008)(Edit, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HLODBuilderMeshApproximateSettings">();
	}
	static class UHLODBuilderMeshApproximateSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHLODBuilderMeshApproximateSettings>();
	}
};

// Class WorldPartitionHLODUtilities.HLODBuilderMeshApproximate
// 0x0000 (0x0040 - 0x0040)
class UHLODBuilderMeshApproximate final : public UHLODBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HLODBuilderMeshApproximate">();
	}
	static class UHLODBuilderMeshApproximate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHLODBuilderMeshApproximate>();
	}
};

// Class WorldPartitionHLODUtilities.HLODBuilderMeshMergeSettings
// 0x0120 (0x0150 - 0x0030)
class UHLODBuilderMeshMergeSettings final : public UHLODBuilderSettings
{
public:
	struct FMeshMergingSettings                   MeshMergeSettings;                                 // 0x0030(0x0118)(Edit, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     HLODMaterial;                                      // 0x0148(0x0008)(Edit, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HLODBuilderMeshMergeSettings">();
	}
	static class UHLODBuilderMeshMergeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHLODBuilderMeshMergeSettings>();
	}
};

// Class WorldPartitionHLODUtilities.HLODBuilderMeshMerge
// 0x0000 (0x0040 - 0x0040)
class UHLODBuilderMeshMerge final : public UHLODBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HLODBuilderMeshMerge">();
	}
	static class UHLODBuilderMeshMerge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHLODBuilderMeshMerge>();
	}
};

// Class WorldPartitionHLODUtilities.HLODBuilderMeshSimplifySettings
// 0x0118 (0x0148 - 0x0030)
class UHLODBuilderMeshSimplifySettings final : public UHLODBuilderSettings
{
public:
	struct FMeshProxySettings                     MeshSimplifySettings;                              // 0x0030(0x0110)(Edit, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     HLODMaterial;                                      // 0x0140(0x0008)(Edit, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HLODBuilderMeshSimplifySettings">();
	}
	static class UHLODBuilderMeshSimplifySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHLODBuilderMeshSimplifySettings>();
	}
};

// Class WorldPartitionHLODUtilities.HLODBuilderMeshSimplify
// 0x0000 (0x0040 - 0x0040)
class UHLODBuilderMeshSimplify final : public UHLODBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HLODBuilderMeshSimplify">();
	}
	static class UHLODBuilderMeshSimplify* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHLODBuilderMeshSimplify>();
	}
};

}

