#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorldPartitionEditor

#include "Basic.hpp"

#include "EditorSubsystem_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UnrealEd_classes.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class WorldPartitionEditor.ContentBundleEditorSubsystem
// 0x0070 (0x00A8 - 0x0038)
class UContentBundleEditorSubsystem final : public UEditorSubsystem
{
public:
	uint8                                         Pad_38[0x68];                                      // 0x0038(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	class UContentBundleEditingSubmodule*         ContentBundleEditingSubModule;                     // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContentBundleEditorSubsystem">();
	}
	static class UContentBundleEditorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContentBundleEditorSubsystem>();
	}
};

// Class WorldPartitionEditor.ContentBundleEditorSubsystemModule
// 0x0008 (0x0038 - 0x0030)
class UContentBundleEditorSubsystemModule : public UObject
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContentBundleEditorSubsystemModule">();
	}
	static class UContentBundleEditorSubsystemModule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContentBundleEditorSubsystemModule>();
	}
};

// Class WorldPartitionEditor.ContentBundleEditingSubmodule
// 0x0050 (0x0088 - 0x0038)
class UContentBundleEditingSubmodule final : public UContentBundleEditorSubsystemModule
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGuid>                          EditingContentBundlesStack;                        // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FGuid                                  EditingContentBundleGuid;                          // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x28];                                      // 0x0060(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContentBundleEditingSubmodule">();
	}
	static class UContentBundleEditingSubmodule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContentBundleEditingSubmodule>();
	}
};

// Class WorldPartitionEditor.WorldPartitionHLODEditorSubsystem
// 0x0038 (0x0080 - 0x0048)
class UWorldPartitionHLODEditorSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_48[0x38];                                      // 0x0048(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldPartitionHLODEditorSubsystem">();
	}
	static class UWorldPartitionHLODEditorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldPartitionHLODEditorSubsystem>();
	}
};

// Class WorldPartitionEditor.HLODLayerFactory
// 0x0000 (0x0088 - 0x0088)
class UHLODLayerFactory final : public UFactory
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HLODLayerFactory">();
	}
	static class UHLODLayerFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHLODLayerFactory>();
	}
};

// Class WorldPartitionEditor.WorldPartitionConvertOptions
// 0x0020 (0x0050 - 0x0030)
class UWorldPartitionConvertOptions final : public UObject
{
public:
	TSubclassOf<class UWorldPartitionConvertCommandlet> CommandletClass;                                   // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInPlace;                                          // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteSourceLevels;                               // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateIni;                                      // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReportOnly;                                       // 0x003B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVerbose;                                          // 0x003C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipStableGUIDValidation;                         // 0x003D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyMergeSubLevels;                               // 0x003E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSaveFoliageTypeToContentFolder;                   // 0x003F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldPartitionConvertOptions">();
	}
	static class UWorldPartitionConvertOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldPartitionConvertOptions>();
	}
};

// Class WorldPartitionEditor.WorldPartitionEditorSettings
// 0x0048 (0x00A8 - 0x0060)
class UWorldPartitionEditorSettings final : public UDeveloperSettings
{
public:
	TSubclassOf<class UWorldPartitionConvertCommandlet> CommandletClass;                                   // 0x0060(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InstancedFoliageGridSize;                          // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinimapLowQualityWorldUnitsPerPixelThreshold;      // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableLoadingInEditor;                            // 0x0070(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableStreamingGenerationLogOnPIE;                // 0x0071(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowHLODsInEditor;                                // 0x0072(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowHLODsOverLoadedRegions;                       // 0x0073(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableAdvancedHLODSettings;                       // 0x0074(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        HLODMinDrawDistance;                               // 0x0078(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        HLODMaxDrawDistance;                               // 0x0080(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x20];                                      // 0x0088(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldPartitionEditorSettings">();
	}
	static class UWorldPartitionEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldPartitionEditorSettings>();
	}
};

}

