#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZoneGraph

#include "Basic.hpp"

#include "ZoneGraph_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class ZoneGraph.ZoneGraphData
// 0x0130 (0x0550 - 0x0420)
class AZoneGraphData final : public AActor
{
public:
	uint8                                         Pad_420[0x1];                                      // 0x0420(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableDrawing;                                    // 0x0421(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_422[0x6];                                      // 0x0422(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UZoneGraphRenderingComponent*           RenderingComp;                                     // 0x0428(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FZoneGraphStorage                      ZoneStorage;                                       // 0x0430(0x00F0)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_520[0x28];                                     // 0x0520(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        CombinedShapeHash;                                 // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphData">();
	}
	static class AZoneGraphData* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZoneGraphData>();
	}
};

// Class ZoneGraph.ZoneGraphRenderingComponent
// 0x0010 (0x0580 - 0x0570)
class UZoneGraphRenderingComponent final : public UPrimitiveComponent
{
public:
	uint8                                         Pad_570[0x10];                                     // 0x0570(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphRenderingComponent">();
	}
	static class UZoneGraphRenderingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphRenderingComponent>();
	}
};

// Class ZoneGraph.ZoneGraphSettings
// 0x0300 (0x0360 - 0x0060)
class UZoneGraphSettings final : public UDeveloperSettings
{
public:
	TArray<struct FZoneLaneProfile>               LaneProfiles;                                      // 0x0060(0x0010)(Edit, ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	struct FZoneGraphTagInfo                      Tags[0x20];                                        // 0x0070(0x0014)(Edit, Config, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FZoneGraphTagMask                      VisualizedTags;                                    // 0x02F0(0x0004)(Edit, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ShapeMaxDrawDistance;                              // 0x02F4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FZoneGraphBuildSettings                BuildSettings;                                     // 0x02F8(0x0060)(Edit, Config, Protected, NativeAccessSpecifierProtected)
	bool                                          bBuildZoneGraphWhileEditing;                       // 0x0358(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphSettings">();
	}
	static class UZoneGraphSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphSettings>();
	}
};

// Class ZoneGraph.ZoneGraphSubsystem
// 0x0210 (0x0258 - 0x0048)
class UZoneGraphSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_48[0x28];                                      // 0x0048(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRegisteredZoneGraphData>       RegisteredZoneGraphData;                           // 0x0070(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_80[0x1D8];                                     // 0x0080(0x01D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphSubsystem">();
	}
	static class UZoneGraphSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphSubsystem>();
	}
};

// Class ZoneGraph.ZoneShape
// 0x0008 (0x0428 - 0x0420)
class AZoneShape final : public AActor
{
public:
	class UZoneShapeComponent*                    ShapeComponent;                                    // 0x0420(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneShape">();
	}
	static class AZoneShape* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZoneShape>();
	}
};

// Class ZoneGraph.ZoneShapeComponent
// 0x0090 (0x0600 - 0x0570)
class UZoneShapeComponent final : public UPrimitiveComponent
{
public:
	struct FZoneLaneProfileRef                    LaneProfile;                                       // 0x0570(0x001C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bReverseLaneProfile;                               // 0x058C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FZoneLaneProfileRef>            PerPointLaneProfiles;                              // 0x0590(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	TArray<struct FZoneShapePoint>                Points;                                            // 0x05A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPrivate)
	EFZoneShapeType                               ShapeType;                                         // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EZoneShapePolygonRoutingType                  PolygonRoutingType;                                // 0x05B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B2[0x2];                                      // 0x05B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneGraphTagMask                      Tags;                                              // 0x05B4(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FZoneShapeConnector>            ShapeConnectors;                                   // 0x05B8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FZoneShapeConnection>           ConnectedShapes;                                   // 0x05C8(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D8[0x28];                                     // 0x05D8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetPolygonRoutingType(const EZoneShapePolygonRoutingType NewType);
	bool SetReverseLaneProfile(bool bReverse);
	void SetShapeType(EFZoneShapeType Type);
	void SetTags(const struct FZoneGraphTagMask& NewTags);

	EFZoneShapeType GetShapeType() const;
	struct FZoneGraphTagMask GetTags() const;
	bool IsLaneProfileReversed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneShapeComponent">();
	}
	static class UZoneShapeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneShapeComponent>();
	}
};

}

