#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZoneGraphEditor

#include "Basic.hpp"

#include "ZoneGraphEditor_structs.hpp"
#include "UnrealEd_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ZoneGraphEditor.ZoneShapeComponentVisualizerSelectionState
// 0x00A0 (0x00D0 - 0x0030)
class UZoneShapeComponentVisualizerSelectionState final : public UObject
{
public:
	struct FComponentPropertyPath                 ShapePropertyPath;                                 // 0x0030(0x0020)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSet<int32>                                   SelectedPoints;                                    // 0x0050(0x0050)(Protected, NativeAccessSpecifierProtected)
	int32                                         LastPointIndexSelected;                            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SelectedSegmentIndex;                              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                SelectedSegmentPoint;                              // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SelectedSegmentT;                                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SelectedControlPoint;                              // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFZoneShapeControlPointType                   SelectedControlPointType;                          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneShapeComponentVisualizerSelectionState">();
	}
	static class UZoneShapeComponentVisualizerSelectionState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneShapeComponentVisualizerSelectionState>();
	}
};

}

