#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZoneGraphAnnotations

#include "Basic.hpp"

#include "ZoneGraphAnnotations_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ZoneGraph_structs.hpp"


namespace SDK
{

// Class ZoneGraphAnnotations.ZoneGraphAnnotationComponent
// 0x0030 (0x05F0 - 0x05C0)
#pragma pack(push, 0x1)
class alignas(0x10) UZoneGraphAnnotationComponent : public UDebugDrawComponent
{
public:
	uint8                                         Pad_5C0[0x20];                                     // 0x05C0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableDebugDrawing;                               // 0x05E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphAnnotationComponent">();
	}
	static class UZoneGraphAnnotationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphAnnotationComponent>();
	}
};
#pragma pack(pop)

// Class ZoneGraphAnnotations.ZoneGraphAnnotationSubsystem
// 0x0070 (0x00B8 - 0x0048)
class UZoneGraphAnnotationSubsystem final : public UTickableWorldSubsystem
{
public:
	TArray<struct FRegisteredZoneGraphAnnotation> RegisteredComponents;                              // 0x0048(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FInstancedStructContainer              Events[0x2];                                       // 0x0058(0x0010)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UZoneGraphAnnotationComponent*>  TagToAnnotationLookup;                             // 0x0080(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_90[0x28];                                      // 0x0090(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphAnnotationSubsystem">();
	}
	static class UZoneGraphAnnotationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphAnnotationSubsystem>();
	}
};

// Class ZoneGraphAnnotations.ZoneGraphAnnotationTest
// 0x0008 (0x0038 - 0x0030)
class UZoneGraphAnnotationTest : public UObject
{
public:
	class UZoneGraphAnnotationTestingComponent*   OwnerComponent;                                    // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphAnnotationTest">();
	}
	static class UZoneGraphAnnotationTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphAnnotationTest>();
	}
};

// Class ZoneGraphAnnotations.ZoneGraphAnnotationTestingComponent
// 0x0020 (0x05E0 - 0x05C0)
class UZoneGraphAnnotationTestingComponent final : public UDebugDrawComponent
{
public:
	uint8                                         Pad_5C0[0x8];                                      // 0x05C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UZoneGraphAnnotationTest*>       Tests;                                             // 0x05C8(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D8[0x8];                                      // 0x05D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphAnnotationTestingComponent">();
	}
	static class UZoneGraphAnnotationTestingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphAnnotationTestingComponent>();
	}
};

// Class ZoneGraphAnnotations.ZoneGraphAnnotationTestingActor
// 0x0008 (0x0428 - 0x0420)
class AZoneGraphAnnotationTestingActor final : public AActor
{
public:
	class UZoneGraphAnnotationTestingComponent*   TestingComp;                                       // 0x0420(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void Trigger();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphAnnotationTestingActor">();
	}
	static class AZoneGraphAnnotationTestingActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZoneGraphAnnotationTestingActor>();
	}
};

// Class ZoneGraphAnnotations.ZoneGraphDisturbanceAnnotation
// 0x0080 (0x0670 - 0x05F0)
class UZoneGraphDisturbanceAnnotation final : public UZoneGraphAnnotationComponent
{
public:
	uint8                                         Pad_5E8[0x18];                                     // 0x05E8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneGraphTag                          DangerAnnotationTag;                               // 0x0600(0x0001)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FZoneGraphTag                          ObstacleAnnotationTag;                             // 0x0601(0x0001)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_602[0x2];                                      // 0x0602(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneGraphTagFilter                    AffectedLaneTags;                                  // 0x0604(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FZoneGraphTagFilter                    EscapeLaneTags;                                    // 0x0610(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         IdealSpanLength;                                   // 0x061C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_620[0x40];                                     // 0x0620(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UZoneGraphSubsystem*                    ZoneGraphSubsystem;                                // 0x0660(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_668[0x8];                                      // 0x0668(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphDisturbanceAnnotation">();
	}
	static class UZoneGraphDisturbanceAnnotation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphDisturbanceAnnotation>();
	}
};

// Class ZoneGraphAnnotations.ZoneGraphDisturbanceAnnotationTest
// 0x0020 (0x0058 - 0x0038)
class UZoneGraphDisturbanceAnnotationTest final : public UZoneGraphAnnotationTest
{
public:
	struct FVector                                Offset;                                            // 0x0038(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Duration;                                          // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DangerRadius;                                      // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphDisturbanceAnnotationTest">();
	}
	static class UZoneGraphDisturbanceAnnotationTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphDisturbanceAnnotationTest>();
	}
};

// Class ZoneGraphAnnotations.ZoneGraphDisturbanceAnnotationBPLibrary
// 0x0000 (0x0030 - 0x0030)
class UZoneGraphDisturbanceAnnotationBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void TriggerDanger(class UObject* WorldContextObject, const class AActor* Instigator, const struct FVector& Position, const float Radius, const float Duration);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphDisturbanceAnnotationBPLibrary">();
	}
	static class UZoneGraphDisturbanceAnnotationBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphDisturbanceAnnotationBPLibrary>();
	}
};

}

